#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLA_Katana_Arm_L

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_CLA_Katana_Arm_L.ABP_CLA_Katana_Arm_L_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_CLA_Katana_Arm_L_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_CLA_Katana_Arm_L_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_CLA_Katana_Arm_L_C_AnimGraph");
static_assert(sizeof(ABP_CLA_Katana_Arm_L_C_AnimGraph) == 0x000010, "Wrong size on ABP_CLA_Katana_Arm_L_C_AnimGraph");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_CLA_Katana_Arm_L_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_CLA_Katana_Arm_L.ABP_CLA_Katana_Arm_L_C.ExecuteUbergraph_ABP_CLA_Katana_Arm_L
// 0x00A0 (0x00A0 - 0x0000)
struct ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AD3[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AD4[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AD5[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagRemoved*   CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AD6[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue_1;  // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AD7[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue_2;  // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AD8[0x2];                                     // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L) == 0x000008, "Wrong alignment on ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L");
static_assert(sizeof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L) == 0x0000A0, "Wrong size on ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, EntryPoint) == 0x000000, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000048, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, K2Node_DynamicCast_AsGz_Character) == 0x000050, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, CallFunc_WaitGameplayTagAddToActor_ReturnValue) == 0x000060, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::CallFunc_WaitGameplayTagAddToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue) == 0x000070, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, CallFunc_WaitGameplayTagAddToActor_ReturnValue_1) == 0x000080, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::CallFunc_WaitGameplayTagAddToActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, CallFunc_IsValid_ReturnValue_2) == 0x000088, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, CallFunc_WaitGameplayTagAddToActor_ReturnValue_2) == 0x000090, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::CallFunc_WaitGameplayTagAddToActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, CallFunc_BooleanAND_ReturnValue) == 0x000098, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, CallFunc_IsValid_ReturnValue_3) == 0x000099, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L, CallFunc_Montage_Play_ReturnValue) == 0x00009C, "Member 'ABP_CLA_Katana_Arm_L_C_ExecuteUbergraph_ABP_CLA_Katana_Arm_L::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");

// Function ABP_CLA_Katana_Arm_L.ABP_CLA_Katana_Arm_L_C.UnHideMaterialSlots
// 0x0058 (0x0058 - 0x0000)
struct ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots final
{
public:
	TArray<int32>                                 LODs;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 Materials;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AD9[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ADA[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots) == 0x000008, "Wrong alignment on ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots");
static_assert(sizeof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots) == 0x000058, "Wrong size on ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, LODs) == 0x000000, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::LODs' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, Materials) == 0x000010, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::Materials' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, Temp_int_Array_Index_Variable) == 0x000020, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, CallFunc_Array_Get_Item) == 0x000028, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, CallFunc_Array_Length_ReturnValue_1) == 0x00002C, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, Temp_int_Array_Index_Variable_1) == 0x00003C, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, Temp_int_Loop_Counter_Variable_1) == 0x000044, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, CallFunc_GetOwningComponent_ReturnValue) == 0x000048, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, CallFunc_Less_IntInt_ReturnValue_1) == 0x000050, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'ABP_CLA_Katana_Arm_L_C_UnHideMaterialSlots::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

}

