#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Submissive_Body

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Submissive_Body.ABP_Submissive_Body_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Submissive_Body_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Submissive_Body_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Submissive_Body_C_AnimGraph");
static_assert(sizeof(ABP_Submissive_Body_C_AnimGraph) == 0x000010, "Wrong size on ABP_Submissive_Body_C_AnimGraph");
static_assert(offsetof(ABP_Submissive_Body_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_Submissive_Body_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_Submissive_Body.ABP_Submissive_Body_C.ExecuteUbergraph_ABP_Submissive_Body
// 0x0004 (0x0004 - 0x0000)
struct ABP_Submissive_Body_C_ExecuteUbergraph_ABP_Submissive_Body final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Submissive_Body_C_ExecuteUbergraph_ABP_Submissive_Body) == 0x000004, "Wrong alignment on ABP_Submissive_Body_C_ExecuteUbergraph_ABP_Submissive_Body");
static_assert(sizeof(ABP_Submissive_Body_C_ExecuteUbergraph_ABP_Submissive_Body) == 0x000004, "Wrong size on ABP_Submissive_Body_C_ExecuteUbergraph_ABP_Submissive_Body");
static_assert(offsetof(ABP_Submissive_Body_C_ExecuteUbergraph_ABP_Submissive_Body, EntryPoint) == 0x000000, "Member 'ABP_Submissive_Body_C_ExecuteUbergraph_ABP_Submissive_Body::EntryPoint' has a wrong offset!");

}

