#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLA_Defiler_PT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_CLA_Defiler_PT.ABP_CLA_Defiler_PT_C.AnimBlueprintGeneratedConstantData
// 0x0327 (0x0328 - 0x0001)
struct ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_5C6E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_66;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6F[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_67;                             // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_68;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_69;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_70;                               // 0x0024(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_71;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_72;                                 // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_73;                                  // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_74;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_75;                                 // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C70[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_76;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_77;                             // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_78;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_79;                                 // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_80;                                 // 0x0072(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C71[0x1];                                     // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_81;                                 // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_82;                                 // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_83;                                 // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_84;                                  // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_85;                               // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0148(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x0178(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x01A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_1;                 // 0x01D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x0208(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x0238(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x0268(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;                   // 0x0298(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x02C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x02F8(0x0030)()
};
static_assert(alignof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData) == 0x000328, "Wrong size on ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __NameProperty_66) == 0x000004, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__NameProperty_66' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_67) == 0x000010, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_67' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __NameProperty_68) == 0x000018, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__NameProperty_68' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __IntProperty_69) == 0x000020, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__IntProperty_69' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __StructProperty_70) == 0x000024, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__StructProperty_70' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __FloatProperty_71) == 0x000050, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__FloatProperty_71' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __NameProperty_72) == 0x000054, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__NameProperty_72' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __IntProperty_73) == 0x00005C, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__IntProperty_73' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __ByteProperty_74) == 0x000060, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__ByteProperty_74' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __BoolProperty_75) == 0x000061, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__BoolProperty_75' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __FloatProperty_76) == 0x000064, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__FloatProperty_76' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_77) == 0x000068, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_77' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __BoolProperty_78) == 0x000070, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__BoolProperty_78' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __EnumProperty_79) == 0x000071, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__EnumProperty_79' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __ByteProperty_80) == 0x000072, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__ByteProperty_80' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __NameProperty_81) == 0x000074, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__NameProperty_81' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __NameProperty_82) == 0x00007C, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__NameProperty_82' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __NameProperty_83) == 0x000084, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__NameProperty_83' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __IntProperty_84) == 0x00008C, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__IntProperty_84' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, __StructProperty_85) == 0x000090, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::__StructProperty_85' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000148, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000178, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x0001A8, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_1) == 0x0001D8, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000208, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000238, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000268, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x000298, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x0002C8, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x0002F8, "Member 'ABP_CLA_Defiler_PT::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

}

