#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_HEX_Generator_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_HEX_Generator_01.ABP_HEX_Generator_01_C
// 0x0420 (0x0790 - 0x0370)
class UABP_HEX_Generator_01_C final : public UAnimInstance
{
public:
	uint8                                         Pad_571D[0x8];                                     // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x03A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x03D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x03F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0420(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0448(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0470(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0498(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x04C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0508(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x0528(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0568(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0588(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x05D0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x05F0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0638(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0658(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0698(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x06B8(0x00C8)()
	bool                                          Reprint;                                           // 0x0780(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Protected;                                         // 0x0781(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Shield_Fully_Down;                                 // 0x0782(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_HEX_Generator_01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_HEX_Generator_01_C">();
	}
	static class UABP_HEX_Generator_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_HEX_Generator_01_C>();
	}
};
static_assert(alignof(UABP_HEX_Generator_01_C) == 0x000010, "Wrong alignment on UABP_HEX_Generator_01_C");
static_assert(sizeof(UABP_HEX_Generator_01_C) == 0x000790, "Wrong size on UABP_HEX_Generator_01_C");
static_assert(offsetof(UABP_HEX_Generator_01_C, UberGraphFrame) == 0x000370, "Member 'UABP_HEX_Generator_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_HEX_Generator_01_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_HEX_Generator_01_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_TransitionResult_6) == 0x0003A8, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_TransitionResult_5) == 0x0003D0, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_TransitionResult_4) == 0x0003F8, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_TransitionResult_3) == 0x000420, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_TransitionResult_2) == 0x000448, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_TransitionResult_1) == 0x000470, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_TransitionResult) == 0x000498, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_SequencePlayer_2) == 0x0004C0, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_StateResult_4) == 0x000508, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_SequenceEvaluator_1) == 0x000528, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_StateResult_3) == 0x000568, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_SequencePlayer_1) == 0x000588, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_StateResult_2) == 0x0005D0, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_SequencePlayer) == 0x0005F0, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_StateResult_1) == 0x000638, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_SequenceEvaluator) == 0x000658, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_StateResult) == 0x000698, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, AnimGraphNode_StateMachine) == 0x0006B8, "Member 'UABP_HEX_Generator_01_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, Reprint) == 0x000780, "Member 'UABP_HEX_Generator_01_C::Reprint' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, Protected) == 0x000781, "Member 'UABP_HEX_Generator_01_C::Protected' has a wrong offset!");
static_assert(offsetof(UABP_HEX_Generator_01_C, Shield_Fully_Down) == 0x000782, "Member 'UABP_HEX_Generator_01_C::Shield_Fully_Down' has a wrong offset!");

}

