#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Submissive_Body

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Submissive_Body.ABP_Submissive_Body_C
// 0x0190 (0x0500 - 0x0370)
class UABP_Submissive_Body_C final : public UAnimInstance
{
public:
	uint8                                         Pad_61BE[0x8];                                     // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x03A8(0x0158)(ContainsInstancedReference)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_ABP_Submissive_Body(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Submissive_Body_C">();
	}
	static class UABP_Submissive_Body_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Submissive_Body_C>();
	}
};
static_assert(alignof(UABP_Submissive_Body_C) == 0x000010, "Wrong alignment on UABP_Submissive_Body_C");
static_assert(sizeof(UABP_Submissive_Body_C) == 0x000500, "Wrong size on UABP_Submissive_Body_C");
static_assert(offsetof(UABP_Submissive_Body_C, UberGraphFrame) == 0x000370, "Member 'UABP_Submissive_Body_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Submissive_Body_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_Submissive_Body_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Submissive_Body_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_Submissive_Body_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Submissive_Body_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_Submissive_Body_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Submissive_Body_C, AnimGraphNode_CopyPoseFromMesh) == 0x0003A8, "Member 'UABP_Submissive_Body_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");

}

