#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Jetpack_VerE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "G01_structs.hpp"
#include "InputJetpackControl_VerD_E_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.SF_UpdateSidewaysBend
// 0x00C8 (0x00C8 - 0x0000)
struct ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5851[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5852[0x5];                                     // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_BendAccumulated_ImplicitCast;   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5853[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_BendAccumulated_ImplicitCast_1; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5854[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_2;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_BendAccumulated_ImplicitCast_2; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend");
static_assert(sizeof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend) == 0x0000C8, "Wrong size on ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, Context) == 0x000000, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::Context' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, Node) == 0x000010, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::Node' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000038, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000039, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Abs_ReturnValue) == 0x000040, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000050, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000059, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_BooleanOR_ReturnValue) == 0x00005A, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000068, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x000070, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, K2Node_VariableSet_BendAccumulated_ImplicitCast) == 0x000078, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::K2Node_VariableSet_BendAccumulated_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000088, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, K2Node_VariableSet_BendAccumulated_ImplicitCast_1) == 0x000090, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::K2Node_VariableSet_BendAccumulated_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Add_DoubleDouble_A_ImplicitCast_2) == 0x0000A0, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Add_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Abs_A_ImplicitCast) == 0x0000A8, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Abs_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x0000B0, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x0000B8, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend, K2Node_VariableSet_BendAccumulated_ImplicitCast_2) == 0x0000C0, "Member 'ABP_Jetpack_VerE_C_SF_UpdateSidewaysBend::K2Node_VariableSet_BendAccumulated_ImplicitCast_2' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.SF_Update_SetAnimOnBreakFree
// 0x0048 (0x0048 - 0x0000)
struct ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FSequencePlayerReference               CallFunc_ConvertToSequencePlayerPure_SequencePlayer; // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequencePlayerPure_Result;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5855[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReference               CallFunc_SetSequence_ReturnValue;                  // 0x0038(0x0010)(NoDestructor)
};
static_assert(alignof(ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree");
static_assert(sizeof(ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree) == 0x000048, "Wrong size on ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree, Context) == 0x000000, "Member 'ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree::Context' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree, Node) == 0x000010, "Member 'ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree::Node' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree, CallFunc_ConvertToSequencePlayerPure_SequencePlayer) == 0x000020, "Member 'ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree::CallFunc_ConvertToSequencePlayerPure_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree, CallFunc_ConvertToSequencePlayerPure_Result) == 0x000030, "Member 'ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree::CallFunc_ConvertToSequencePlayerPure_Result' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree, CallFunc_SetSequence_ReturnValue) == 0x000038, "Member 'ABP_Jetpack_VerE_C_SF_Update_SetAnimOnBreakFree::CallFunc_SetSequence_ReturnValue' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.SF_Update_GetLastLeaningDirectot
// 0x0040 (0x0040 - 0x0000)
struct ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5856[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5857[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot");
static_assert(sizeof(ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot) == 0x000040, "Wrong size on ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot, Context) == 0x000000, "Member 'ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot::Context' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot, Node) == 0x000010, "Member 'ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot::Node' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot, Temp_bool_Variable) == 0x000020, "Member 'ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot, Temp_name_Variable) == 0x000024, "Member 'ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot, Temp_name_Variable_1) == 0x00002C, "Member 'ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000034, "Member 'ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot, K2Node_Select_Default) == 0x000038, "Member 'ABP_Jetpack_VerE_C_SF_Update_GetLastLeaningDirectot::K2Node_Select_Default' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.SF_Setup_SetWavyData
// 0x0020 (0x0020 - 0x0000)
struct ABP_Jetpack_VerE_C_SF_Setup_SetWavyData final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_Jetpack_VerE_C_SF_Setup_SetWavyData) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_SF_Setup_SetWavyData");
static_assert(sizeof(ABP_Jetpack_VerE_C_SF_Setup_SetWavyData) == 0x000020, "Wrong size on ABP_Jetpack_VerE_C_SF_Setup_SetWavyData");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Setup_SetWavyData, Context) == 0x000000, "Member 'ABP_Jetpack_VerE_C_SF_Setup_SetWavyData::Context' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Setup_SetWavyData, Node) == 0x000010, "Member 'ABP_Jetpack_VerE_C_SF_Setup_SetWavyData::Node' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.SF_Setup_OverrideWavyData
// 0x0020 (0x0020 - 0x0000)
struct ABP_Jetpack_VerE_C_SF_Setup_OverrideWavyData final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_Jetpack_VerE_C_SF_Setup_OverrideWavyData) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_SF_Setup_OverrideWavyData");
static_assert(sizeof(ABP_Jetpack_VerE_C_SF_Setup_OverrideWavyData) == 0x000020, "Wrong size on ABP_Jetpack_VerE_C_SF_Setup_OverrideWavyData");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Setup_OverrideWavyData, Context) == 0x000000, "Member 'ABP_Jetpack_VerE_C_SF_Setup_OverrideWavyData::Context' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_Setup_OverrideWavyData, Node) == 0x000010, "Member 'ABP_Jetpack_VerE_C_SF_Setup_OverrideWavyData::Node' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.SF_EnableLimbSway
// 0x0020 (0x0020 - 0x0000)
struct ABP_Jetpack_VerE_C_SF_EnableLimbSway final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_Jetpack_VerE_C_SF_EnableLimbSway) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_SF_EnableLimbSway");
static_assert(sizeof(ABP_Jetpack_VerE_C_SF_EnableLimbSway) == 0x000020, "Wrong size on ABP_Jetpack_VerE_C_SF_EnableLimbSway");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_EnableLimbSway, Context) == 0x000000, "Member 'ABP_Jetpack_VerE_C_SF_EnableLimbSway::Context' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_EnableLimbSway, Node) == 0x000010, "Member 'ABP_Jetpack_VerE_C_SF_EnableLimbSway::Node' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.SF_DisableLimbSway
// 0x0020 (0x0020 - 0x0000)
struct ABP_Jetpack_VerE_C_SF_DisableLimbSway final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_Jetpack_VerE_C_SF_DisableLimbSway) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_SF_DisableLimbSway");
static_assert(sizeof(ABP_Jetpack_VerE_C_SF_DisableLimbSway) == 0x000020, "Wrong size on ABP_Jetpack_VerE_C_SF_DisableLimbSway");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_DisableLimbSway, Context) == 0x000000, "Member 'ABP_Jetpack_VerE_C_SF_DisableLimbSway::Context' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_DisableLimbSway, Node) == 0x000010, "Member 'ABP_Jetpack_VerE_C_SF_DisableLimbSway::Node' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.SF_ControlRigEnable
// 0x0020 (0x0020 - 0x0000)
struct ABP_Jetpack_VerE_C_SF_ControlRigEnable final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_Jetpack_VerE_C_SF_ControlRigEnable) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_SF_ControlRigEnable");
static_assert(sizeof(ABP_Jetpack_VerE_C_SF_ControlRigEnable) == 0x000020, "Wrong size on ABP_Jetpack_VerE_C_SF_ControlRigEnable");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_ControlRigEnable, Context) == 0x000000, "Member 'ABP_Jetpack_VerE_C_SF_ControlRigEnable::Context' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_ControlRigEnable, Node) == 0x000010, "Member 'ABP_Jetpack_VerE_C_SF_ControlRigEnable::Node' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.SF_ControlRigDisable
// 0x0020 (0x0020 - 0x0000)
struct ABP_Jetpack_VerE_C_SF_ControlRigDisable final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_Jetpack_VerE_C_SF_ControlRigDisable) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_SF_ControlRigDisable");
static_assert(sizeof(ABP_Jetpack_VerE_C_SF_ControlRigDisable) == 0x000020, "Wrong size on ABP_Jetpack_VerE_C_SF_ControlRigDisable");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_ControlRigDisable, Context) == 0x000000, "Member 'ABP_Jetpack_VerE_C_SF_ControlRigDisable::Context' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_SF_ControlRigDisable, Node) == 0x000010, "Member 'ABP_Jetpack_VerE_C_SF_ControlRigDisable::Node' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.OnInitialUpdate
// 0x0068 (0x0068 - 0x0000)
struct ABP_Jetpack_VerE_C_OnInitialUpdate final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5858[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReference               CallFunc_ConvertToSequencePlayerPure_SequencePlayer; // 0x0028(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequencePlayerPure_Result;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5859[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable_1;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSequencePlayerReference               CallFunc_SetSequence_ReturnValue;                  // 0x0058(0x0010)(NoDestructor)
};
static_assert(alignof(ABP_Jetpack_VerE_C_OnInitialUpdate) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_OnInitialUpdate");
static_assert(sizeof(ABP_Jetpack_VerE_C_OnInitialUpdate) == 0x000068, "Wrong size on ABP_Jetpack_VerE_C_OnInitialUpdate");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnInitialUpdate, Context) == 0x000000, "Member 'ABP_Jetpack_VerE_C_OnInitialUpdate::Context' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnInitialUpdate, Node) == 0x000010, "Member 'ABP_Jetpack_VerE_C_OnInitialUpdate::Node' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnInitialUpdate, Temp_bool_Variable) == 0x000020, "Member 'ABP_Jetpack_VerE_C_OnInitialUpdate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnInitialUpdate, CallFunc_ConvertToSequencePlayerPure_SequencePlayer) == 0x000028, "Member 'ABP_Jetpack_VerE_C_OnInitialUpdate::CallFunc_ConvertToSequencePlayerPure_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnInitialUpdate, CallFunc_ConvertToSequencePlayerPure_Result) == 0x000038, "Member 'ABP_Jetpack_VerE_C_OnInitialUpdate::CallFunc_ConvertToSequencePlayerPure_Result' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnInitialUpdate, Temp_object_Variable) == 0x000040, "Member 'ABP_Jetpack_VerE_C_OnInitialUpdate::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnInitialUpdate, Temp_object_Variable_1) == 0x000048, "Member 'ABP_Jetpack_VerE_C_OnInitialUpdate::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnInitialUpdate, K2Node_Select_Default) == 0x000050, "Member 'ABP_Jetpack_VerE_C_OnInitialUpdate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnInitialUpdate, CallFunc_SetSequence_ReturnValue) == 0x000058, "Member 'ABP_Jetpack_VerE_C_OnInitialUpdate::CallFunc_SetSequence_ReturnValue' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.OnBecomeRelevant
// 0x0058 (0x0058 - 0x0000)
struct ABP_Jetpack_VerE_C_OnBecomeRelevant final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FSequenceEvaluatorReference            CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator; // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequenceEvaluatorPure_Result;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_585A[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      CallFunc_Array_Random_OutItem;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_585B[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequenceEvaluatorReference            CallFunc_SetSequence_ReturnValue;                  // 0x0048(0x0010)(NoDestructor)
};
static_assert(alignof(ABP_Jetpack_VerE_C_OnBecomeRelevant) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_OnBecomeRelevant");
static_assert(sizeof(ABP_Jetpack_VerE_C_OnBecomeRelevant) == 0x000058, "Wrong size on ABP_Jetpack_VerE_C_OnBecomeRelevant");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnBecomeRelevant, Context) == 0x000000, "Member 'ABP_Jetpack_VerE_C_OnBecomeRelevant::Context' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnBecomeRelevant, Node) == 0x000010, "Member 'ABP_Jetpack_VerE_C_OnBecomeRelevant::Node' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnBecomeRelevant, CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator) == 0x000020, "Member 'ABP_Jetpack_VerE_C_OnBecomeRelevant::CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnBecomeRelevant, CallFunc_ConvertToSequenceEvaluatorPure_Result) == 0x000030, "Member 'ABP_Jetpack_VerE_C_OnBecomeRelevant::CallFunc_ConvertToSequenceEvaluatorPure_Result' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnBecomeRelevant, CallFunc_Array_Random_OutItem) == 0x000038, "Member 'ABP_Jetpack_VerE_C_OnBecomeRelevant::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnBecomeRelevant, CallFunc_Array_Random_OutIndex) == 0x000040, "Member 'ABP_Jetpack_VerE_C_OnBecomeRelevant::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_OnBecomeRelevant, CallFunc_SetSequence_ReturnValue) == 0x000048, "Member 'ABP_Jetpack_VerE_C_OnBecomeRelevant::CallFunc_SetSequence_ReturnValue' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.NPC_CoverState
// 0x0010 (0x0010 - 0x0000)
struct ABP_Jetpack_VerE_C_NPC_CoverState final
{
public:
	struct FPoseLink                              Param_NPC_CoverState;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Jetpack_VerE_C_NPC_CoverState) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_NPC_CoverState");
static_assert(sizeof(ABP_Jetpack_VerE_C_NPC_CoverState) == 0x000010, "Wrong size on ABP_Jetpack_VerE_C_NPC_CoverState");
static_assert(offsetof(ABP_Jetpack_VerE_C_NPC_CoverState, Param_NPC_CoverState) == 0x000000, "Member 'ABP_Jetpack_VerE_C_NPC_CoverState::Param_NPC_CoverState' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.Limbless_State
// 0x0010 (0x0010 - 0x0000)
struct ABP_Jetpack_VerE_C_Limbless_State final
{
public:
	struct FPoseLink                              Param_Limbless_State;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Jetpack_VerE_C_Limbless_State) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_Limbless_State");
static_assert(sizeof(ABP_Jetpack_VerE_C_Limbless_State) == 0x000010, "Wrong size on ABP_Jetpack_VerE_C_Limbless_State");
static_assert(offsetof(ABP_Jetpack_VerE_C_Limbless_State, Param_Limbless_State) == 0x000000, "Member 'ABP_Jetpack_VerE_C_Limbless_State::Param_Limbless_State' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.KneeSlide_State
// 0x0010 (0x0010 - 0x0000)
struct ABP_Jetpack_VerE_C_KneeSlide_State final
{
public:
	struct FPoseLink                              Param_KneeSlide_State;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Jetpack_VerE_C_KneeSlide_State) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_KneeSlide_State");
static_assert(sizeof(ABP_Jetpack_VerE_C_KneeSlide_State) == 0x000010, "Wrong size on ABP_Jetpack_VerE_C_KneeSlide_State");
static_assert(offsetof(ABP_Jetpack_VerE_C_KneeSlide_State, Param_KneeSlide_State) == 0x000000, "Member 'ABP_Jetpack_VerE_C_KneeSlide_State::Param_KneeSlide_State' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.GetOwnerMovements
// 0x0018 (0x0018 - 0x0000)
struct ABP_Jetpack_VerE_C_GetOwnerMovements final
{
public:
	class UGzCharacterMovementComponent*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzCharacterMovementComponent*          K2Node_DynamicCast_AsGz_Character_Movement_Component; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Jetpack_VerE_C_GetOwnerMovements) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_GetOwnerMovements");
static_assert(sizeof(ABP_Jetpack_VerE_C_GetOwnerMovements) == 0x000018, "Wrong size on ABP_Jetpack_VerE_C_GetOwnerMovements");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetOwnerMovements, ReturnValue) == 0x000000, "Member 'ABP_Jetpack_VerE_C_GetOwnerMovements::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetOwnerMovements, K2Node_DynamicCast_AsGz_Character_Movement_Component) == 0x000008, "Member 'ABP_Jetpack_VerE_C_GetOwnerMovements::K2Node_DynamicCast_AsGz_Character_Movement_Component' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetOwnerMovements, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ABP_Jetpack_VerE_C_GetOwnerMovements::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.GetNormalizeData
// 0x0038 (0x0038 - 0x0000)
struct ABP_Jetpack_VerE_C_GetNormalizeData final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_Value_ImplicitCast;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Jetpack_VerE_C_GetNormalizeData) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_GetNormalizeData");
static_assert(sizeof(ABP_Jetpack_VerE_C_GetNormalizeData) == 0x000038, "Wrong size on ABP_Jetpack_VerE_C_GetNormalizeData");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetNormalizeData, DeltaTime) == 0x000000, "Member 'ABP_Jetpack_VerE_C_GetNormalizeData::DeltaTime' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetNormalizeData, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'ABP_Jetpack_VerE_C_GetNormalizeData::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetNormalizeData, CallFunc_Abs_ReturnValue) == 0x000010, "Member 'ABP_Jetpack_VerE_C_GetNormalizeData::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetNormalizeData, CallFunc_NormalizeToRange_ReturnValue) == 0x000018, "Member 'ABP_Jetpack_VerE_C_GetNormalizeData::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetNormalizeData, CallFunc_NormalizeToRange_ReturnValue_1) == 0x000020, "Member 'ABP_Jetpack_VerE_C_GetNormalizeData::CallFunc_NormalizeToRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetNormalizeData, CallFunc_Abs_A_ImplicitCast) == 0x000028, "Member 'ABP_Jetpack_VerE_C_GetNormalizeData::CallFunc_Abs_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetNormalizeData, CallFunc_NormalizeToRange_Value_ImplicitCast) == 0x000030, "Member 'ABP_Jetpack_VerE_C_GetNormalizeData::CallFunc_NormalizeToRange_Value_ImplicitCast' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.GetMainThreadSafeAnimation
// 0x0018 (0x0018 - 0x0000)
struct ABP_Jetpack_VerE_C_GetMainThreadSafeAnimation final
{
public:
	class UABP_Human_C*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UABP_Human_C*                           K2Node_DynamicCast_AsABP_Human;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Jetpack_VerE_C_GetMainThreadSafeAnimation) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_GetMainThreadSafeAnimation");
static_assert(sizeof(ABP_Jetpack_VerE_C_GetMainThreadSafeAnimation) == 0x000018, "Wrong size on ABP_Jetpack_VerE_C_GetMainThreadSafeAnimation");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetMainThreadSafeAnimation, ReturnValue) == 0x000000, "Member 'ABP_Jetpack_VerE_C_GetMainThreadSafeAnimation::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetMainThreadSafeAnimation, K2Node_DynamicCast_AsABP_Human) == 0x000008, "Member 'ABP_Jetpack_VerE_C_GetMainThreadSafeAnimation::K2Node_DynamicCast_AsABP_Human' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetMainThreadSafeAnimation, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ABP_Jetpack_VerE_C_GetMainThreadSafeAnimation::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ABP_Jetpack_VerE.ABP_Jetpack_VerE_C.GetJetpackStatsData
// 0x0130 (0x0130 - 0x0000)
struct ABP_Jetpack_VerE_C_GetJetpackStatsData final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_585C[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSizeXY_ReturnValue;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_585D[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_585E[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_585F[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_1;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5860[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_4;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5861[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5862[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_5;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5863[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_6;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_2;      // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5864[0x5];                                     // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_InRange_FloatFloat_Value_ImplicitCast;    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_LimbsSpreadAlpha_ImplicitCast;  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5865[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_TurbulenceStrengthAlpha_ImplicitCast; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5866[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1;   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_LimbsSwayAlpha_ImplicitCast;    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Jetpack_VerE_C_GetJetpackStatsData) == 0x000008, "Wrong alignment on ABP_Jetpack_VerE_C_GetJetpackStatsData");
static_assert(sizeof(ABP_Jetpack_VerE_C_GetJetpackStatsData) == 0x000130, "Wrong size on ABP_Jetpack_VerE_C_GetJetpackStatsData");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, DeltaTime) == 0x000000, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::DeltaTime' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, Temp_real_Variable) == 0x000008, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000010, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_MapRangeClamped_ReturnValue) == 0x000018, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_VSizeXY_ReturnValue) == 0x000028, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_VSizeXY_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000040, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_VSize_ReturnValue) == 0x000048, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000058, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_SafeDivide_ReturnValue) == 0x000060, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_FClamp_ReturnValue) == 0x000068, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_VSize_ReturnValue_1) == 0x000070, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x000078, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_SafeDivide_ReturnValue_1) == 0x000080, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_Abs_ReturnValue) == 0x000088, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_FClamp_ReturnValue_1) == 0x000090, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000098, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_Subtract_DoubleDouble_ReturnValue_4) == 0x0000A0, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_Subtract_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A8, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_Abs_ReturnValue_1) == 0x0000B0, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_Subtract_DoubleDouble_ReturnValue_5) == 0x0000C0, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_Subtract_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_Subtract_DoubleDouble_ReturnValue_6) == 0x0000D0, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_Subtract_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000E0, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_FClamp_ReturnValue_2) == 0x0000F0, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_NotEqual_DoubleDouble_ReturnValue_1) == 0x0000F8, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_NotEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_NotEqual_DoubleDouble_ReturnValue_2) == 0x0000F9, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_NotEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_BooleanOR_ReturnValue) == 0x0000FA, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_InRange_FloatFloat_Value_ImplicitCast) == 0x000100, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_InRange_FloatFloat_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, K2Node_VariableSet_LimbsSpreadAlpha_ImplicitCast) == 0x000108, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::K2Node_VariableSet_LimbsSpreadAlpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000110, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Jetpack_VerE_C_GetJetpackStatsData, K2Node_VariableSet_TurbulenceStrengthAlpha_ImplicitCast) == 0x000118, "Member 'ABP_Jetpack_VerE_C_GetJetpackStatsData::K2Node_VariableSet_TurbulenceStrengthAlpha_ImplicitCast' has a wrong offset!");
