#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Zipline

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "G01_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK::Params
{

// Function ABP_Zipline.ABP_Zipline_C.UpdateZiplineStart
// 0x0098 (0x0098 - 0x0000)
struct ABP_Zipline_C_UpdateZiplineStart final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D8[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReference               CallFunc_ConvertToSequencePlayerPure_SequencePlayer; // 0x0028(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequencePlayerPure_Result;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D9[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11DA[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11DB[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_2;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11DC[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_3;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11DD[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_1;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_2;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_3;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_4;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSequencePlayerReference               CallFunc_SetSequenceWithInertialBlending_ReturnValue; // 0x0088(0x0010)(NoDestructor)
};
static_assert(alignof(ABP_Zipline_C_UpdateZiplineStart) == 0x000008, "Wrong alignment on ABP_Zipline_C_UpdateZiplineStart");
static_assert(sizeof(ABP_Zipline_C_UpdateZiplineStart) == 0x000098, "Wrong size on ABP_Zipline_C_UpdateZiplineStart");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, Context) == 0x000000, "Member 'ABP_Zipline_C_UpdateZiplineStart::Context' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, Node) == 0x000010, "Member 'ABP_Zipline_C_UpdateZiplineStart::Node' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, Temp_bool_Variable) == 0x000020, "Member 'ABP_Zipline_C_UpdateZiplineStart::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, CallFunc_ConvertToSequencePlayerPure_SequencePlayer) == 0x000028, "Member 'ABP_Zipline_C_UpdateZiplineStart::CallFunc_ConvertToSequencePlayerPure_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, CallFunc_ConvertToSequencePlayerPure_Result) == 0x000038, "Member 'ABP_Zipline_C_UpdateZiplineStart::CallFunc_ConvertToSequencePlayerPure_Result' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, Temp_bool_Variable_1) == 0x000039, "Member 'ABP_Zipline_C_UpdateZiplineStart::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, Temp_bool_Variable_2) == 0x00003A, "Member 'ABP_Zipline_C_UpdateZiplineStart::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, Temp_bool_Variable_3) == 0x00003B, "Member 'ABP_Zipline_C_UpdateZiplineStart::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, Temp_bool_Variable_4) == 0x00003C, "Member 'ABP_Zipline_C_UpdateZiplineStart::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, CallFunc_MakeLiteralInt_ReturnValue) == 0x000040, "Member 'ABP_Zipline_C_UpdateZiplineStart::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000044, "Member 'ABP_Zipline_C_UpdateZiplineStart::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000048, "Member 'ABP_Zipline_C_UpdateZiplineStart::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00004C, "Member 'ABP_Zipline_C_UpdateZiplineStart::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, CallFunc_MakeLiteralInt_ReturnValue_2) == 0x000050, "Member 'ABP_Zipline_C_UpdateZiplineStart::CallFunc_MakeLiteralInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, CallFunc_BooleanOR_ReturnValue) == 0x000054, "Member 'ABP_Zipline_C_UpdateZiplineStart::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000055, "Member 'ABP_Zipline_C_UpdateZiplineStart::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, CallFunc_MakeLiteralInt_ReturnValue_3) == 0x000058, "Member 'ABP_Zipline_C_UpdateZiplineStart::CallFunc_MakeLiteralInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00005C, "Member 'ABP_Zipline_C_UpdateZiplineStart::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, CallFunc_BooleanOR_ReturnValue_1) == 0x00005D, "Member 'ABP_Zipline_C_UpdateZiplineStart::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, K2Node_Select_Default) == 0x000060, "Member 'ABP_Zipline_C_UpdateZiplineStart::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, K2Node_Select_Default_1) == 0x000068, "Member 'ABP_Zipline_C_UpdateZiplineStart::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, K2Node_Select_Default_2) == 0x000070, "Member 'ABP_Zipline_C_UpdateZiplineStart::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, K2Node_Select_Default_3) == 0x000078, "Member 'ABP_Zipline_C_UpdateZiplineStart::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, K2Node_Select_Default_4) == 0x000080, "Member 'ABP_Zipline_C_UpdateZiplineStart::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_UpdateZiplineStart, CallFunc_SetSequenceWithInertialBlending_ReturnValue) == 0x000088, "Member 'ABP_Zipline_C_UpdateZiplineStart::CallFunc_SetSequenceWithInertialBlending_ReturnValue' has a wrong offset!");

// Function ABP_Zipline.ABP_Zipline_C.SetupZiplineLoop
// 0x0098 (0x0098 - 0x0000)
struct ABP_Zipline_C_SetupZiplineLoop final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11DE[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReference               CallFunc_ConvertToSequencePlayerPure_SequencePlayer; // 0x0028(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequencePlayerPure_Result;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11DF[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E0[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E1[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_2;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E2[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_3;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E3[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_1;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_2;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_3;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_4;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSequencePlayerReference               CallFunc_SetSequence_ReturnValue;                  // 0x0088(0x0010)(NoDestructor)
};
static_assert(alignof(ABP_Zipline_C_SetupZiplineLoop) == 0x000008, "Wrong alignment on ABP_Zipline_C_SetupZiplineLoop");
static_assert(sizeof(ABP_Zipline_C_SetupZiplineLoop) == 0x000098, "Wrong size on ABP_Zipline_C_SetupZiplineLoop");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, Context) == 0x000000, "Member 'ABP_Zipline_C_SetupZiplineLoop::Context' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, Node) == 0x000010, "Member 'ABP_Zipline_C_SetupZiplineLoop::Node' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, Temp_bool_Variable) == 0x000020, "Member 'ABP_Zipline_C_SetupZiplineLoop::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, CallFunc_ConvertToSequencePlayerPure_SequencePlayer) == 0x000028, "Member 'ABP_Zipline_C_SetupZiplineLoop::CallFunc_ConvertToSequencePlayerPure_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, CallFunc_ConvertToSequencePlayerPure_Result) == 0x000038, "Member 'ABP_Zipline_C_SetupZiplineLoop::CallFunc_ConvertToSequencePlayerPure_Result' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, Temp_bool_Variable_1) == 0x000039, "Member 'ABP_Zipline_C_SetupZiplineLoop::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, Temp_bool_Variable_2) == 0x00003A, "Member 'ABP_Zipline_C_SetupZiplineLoop::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, Temp_bool_Variable_3) == 0x00003B, "Member 'ABP_Zipline_C_SetupZiplineLoop::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, Temp_bool_Variable_4) == 0x00003C, "Member 'ABP_Zipline_C_SetupZiplineLoop::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, CallFunc_MakeLiteralInt_ReturnValue) == 0x000040, "Member 'ABP_Zipline_C_SetupZiplineLoop::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000044, "Member 'ABP_Zipline_C_SetupZiplineLoop::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000048, "Member 'ABP_Zipline_C_SetupZiplineLoop::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00004C, "Member 'ABP_Zipline_C_SetupZiplineLoop::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, CallFunc_MakeLiteralInt_ReturnValue_2) == 0x000050, "Member 'ABP_Zipline_C_SetupZiplineLoop::CallFunc_MakeLiteralInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, CallFunc_BooleanOR_ReturnValue) == 0x000054, "Member 'ABP_Zipline_C_SetupZiplineLoop::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000055, "Member 'ABP_Zipline_C_SetupZiplineLoop::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, CallFunc_MakeLiteralInt_ReturnValue_3) == 0x000058, "Member 'ABP_Zipline_C_SetupZiplineLoop::CallFunc_MakeLiteralInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00005C, "Member 'ABP_Zipline_C_SetupZiplineLoop::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, CallFunc_BooleanOR_ReturnValue_1) == 0x00005D, "Member 'ABP_Zipline_C_SetupZiplineLoop::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, K2Node_Select_Default) == 0x000060, "Member 'ABP_Zipline_C_SetupZiplineLoop::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, K2Node_Select_Default_1) == 0x000068, "Member 'ABP_Zipline_C_SetupZiplineLoop::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, K2Node_Select_Default_2) == 0x000070, "Member 'ABP_Zipline_C_SetupZiplineLoop::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, K2Node_Select_Default_3) == 0x000078, "Member 'ABP_Zipline_C_SetupZiplineLoop::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, K2Node_Select_Default_4) == 0x000080, "Member 'ABP_Zipline_C_SetupZiplineLoop::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_SetupZiplineLoop, CallFunc_SetSequence_ReturnValue) == 0x000088, "Member 'ABP_Zipline_C_SetupZiplineLoop::CallFunc_SetSequence_ReturnValue' has a wrong offset!");

// Function ABP_Zipline.ABP_Zipline_C.NPC_CoverState
// 0x0010 (0x0010 - 0x0000)
struct ABP_Zipline_C_NPC_CoverState final
{
public:
	struct FPoseLink                              Param_NPC_CoverState;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Zipline_C_NPC_CoverState) == 0x000008, "Wrong alignment on ABP_Zipline_C_NPC_CoverState");
static_assert(sizeof(ABP_Zipline_C_NPC_CoverState) == 0x000010, "Wrong size on ABP_Zipline_C_NPC_CoverState");
static_assert(offsetof(ABP_Zipline_C_NPC_CoverState, Param_NPC_CoverState) == 0x000000, "Member 'ABP_Zipline_C_NPC_CoverState::Param_NPC_CoverState' has a wrong offset!");

// Function ABP_Zipline.ABP_Zipline_C.Limbless_State
// 0x0010 (0x0010 - 0x0000)
struct ABP_Zipline_C_Limbless_State final
{
public:
	struct FPoseLink                              Param_Limbless_State;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Zipline_C_Limbless_State) == 0x000008, "Wrong alignment on ABP_Zipline_C_Limbless_State");
static_assert(sizeof(ABP_Zipline_C_Limbless_State) == 0x000010, "Wrong size on ABP_Zipline_C_Limbless_State");
static_assert(offsetof(ABP_Zipline_C_Limbless_State, Param_Limbless_State) == 0x000000, "Member 'ABP_Zipline_C_Limbless_State::Param_Limbless_State' has a wrong offset!");

// Function ABP_Zipline.ABP_Zipline_C.KneeSlide_State
// 0x0010 (0x0010 - 0x0000)
struct ABP_Zipline_C_KneeSlide_State final
{
public:
	struct FPoseLink                              Param_KneeSlide_State;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Zipline_C_KneeSlide_State) == 0x000008, "Wrong alignment on ABP_Zipline_C_KneeSlide_State");
static_assert(sizeof(ABP_Zipline_C_KneeSlide_State) == 0x000010, "Wrong size on ABP_Zipline_C_KneeSlide_State");
static_assert(offsetof(ABP_Zipline_C_KneeSlide_State, Param_KneeSlide_State) == 0x000000, "Member 'ABP_Zipline_C_KneeSlide_State::Param_KneeSlide_State' has a wrong offset!");

// Function ABP_Zipline.ABP_Zipline_C.IsVerticalZipline
// 0x0003 (0x0003 - 0x0000)
struct ABP_Zipline_C_IsVerticalZipline final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVertical_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Zipline_C_IsVerticalZipline) == 0x000001, "Wrong alignment on ABP_Zipline_C_IsVerticalZipline");
static_assert(sizeof(ABP_Zipline_C_IsVerticalZipline) == 0x000003, "Wrong size on ABP_Zipline_C_IsVerticalZipline");
static_assert(offsetof(ABP_Zipline_C_IsVerticalZipline, ReturnValue) == 0x000000, "Member 'ABP_Zipline_C_IsVerticalZipline::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_IsVerticalZipline, CallFunc_IsVertical_ReturnValue) == 0x000001, "Member 'ABP_Zipline_C_IsVerticalZipline::CallFunc_IsVertical_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_IsVerticalZipline, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'ABP_Zipline_C_IsVerticalZipline::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ABP_Zipline.ABP_Zipline_C.GetZiplineDataAndLogic
// 0x01C0 (0x01C0 - 0x0000)
struct ABP_Zipline_C_GetZiplineDataAndLogic final
{
public:
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E5[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E6[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E7[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E8[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayerFacingVerticalZiplineDirection_ReturnValue; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Select_Default;                             // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E9[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPoleVectorForHandIK_L_ReturnValue;     // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPoleVectorForHandIK_R_ReturnValue;     // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVerticalDirection_ReturnValue;         // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHorizontalDirection_ReturnValue;       // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Select_Default_1;                           // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_SelectFloat_B_ImplicitCast;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_B_ImplicitCast_1;             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_Value_ImplicitCast;      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_2;           // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_A_ImplicitCast;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_3;           // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Zipline_C_GetZiplineDataAndLogic) == 0x000008, "Wrong alignment on ABP_Zipline_C_GetZiplineDataAndLogic");
static_assert(sizeof(ABP_Zipline_C_GetZiplineDataAndLogic) == 0x0001C0, "Wrong size on ABP_Zipline_C_GetZiplineDataAndLogic");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000000, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_NormalizeToRange_ReturnValue) == 0x000008, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_Abs_ReturnValue) == 0x000010, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_SelectFloat_ReturnValue) == 0x000030, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_BreakRotator_Roll) == 0x000038, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_BreakRotator_Pitch) == 0x00003C, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_BreakRotator_Yaw) == 0x000040, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_SelectInt_ReturnValue) == 0x000054, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_NormalizeToRange_ReturnValue_1) == 0x000058, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_NormalizeToRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_Abs_ReturnValue_1) == 0x000060, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_GetCurveValue_ReturnValue) == 0x000068, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_MakeRotator_ReturnValue_1) == 0x000070, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_MakeRotator_ReturnValue_2) == 0x000088, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, Temp_bool_Variable) == 0x0000A0, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_GetPlayerFacingVerticalZiplineDirection_ReturnValue) == 0x0000A4, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_GetPlayerFacingVerticalZiplineDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_SelectFloat_ReturnValue_1) == 0x0000A8, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, K2Node_Select_Default) == 0x0000B0, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_MakeRotator_ReturnValue_3) == 0x0000C8, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, Temp_bool_Variable_1) == 0x0000E0, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_GetPoleVectorForHandIK_L_ReturnValue) == 0x0000E8, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_GetPoleVectorForHandIK_L_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_GetPoleVectorForHandIK_R_ReturnValue) == 0x000100, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_GetPoleVectorForHandIK_R_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_GetVerticalDirection_ReturnValue) == 0x000118, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_GetVerticalDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_GetHorizontalDirection_ReturnValue) == 0x000130, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_GetHorizontalDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_SelectVector_ReturnValue) == 0x000148, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_SelectFloat_ReturnValue_2) == 0x000160, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, K2Node_Select_Default_1) == 0x000168, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_SelectFloat_B_ImplicitCast) == 0x000180, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_SelectFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x000188, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x00018C, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_SelectFloat_B_ImplicitCast_1) == 0x000190, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_SelectFloat_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_NormalizeToRange_Value_ImplicitCast) == 0x000198, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_NormalizeToRange_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0001A0, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_MakeRotator_Yaw_ImplicitCast_1) == 0x0001A8, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_MakeRotator_Yaw_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_MakeRotator_Yaw_ImplicitCast_2) == 0x0001AC, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_MakeRotator_Yaw_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_SelectFloat_A_ImplicitCast) == 0x0001B0, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_SelectFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetZiplineDataAndLogic, CallFunc_MakeRotator_Yaw_ImplicitCast_3) == 0x0001B8, "Member 'ABP_Zipline_C_GetZiplineDataAndLogic::CallFunc_MakeRotator_Yaw_ImplicitCast_3' has a wrong offset!");

// Function ABP_Zipline.ABP_Zipline_C.GetZiplineData
// 0x0058 (0x0058 - 0x0000)
struct ABP_Zipline_C_GetZiplineData final
{
public:
	struct FGzZiplineMovementRuntimeData          ReturnValue;                                       // 0x0000(0x0058)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(ABP_Zipline_C_GetZiplineData) == 0x000008, "Wrong alignment on ABP_Zipline_C_GetZiplineData");
static_assert(sizeof(ABP_Zipline_C_GetZiplineData) == 0x000058, "Wrong size on ABP_Zipline_C_GetZiplineData");
static_assert(offsetof(ABP_Zipline_C_GetZiplineData, ReturnValue) == 0x000000, "Member 'ABP_Zipline_C_GetZiplineData::ReturnValue' has a wrong offset!");

// Function ABP_Zipline.ABP_Zipline_C.GetVerticalDirection
// 0x0120 (0x0120 - 0x0000)
struct ABP_Zipline_C_GetVerticalDirection final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Zipline_C_GetVerticalDirection) == 0x000008, "Wrong alignment on ABP_Zipline_C_GetVerticalDirection");
static_assert(sizeof(ABP_Zipline_C_GetVerticalDirection) == 0x000120, "Wrong size on ABP_Zipline_C_GetVerticalDirection");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, ReturnValue) == 0x000000, "Member 'ABP_Zipline_C_GetVerticalDirection::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_BreakVector_X) == 0x000018, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_BreakVector_Y) == 0x000020, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_BreakVector_Z) == 0x000028, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_BreakVector_X_1) == 0x000030, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_BreakVector_Y_1) == 0x000038, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_BreakVector_Z_1) == 0x000040, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_SelectFloat_ReturnValue) == 0x000048, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_SelectFloat_ReturnValue_1) == 0x000050, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000070, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_SelectFloat_ReturnValue_2) == 0x000088, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000090, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x0000A8, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000C0, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D8, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000F0, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetVerticalDirection, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000108, "Member 'ABP_Zipline_C_GetVerticalDirection::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");

// Function ABP_Zipline.ABP_Zipline_C.GetSpine05Data
// 0x00D0 (0x00D0 - 0x0000)
struct ABP_Zipline_C_GetSpine05Data final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetBoneTransform_ReturnValue;             // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Zipline_C_GetSpine05Data) == 0x000010, "Wrong alignment on ABP_Zipline_C_GetSpine05Data");
static_assert(sizeof(ABP_Zipline_C_GetSpine05Data) == 0x0000D0, "Wrong size on ABP_Zipline_C_GetSpine05Data");
static_assert(offsetof(ABP_Zipline_C_GetSpine05Data, ReturnValue) == 0x000000, "Member 'ABP_Zipline_C_GetSpine05Data::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetSpine05Data, CallFunc_GetBoneTransform_ReturnValue) == 0x000060, "Member 'ABP_Zipline_C_GetSpine05Data::CallFunc_GetBoneTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetSpine05Data, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'ABP_Zipline_C_GetSpine05Data::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ABP_Zipline.ABP_Zipline_C.GetPoleVectorForHandIK_R
// 0x0150 (0x0150 - 0x0000)
struct ABP_Zipline_C_GetPoleVectorForHandIK_R final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Quat_Rotator_ReturnValue;                 // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Zipline_C_GetPoleVectorForHandIK_R) == 0x000008, "Wrong alignment on ABP_Zipline_C_GetPoleVectorForHandIK_R");
static_assert(sizeof(ABP_Zipline_C_GetPoleVectorForHandIK_R) == 0x000150, "Wrong size on ABP_Zipline_C_GetPoleVectorForHandIK_R");
static_assert(offsetof(ABP_Zipline_C_GetPoleVectorForHandIK_R, ReturnValue) == 0x000000, "Member 'ABP_Zipline_C_GetPoleVectorForHandIK_R::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetPoleVectorForHandIK_R, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000018, "Member 'ABP_Zipline_C_GetPoleVectorForHandIK_R::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetPoleVectorForHandIK_R, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000030, "Member 'ABP_Zipline_C_GetPoleVectorForHandIK_R::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetPoleVectorForHandIK_R, CallFunc_BreakTransform_Location) == 0x000048, "Member 'ABP_Zipline_C_GetPoleVectorForHandIK_R::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetPoleVectorForHandIK_R, CallFunc_BreakTransform_Rotation) == 0x000060, "Member 'ABP_Zipline_C_GetPoleVectorForHandIK_R::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetPoleVectorForHandIK_R, CallFunc_BreakTransform_Scale) == 0x000078, "Member 'ABP_Zipline_C_GetPoleVectorForHandIK_R::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetPoleVectorForHandIK_R, CallFunc_Quat_Rotator_ReturnValue) == 0x000090, "Member 'ABP_Zipline_C_GetPoleVectorForHandIK_R::CallFunc_Quat_Rotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetPoleVectorForHandIK_R, CallFunc_GetForwardVector_ReturnValue) == 0x0000A8, "Member 'ABP_Zipline_C_GetPoleVectorForHandIK_R::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetPoleVectorForHandIK_R, CallFunc_GetForwardVector_ReturnValue_1) == 0x0000C0, "Member 'ABP_Zipline_C_GetPoleVectorForHandIK_R::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetPoleVectorForHandIK_R, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000D8, "Member 'ABP_Zipline_C_GetPoleVectorForHandIK_R::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetPoleVectorForHandIK_R, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000F0, "Member 'ABP_Zipline_C_GetPoleVectorForHandIK_R::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetPoleVectorForHandIK_R, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'ABP_Zipline_C_GetPoleVectorForHandIK_R::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetPoleVectorForHandIK_R, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000120, "Member 'ABP_Zipline_C_GetPoleVectorForHandIK_R::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Zipline_C_GetPoleVectorForHandIK_R, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000138, "Member 'ABP_Zipline_C_GetPoleVectorForHandIK_R::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");

// Function ABP_Zipline.ABP_Zipline_C.GetPoleVectorForHandIK_L
// 0x0150 (0x0150 - 0x0000)
struct ABP_Zipline_C_GetPoleVectorForHandIK_L final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Quat_Rotator_ReturnValue;                 // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
