#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AssaultDrone

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_AssaultDrone.ABP_AssaultDrone_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_AssaultDrone_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_AssaultDrone_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_AssaultDrone_C_AnimGraph");
static_assert(sizeof(ABP_AssaultDrone_C_AnimGraph) == 0x000010, "Wrong size on ABP_AssaultDrone_C_AnimGraph");
static_assert(offsetof(ABP_AssaultDrone_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_AssaultDrone_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_AssaultDrone.ABP_AssaultDrone_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_AssaultDrone_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AssaultDrone_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_AssaultDrone_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_AssaultDrone_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_AssaultDrone_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_AssaultDrone_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_AssaultDrone_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_AssaultDrone.ABP_AssaultDrone_C.ExecuteUbergraph_ABP_AssaultDrone
// 0x0028 (0x0028 - 0x0000)
struct ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_AssaultDrone_C*                 K2Node_DynamicCast_AsBP_NPC_Assault_Drone;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6478[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_SideValue_ImplicitCast;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone) == 0x000008, "Wrong alignment on ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone");
static_assert(sizeof(ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone) == 0x000028, "Wrong size on ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone");
static_assert(offsetof(ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone, EntryPoint) == 0x000000, "Member 'ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone, K2Node_DynamicCast_AsBP_NPC_Assault_Drone) == 0x000010, "Member 'ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone::K2Node_DynamicCast_AsBP_NPC_Assault_Drone' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone, K2Node_VariableSet_SideValue_ImplicitCast) == 0x000020, "Member 'ABP_AssaultDrone_C_ExecuteUbergraph_ABP_AssaultDrone::K2Node_VariableSet_SideValue_ImplicitCast' has a wrong offset!");

}

