#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Turret

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Turret.ABP_Turret_C.AnimBlueprintGeneratedMutableData
// 0x001B (0x001C - 0x0001)
struct ABP_Turret::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_5B19[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1A[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Turret::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_Turret::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Turret::FAnimBlueprintGeneratedMutableData) == 0x00001C, "Wrong size on ABP_Turret::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_Turret::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABP_Turret::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x00000C, "Member 'ABP_Turret::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'ABP_Turret::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'ABP_Turret::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000018, "Member 'ABP_Turret::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");

// ScriptStruct ABP_Turret.ABP_Turret_C.AnimBlueprintGeneratedConstantData
// 0x037F (0x0380 - 0x0001)
struct ABP_Turret::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_5B1B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_94;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_95;                             // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_96;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_97;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_98;                                 // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1D[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_99;                             // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_100;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_101;                                  // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_102;                                // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_103;                                // 0x0041(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1E[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_104;                               // 0x0048(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_105;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_106;                                // 0x005C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1F[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_107;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_108;                                // 0x0064(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_109;                                // 0x0065(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_110;                                // 0x0066(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B20[0x1];                                     // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_111;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_112;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_113;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_114;                                 // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B21[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_115;                              // 0x0088(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0128(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0140(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x0170(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace_2;          // 0x01A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_1;                 // 0x01D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x0200(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;                   // 0x0230(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x0260(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                     // 0x0290(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;                    // 0x02C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace;            // 0x02F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x0320(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x0350(0x0030)()
};
static_assert(alignof(ABP_Turret::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Turret::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Turret::FAnimBlueprintGeneratedConstantData) == 0x000380, "Wrong size on ABP_Turret::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __NameProperty_94) == 0x000004, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__NameProperty_94' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_95) == 0x000010, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_95' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __NameProperty_96) == 0x000018, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__NameProperty_96' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __IntProperty_97) == 0x000020, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__IntProperty_97' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __ByteProperty_98) == 0x000024, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__ByteProperty_98' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_99) == 0x000028, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_99' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __BlendProfile_100) == 0x000030, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__BlendProfile_100' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __CurveFloat_101) == 0x000038, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__CurveFloat_101' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __EnumProperty_102) == 0x000040, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__EnumProperty_102' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __EnumProperty_103) == 0x000041, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__EnumProperty_103' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __ArrayProperty_104) == 0x000048, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__ArrayProperty_104' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __FloatProperty_105) == 0x000058, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__FloatProperty_105' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __BoolProperty_106) == 0x00005C, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__BoolProperty_106' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __FloatProperty_107) == 0x000060, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__FloatProperty_107' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __BoolProperty_108) == 0x000064, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__BoolProperty_108' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __EnumProperty_109) == 0x000065, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__EnumProperty_109' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __ByteProperty_110) == 0x000066, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__ByteProperty_110' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __NameProperty_111) == 0x000068, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__NameProperty_111' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __NameProperty_112) == 0x000070, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__NameProperty_112' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __NameProperty_113) == 0x000078, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__NameProperty_113' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __IntProperty_114) == 0x000080, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__IntProperty_114' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, __StructProperty_115) == 0x000088, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::__StructProperty_115' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A8, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000128, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000140, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000170, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotationOffsetBlendSpace_2) == 0x0001A0, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotationOffsetBlendSpace_2' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_1) == 0x0001D0, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000200, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x000230, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotationOffsetBlendSpace_1) == 0x000260, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotationOffsetBlendSpace_1' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000290, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x0002C0, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotationOffsetBlendSpace) == 0x0002F0, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000320, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_Turret::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000350, "Member 'ABP_Turret::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

}

