#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Human

#include "Basic.hpp"

#include "AnimationWarpingRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"
#include "ABP_Human_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Human.ABP_Human_C
// 0x5200 (0x5E90 - 0x0C90)
class UABP_Human_C final : public UGzDefaultCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Human::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0C98(0x0028)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x0CC0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0CC8(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x0CD0(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0D78(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x0D80(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x0DA0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x0DC0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x0DE0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x0E00(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0E20(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x0ED8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x0EF8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x0F18(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x0F38(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x0F58(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x0F78(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x0F98(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x0FB8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x0FD8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x0FF8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1018(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1038(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x10F0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x1110(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1130(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1150(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1170(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1190(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x11B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x11D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x1200(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x1228(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x1250(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x1278(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x12A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x12C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x12F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x1318(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x1340(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x1368(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x1390(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x13B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x13E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x1408(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x1430(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x1458(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x1480(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x14A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x14D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x14F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x1520(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x1548(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x1570(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x1598(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x15C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x15E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x1610(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x1638(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x1660(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x1688(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x16B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x16D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x1700(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x1728(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x1750(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1778(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x17A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x17C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x17F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1818(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x1840(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1868(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1890(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x18B8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x18E0(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_19;                  // 0x1900(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x19C8(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x19E8(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_18;                  // 0x1A08(0x00C8)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_1;                   // 0x1AD0(0x0440)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x1F10(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_17;                  // 0x1F30(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x1FF8(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_16;                  // 0x2018(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x20E0(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_15;                  // 0x2100(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x21C8(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_14;                  // 0x21E8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x22B0(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_13;                  // 0x22D0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x2398(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_12;                  // 0x23B8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x2480(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x24A0(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_11;                  // 0x24C8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x2590(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_10;                  // 0x25B0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x2678(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_9;                   // 0x2698(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x2760(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2780(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_8;                   // 0x27A8(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x2870(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x2938(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x29A8(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_7;                   // 0x29C8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x2A90(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_6;                   // 0x2AB0(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x2B78(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x2C40(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2CB0(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_5;                   // 0x2CD0(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x2D98(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x2E60(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2ED0(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0x2EF0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2FB8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2FD8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x30A0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x3120(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x3148(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x3190(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x31B8(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x3238(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x3300(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x3348(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x3438(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x3480(0x0010)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone;                      // 0x3490(0x00B0)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x3540(0x0440)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x3980(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x39C8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x3A90(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x3AD8(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x3B00(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x3BC8(0x00C8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x3C90(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x4160(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x4228(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x4270(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x42B8(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x43A8(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x4498(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x44E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x4508(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x4530(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x4578(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x4668(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x4690(0x0048)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x46D8(0x04D0)(ContainsInstancedReference)
	uint8                                         Pad_2457[0x8];                                     // 0x4BA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_FootPlacement                AnimGraphNode_FootPlacement;                       // 0x4BB0(0x0430)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x4FE0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x5000(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x5020(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x50E8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x5130(0x0048)()
	uint8                                         Pad_2458[0x8];                                     // 0x5178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x5180(0x0970)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x5AF0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x5B10(0x0020)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK;                               // 0x5B30(0x0100)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x5C30(0x0048)()
	class UPawnMovementComponent*                 K2Node_PropertyAccess_44;                          // 0x5C78(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_AimPitch_9527FFCA45E8147F537F999E152BBE95; // 0x5C80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_AimYaw_9527FFCA45E8147F537F999E152BBE95; // 0x5C88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_WeaponImpactModifier_1EAE1891487872884F729BA1A4195A06; // 0x5C90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitDirectionInfo                      __CustomProperty_Arm_R_Results_Shock_1EAE1891487872884F729BA1A4195A06; // 0x5C98(0x0030)(NoDestructor)
	struct FHitDirectionInfo                      __CustomProperty_Arm_L_Results_Shock_1EAE1891487872884F729BA1A4195A06; // 0x5CC8(0x0030)(NoDestructor)
	struct FHitDirectionInfo                      __CustomProperty_Body_Results_Shock_1EAE1891487872884F729BA1A4195A06; // 0x5CF8(0x0030)(NoDestructor)
	struct FHitDirectionInfo                      __CustomProperty_Head_Results_Shock_1EAE1891487872884F729BA1A4195A06; // 0x5D28(0x0030)(NoDestructor)
	bool                                          __CustomProperty_Is_ADS_1EAE1891487872884F729BA1A4195A06; // 0x5D58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2459[0x7];                                     // 0x5D59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitDirectionInfo                      __CustomProperty_Arm_R_Results_Hit_1EAE1891487872884F729BA1A4195A06; // 0x5D60(0x0030)(NoDestructor)
	struct FHitDirectionInfo                      __CustomProperty_Arm_L_Results_Hit_1EAE1891487872884F729BA1A4195A06; // 0x5D90(0x0030)(NoDestructor)
	struct FHitDirectionInfo                      __CustomProperty_Body_Results_Hit_1EAE1891487872884F729BA1A4195A06; // 0x5DC0(0x0030)(NoDestructor)
	struct FHitDirectionInfo                      __CustomProperty_Head_Results_Hit_1EAE1891487872884F729BA1A4195A06; // 0x5DF0(0x0030)(NoDestructor)
	struct FVector                                __CustomProperty_Weapon_Front_Grip_C603AF064DB8A2E93D73CB92809F45A0; // 0x5E20(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Right_Hand_IK_C603AF064DB8A2E93D73CB92809F45A0; // 0x5E38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Left_Hand_IK_C603AF064DB8A2E93D73CB92809F45A0; // 0x5E39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTag_IsFiring;                              // 0x5E3A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTag_IsDashing;                             // 0x5E3B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTag_IsMelee;                               // 0x5E3C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInGrapplePull;                                   // 0x5E3D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245A[0x2];                                     // 0x5E3E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ExternalForceMultiplier;                           // 0x5E40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Limb_Slot;                                         // 0x5E58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245B[0x7];                                     // 0x5E59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CyberArmAimLocation;                               // 0x5E60(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RootYawOffset_WithDamagedBodyAim;                  // 0x5E78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsingLeftGrappleHook;                            // 0x5E80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245C[0x3];                                     // 0x5E81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FullBodyAbilityOutBlendTime;                       // 0x5E84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FullBodyAbilityInBlendTime;                        // 0x5E88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bJumpBoostLegs;                                    // 0x5E8C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Aiming_Correction(const struct FPoseLink& Aim_pose, struct FPoseLink* Param_Aiming_Correction);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void DamagedBody_CycleState(struct FPoseLink* Param_DamagedBody_CycleState);
	void DamagedBody_EnterState(struct FPoseLink* Param_DamagedBody_EnterState);
	void DamagedBody_ExitState(struct FPoseLink* Param_DamagedBody_ExitState);
	void DamagedBody_IdleState(struct FPoseLink* Param_DamagedBody_IdleState);
	void DamagedBodyOnExitStateEntry(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void DamagedBodySetupState(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void DamagedBodyUpdateRootYawOffset_CompensateAimYaw(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
