#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLA_Dart_Arm_ARM_R

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function ABP_CLA_Dart_Arm_ARM_R.ABP_CLA_Dart_Arm_ARM_R_C.UnHideMaterialSlots
// 0x0058 (0x0058 - 0x0000)
struct ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots final
{
public:
	TArray<int32>                                 LODs;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 Materials;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_612C[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_612D[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots) == 0x000008, "Wrong alignment on ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots");
static_assert(sizeof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots) == 0x000058, "Wrong size on ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, LODs) == 0x000000, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::LODs' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, Materials) == 0x000010, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::Materials' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, Temp_int_Array_Index_Variable) == 0x000020, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, CallFunc_Array_Get_Item) == 0x000028, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, CallFunc_Array_Length_ReturnValue_1) == 0x00002C, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, Temp_int_Array_Index_Variable_1) == 0x00003C, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, Temp_int_Loop_Counter_Variable_1) == 0x000044, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, CallFunc_GetOwningComponent_ReturnValue) == 0x000048, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, CallFunc_Less_IntInt_ReturnValue_1) == 0x000050, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_UnHideMaterialSlots::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function ABP_CLA_Dart_Arm_ARM_R.ABP_CLA_Dart_Arm_ARM_R_C.OnTagRemoved_A83057644504EB5754F9E49435DC5975
// 0x0008 (0x0008 - 0x0000)
struct ABP_CLA_Dart_Arm_ARM_R_C_OnTagRemoved_A83057644504EB5754F9E49435DC5975 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLA_Dart_Arm_ARM_R_C_OnTagRemoved_A83057644504EB5754F9E49435DC5975) == 0x000004, "Wrong alignment on ABP_CLA_Dart_Arm_ARM_R_C_OnTagRemoved_A83057644504EB5754F9E49435DC5975");
static_assert(sizeof(ABP_CLA_Dart_Arm_ARM_R_C_OnTagRemoved_A83057644504EB5754F9E49435DC5975) == 0x000008, "Wrong size on ABP_CLA_Dart_Arm_ARM_R_C_OnTagRemoved_A83057644504EB5754F9E49435DC5975");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_OnTagRemoved_A83057644504EB5754F9E49435DC5975, Tag) == 0x000000, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_OnTagRemoved_A83057644504EB5754F9E49435DC5975::Tag' has a wrong offset!");

// Function ABP_CLA_Dart_Arm_ARM_R.ABP_CLA_Dart_Arm_ARM_R_C.OnTagRemoved_62ADEBA8495E708164B2B7BDB9F79160
// 0x0008 (0x0008 - 0x0000)
struct ABP_CLA_Dart_Arm_ARM_R_C_OnTagRemoved_62ADEBA8495E708164B2B7BDB9F79160 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLA_Dart_Arm_ARM_R_C_OnTagRemoved_62ADEBA8495E708164B2B7BDB9F79160) == 0x000004, "Wrong alignment on ABP_CLA_Dart_Arm_ARM_R_C_OnTagRemoved_62ADEBA8495E708164B2B7BDB9F79160");
static_assert(sizeof(ABP_CLA_Dart_Arm_ARM_R_C_OnTagRemoved_62ADEBA8495E708164B2B7BDB9F79160) == 0x000008, "Wrong size on ABP_CLA_Dart_Arm_ARM_R_C_OnTagRemoved_62ADEBA8495E708164B2B7BDB9F79160");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_OnTagRemoved_62ADEBA8495E708164B2B7BDB9F79160, Tag) == 0x000000, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_OnTagRemoved_62ADEBA8495E708164B2B7BDB9F79160::Tag' has a wrong offset!");

// Function ABP_CLA_Dart_Arm_ARM_R.ABP_CLA_Dart_Arm_ARM_R_C.OnTagAdded_A83057644504EB5754F9E49435DC5975
// 0x0008 (0x0008 - 0x0000)
struct ABP_CLA_Dart_Arm_ARM_R_C_OnTagAdded_A83057644504EB5754F9E49435DC5975 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLA_Dart_Arm_ARM_R_C_OnTagAdded_A83057644504EB5754F9E49435DC5975) == 0x000004, "Wrong alignment on ABP_CLA_Dart_Arm_ARM_R_C_OnTagAdded_A83057644504EB5754F9E49435DC5975");
static_assert(sizeof(ABP_CLA_Dart_Arm_ARM_R_C_OnTagAdded_A83057644504EB5754F9E49435DC5975) == 0x000008, "Wrong size on ABP_CLA_Dart_Arm_ARM_R_C_OnTagAdded_A83057644504EB5754F9E49435DC5975");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_OnTagAdded_A83057644504EB5754F9E49435DC5975, Tag) == 0x000000, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_OnTagAdded_A83057644504EB5754F9E49435DC5975::Tag' has a wrong offset!");

// Function ABP_CLA_Dart_Arm_ARM_R.ABP_CLA_Dart_Arm_ARM_R_C.OnTagAdded_62ADEBA8495E708164B2B7BDB9F79160
// 0x0008 (0x0008 - 0x0000)
struct ABP_CLA_Dart_Arm_ARM_R_C_OnTagAdded_62ADEBA8495E708164B2B7BDB9F79160 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLA_Dart_Arm_ARM_R_C_OnTagAdded_62ADEBA8495E708164B2B7BDB9F79160) == 0x000004, "Wrong alignment on ABP_CLA_Dart_Arm_ARM_R_C_OnTagAdded_62ADEBA8495E708164B2B7BDB9F79160");
static_assert(sizeof(ABP_CLA_Dart_Arm_ARM_R_C_OnTagAdded_62ADEBA8495E708164B2B7BDB9F79160) == 0x000008, "Wrong size on ABP_CLA_Dart_Arm_ARM_R_C_OnTagAdded_62ADEBA8495E708164B2B7BDB9F79160");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_OnTagAdded_62ADEBA8495E708164B2B7BDB9F79160, Tag) == 0x000000, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_OnTagAdded_62ADEBA8495E708164B2B7BDB9F79160::Tag' has a wrong offset!");

// Function ABP_CLA_Dart_Arm_ARM_R.ABP_CLA_Dart_Arm_ARM_R_C.ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R
// 0x00E8 (0x00E8 - 0x0000)
struct ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_2;                          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_612E[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_612F[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6130[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6131[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_3;                          // 0x00BC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6132[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6133[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6134[0x2];                                     // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R) == 0x000008, "Wrong alignment on ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R");
static_assert(sizeof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R) == 0x0000E8, "Wrong size on ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, EntryPoint) == 0x000000, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, Temp_int_Array_Index_Variable) == 0x000004, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, Temp_struct_Variable) == 0x000008, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, K2Node_CustomEvent_Tag_2) == 0x000010, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::K2Node_CustomEvent_Tag_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, Temp_struct_Variable_1) == 0x000028, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_GetGzAbilitySystemComponent_ReturnValue) == 0x000030, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_GetGzAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, K2Node_CustomEvent_Tag_1) == 0x000038, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, K2Node_CustomEvent_Tag) == 0x000050, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, K2Node_Event_DeltaTimeX) == 0x000068, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000070, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue) == 0x000078, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, K2Node_DynamicCast_AsGz_Character) == 0x000080, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_GetOwningComponent_ReturnValue) == 0x000090, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_GetCurveValue_ReturnValue) == 0x000098, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_Array_Get_Item) == 0x00009C, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_Not_PreBool_ReturnValue) == 0x0000A8, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000AC, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, K2Node_CustomEvent_Tag_3) == 0x0000BC, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::K2Node_CustomEvent_Tag_3' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000C4, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, Temp_int_Loop_Counter_Variable) == 0x0000C8, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1) == 0x0000D0, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_IsValid_ReturnValue_1) == 0x0000D9, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_Add_IntInt_ReturnValue) == 0x0000DC, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0000E0, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_ExecuteUbergraph_ABP_CLA_Dart_Arm_ARM_R::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ABP_CLA_Dart_Arm_ARM_R.ABP_CLA_Dart_Arm_ARM_R_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_CLA_Dart_Arm_ARM_R_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLA_Dart_Arm_ARM_R_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_CLA_Dart_Arm_ARM_R_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_CLA_Dart_Arm_ARM_R_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_CLA_Dart_Arm_ARM_R_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_CLA_Dart_Arm_ARM_R.ABP_CLA_Dart_Arm_ARM_R_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_CLA_Dart_Arm_ARM_R_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_CLA_Dart_Arm_ARM_R_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_CLA_Dart_Arm_ARM_R_C_AnimGraph");
static_assert(sizeof(ABP_CLA_Dart_Arm_ARM_R_C_AnimGraph) == 0x000010, "Wrong size on ABP_CLA_Dart_Arm_ARM_R_C_AnimGraph");
static_assert(offsetof(ABP_CLA_Dart_Arm_ARM_R_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_CLA_Dart_Arm_ARM_R_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

