#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_JumpBoost

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_JumpBoost.ABP_JumpBoost_C.AnimBlueprintGeneratedConstantData
// 0x07BF (0x07C0 - 0x0001)
struct ABP_JumpBoost::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_6095[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_128;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_129;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_130;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_131;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_132;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_133;                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_134;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_135;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_136;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_137;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_138;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_139;                                // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_140;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_141;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_142;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_143;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_144;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_145;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_146;                                // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_147;                                // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_148;                                // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_149;                                // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6096[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_150;                              // 0x00B8(0x0020)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_151;                               // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_152;                                // 0x00DC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_153;                                 // 0x00E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_154;                              // 0x00E8(0x0020)(BlueprintVisible, NoDestructor)
	struct FInputScaleBiasClampConstants          __StructProperty_155;                              // 0x0108(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_156;                               // 0x0134(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_157;                                // 0x0138(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_158;                                // 0x0139(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_159;                                // 0x013A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6097[0x1];                                     // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_160;                                // 0x013C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_161;                                // 0x0144(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_162;                                 // 0x014C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_163;                              // 0x0150(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_164;                                // 0x0170(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_165;                                // 0x0178(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0180(0x0080)()
	struct FAnimSubsystem                         AnimBlueprintExtension_NodeRelevancy;              // 0x0200(0x0008)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0208(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_21;                             // 0x0220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_20;                             // 0x0250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_19;                             // 0x0280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_18;                             // 0x02B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_17;                             // 0x02E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_1;                   // 0x0310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_16;                             // 0x0340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_15;                             // 0x0370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_14;                             // 0x03A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_13;                             // 0x03D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_12;                             // 0x0400(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_11;                             // 0x0430(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_10;                             // 0x0460(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_9;                              // 0x0490(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_8;                              // 0x04C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_7;                              // 0x04F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                     // 0x0520(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_6;                              // 0x0550(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_5;                              // 0x0580(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_4;                              // 0x05B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_3;                              // 0x05E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_2;                              // 0x0610(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                              // 0x0640(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x0670(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x06A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x06D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x0700(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x0730(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x0760(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0790(0x0030)()
};
static_assert(alignof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_JumpBoost::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData) == 0x0007C0, "Wrong size on ABP_JumpBoost::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_128) == 0x000004, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_128' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_129) == 0x00000C, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_129' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_130) == 0x000014, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_130' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_131) == 0x00001C, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_131' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_132) == 0x000024, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_132' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_133) == 0x00002C, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_133' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_134) == 0x000034, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_134' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_135) == 0x00003C, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_135' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_136) == 0x000044, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_136' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_137) == 0x00004C, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_137' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_138) == 0x000054, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_138' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_139) == 0x00005C, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_139' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_140) == 0x000064, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_140' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_141) == 0x00006C, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_141' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_142) == 0x000074, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_142' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_143) == 0x00007C, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_143' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_144) == 0x000084, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_144' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_145) == 0x00008C, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_145' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_146) == 0x000094, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_146' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_147) == 0x00009C, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_147' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_148) == 0x0000A4, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_148' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_149) == 0x0000AC, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_149' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __StructProperty_150) == 0x0000B8, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__StructProperty_150' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __FloatProperty_151) == 0x0000D8, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__FloatProperty_151' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_152) == 0x0000DC, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_152' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __IntProperty_153) == 0x0000E4, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__IntProperty_153' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __StructProperty_154) == 0x0000E8, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__StructProperty_154' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __StructProperty_155) == 0x000108, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__StructProperty_155' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __FloatProperty_156) == 0x000134, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__FloatProperty_156' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __BoolProperty_157) == 0x000138, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__BoolProperty_157' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __EnumProperty_158) == 0x000139, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__EnumProperty_158' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __ByteProperty_159) == 0x00013A, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__ByteProperty_159' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_160) == 0x00013C, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_160' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_161) == 0x000144, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_161' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __IntProperty_162) == 0x00014C, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__IntProperty_162' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __StructProperty_163) == 0x000150, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__StructProperty_163' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_164) == 0x000170, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_164' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, __NameProperty_165) == 0x000178, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::__NameProperty_165' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000180, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_NodeRelevancy) == 0x000200, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000208, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_21) == 0x000220, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_21' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_20) == 0x000250, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_20' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_19) == 0x000280, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_19' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_18) == 0x0002B0, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_18' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_17) == 0x0002E0, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_17' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_1) == 0x000310, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_16) == 0x000340, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_15) == 0x000370, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_14) == 0x0003A0, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_13) == 0x0003D0, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_12) == 0x000400, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_11) == 0x000430, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_10) == 0x000460, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_9) == 0x000490, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_8) == 0x0004C0, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_7) == 0x0004F0, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x000520, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_6) == 0x000550, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_5) == 0x000580, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_4) == 0x0005B0, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_3) == 0x0005E0, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_2) == 0x000610, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_1) == 0x000640, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000670, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x0006A0, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x0006D0, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000700, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000730, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000760, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000790, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");

// ScriptStruct ABP_JumpBoost.ABP_JumpBoost_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_JumpBoost::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_6098[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_JumpBoost::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_JumpBoost::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_JumpBoost::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_JumpBoost::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_JumpBoost::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_JumpBoost::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

