#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLA_Grapple_L

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_CLA_Grapple_L.ABP_CLA_Grapple_L_C.AnimBlueprintGeneratedConstantData
// 0x050F (0x0510 - 0x0001)
struct ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_6916[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_120;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_121;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_122;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_123;                            // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_124;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_125;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_126;                              // 0x002C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_127;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_128;                                // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_129;                                 // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_130;                                // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_131;                                // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6917[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_132;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_133;                            // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_134;                                // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_135;                                // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_136;                                // 0x007A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6918[0x1];                                     // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_137;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_138;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_139;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_140;                                 // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_141;                              // 0x0098(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0138(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0150(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                          // 0x0180(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;                    // 0x01B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh;                    // 0x01E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                                // 0x0210(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x0240(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x0270(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x02A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x02D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x0300(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x0330(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x0360(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                       // 0x0390(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_1;                 // 0x03C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x03F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x0420(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x0450(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;                   // 0x0480(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x04B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x04E0(0x0030)()
};
static_assert(alignof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData) == 0x000510, "Wrong size on ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __NameProperty_120) == 0x000004, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__NameProperty_120' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __NameProperty_121) == 0x00000C, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__NameProperty_121' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __IntProperty_122) == 0x000014, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__IntProperty_122' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_123) == 0x000018, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_123' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __NameProperty_124) == 0x000020, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__NameProperty_124' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __IntProperty_125) == 0x000028, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__IntProperty_125' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __StructProperty_126) == 0x00002C, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__StructProperty_126' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __FloatProperty_127) == 0x000058, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__FloatProperty_127' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __NameProperty_128) == 0x00005C, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__NameProperty_128' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __IntProperty_129) == 0x000064, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__IntProperty_129' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __ByteProperty_130) == 0x000068, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__ByteProperty_130' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __BoolProperty_131) == 0x000069, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__BoolProperty_131' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __FloatProperty_132) == 0x00006C, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__FloatProperty_132' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_133) == 0x000070, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_133' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __BoolProperty_134) == 0x000078, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__BoolProperty_134' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __EnumProperty_135) == 0x000079, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__EnumProperty_135' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __ByteProperty_136) == 0x00007A, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__ByteProperty_136' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __NameProperty_137) == 0x00007C, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__NameProperty_137' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __NameProperty_138) == 0x000084, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__NameProperty_138' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __NameProperty_139) == 0x00008C, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__NameProperty_139' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __IntProperty_140) == 0x000094, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__IntProperty_140' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, __StructProperty_141) == 0x000098, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::__StructProperty_141' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B8, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000138, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000150, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig) == 0x000180, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x0001B0, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh) == 0x0001E0, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000210, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000240, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000270, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x0002A0, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x0002D0, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000300, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000330, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000360, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x000390, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_1) == 0x0003C0, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x0003F0, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000420, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000450, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x000480, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x0004B0, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x0004E0, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

// ScriptStruct ABP_CLA_Grapple_L.ABP_CLA_Grapple_L_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_CLA_Grapple_L::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_6919[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_CLA_Grapple_L::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_CLA_Grapple_L::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_CLA_Grapple_L::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_CLA_Grapple_L::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

