#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_HEX_Extractor_02

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_HEX_Extractor_02.ABP_HEX_Extractor_02_C.OnStateExit
// 0x0020 (0x0020 - 0x0000)
struct ABP_HEX_Extractor_02_C_OnStateExit final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_HEX_Extractor_02_C_OnStateExit) == 0x000008, "Wrong alignment on ABP_HEX_Extractor_02_C_OnStateExit");
static_assert(sizeof(ABP_HEX_Extractor_02_C_OnStateExit) == 0x000020, "Wrong size on ABP_HEX_Extractor_02_C_OnStateExit");
static_assert(offsetof(ABP_HEX_Extractor_02_C_OnStateExit, Context) == 0x000000, "Member 'ABP_HEX_Extractor_02_C_OnStateExit::Context' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Extractor_02_C_OnStateExit, Node) == 0x000010, "Member 'ABP_HEX_Extractor_02_C_OnStateExit::Node' has a wrong offset!");

// Function ABP_HEX_Extractor_02.ABP_HEX_Extractor_02_C.OnStateEntry
// 0x0020 (0x0020 - 0x0000)
struct ABP_HEX_Extractor_02_C_OnStateEntry final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_HEX_Extractor_02_C_OnStateEntry) == 0x000008, "Wrong alignment on ABP_HEX_Extractor_02_C_OnStateEntry");
static_assert(sizeof(ABP_HEX_Extractor_02_C_OnStateEntry) == 0x000020, "Wrong size on ABP_HEX_Extractor_02_C_OnStateEntry");
static_assert(offsetof(ABP_HEX_Extractor_02_C_OnStateEntry, Context) == 0x000000, "Member 'ABP_HEX_Extractor_02_C_OnStateEntry::Context' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Extractor_02_C_OnStateEntry, Node) == 0x000010, "Member 'ABP_HEX_Extractor_02_C_OnStateEntry::Node' has a wrong offset!");

// Function ABP_HEX_Extractor_02.ABP_HEX_Extractor_02_C.ExecuteUbergraph_ABP_HEX_Extractor_02
// 0x0020 (0x0020 - 0x0000)
struct ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_517B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_HEX_Extractor_C*                    K2Node_DynamicCast_AsBP_HEX_Extractor;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_517C[0x1];                                     // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02) == 0x000008, "Wrong alignment on ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02");
static_assert(sizeof(ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02) == 0x000020, "Wrong size on ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02");
static_assert(offsetof(ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02, EntryPoint) == 0x000000, "Member 'ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02, K2Node_DynamicCast_AsBP_HEX_Extractor) == 0x000010, "Member 'ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02::K2Node_DynamicCast_AsBP_HEX_Extractor' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02, K2Node_Event_DeltaTimeX) == 0x00001C, "Member 'ABP_HEX_Extractor_02_C_ExecuteUbergraph_ABP_HEX_Extractor_02::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function ABP_HEX_Extractor_02.ABP_HEX_Extractor_02_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_HEX_Extractor_02_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_HEX_Extractor_02_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_HEX_Extractor_02_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_HEX_Extractor_02_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_HEX_Extractor_02_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_HEX_Extractor_02_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_HEX_Extractor_02_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_HEX_Extractor_02.ABP_HEX_Extractor_02_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_HEX_Extractor_02_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_HEX_Extractor_02_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_HEX_Extractor_02_C_AnimGraph");
static_assert(sizeof(ABP_HEX_Extractor_02_C_AnimGraph) == 0x000010, "Wrong size on ABP_HEX_Extractor_02_C_AnimGraph");
static_assert(offsetof(ABP_HEX_Extractor_02_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_HEX_Extractor_02_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

