#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLA_Micro_Missiles_Arm_R

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_CLA_Micro_Missiles_Arm_R.ABP_CLA_Micro_Missiles_Arm_R_C.AnimBlueprintGeneratedConstantData
// 0x049F (0x04A0 - 0x0001)
struct ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_5E41[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_105;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_106;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_107;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_108;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_109;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_110;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_111;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_112;                               // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_113;                              // 0x0034(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_114;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_115;                                // 0x0064(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_116;                                // 0x0065(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_117;                                // 0x0066(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E42[0x1];                                     // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_118;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_119;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_120;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_121;                                 // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E43[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_122;                              // 0x0088(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0128(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0140(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                          // 0x0170(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh;                    // 0x01A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;                    // 0x01D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                                // 0x0200(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x0230(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x0260(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x0290(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x02C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;                    // 0x02F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x0320(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x0350(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x0380(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x03B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x03E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x0410(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x0440(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x0470(0x0030)()
};
static_assert(alignof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData) == 0x0004A0, "Wrong size on ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __NameProperty_105) == 0x000004, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__NameProperty_105' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __NameProperty_106) == 0x00000C, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__NameProperty_106' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __IntProperty_107) == 0x000014, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__IntProperty_107' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __NameProperty_108) == 0x000018, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__NameProperty_108' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __IntProperty_109) == 0x000020, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__IntProperty_109' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __NameProperty_110) == 0x000024, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__NameProperty_110' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __IntProperty_111) == 0x00002C, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__IntProperty_111' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __FloatProperty_112) == 0x000030, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__FloatProperty_112' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __StructProperty_113) == 0x000034, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__StructProperty_113' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __FloatProperty_114) == 0x000060, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__FloatProperty_114' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __BoolProperty_115) == 0x000064, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__BoolProperty_115' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __EnumProperty_116) == 0x000065, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__EnumProperty_116' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __ByteProperty_117) == 0x000066, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__ByteProperty_117' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __NameProperty_118) == 0x000068, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__NameProperty_118' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __NameProperty_119) == 0x000070, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__NameProperty_119' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __NameProperty_120) == 0x000078, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__NameProperty_120' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __IntProperty_121) == 0x000080, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__IntProperty_121' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, __StructProperty_122) == 0x000088, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::__StructProperty_122' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A8, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000128, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000140, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig) == 0x000170, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh) == 0x0001A0, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x0001D0, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000200, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000230, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000260, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000290, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x0002C0, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x0002F0, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000320, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000350, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000380, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x0003B0, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x0003E0, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000410, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000440, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000470, "Member 'ABP_CLA_Micro_Missiles_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

}

