#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLA_Cloaking_L

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_CLA_Cloaking_L.ABP_CLA_Cloaking_L_C.AnimBlueprintGeneratedConstantData
// 0x036F (0x0370 - 0x0001)
struct ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_57D5[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_56;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_57;                               // 0x000C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_58;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_59;                                 // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_60;                                  // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_61;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_62;                                 // 0x0049(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D6[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_63;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_64;                             // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_65;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_66;                                 // 0x0059(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_67;                                 // 0x005A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D7[0x1];                                     // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_68;                                 // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_69;                                 // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_70;                                 // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_71;                                  // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_72;                               // 0x0078(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0098(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0118(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0130(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x0160(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x0190(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x01C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x01F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;                   // 0x0220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x0250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x0280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                                // 0x02B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                          // 0x02E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh;                    // 0x0310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;                    // 0x0340(0x0030)()
};
static_assert(alignof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData) == 0x000370, "Wrong size on ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __NameProperty_56) == 0x000004, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__NameProperty_56' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __StructProperty_57) == 0x00000C, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__StructProperty_57' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __FloatProperty_58) == 0x000038, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__FloatProperty_58' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __NameProperty_59) == 0x00003C, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__NameProperty_59' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __IntProperty_60) == 0x000044, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__IntProperty_60' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __ByteProperty_61) == 0x000048, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__ByteProperty_61' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __BoolProperty_62) == 0x000049, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__BoolProperty_62' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __FloatProperty_63) == 0x00004C, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__FloatProperty_63' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_64) == 0x000050, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_64' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __BoolProperty_65) == 0x000058, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__BoolProperty_65' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __EnumProperty_66) == 0x000059, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__EnumProperty_66' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __ByteProperty_67) == 0x00005A, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__ByteProperty_67' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __NameProperty_68) == 0x00005C, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__NameProperty_68' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __NameProperty_69) == 0x000064, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__NameProperty_69' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __NameProperty_70) == 0x00006C, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__NameProperty_70' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __IntProperty_71) == 0x000074, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__IntProperty_71' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, __StructProperty_72) == 0x000078, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::__StructProperty_72' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000098, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000118, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000130, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000160, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000190, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0001C0, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x0001F0, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x000220, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000250, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000280, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x0002B0, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig) == 0x0002E0, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh) == 0x000310, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000340, "Member 'ABP_CLA_Cloaking_L::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");

}

