#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_V_CascadiaPlane

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_V_CascadiaPlane.ABP_V_CascadiaPlane_C.AnimBlueprintGeneratedConstantData
// 0x0137 (0x0138 - 0x0001)
struct ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_56D6[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_4;                                  // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_5;                                  // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D7[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_6;                                // 0x0018(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_7;                                  // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D8[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0040(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00C0(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x00D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RandomPlayer;                        // 0x0108(0x0030)()
};
static_assert(alignof(ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData) == 0x000138, "Wrong size on ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData, __NameProperty_4) == 0x000004, "Member 'ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData::__NameProperty_4' has a wrong offset!");
static_assert(offsetof(ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData, __NameProperty_5) == 0x00000C, "Member 'ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData::__NameProperty_5' has a wrong offset!");
static_assert(offsetof(ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData, __StructProperty_6) == 0x000018, "Member 'ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData::__StructProperty_6' has a wrong offset!");
static_assert(offsetof(ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData, __BoolProperty_7) == 0x000038, "Member 'ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData::__BoolProperty_7' has a wrong offset!");
static_assert(offsetof(ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000040, "Member 'ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000C0, "Member 'ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000D8, "Member 'ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RandomPlayer) == 0x000108, "Member 'ABP_V_CascadiaPlane::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RandomPlayer' has a wrong offset!");

}

