#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLA_Cloaking_L

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_CLA_Cloaking_L.ABP_CLA_Cloaking_L_C
// 0x09A0 (0x0D10 - 0x0370)
class UABP_CLA_Cloaking_L_C final : public UAnimInstance
{
public:
	uint8                                         Pad_57D8[0x8];                                     // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x03A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x03D0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03F8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0440(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0460(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x04A0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x04C0(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0588(0x0048)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x05D0(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0AA0(0x0158)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0BF8(0x00F0)()
	bool                                          IsShoot;                                           // 0x0CE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D9[0x7];                                     // 0x0CE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Mat_count;                                         // 0x0CF0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 LOD_count;                                         // 0x0D00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UnHideMaterialSlots(TArray<int32>& LODs, TArray<int32>& Materials);
	void ExecuteUbergraph_ABP_CLA_Cloaking_L(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_CLA_Cloaking_L_C">();
	}
	static class UABP_CLA_Cloaking_L_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_CLA_Cloaking_L_C>();
	}
};
static_assert(alignof(UABP_CLA_Cloaking_L_C) == 0x000010, "Wrong alignment on UABP_CLA_Cloaking_L_C");
static_assert(sizeof(UABP_CLA_Cloaking_L_C) == 0x000D10, "Wrong size on UABP_CLA_Cloaking_L_C");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, UberGraphFrame) == 0x000370, "Member 'UABP_CLA_Cloaking_L_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_CLA_Cloaking_L_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_CLA_Cloaking_L_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_CLA_Cloaking_L_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, AnimGraphNode_TransitionResult_1) == 0x0003A8, "Member 'UABP_CLA_Cloaking_L_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, AnimGraphNode_TransitionResult) == 0x0003D0, "Member 'UABP_CLA_Cloaking_L_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, AnimGraphNode_SequencePlayer) == 0x0003F8, "Member 'UABP_CLA_Cloaking_L_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, AnimGraphNode_StateResult_1) == 0x000440, "Member 'UABP_CLA_Cloaking_L_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, AnimGraphNode_SequenceEvaluator) == 0x000460, "Member 'UABP_CLA_Cloaking_L_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, AnimGraphNode_StateResult) == 0x0004A0, "Member 'UABP_CLA_Cloaking_L_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, AnimGraphNode_StateMachine) == 0x0004C0, "Member 'UABP_CLA_Cloaking_L_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, AnimGraphNode_Slot) == 0x000588, "Member 'UABP_CLA_Cloaking_L_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, AnimGraphNode_ControlRig) == 0x0005D0, "Member 'UABP_CLA_Cloaking_L_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, AnimGraphNode_CopyPoseFromMesh) == 0x000AA0, "Member 'UABP_CLA_Cloaking_L_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, AnimGraphNode_LayeredBoneBlend) == 0x000BF8, "Member 'UABP_CLA_Cloaking_L_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, IsShoot) == 0x000CE8, "Member 'UABP_CLA_Cloaking_L_C::IsShoot' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, Mat_count) == 0x000CF0, "Member 'UABP_CLA_Cloaking_L_C::Mat_count' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Cloaking_L_C, LOD_count) == 0x000D00, "Member 'UABP_CLA_Cloaking_L_C::LOD_count' has a wrong offset!");

}

