#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Item

#include "Basic.hpp"

#include "AnimStruct_StanceTransitions_structs.hpp"
#include "Engine_structs.hpp"
#include "Anim_ItemType_structs.hpp"
#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimStruct_AimingCorrection_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "AnimStruct_ArmedStates_structs.hpp"


namespace SDK::Params
{

// Function ABP_Item.ABP_Item_C.Aiming_Correction
// 0x0020 (0x0020 - 0x0000)
struct ABP_Item_C_Aiming_Correction final
{
public:
	struct FPoseLink                              Aim_pose;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_Aiming_Correction;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Item_C_Aiming_Correction) == 0x000008, "Wrong alignment on ABP_Item_C_Aiming_Correction");
static_assert(sizeof(ABP_Item_C_Aiming_Correction) == 0x000020, "Wrong size on ABP_Item_C_Aiming_Correction");
static_assert(offsetof(ABP_Item_C_Aiming_Correction, Aim_pose) == 0x000000, "Member 'ABP_Item_C_Aiming_Correction::Aim_pose' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_Aiming_Correction, Param_Aiming_Correction) == 0x000010, "Member 'ABP_Item_C_Aiming_Correction::Param_Aiming_Correction' has a wrong offset!");

// Function ABP_Item.ABP_Item_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Item_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Item_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Item_C_AnimGraph");
static_assert(sizeof(ABP_Item_C_AnimGraph) == 0x000010, "Wrong size on ABP_Item_C_AnimGraph");
static_assert(offsetof(ABP_Item_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_Item_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_Item.ABP_Item_C.BlueprintThreadSafeUpdateAnimation
// 0x0028 (0x0028 - 0x0000)
struct ABP_Item_C_BlueprintThreadSafeUpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F61[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F62[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Update_Blend_Weight_Data_DeltaTime_ImplicitCast; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateJumpFallData_DeltaTime_ImplicitCast; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Item_C_BlueprintThreadSafeUpdateAnimation) == 0x000008, "Wrong alignment on ABP_Item_C_BlueprintThreadSafeUpdateAnimation");
static_assert(sizeof(ABP_Item_C_BlueprintThreadSafeUpdateAnimation) == 0x000028, "Wrong size on ABP_Item_C_BlueprintThreadSafeUpdateAnimation");
static_assert(offsetof(ABP_Item_C_BlueprintThreadSafeUpdateAnimation, DeltaTime) == 0x000000, "Member 'ABP_Item_C_BlueprintThreadSafeUpdateAnimation::DeltaTime' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_BlueprintThreadSafeUpdateAnimation, CallFunc_GetMainAnimBPThreadSafe_ReturnValue) == 0x000008, "Member 'ABP_Item_C_BlueprintThreadSafeUpdateAnimation::CallFunc_GetMainAnimBPThreadSafe_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_BlueprintThreadSafeUpdateAnimation, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'ABP_Item_C_BlueprintThreadSafeUpdateAnimation::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_BlueprintThreadSafeUpdateAnimation, CallFunc_Update_Blend_Weight_Data_DeltaTime_ImplicitCast) == 0x000018, "Member 'ABP_Item_C_BlueprintThreadSafeUpdateAnimation::CallFunc_Update_Blend_Weight_Data_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_BlueprintThreadSafeUpdateAnimation, CallFunc_UpdateJumpFallData_DeltaTime_ImplicitCast) == 0x000020, "Member 'ABP_Item_C_BlueprintThreadSafeUpdateAnimation::CallFunc_UpdateJumpFallData_DeltaTime_ImplicitCast' has a wrong offset!");

// Function ABP_Item.ABP_Item_C.CanPlayIdleBreak
// 0x0250 (0x0250 - 0x0000)
struct ABP_Item_C_CanPlayIdleBreak final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F63[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_1;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue;                 // 0x0018(0x0218)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F64[0x3];                                     // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_2;    // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAnimStances                                  CallFunc_GetAnimStance_ReturnValue;                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0246(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0247(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Item_C_CanPlayIdleBreak) == 0x000008, "Wrong alignment on ABP_Item_C_CanPlayIdleBreak");
static_assert(sizeof(ABP_Item_C_CanPlayIdleBreak) == 0x000250, "Wrong size on ABP_Item_C_CanPlayIdleBreak");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, ReturnValue) == 0x000000, "Member 'ABP_Item_C_CanPlayIdleBreak::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_GetMainAnimBPThreadSafe_ReturnValue) == 0x000008, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_GetMainAnimBPThreadSafe_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_GetMainAnimBPThreadSafe_ReturnValue_1) == 0x000010, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_GetMainAnimBPThreadSafe_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_GetAnimCache_ReturnValue) == 0x000018, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_GetAnimCache_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_Array_Length_ReturnValue) == 0x000230, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_Greater_IntInt_ReturnValue) == 0x000234, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_GetMainAnimBPThreadSafe_ReturnValue_2) == 0x000238, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_GetMainAnimBPThreadSafe_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_GetAnimStance_ReturnValue) == 0x000240, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_GetAnimStance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000241, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_BooleanOR_ReturnValue) == 0x000242, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_BooleanOR_ReturnValue_1) == 0x000243, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_BooleanOR_ReturnValue_2) == 0x000244, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_BooleanOR_ReturnValue_3) == 0x000245, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_BooleanOR_ReturnValue_4) == 0x000246, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_BooleanOR_ReturnValue_5) == 0x000247, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_Not_PreBool_ReturnValue) == 0x000248, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_CanPlayIdleBreak, CallFunc_BooleanAND_ReturnValue) == 0x000249, "Member 'ABP_Item_C_CanPlayIdleBreak::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ABP_Item.ABP_Item_C.ChooseIdleBreakDelayTime
// 0x0260 (0x0260 - 0x0000)
struct ABP_Item_C_ChooseIdleBreakDelayTime final
{
public:
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue;                 // 0x0008(0x0218)(NoDestructor)
	double                                        CallFunc_BreakVector_X;                            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F65[0x4];                                     // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Item_C_ChooseIdleBreakDelayTime) == 0x000008, "Wrong alignment on ABP_Item_C_ChooseIdleBreakDelayTime");
static_assert(sizeof(ABP_Item_C_ChooseIdleBreakDelayTime) == 0x000260, "Wrong size on ABP_Item_C_ChooseIdleBreakDelayTime");
static_assert(offsetof(ABP_Item_C_ChooseIdleBreakDelayTime, CallFunc_GetMainAnimBPThreadSafe_ReturnValue) == 0x000000, "Member 'ABP_Item_C_ChooseIdleBreakDelayTime::CallFunc_GetMainAnimBPThreadSafe_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_ChooseIdleBreakDelayTime, CallFunc_GetAnimCache_ReturnValue) == 0x000008, "Member 'ABP_Item_C_ChooseIdleBreakDelayTime::CallFunc_GetAnimCache_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_ChooseIdleBreakDelayTime, CallFunc_BreakVector_X) == 0x000220, "Member 'ABP_Item_C_ChooseIdleBreakDelayTime::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_ChooseIdleBreakDelayTime, CallFunc_BreakVector_Y) == 0x000228, "Member 'ABP_Item_C_ChooseIdleBreakDelayTime::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_ChooseIdleBreakDelayTime, CallFunc_BreakVector_Z) == 0x000230, "Member 'ABP_Item_C_ChooseIdleBreakDelayTime::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_ChooseIdleBreakDelayTime, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000238, "Member 'ABP_Item_C_ChooseIdleBreakDelayTime::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_ChooseIdleBreakDelayTime, CallFunc_Abs_ReturnValue) == 0x000240, "Member 'ABP_Item_C_ChooseIdleBreakDelayTime::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_ChooseIdleBreakDelayTime, CallFunc_FTrunc_ReturnValue) == 0x000248, "Member 'ABP_Item_C_ChooseIdleBreakDelayTime::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_ChooseIdleBreakDelayTime, CallFunc_Percent_IntInt_ReturnValue) == 0x00024C, "Member 'ABP_Item_C_ChooseIdleBreakDelayTime::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_ChooseIdleBreakDelayTime, CallFunc_Add_IntInt_ReturnValue) == 0x000250, "Member 'ABP_Item_C_ChooseIdleBreakDelayTime::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_ChooseIdleBreakDelayTime, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000258, "Member 'ABP_Item_C_ChooseIdleBreakDelayTime::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");

// Function ABP_Item.ABP_Item_C.DamagedBody_CycleState
// 0x0010 (0x0010 - 0x0000)
struct ABP_Item_C_DamagedBody_CycleState final
{
public:
	struct FPoseLink                              Param_DamagedBody_CycleState;                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Item_C_DamagedBody_CycleState) == 0x000008, "Wrong alignment on ABP_Item_C_DamagedBody_CycleState");
static_assert(sizeof(ABP_Item_C_DamagedBody_CycleState) == 0x000010, "Wrong size on ABP_Item_C_DamagedBody_CycleState");
static_assert(offsetof(ABP_Item_C_DamagedBody_CycleState, Param_DamagedBody_CycleState) == 0x000000, "Member 'ABP_Item_C_DamagedBody_CycleState::Param_DamagedBody_CycleState' has a wrong offset!");

// Function ABP_Item.ABP_Item_C.DamagedBody_EnterState
// 0x0010 (0x0010 - 0x0000)
struct ABP_Item_C_DamagedBody_EnterState final
{
public:
	struct FPoseLink                              Param_DamagedBody_EnterState;                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Item_C_DamagedBody_EnterState) == 0x000008, "Wrong alignment on ABP_Item_C_DamagedBody_EnterState");
static_assert(sizeof(ABP_Item_C_DamagedBody_EnterState) == 0x000010, "Wrong size on ABP_Item_C_DamagedBody_EnterState");
static_assert(offsetof(ABP_Item_C_DamagedBody_EnterState, Param_DamagedBody_EnterState) == 0x000000, "Member 'ABP_Item_C_DamagedBody_EnterState::Param_DamagedBody_EnterState' has a wrong offset!");

// Function ABP_Item.ABP_Item_C.DamagedBody_ExitState
// 0x0010 (0x0010 - 0x0000)
struct ABP_Item_C_DamagedBody_ExitState final
{
public:
	struct FPoseLink                              Param_DamagedBody_ExitState;                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Item_C_DamagedBody_ExitState) == 0x000008, "Wrong alignment on ABP_Item_C_DamagedBody_ExitState");
static_assert(sizeof(ABP_Item_C_DamagedBody_ExitState) == 0x000010, "Wrong size on ABP_Item_C_DamagedBody_ExitState");
static_assert(offsetof(ABP_Item_C_DamagedBody_ExitState, Param_DamagedBody_ExitState) == 0x000000, "Member 'ABP_Item_C_DamagedBody_ExitState::Param_DamagedBody_ExitState' has a wrong offset!");

// Function ABP_Item.ABP_Item_C.DamagedBody_IdleState
// 0x0010 (0x0010 - 0x0000)
struct ABP_Item_C_DamagedBody_IdleState final
{
public:
	struct FPoseLink                              Param_DamagedBody_IdleState;                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Item_C_DamagedBody_IdleState) == 0x000008, "Wrong alignment on ABP_Item_C_DamagedBody_IdleState");
static_assert(sizeof(ABP_Item_C_DamagedBody_IdleState) == 0x000010, "Wrong size on ABP_Item_C_DamagedBody_IdleState");
static_assert(offsetof(ABP_Item_C_DamagedBody_IdleState, Param_DamagedBody_IdleState) == 0x000000, "Member 'ABP_Item_C_DamagedBody_IdleState::Param_DamagedBody_IdleState' has a wrong offset!");

// Function ABP_Item.ABP_Item_C.DebugLeftHandGrip
// 0x0470 (0x0470 - 0x0000)
struct ABP_Item_C_DebugLeftHandGrip final
{
public:
	bool                                          Debug;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F66[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue;                 // 0x0010(0x0218)(NoDestructor)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_1;    // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_1;               // 0x0230(0x0218)(NoDestructor)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Item_C_DebugLeftHandGrip) == 0x000008, "Wrong alignment on ABP_Item_C_DebugLeftHandGrip");
static_assert(sizeof(ABP_Item_C_DebugLeftHandGrip) == 0x000470, "Wrong size on ABP_Item_C_DebugLeftHandGrip");
static_assert(offsetof(ABP_Item_C_DebugLeftHandGrip, Debug) == 0x000000, "Member 'ABP_Item_C_DebugLeftHandGrip::Debug' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_DebugLeftHandGrip, CallFunc_GetMainAnimBPThreadSafe_ReturnValue) == 0x000008, "Member 'ABP_Item_C_DebugLeftHandGrip::CallFunc_GetMainAnimBPThreadSafe_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_DebugLeftHandGrip, CallFunc_GetAnimCache_ReturnValue) == 0x000010, "Member 'ABP_Item_C_DebugLeftHandGrip::CallFunc_GetAnimCache_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_DebugLeftHandGrip, CallFunc_GetMainAnimBPThreadSafe_ReturnValue_1) == 0x000228, "Member 'ABP_Item_C_DebugLeftHandGrip::CallFunc_GetMainAnimBPThreadSafe_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_DebugLeftHandGrip, CallFunc_GetAnimCache_ReturnValue_1) == 0x000230, "Member 'ABP_Item_C_DebugLeftHandGrip::CallFunc_GetAnimCache_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_DebugLeftHandGrip, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000448, "Member 'ABP_Item_C_DebugLeftHandGrip::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_DebugLeftHandGrip, CallFunc_Concat_StrStr_ReturnValue) == 0x000458, "Member 'ABP_Item_C_DebugLeftHandGrip::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Item_C_DebugLeftHandGrip, K2Node_SwitchEnum_CmpSuccess) == 0x000468, "Member 'ABP_Item_C_DebugLeftHandGrip::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function ABP_Item.ABP_Item_C.ExecuteUbergraph_ABP_Item
// 0x5A20 (0x5A20 - 0x0000)
struct ABP_Item_C_ExecuteUbergraph_ABP_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F67[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_1;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue;                 // 0x0018(0x0218)(NoDestructor)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_1;               // 0x0230(0x0218)(NoDestructor)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_2;    // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_2;               // 0x0450(0x0218)(NoDestructor)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_3;    // 0x0668(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_3;               // 0x0678(0x0218)(NoDestructor)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0891(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMirrorState_IsMirror;                  // 0x0892(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0893(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F68[0x4];                                     // 0x0894(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_4;    // 0x0898(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x08A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F69[0x7];                                     // 0x08A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_4;               // 0x08A8(0x0218)(NoDestructor)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_5;    // 0x0AC0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0AC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F6A[0x7];                                     // 0x0AC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_5;               // 0x0AD0(0x0218)(NoDestructor)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_6;    // 0x0CE8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0CF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_6;               // 0x0CF8(0x0218)(NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0F10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0F18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F6B[0x7];                                     // 0x0F19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_7;    // 0x0F20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0F28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F6C[0x7];                                     // 0x0F29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_7;               // 0x0F30(0x0218)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x1148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMirrorState_IsMirror_1;                // 0x1149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F6D[0x6];                                     // 0x114A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_8;    // 0x1150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x1158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F6E[0x7];                                     // 0x1159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_8;               // 0x1160(0x0218)(NoDestructor)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_9;    // 0x1378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_9;               // 0x1380(0x0218)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x1598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F6F[0x7];                                     // 0x1599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_10;   // 0x15A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_11;   // 0x15A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_10;              // 0x15B0(0x0218)(NoDestructor)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_11;              // 0x17C8(0x0218)(NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x19E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x19E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x19F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F70[0x7];                                     // 0x19F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_12;   // 0x19F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_12;              // 0x1A00(0x0218)(NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x1C18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F71[0x3];                                     // 0x1C19(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x1C1C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x1C20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x1C21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x1C22(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x1C23(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x1C24(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x1C25(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F72[0x2];                                     // 0x1C26(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_13;   // 0x1C28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_13;              // 0x1C30(0x0218)(NoDestructor)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_14;   // 0x1E48(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_14;              // 0x1E50(0x0218)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x2068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F73[0x7];                                     // 0x2069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x2070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_15;   // 0x2078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x2080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F74[0x7];                                     // 0x2081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_15;              // 0x2088(0x0218)(NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x22A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F75[0x7];                                     // 0x22A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x22A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x22B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F76[0x4];                                     // 0x22B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_16;   // 0x22B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x22C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F77[0x7];                                     // 0x22C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_16;              // 0x22C8(0x0218)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x24E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F78[0x7];                                     // 0x24E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_17;   // 0x24E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_17;              // 0x24F0(0x0218)(NoDestructor)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_18;   // 0x2708(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_18;              // 0x2710(0x0218)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x2928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x2929(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F79[0x6];                                     // 0x292A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_19;   // 0x2930(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_20;   // 0x2938(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_19;              // 0x2940(0x0218)(NoDestructor)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_20;              // 0x2B58(0x0218)(NoDestructor)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_21;   // 0x2D70(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x2D78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F7A[0x7];                                     // 0x2D79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_21;              // 0x2D80(0x0218)(NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x2F98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F7B[0x7];                                     // 0x2F99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_22;   // 0x2FA0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_23;   // 0x2FA8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_22;              // 0x2FB0(0x0218)(NoDestructor)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_23;              // 0x31C8(0x0218)(NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x33E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetJumpLean_Lean;                         // 0x33E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x3400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_2;              // 0x3404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x3408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x340C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F7C[0x3];                                     // 0x340D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_2;             // 0x3410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F7D[0x4];                                     // 0x3414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_24;   // 0x3418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_25;   // 0x3420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_24;              // 0x3428(0x0218)(NoDestructor)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_25;              // 0x3640(0x0218)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x3858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x3859(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F7E[0x6];                                     // 0x385A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_26;   // 0x3860(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_3;              // 0x3868(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMovingPerpendicularToInitialPivotNative_ReturnValue; // 0x386C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x386D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F7F[0x2];                                     // 0x386E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x3870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x3878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x3879(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMirrorState_IsMirror_2;                // 0x387A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x387B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x387C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x387D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F80[0x2];                                     // 0x387E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_27;   // 0x3880(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x3888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F81[0x7];                                     // 0x3889(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_26;              // 0x3890(0x0218)(NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_3;             // 0x3AA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x3AAC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x3AAD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x3AAE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x3AAF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_4;             // 0x3AB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x3AB4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x3AB5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F82[0x2];                                     // 0x3AB6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_5;             // 0x3AB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F83[0x4];                                     // 0x3ABC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_FindTransform_Transform;                  // 0x3AC0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x3B20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x3B21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x3B22(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F84[0x5];                                     // 0x3B23(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_28;   // 0x3B28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_27;              // 0x3B30(0x0218)(NoDestructor)
	bool                                          CallFunc_GetAimCorrection_AimCorrection;           // 0x3D48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x3D49(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F85[0x2];                                     // 0x3D4A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_6;             // 0x3D4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x3D50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F86[0x7];                                     // 0x3D51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_29;   // 0x3D58(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x3D60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x3D61(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F87[0x6];                                     // 0x3D62(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_30;   // 0x3D68(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x3D70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F88[0x7];                                     // 0x3D71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_28;              // 0x3D78(0x0218)(NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_7;             // 0x3F90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x3F94(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x3F95(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x3F96(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMirrorState_IsMirror_3;                // 0x3F97(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x3F98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x3F99(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F89[0x6];                                     // 0x3F9A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_31;   // 0x3FA0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_29;              // 0x3FA8(0x0218)(NoDestructor)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_32;   // 0x41C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_30;              // 0x41C8(0x0218)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x43E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_12;       // 0x43E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_13;       // 0x43E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F8A[0x5];                                     // 0x43E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x43E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x43F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMirrorState_IsMirror_4;                // 0x43F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F8B[0x7];                                     // 0x43F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_33;   // 0x4400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_31;              // 0x4408(0x0218)(NoDestructor)
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_34;   // 0x4620(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x4628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x4629(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_14;       // 0x462A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F8C[0x5];                                     // 0x462B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_1;          // 0x4630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x4638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F8D[0x7];                                     // 0x4639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x4640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_2;          // 0x4648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x4650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMirrorState_IsMirror_5;                // 0x4658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F8E[0x7];                                     // 0x4659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Human_C*                           CallFunc_GetMainAnimBPThreadSafe_ReturnValue_35;   // 0x4660(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             CallFunc_GetAnimCache_ReturnValue_32;              // 0x4668(0x0218)(NoDestructor)
	double                                        K2Node_Select_Default;                             // 0x4880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x4888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x4890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F8F[0x7];                                     // 0x4891(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_3;          // 0x4898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x48A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
