#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLA_Gorilla_R

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_CLA_Gorilla_R.ABP_CLA_Gorilla_R_C
// 0x0AC0 (0x0E30 - 0x0370)
class UABP_CLA_Gorilla_R_C final : public UAnimInstance
{
public:
	uint8                                         Pad_6B8D[0x8];                                     // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x03A8(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0878(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0968(0x0048)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x09B0(0x0158)(ContainsInstancedReference)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0B08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0B30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0B58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0B80(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0BA8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0BF0(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x0C10(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0C50(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0C70(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0CB8(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0CD8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0D18(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0D38(0x00C8)()
	TArray<int32>                                 Mat_count;                                         // 0x0E00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 LOD_count;                                         // 0x0E10(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsActive;                                          // 0x0E20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B8E[0x7];                                     // 0x0E21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           OwnerCharacter;                                    // 0x0E28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_ABP_CLA_Gorilla_R(int32 EntryPoint);
	void OnTagAdded_D5B902D54D4CF7F7BD76A48FC0542CB8(const struct FGameplayTag& Tag);
	void OnTagRemoved_D5B902D54D4CF7F7BD76A48FC0542CB8(const struct FGameplayTag& Tag);
	void UnHideMaterialSlots(TArray<int32>& LODs, TArray<int32>& Materials);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_CLA_Gorilla_R_C">();
	}
	static class UABP_CLA_Gorilla_R_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_CLA_Gorilla_R_C>();
	}
};
static_assert(alignof(UABP_CLA_Gorilla_R_C) == 0x000010, "Wrong alignment on UABP_CLA_Gorilla_R_C");
static_assert(sizeof(UABP_CLA_Gorilla_R_C) == 0x000E30, "Wrong size on UABP_CLA_Gorilla_R_C");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, UberGraphFrame) == 0x000370, "Member 'UABP_CLA_Gorilla_R_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_CLA_Gorilla_R_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_CLA_Gorilla_R_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_ControlRig) == 0x0003A8, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_LayeredBoneBlend) == 0x000878, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_Slot) == 0x000968, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_CopyPoseFromMesh) == 0x0009B0, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_TransitionResult_3) == 0x000B08, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_TransitionResult_2) == 0x000B30, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_TransitionResult_1) == 0x000B58, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_TransitionResult) == 0x000B80, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_SequencePlayer_1) == 0x000BA8, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_StateResult_3) == 0x000BF0, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_SequenceEvaluator_1) == 0x000C10, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_StateResult_2) == 0x000C50, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_SequencePlayer) == 0x000C70, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_StateResult_1) == 0x000CB8, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_SequenceEvaluator) == 0x000CD8, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_StateResult) == 0x000D18, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, AnimGraphNode_StateMachine) == 0x000D38, "Member 'UABP_CLA_Gorilla_R_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, Mat_count) == 0x000E00, "Member 'UABP_CLA_Gorilla_R_C::Mat_count' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, LOD_count) == 0x000E10, "Member 'UABP_CLA_Gorilla_R_C::LOD_count' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, IsActive) == 0x000E20, "Member 'UABP_CLA_Gorilla_R_C::IsActive' has a wrong offset!");
static_assert(offsetof(UABP_CLA_Gorilla_R_C, OwnerCharacter) == 0x000E28, "Member 'UABP_CLA_Gorilla_R_C::OwnerCharacter' has a wrong offset!");

}

