#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AssaultDrone

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_AssaultDrone.ABP_AssaultDrone_C.AnimBlueprintGeneratedConstantData
// 0x0277 (0x0278 - 0x0001)
struct ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_6472[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_40;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_41;                               // 0x000C(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_42;                                 // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_43;                                  // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_44;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6473[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_45;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_46;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_47;                                 // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_48;                                 // 0x0051(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_49;                                 // 0x0052(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6474[0x1];                                     // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_50;                                 // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_51;                                 // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_52;                                 // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_53;                                  // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_54;                               // 0x0070(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0090(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0110(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0128(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x0158(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x0188(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x01B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;                    // 0x01E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x0218(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x0248(0x0030)()
};
static_assert(alignof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData) == 0x000278, "Wrong size on ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __NameProperty_40) == 0x000004, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__NameProperty_40' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __StructProperty_41) == 0x00000C, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__StructProperty_41' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __NameProperty_42) == 0x000038, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__NameProperty_42' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __IntProperty_43) == 0x000040, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__IntProperty_43' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __BoolProperty_44) == 0x000044, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__BoolProperty_44' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __FloatProperty_45) == 0x000048, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__FloatProperty_45' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __FloatProperty_46) == 0x00004C, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__FloatProperty_46' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __BoolProperty_47) == 0x000050, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__BoolProperty_47' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __EnumProperty_48) == 0x000051, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__EnumProperty_48' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __ByteProperty_49) == 0x000052, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__ByteProperty_49' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __NameProperty_50) == 0x000054, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__NameProperty_50' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __NameProperty_51) == 0x00005C, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__NameProperty_51' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __NameProperty_52) == 0x000064, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__NameProperty_52' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __IntProperty_53) == 0x00006C, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__IntProperty_53' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, __StructProperty_54) == 0x000070, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::__StructProperty_54' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000090, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000110, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000128, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000158, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000188, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x0001B8, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x0001E8, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000218, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000248, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

// ScriptStruct ABP_AssaultDrone.ABP_AssaultDrone_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_AssaultDrone::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_6475[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AssaultDrone::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_AssaultDrone::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_AssaultDrone::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_AssaultDrone::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_AssaultDrone::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_AssaultDrone::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

