#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Folding_Drone_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Folding_Drone_01.ABP_Folding_Drone_01_C.AnimBlueprintGeneratedConstantData
// 0x04BF (0x04C0 - 0x0001)
struct ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_67C4[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_120;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_121;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_122;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_123;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_124;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67C5[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_125;                            // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_126;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_127;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_128;                              // 0x003C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_129;                               // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_130;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_131;                                 // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_132;                                // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_133;                                // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67C6[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_134;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_135;                            // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_136;                                // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_137;                                // 0x0089(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_138;                                // 0x008A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67C7[0x1];                                     // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_139;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_140;                                // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_141;                                // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_142;                                 // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_143;                              // 0x00A8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0148(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0160(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;                  // 0x0190(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;                  // 0x01C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x01F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x0220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x0250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x0280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x02B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                       // 0x02E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x0310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x0340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_1;                 // 0x0370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x03A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x03D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x0400(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;                   // 0x0430(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x0460(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x0490(0x0030)()
};
static_assert(alignof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData) == 0x0004C0, "Wrong size on ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __NameProperty_120) == 0x000004, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__NameProperty_120' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __NameProperty_121) == 0x00000C, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__NameProperty_121' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __IntProperty_122) == 0x000014, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__IntProperty_122' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __NameProperty_123) == 0x000018, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__NameProperty_123' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __IntProperty_124) == 0x000020, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__IntProperty_124' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_125) == 0x000028, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_125' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __NameProperty_126) == 0x000030, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__NameProperty_126' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __IntProperty_127) == 0x000038, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__IntProperty_127' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __StructProperty_128) == 0x00003C, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__StructProperty_128' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __FloatProperty_129) == 0x000068, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__FloatProperty_129' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __NameProperty_130) == 0x00006C, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__NameProperty_130' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __IntProperty_131) == 0x000074, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__IntProperty_131' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __ByteProperty_132) == 0x000078, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__ByteProperty_132' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __BoolProperty_133) == 0x000079, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__BoolProperty_133' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __FloatProperty_134) == 0x00007C, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__FloatProperty_134' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_135) == 0x000080, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_135' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __BoolProperty_136) == 0x000088, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__BoolProperty_136' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __EnumProperty_137) == 0x000089, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__EnumProperty_137' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __ByteProperty_138) == 0x00008A, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__ByteProperty_138' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __NameProperty_139) == 0x00008C, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__NameProperty_139' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __NameProperty_140) == 0x000094, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__NameProperty_140' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __NameProperty_141) == 0x00009C, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__NameProperty_141' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __IntProperty_142) == 0x0000A4, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__IntProperty_142' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, __StructProperty_143) == 0x0000A8, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::__StructProperty_143' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C8, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000148, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000160, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_5) == 0x000190, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x0001C0, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x0001F0, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000220, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000250, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000280, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x0002B0, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_4) == 0x0002E0, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000310, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000340, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_1) == 0x000370, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x0003A0, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0003D0, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000400, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x000430, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000460, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000490, "Member 'ABP_Folding_Drone_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

}

