#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimStruct_StanceTransitions_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"
#include "Anim_ItemType_structs.hpp"
#include "ABP_Item_structs.hpp"
#include "ControlRig_structs.hpp"
#include "AnimStruct_ArmedStates_structs.hpp"
#include "AnimStruct_AimingCorrection_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Item.ABP_Item_C
// 0x6940 (0x71F0 - 0x08B0)
class UABP_Item_C : public UGzLayerCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Item::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x08B8(0x0100)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x09B8(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x09C0(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0A68(0x0008)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0A70(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0A98(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0AC0(0x0028)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_12;                           // 0x0AE8(0x0048)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_11;                           // 0x0B30(0x0048)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x0B78(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x1048(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x1068(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x1090(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x10B8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x10E0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x1128(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x1148(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0x1190(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x11B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0x11F8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0x1218(0x00C8)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_10;                           // 0x12E0(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x1328(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_18;            // 0x1450(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_18;            // 0x1470(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x1490(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x14B0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x14D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x14F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x1520(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x1548(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x1570(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x1598(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x15E0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x1600(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x1648(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x1668(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x16B0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x16D0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0x1718(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x1738(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x1800(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x1820(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x1840(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x1868(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x1890(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x18B8(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x18E0(0x0010)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x18F0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x19B8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x1A00(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x1A20(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x1A40(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x1A60(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x1B28(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x1B48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x1B70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x1B98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x1BC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x1BE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x1C10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x1C38(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x1C60(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x1CA8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x1CC8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x1D10(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_14;                // 0x1D30(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x1D70(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x1D90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x1DB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x1DE0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x1E08(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x1E50(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x1E70(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x1EB8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x1ED8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x1FA0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x1FC0(0x00C8)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_9;                            // 0x2088(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_17;            // 0x20D0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_17;            // 0x20F0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x2110(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x2238(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_13;                // 0x2258(0x0040)()
	uint8                                         Pad_5F4E[0x8];                                     // 0x2298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_OrientationWarping           AnimGraphNode_OrientationWarping_3;                // 0x22A0(0x0220)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_16;            // 0x24C0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_16;            // 0x24E0(0x0020)()
	struct FAnimNode_StrideWarping                AnimGraphNode_StrideWarping_3;                     // 0x2500(0x0248)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_15;            // 0x2748(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_15;            // 0x2768(0x0020)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_8;                            // 0x2788(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x27D0(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x28F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x2918(0x0048)()
	struct FAnimNode_OrientationWarping           AnimGraphNode_OrientationWarping_2;                // 0x2960(0x0220)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14;            // 0x2B80(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_14;            // 0x2BA0(0x0020)()
	struct FAnimNode_StrideWarping                AnimGraphNode_StrideWarping_2;                     // 0x2BC0(0x0248)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_7;                            // 0x2E08(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x2E50(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13;            // 0x2F78(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_13;            // 0x2F98(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x2FB8(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_12;                // 0x2FD8(0x0040)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_6;                            // 0x3018(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12;            // 0x3060(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_12;            // 0x3080(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x30A0(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x31C8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x31E8(0x0028)()
	struct FAnimNode_StrideWarping                AnimGraphNode_StrideWarping_1;                     // 0x3210(0x0248)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11;            // 0x3458(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11;            // 0x3478(0x0020)()
	uint8                                         Pad_5F4F[0x8];                                     // 0x3498(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_OrientationWarping           AnimGraphNode_OrientationWarping_1;                // 0x34A0(0x0220)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_11;                // 0x36C0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x3700(0x0020)()
	struct FAnimNode_StrideWarping                AnimGraphNode_StrideWarping;                       // 0x3720(0x0248)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10;            // 0x3968(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10;            // 0x3988(0x0020)()
	uint8                                         Pad_5F50[0x8];                                     // 0x39A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_OrientationWarping           AnimGraphNode_OrientationWarping;                  // 0x39B0(0x0220)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_10;                // 0x3BD0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x3C10(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x3C30(0x00C8)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_5;                            // 0x3CF8(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9;             // 0x3D40(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9;             // 0x3D60(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x3D80(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x3EA8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x3EC8(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x3F80(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x4000(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x4080(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x40A8(0x00C8)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x4170(0x0118)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_9;                 // 0x4288(0x0040)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x42C8(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x43B8(0x00F0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_8;                 // 0x44A8(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x44E8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x45B0(0x0080)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x4630(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_7;                 // 0x4B00(0x0040)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x4B40(0x00B8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x4BF8(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x4CC0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x4CE0(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x4D28(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x4D48(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x4D90(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x4DB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x4DD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x4E00(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x4E28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x4E70(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_6;                 // 0x4E90(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x4ED0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x4EF0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x4F38(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x4F58(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x5020(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x5040(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x5088(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x51A0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x51C0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x51E0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x5228(0x00F0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x5318(0x0040)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8;             // 0x5358(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x5378(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8;             // 0x54A0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;             // 0x54C0(0x0020)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_4;                            // 0x54E0(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x5528(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0x5650(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x5670(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x5690(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x56D8(0x00F0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x57C8(0x0040)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x5808(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x5828(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x5950(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x5970(0x0020)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_3;                            // 0x5990(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x59D8(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x5B00(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x5B20(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x5B40(0x0040)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x5B80(0x00F0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x5C70(0x0040)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_2;                            // 0x5CB0(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x5CF8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x5D18(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x5E40(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x5E60(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x5E80(0x00F0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x5F70(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x5FB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x5FD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x6000(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x6028(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x6050(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x6078(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x60A0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x60C8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x6110(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x6130(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x6158(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x61A0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x61C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x6208(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x6228(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x6270(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x6290(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x62B0(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x63D8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x63F8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x6440(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x6460(0x00C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x6528(0x0020)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_1;                            // 0x6548(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x6590(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x66B8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x66D8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x66F8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x6740(0x00F0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x6830(0x0040)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x6870(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x6890(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x68B0(0x0128)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror;                              // 0x69D8(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x6A20(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x6B48(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x6B68(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x6B88(0x0020)()
	bool                                          __CustomProperty_Gpapple_Left_FA2DBFBC4B33E58F20D3FD8F3717F4F3; // 0x6BA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Grapple_Right_FA2DBFBC4B33E58F20D3FD8F3717F4F3; // 0x6BA9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F51[0x6];                                     // 0x6BAA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Pitch_FA2DBFBC4B33E58F20D3FD8F3717F4F3; // 0x6BB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Yaw_FA2DBFBC4B33E58F20D3FD8F3717F4F3; // 0x6BB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Kinetic_Left_FA2DBFBC4B33E58F20D3FD8F3717F4F3; // 0x6BC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Kinetic_Right_FA2DBFBC4B33E58F20D3FD8F3717F4F3; // 0x6BC1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F52[0x6];                                     // 0x6BC2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Distance_FA2DBFBC4B33E58F20D3FD8F3717F4F3; // 0x6BC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_AimPoint_FA2DBFBC4B33E58F20D3FD8F3717F4F3; // 0x6BD0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_IsCyberLeftArm_ACAD45A947B11AE87262E7B8AC9AEC08; // 0x6BE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Kinetic_ACAD45A947B11AE87262E7B8AC9AEC08; // 0x6BE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_CyberArm_ACAD45A947B11AE87262E7B8AC9AEC08; // 0x6BEA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F53[0x5];                                     // 0x6BEB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                __CustomProperty_AimPoint_ACAD45A947B11AE87262E7B8AC9AEC08; // 0x6BF0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Pistol_D082873B410138465D165884DD5CD24D; // 0x6C08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F54[0x7];                                     // 0x6C09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             __CustomProperty_Transform_D082873B410138465D165884DD5CD24D; // 0x6C10(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Yaw_D082873B410138465D165884DD5CD24D; // 0x6C70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Pitch_D082873B410138465D165884DD5CD24D; // 0x6C78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_isCrouch_D082873B410138465D165884DD5CD24D; // 0x6C80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F55[0x7];                                     // 0x6C81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                __CustomProperty_TargetAimWithoutCorrection_D082873B410138465D165884DD5CD24D; // 0x6C88(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_LeftArm_D082873B410138465D165884DD5CD24D; // 0x6CA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_RightShoulder_D082873B410138465D165884DD5CD24D; // 0x6CA1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_RightArm_D082873B410138465D165884DD5CD24D; // 0x6CA2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F56[0x5];                                     // 0x6CA3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                __CustomProperty_AimTransform_D082873B410138465D165884DD5CD24D; // 0x6CA8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AimPitch;                                          // 0x6CC0(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AimYaw;                                            // 0x6CC8(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_PropertyAccess_62;                          // 0x6CD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_PropertyAccess_61;                          // 0x6CD8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_PropertyAccess_60;                          // 0x6CF0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_33;                          // 0x6D08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_32;                          // 0x6D09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_31;                          // 0x6D0A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_30;                          // 0x6D0B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_PropertyAccess_13;                          // 0x6D0C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_PropertyAccess_12;                          // 0x6D10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_PropertyAccess_11;                          // 0x6D14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_PropertyAccess_10;                          // 0x6D18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_9;                           // 0x6D1C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F57[0x3];                                     // 0x6D1D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_PropertyAccess_8;                           // 0x6D20(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 K2Node_PropertyAccess_2;                           // 0x6D38(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          RaiseWeaponAfterFiringWhenCrouched;                // 0x6D40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F58[0x7];                                     // 0x6D41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RaiseWeaponAfterFiringDuration;                    // 0x6D48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HipFireUpperBodyOverrideWeight;                    // 0x6D50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AimOffsetBlendWeight;                              // 0x6D58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HandIK_Left_Alpha;                                 // 0x6D60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HandIK_Right_Alpha;                                // 0x6D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableHandIK;                                     // 0x6D70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F59[0x7];                                     // 0x6D71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeFalling;                                       // 0x6D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeUntilNextIdleBreak;                            // 0x6D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IdleBreakDelayTime;                                // 0x6D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurnInPlaceAnimTime;                               // 0x6D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurnInPlaceRotationDirection;                      // 0x6D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurnInPlaceRecoveryDirection;                      // 0x6DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableLeftHandPoseOverride;                        // 0x6DA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F5A[0x7];                                     // 0x6DA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LeftHandPoseOverrideWeight;                        // 0x6DB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StrideWarpingPivotAlpha;                           // 0x6DB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeAtPivotStop;                                   // 0x6DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocomotionDistanceCurveName;                       // 0x6DC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StrideWarpingCycleAlpha;                           // 0x6DD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PlayRateClampCycle;                                // 0x6DD8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PivotStartingAcceleration;                         // 0x6DE8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PlayRateClampStartsPivots;                         // 0x6E00(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StrideWarpingBlendInDurationScaled;                // 0x6E10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StrideWarpingBlendInStartOffset;                   // 0x6E18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIdleBreakIndex;                             // 0x6E20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F5B[0x4];                                     // 0x6E24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        StrideWarpingStartAlpha;                           // 0x6E28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LandRecoveryAlpha;                                 // 0x6E30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WantsIdleBreak;                                    // 0x6E38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F5C[0x3];                                     // 0x6E39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Hand_FKWeight;                                     // 0x6E3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          NPC_Cover_Idle;                                    // 0x6E40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          NPC_Crouch_Cover_Idle;                             // 0x6E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequence*>                  NPC_Lean_Idle;                                     // 0x6E50(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimSequence*>                  NPC_Lean_In;                                       // 0x6E60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimSequence*>                  NPC_Lean_Out;                                      // 0x6E70(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimSequence*>                  NPC_Crouch_Lean_Idle;                              // 0x6E80(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimSequence*>                  NPC_Crouch_Lean_In;                                // 0x6E90(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimSequence*>                  NPC_Crouch_Lean_Out;                               // 0x6EA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ELeanType                                     LastLeanDirection;                                 // 0x6EB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F5D[0x7];                                     // 0x6EB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Legless_StateEnterAnim_PlayRate;                   // 0x6EB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Legless_StateExitAnim_PlayRate;                    // 0x6EC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAimOffsetBlendSpace*                   WeaponAimOffset;                                   // 0x6EC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          KneeSlide_Cycle;                                   // 0x6ED0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          KneeSlide_Start_FWD;                               // 0x6ED8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          KneeSlide_Start_Left;                              // 0x6EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          KneeSlide_Start_Right;                             // 0x6EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          KneeSlide_PreStart;                                // 0x6EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EAnim_ItemType                                ItemType;                                          // 0x6EF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F5E[0x7];                                     // 0x6EF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          VerticalGripPose;                                  // 0x6F00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EGzWeaponSupportHoldType                      WeaponGripType;                                    // 0x6F08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F5F[0x7];                                     // 0x6F09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          VerticalAngledGripPose;                            // 0x6F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          AngledGripPose;                                    // 0x6F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          HorizontalGripPose;                                // 0x6F20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          SideGripPose;                                      // 0x6F28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        HandGripPosesWeight;                               // 0x6F30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CyberArmAimLocation;                               // 0x6F38(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Kinetic_Left;                                      // 0x6F50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F60[0x7];                                     // 0x6F51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMultiPartCharacter*                  As_Gz_Multi_Part_Character;                        // 0x6F58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAimOffsetBlendSpace*                   Quick_CyberArm_Right;                              // 0x6F60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAimOffsetBlendSpace*                   Quick_CyberArm_Left;                               // 0x6F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAimOffsetBlendSpace*                   Crouch_ADS_AimOffset;                              // 0x6F70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Idle_Knockdown_Sequence;                           // 0x6F78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Knockdown_Turn_In_Place_Right_Sequence;            // 0x6F80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Knockdown_Turn_In_Place_Left_Sequence;             // 0x6F88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          KneeSlide_End;                                     // 0x6F90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          SuperSprint;                                       // 0x6F98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAimOffsetBlendSpace*                   Mirror_Aim;                                        // 0x6FA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimStruct_AimingCorrection           Stand_Aim_Additive_Correction;                     // 0x6FA8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAnimStruct_AimingCorrection           Crouch_Aim_Additive_Correction;                    // 0x6FC8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAnimStruct_StanceTransitions          Stand_to_Crouch;                                   // 0x6FE8(0x0048)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAnimStruct_StanceTransitions          Crouch_to_Stand;                                   // 0x7030(0x0048)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<EAnimStances, class UAnimSequence*>      Stand_Idle_anims;                                  // 0x7078(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EAnimStances, class UAnimSequence*>      Crouch_Idle_anims;                                 // 0x70C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAnimStruct_ArmedStates                Mirrored_Stand_Turn_Left;                          // 0x7118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAnimStruct_ArmedStates                Mirrored_Stand_Turn_Right;                         // 0x7130(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAnimStruct_ArmedStates                Mirrored_Crouch_Turn_Left;                         // 0x7148(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAnimStruct_ArmedStates                Mirrored_Crouch_Turn_Right;                        // 0x7160(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Jump_Fall_to_ParaFall_Sequence;                    // 0x7178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Jump_ParaFall_to_Fall_Sequence;                    // 0x7180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Jump_ParaFall_Sequence;                            // 0x7188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<EGzWeaponSupportHoldType, class UAnimSequence*> LeftHandGrip;                                      // 0x7190(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Kinetic_Right;                                     // 0x71E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Right_Arm;                                         // 0x71E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Left_Arm;                                          // 0x71E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Legs;                                              // 0x71E3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Local_Controller;                                  // 0x71E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Aiming_Correction(const struct FPoseLink& Aim_pose, struct FPoseLink* Param_Aiming_Correction);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BlueprintLinkedAnimationLayersInitialized();
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	bool CanPlayIdleBreak();
	void ChooseIdleBreakDelayTime();
	void DamagedBody_CycleState(struct FPoseLink* Param_DamagedBody_CycleState);
	void DamagedBody_EnterState(struct FPoseLink* Param_DamagedBody_EnterState);
	void DamagedBody_ExitState(struct FPoseLink* Param_DamagedBody_ExitState);
	void DamagedBody_IdleState(struct FPoseLink* Param_DamagedBody_IdleState);
	void DebugLeftHandGrip(bool Debug);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Item_AnimGraphNode_ApplyAdditive_97D32B9E4EDEBF8062879598BBA3B80F();
