#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLA_Cloaking_PT_Device

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_CLA_Cloaking_PT_Device.ABP_CLA_Cloaking_PT_Device_C.AnimBlueprintGeneratedConstantData
// 0x032F (0x0330 - 0x0001)
struct ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_64C8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_65;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C9[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_66;                             // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_67;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_68;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_69;                               // 0x0024(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_70;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_71;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_72;                                 // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_73;                                  // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_74;                                 // 0x0064(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_75;                                 // 0x0065(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64CA[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_76;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64CB[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_77;                             // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_78;                                 // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_79;                                 // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_80;                                 // 0x007A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64CC[0x1];                                     // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_81;                                 // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_82;                                 // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_83;                                 // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_84;                                  // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_85;                               // 0x0098(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0138(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0150(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x0180(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x01B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_1;                 // 0x01E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x0210(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x0240(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x0270(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;                   // 0x02A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x02D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x0300(0x0030)()
};
static_assert(alignof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData) == 0x000330, "Wrong size on ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __NameProperty_65) == 0x000004, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__NameProperty_65' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_66) == 0x000010, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_66' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __NameProperty_67) == 0x000018, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__NameProperty_67' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __IntProperty_68) == 0x000020, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__IntProperty_68' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __StructProperty_69) == 0x000024, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__StructProperty_69' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __FloatProperty_70) == 0x000050, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__FloatProperty_70' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __FloatProperty_71) == 0x000054, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__FloatProperty_71' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __NameProperty_72) == 0x000058, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__NameProperty_72' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __IntProperty_73) == 0x000060, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__IntProperty_73' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __ByteProperty_74) == 0x000064, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__ByteProperty_74' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __BoolProperty_75) == 0x000065, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__BoolProperty_75' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __FloatProperty_76) == 0x000068, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__FloatProperty_76' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_77) == 0x000070, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_77' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __BoolProperty_78) == 0x000078, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__BoolProperty_78' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __EnumProperty_79) == 0x000079, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__EnumProperty_79' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __ByteProperty_80) == 0x00007A, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__ByteProperty_80' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __NameProperty_81) == 0x00007C, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__NameProperty_81' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __NameProperty_82) == 0x000084, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__NameProperty_82' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __NameProperty_83) == 0x00008C, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__NameProperty_83' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __IntProperty_84) == 0x000094, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__IntProperty_84' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, __StructProperty_85) == 0x000098, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::__StructProperty_85' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B8, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000138, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000150, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000180, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x0001B0, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_1) == 0x0001E0, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000210, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000240, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000270, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x0002A0, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x0002D0, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000300, "Member 'ABP_CLA_Cloaking_PT_Device::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

}

