#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLL_Mortar_Leg_R

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_CLL_Mortar_Leg_R.ABP_CLL_Mortar_Leg_R_C.AnimBlueprintGeneratedConstantData
// 0x0507 (0x0508 - 0x0001)
struct ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_5E9D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_126;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_127;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_128;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_129;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_130;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_131;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_132;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_133;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_134;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_135;                               // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_136;                              // 0x0040(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_137;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_138;                                // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_139;                                // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_140;                                // 0x0072(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9E[0x1];                                     // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_141;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_142;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_143;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_144;                                 // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_145;                              // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0148(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh;                    // 0x0178(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;                    // 0x01A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;                  // 0x01D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;                  // 0x0208(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x0238(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x0268(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x0298(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x02C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;                    // 0x02F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                       // 0x0328(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;                    // 0x0358(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x0388(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x03B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x03E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x0418(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x0448(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x0478(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x04A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x04D8(0x0030)()
};
static_assert(alignof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData) == 0x000508, "Wrong size on ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __NameProperty_126) == 0x000004, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__NameProperty_126' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __NameProperty_127) == 0x00000C, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__NameProperty_127' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __IntProperty_128) == 0x000014, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__IntProperty_128' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __NameProperty_129) == 0x000018, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__NameProperty_129' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __IntProperty_130) == 0x000020, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__IntProperty_130' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __NameProperty_131) == 0x000024, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__NameProperty_131' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __IntProperty_132) == 0x00002C, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__IntProperty_132' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __NameProperty_133) == 0x000030, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__NameProperty_133' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __IntProperty_134) == 0x000038, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__IntProperty_134' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __FloatProperty_135) == 0x00003C, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__FloatProperty_135' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __StructProperty_136) == 0x000040, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__StructProperty_136' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __FloatProperty_137) == 0x00006C, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__FloatProperty_137' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __BoolProperty_138) == 0x000070, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__BoolProperty_138' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __EnumProperty_139) == 0x000071, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__EnumProperty_139' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __ByteProperty_140) == 0x000072, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__ByteProperty_140' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __NameProperty_141) == 0x000074, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__NameProperty_141' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __NameProperty_142) == 0x00007C, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__NameProperty_142' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __NameProperty_143) == 0x000084, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__NameProperty_143' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __IntProperty_144) == 0x00008C, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__IntProperty_144' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, __StructProperty_145) == 0x000090, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::__StructProperty_145' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000148, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh) == 0x000178, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x0001A8, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_5) == 0x0001D8, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x000208, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000238, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000268, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000298, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x0002C8, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_4) == 0x0002F8, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_4) == 0x000328, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x000358, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000388, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x0003B8, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x0003E8, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000418, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000448, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000478, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x0004A8, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x0004D8, "Member 'ABP_CLL_Mortar_Leg_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

}

