#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AT_SA02_S01_GRP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_AT_SA02_S01_GRP.ABP_AT_SA02_S01_GRP_C.AnimBlueprintGeneratedConstantData
// 0x017F (0x0180 - 0x0001)
struct ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_6A79[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_11;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A7A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_12;                               // 0x0010(0x0020)(BlueprintVisible, NoDestructor)
	ESequenceEvalReinit                           __ByteProperty_13;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A7B[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_15;                                  // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A7C[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_17;                             // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_18;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_19;                                 // 0x0049(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_20;                                 // 0x004A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A7D[0x1];                                     // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_21;                                 // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A7E[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0058(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00D8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x00F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                                // 0x0120(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;                   // 0x0150(0x0030)()
};
static_assert(alignof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData) == 0x000180, "Wrong size on ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, __NameProperty_11) == 0x000004, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::__NameProperty_11' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, __StructProperty_12) == 0x000010, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::__StructProperty_12' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, __ByteProperty_13) == 0x000030, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::__ByteProperty_13' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, __BoolProperty_14) == 0x000031, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::__BoolProperty_14' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, __IntProperty_15) == 0x000034, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::__IntProperty_15' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, __FloatProperty_16) == 0x000038, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::__FloatProperty_16' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_17) == 0x000040, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_17' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, __BoolProperty_18) == 0x000048, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::__BoolProperty_18' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, __EnumProperty_19) == 0x000049, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::__EnumProperty_19' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, __ByteProperty_20) == 0x00004A, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::__ByteProperty_20' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, __NameProperty_21) == 0x00004C, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::__NameProperty_21' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000058, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000D8, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000F0, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000120, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x000150, "Member 'ABP_AT_SA02_S01_GRP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");

}

