#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLA_TetherArm_Base_R

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_CLA_TetherArm_Base_R.ABP_CLA_TetherArm_Base_R_C.AnimBlueprintGeneratedConstantData
// 0x02B7 (0x02B8 - 0x0001)
struct ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_6F69[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_37;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_38;                               // 0x000C(0x002C)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_39;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F6A[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_40;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_41;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_42;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_43;                                 // 0x0045(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_44;                                 // 0x0046(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F6B[0x1];                                     // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_45;                                 // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_46;                               // 0x0050(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0070(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00F0(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0108(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh;                    // 0x0138(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                          // 0x0168(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                                // 0x0198(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_1;                  // 0x01C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x01F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;                    // 0x0228(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;                    // 0x0258(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver;                          // 0x0288(0x0030)()
};
static_assert(alignof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData) == 0x0002B8, "Wrong size on ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, __NameProperty_37) == 0x000004, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::__NameProperty_37' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, __StructProperty_38) == 0x00000C, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::__StructProperty_38' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, __BoolProperty_39) == 0x000038, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::__BoolProperty_39' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, __FloatProperty_40) == 0x00003C, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::__FloatProperty_40' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, __FloatProperty_41) == 0x000040, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::__FloatProperty_41' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, __BoolProperty_42) == 0x000044, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::__BoolProperty_42' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, __EnumProperty_43) == 0x000045, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::__EnumProperty_43' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, __ByteProperty_44) == 0x000046, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::__ByteProperty_44' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, __NameProperty_45) == 0x000048, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::__NameProperty_45' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, __StructProperty_46) == 0x000050, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::__StructProperty_46' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000070, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000F0, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000108, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh) == 0x000138, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig) == 0x000168, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000198, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend_1) == 0x0001C8, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0001F8, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x000228, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000258, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_PoseDriver) == 0x000288, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_PoseDriver' has a wrong offset!");

// ScriptStruct ABP_CLA_TetherArm_Base_R.ABP_CLA_TetherArm_Base_R_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_6F6C[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_CLA_TetherArm_Base_R::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

