#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_HEX_Antenna_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_HEX_Antenna_01.ABP_HEX_Antenna_01_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_HEX_Antenna_01::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5989[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_HEX_Antenna_01::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_HEX_Antenna_01::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

// ScriptStruct ABP_HEX_Antenna_01.ABP_HEX_Antenna_01_C.AnimBlueprintGeneratedConstantData
// 0x03E7 (0x03E8 - 0x0001)
struct ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_598A[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_90;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_91;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_92;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_93;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_94;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_95;                               // 0x0024(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_96;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_97;                                 // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_98;                                  // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_99;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_100;                                // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_598B[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_101;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_102;                            // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_103;                                // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_104;                                // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_105;                                // 0x0072(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_598C[0x1];                                     // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_106;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_107;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_108;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_109;                                 // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_110;                              // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0148(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x0178(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x01A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x01D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x0208(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x0238(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x0268(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x0298(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x02C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x02F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x0328(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;                   // 0x0358(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x0388(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x03B8(0x0030)()
};
static_assert(alignof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData) == 0x0003E8, "Wrong size on ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __NameProperty_90) == 0x000004, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__NameProperty_90' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __NameProperty_91) == 0x00000C, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__NameProperty_91' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __IntProperty_92) == 0x000014, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__IntProperty_92' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __NameProperty_93) == 0x000018, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__NameProperty_93' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __IntProperty_94) == 0x000020, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__IntProperty_94' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __StructProperty_95) == 0x000024, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__StructProperty_95' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __FloatProperty_96) == 0x000050, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__FloatProperty_96' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __NameProperty_97) == 0x000054, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__NameProperty_97' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __IntProperty_98) == 0x00005C, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__IntProperty_98' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __ByteProperty_99) == 0x000060, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__ByteProperty_99' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __BoolProperty_100) == 0x000061, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__BoolProperty_100' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __FloatProperty_101) == 0x000064, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__FloatProperty_101' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_102) == 0x000068, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_102' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __BoolProperty_103) == 0x000070, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__BoolProperty_103' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __EnumProperty_104) == 0x000071, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__EnumProperty_104' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __ByteProperty_105) == 0x000072, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__ByteProperty_105' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __NameProperty_106) == 0x000074, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__NameProperty_106' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __NameProperty_107) == 0x00007C, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__NameProperty_107' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __NameProperty_108) == 0x000084, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__NameProperty_108' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __IntProperty_109) == 0x00008C, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__IntProperty_109' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, __StructProperty_110) == 0x000090, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::__StructProperty_110' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000148, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000178, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x0001A8, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x0001D8, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000208, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000238, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000268, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000298, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x0002C8, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0002F8, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000328, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x000358, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000388, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x0003B8, "Member 'ABP_HEX_Antenna_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

}

