#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLA_KineticShield_Arm_R

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_CLA_KineticShield_Arm_R.ABP_CLA_KineticShield_Arm_R_C.AnimBlueprintGeneratedConstantData
// 0x04AF (0x04B0 - 0x0001)
struct ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_516D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_105;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_106;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_107;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_108;                            // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_109;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_110;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_111;                              // 0x002C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_112;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_113;                                // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_114;                                 // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_115;                                // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_116;                                // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_516E[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_117;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_118;                            // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_119;                                // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_120;                                // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_121;                                // 0x007A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_516F[0x1];                                     // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_122;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_123;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_124;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_125;                                 // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_126;                              // 0x0098(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0138(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0150(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh;                    // 0x0180(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                          // 0x01B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;                    // 0x01E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                                // 0x0210(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x0240(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x0270(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x02A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x02D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x0300(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x0330(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_1;                 // 0x0360(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x0390(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x03C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x03F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;                   // 0x0420(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x0450(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x0480(0x0030)()
};
static_assert(alignof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData) == 0x0004B0, "Wrong size on ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __NameProperty_105) == 0x000004, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__NameProperty_105' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __NameProperty_106) == 0x00000C, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__NameProperty_106' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __IntProperty_107) == 0x000014, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__IntProperty_107' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_108) == 0x000018, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_108' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __NameProperty_109) == 0x000020, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__NameProperty_109' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __IntProperty_110) == 0x000028, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__IntProperty_110' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __StructProperty_111) == 0x00002C, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__StructProperty_111' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __FloatProperty_112) == 0x000058, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__FloatProperty_112' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __NameProperty_113) == 0x00005C, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__NameProperty_113' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __IntProperty_114) == 0x000064, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__IntProperty_114' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __ByteProperty_115) == 0x000068, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__ByteProperty_115' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __BoolProperty_116) == 0x000069, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__BoolProperty_116' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __FloatProperty_117) == 0x00006C, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__FloatProperty_117' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_118) == 0x000070, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_118' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __BoolProperty_119) == 0x000078, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__BoolProperty_119' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __EnumProperty_120) == 0x000079, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__EnumProperty_120' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __ByteProperty_121) == 0x00007A, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__ByteProperty_121' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __NameProperty_122) == 0x00007C, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__NameProperty_122' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __NameProperty_123) == 0x000084, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__NameProperty_123' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __NameProperty_124) == 0x00008C, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__NameProperty_124' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __IntProperty_125) == 0x000094, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__IntProperty_125' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, __StructProperty_126) == 0x000098, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::__StructProperty_126' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B8, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000138, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000150, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh) == 0x000180, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig) == 0x0001B0, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x0001E0, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000210, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000240, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000270, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x0002A0, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x0002D0, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000300, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000330, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_1) == 0x000360, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000390, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0003C0, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x0003F0, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x000420, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000450, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000480, "Member 'ABP_CLA_KineticShield_Arm_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

}

