#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLA_Gorilla_R

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_CLA_Gorilla_R.ABP_CLA_Gorilla_R_C.AnimBlueprintGeneratedConstantData
// 0x04B7 (0x04B8 - 0x0001)
struct ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_6B89[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_104;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_105;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_106;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_107;                            // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_108;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_109;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_110;                              // 0x002C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_111;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_112;                               // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_113;                                // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_114;                                 // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_115;                                // 0x006C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_116;                                // 0x006D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B8A[0x2];                                     // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_117;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B8B[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_118;                            // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_119;                                // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_120;                                // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_121;                                // 0x0082(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B8C[0x1];                                     // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_122;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_123;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_124;                                // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_125;                                 // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_126;                              // 0x00A0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0140(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0158(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                          // 0x0188(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;                    // 0x01B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                                // 0x01E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh;                    // 0x0218(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x0248(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x0278(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x02A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x02D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x0308(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x0338(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_1;                 // 0x0368(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x0398(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x03C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x03F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;                   // 0x0428(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x0458(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x0488(0x0030)()
};
static_assert(alignof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData) == 0x0004B8, "Wrong size on ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __NameProperty_104) == 0x000004, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__NameProperty_104' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __NameProperty_105) == 0x00000C, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__NameProperty_105' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __IntProperty_106) == 0x000014, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__IntProperty_106' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_107) == 0x000018, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_107' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __NameProperty_108) == 0x000020, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__NameProperty_108' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __IntProperty_109) == 0x000028, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__IntProperty_109' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __StructProperty_110) == 0x00002C, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__StructProperty_110' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __FloatProperty_111) == 0x000058, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__FloatProperty_111' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __FloatProperty_112) == 0x00005C, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__FloatProperty_112' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __NameProperty_113) == 0x000060, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__NameProperty_113' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __IntProperty_114) == 0x000068, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__IntProperty_114' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __ByteProperty_115) == 0x00006C, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__ByteProperty_115' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __BoolProperty_116) == 0x00006D, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__BoolProperty_116' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __FloatProperty_117) == 0x000070, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__FloatProperty_117' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_118) == 0x000078, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_118' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __BoolProperty_119) == 0x000080, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__BoolProperty_119' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __EnumProperty_120) == 0x000081, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__EnumProperty_120' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __ByteProperty_121) == 0x000082, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__ByteProperty_121' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __NameProperty_122) == 0x000084, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__NameProperty_122' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __NameProperty_123) == 0x00008C, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__NameProperty_123' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __NameProperty_124) == 0x000094, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__NameProperty_124' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __IntProperty_125) == 0x00009C, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__IntProperty_125' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, __StructProperty_126) == 0x0000A0, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::__StructProperty_126' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C0, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000140, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000158, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig) == 0x000188, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x0001B8, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x0001E8, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh) == 0x000218, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000248, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000278, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x0002A8, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x0002D8, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000308, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000338, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_1) == 0x000368, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000398, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0003C8, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x0003F8, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x000428, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000458, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000488, "Member 'ABP_CLA_Gorilla_R::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

}

