#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PlayerVehicle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ABP_PlayerVehicle_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PlayerVehicle.ABP_PlayerVehicle_C
// 0x1E50 (0x21C0 - 0x0370)
class UABP_PlayerVehicle_C final : public UAnimInstance
{
public:
	uint8                                         Pad_6060[0x8];                                     // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_PlayerVehicle::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0378(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0390(0x0020)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x03B0(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x03F8(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0418(0x0040)()
	uint8                                         Pad_6061[0x8];                                     // 0x0458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_3;                         // 0x0460(0x0280)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x06E0(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x0808(0x0020)()
	uint8                                         Pad_6062[0x8];                                     // 0x0828(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_2;                         // 0x0830(0x0280)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0AB0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x0AD0(0x00C8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x0B98(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x0BB8(0x0020)()
	uint8                                         Pad_6063[0x8];                                     // 0x0BD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x0BE0(0x0280)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x0E60(0x0280)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x10E0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1128(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x1148(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1210(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x1258(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x1278(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1298(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x13C0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x13E0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x14A8(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x14F0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x1510(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1530(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1658(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1678(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1740(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1788(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x17A8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x17C8(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x18F0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1910(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x19D8(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x19F8(0x00C8)()
	class APawn*                                  K2Node_PropertyAccess_2;                           // 0x1AC0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          K2Node_PropertyAccess_1;                           // 0x1AC8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzVehicle*                             __CustomProperty_CurrentVehicle_D6B931B749EB319C1F83BF9B11E10837; // 0x1AD0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             __CustomProperty_animCache_D6B931B749EB319C1F83BF9B11E10837; // 0x1AD8(0x0218)(NoDestructor)
	bool                                          __CustomProperty_GunShoot_D6B931B749EB319C1F83BF9B11E10837; // 0x1CF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6064[0x7];                                     // 0x1CF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzVehicle*                             __CustomProperty_CurrentVehicle_407BBEE247A977102F8E5EB1A2D7E889; // 0x1CF8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCache                             __CustomProperty_animCache_407BBEE247A977102F8E5EB1A2D7E889; // 0x1D00(0x0218)(NoDestructor)
	bool                                          __CustomProperty_GunShoot_407BBEE247A977102F8E5EB1A2D7E889; // 0x1F18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6065[0x7];                                     // 0x1F19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                IKHandR;                                           // 0x1F20(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IKHandL;                                           // 0x1F38(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewVar;                                            // 0x1F50(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AGzCharacter*                           As_Gz_Character;                                   // 0x1F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EGzVehicleSeatType                            Seat;                                              // 0x1F70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6066[0x7];                                     // 0x1F71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GunForceVector;                                    // 0x1F78(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Gun_Shoot;                                         // 0x1F90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLeaningOut;                                      // 0x1F91(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6067[0x6];                                     // 0x1F92(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzVehicle*                             CurrentVehicle;                                    // 0x1F98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CurrentVehicleMesh;                                // 0x1FA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FAnimCache                             AnimCache;                                         // 0x1FA8(0x0218)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	struct FAnimCache ABPHumanData();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BlueprintInitializeAnimation();
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ComputeDriversHandsIK();
	void ComputeGunnerHandsIK();
	void ComputeHandsIKs();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerVehicle_AnimGraphNode_BlendListByInt_3FE024CE454C5D98FBC71A9ED3727547();
	void ExecuteUbergraph_ABP_PlayerVehicle(int32 EntryPoint);
	class UABP_Human_C* GetABPHuman();
	class AGzPlayerCharacter* GetGZPlayerCharacter();
	void GunFire();
	void OnEnterVehicle();
	void OnExitVehicle();
	void OnJumped();
	void OnReachedJumpApex();
	void OnShotPerformed();
	void OnVehicleSeatChange(class AGzVehicle* VehicleRef, EGzVehicleSeatType Param_Seat);
	void SeatsPositionLayer(struct FPoseLink* Param_SeatsPositionLayer);
	void SetGroundedEntryState(ELocomotionGroundedEntryState EntryState);
	void SetOverlayOverrideState(int32 OverlayOverride);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PlayerVehicle_C">();
	}
	static class UABP_PlayerVehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PlayerVehicle_C>();
	}
};
static_assert(alignof(UABP_PlayerVehicle_C) == 0x000010, "Wrong alignment on UABP_PlayerVehicle_C");
static_assert(sizeof(UABP_PlayerVehicle_C) == 0x0021C0, "Wrong size on UABP_PlayerVehicle_C");
static_assert(offsetof(UABP_PlayerVehicle_C, UberGraphFrame) == 0x000370, "Member 'UABP_PlayerVehicle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, __AnimBlueprintMutables) == 0x000378, "Member 'UABP_PlayerVehicle_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimBlueprintExtension_PropertyAccess) == 0x000380, "Member 'UABP_PlayerVehicle_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimBlueprintExtension_Base) == 0x000388, "Member 'UABP_PlayerVehicle_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_Root_1) == 0x000390, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_BlendListByInt) == 0x0003B0, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_LocalToComponentSpace_4) == 0x0003F8, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_LocalToComponentSpace_4' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_SequenceEvaluator) == 0x000418, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_TwoBoneIK_3) == 0x000460, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_TwoBoneIK_3' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_ModifyBone_3) == 0x0006E0, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_ComponentToLocalSpace_4) == 0x000808, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_ComponentToLocalSpace_4' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_TwoBoneIK_2) == 0x000830, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_TwoBoneIK_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_StateResult_4) == 0x000AB0, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_StateMachine_4) == 0x000AD0, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_StateMachine_4' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_ComponentToLocalSpace_3) == 0x000B98, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_ComponentToLocalSpace_3' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_LocalToComponentSpace_3) == 0x000BB8, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_LocalToComponentSpace_3' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_TwoBoneIK_1) == 0x000BE0, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_TwoBoneIK_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_TwoBoneIK) == 0x000E60, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_SequencePlayer_3) == 0x0010E0, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_StateResult_3) == 0x001128, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_StateMachine_3) == 0x001148, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_StateMachine_3' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_SequencePlayer_2) == 0x001210, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x001258, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_LocalToComponentSpace_2) == 0x001278, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_ModifyBone_2) == 0x001298, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_StateResult_2) == 0x0013C0, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_StateMachine_2) == 0x0013E0, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_SequencePlayer_1) == 0x0014A8, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x0014F0, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_LocalToComponentSpace_1) == 0x001510, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_ModifyBone_1) == 0x001530, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_StateResult_1) == 0x001658, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_StateMachine_1) == 0x001678, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_SequencePlayer) == 0x001740, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_ComponentToLocalSpace) == 0x001788, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_LocalToComponentSpace) == 0x0017A8, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_ModifyBone) == 0x0017C8, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_StateResult) == 0x0018F0, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_StateMachine) == 0x001910, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_Root) == 0x0019D8, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimGraphNode_LinkedAnimLayer) == 0x0019F8, "Member 'UABP_PlayerVehicle_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, K2Node_PropertyAccess_2) == 0x001AC0, "Member 'UABP_PlayerVehicle_C::K2Node_PropertyAccess_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, K2Node_PropertyAccess_1) == 0x001AC8, "Member 'UABP_PlayerVehicle_C::K2Node_PropertyAccess_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, __CustomProperty_CurrentVehicle_D6B931B749EB319C1F83BF9B11E10837) == 0x001AD0, "Member 'UABP_PlayerVehicle_C::__CustomProperty_CurrentVehicle_D6B931B749EB319C1F83BF9B11E10837' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, __CustomProperty_animCache_D6B931B749EB319C1F83BF9B11E10837) == 0x001AD8, "Member 'UABP_PlayerVehicle_C::__CustomProperty_animCache_D6B931B749EB319C1F83BF9B11E10837' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, __CustomProperty_GunShoot_D6B931B749EB319C1F83BF9B11E10837) == 0x001CF0, "Member 'UABP_PlayerVehicle_C::__CustomProperty_GunShoot_D6B931B749EB319C1F83BF9B11E10837' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, __CustomProperty_CurrentVehicle_407BBEE247A977102F8E5EB1A2D7E889) == 0x001CF8, "Member 'UABP_PlayerVehicle_C::__CustomProperty_CurrentVehicle_407BBEE247A977102F8E5EB1A2D7E889' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, __CustomProperty_animCache_407BBEE247A977102F8E5EB1A2D7E889) == 0x001D00, "Member 'UABP_PlayerVehicle_C::__CustomProperty_animCache_407BBEE247A977102F8E5EB1A2D7E889' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, __CustomProperty_GunShoot_407BBEE247A977102F8E5EB1A2D7E889) == 0x001F18, "Member 'UABP_PlayerVehicle_C::__CustomProperty_GunShoot_407BBEE247A977102F8E5EB1A2D7E889' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, IKHandR) == 0x001F20, "Member 'UABP_PlayerVehicle_C::IKHandR' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, IKHandL) == 0x001F38, "Member 'UABP_PlayerVehicle_C::IKHandL' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, NewVar) == 0x001F50, "Member 'UABP_PlayerVehicle_C::NewVar' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, As_Gz_Character) == 0x001F68, "Member 'UABP_PlayerVehicle_C::As_Gz_Character' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, Seat) == 0x001F70, "Member 'UABP_PlayerVehicle_C::Seat' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, GunForceVector) == 0x001F78, "Member 'UABP_PlayerVehicle_C::GunForceVector' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, Gun_Shoot) == 0x001F90, "Member 'UABP_PlayerVehicle_C::Gun_Shoot' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, IsLeaningOut) == 0x001F91, "Member 'UABP_PlayerVehicle_C::IsLeaningOut' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, CurrentVehicle) == 0x001F98, "Member 'UABP_PlayerVehicle_C::CurrentVehicle' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, CurrentVehicleMesh) == 0x001FA0, "Member 'UABP_PlayerVehicle_C::CurrentVehicleMesh' has a wrong offset!");
static_assert(offsetof(UABP_PlayerVehicle_C, AnimCache) == 0x001FA8, "Member 'UABP_PlayerVehicle_C::AnimCache' has a wrong offset!");

}

