#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLL_ChargedJumpLegs

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_CLL_ChargedJumpLegs.ABP_CLL_ChargedJumpLegs_C.AnimBlueprintGeneratedConstantData
// 0x0167 (0x0168 - 0x0001)
struct ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_50B9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_10;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_11;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50BA[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_12;                               // 0x0018(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0038(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x00D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh;                    // 0x0100(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                          // 0x0130(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose;                     // 0x0160(0x0008)()
};
static_assert(alignof(ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData) == 0x000168, "Wrong size on ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData, __NameProperty_10) == 0x000004, "Member 'ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData::__NameProperty_10' has a wrong offset!");
static_assert(offsetof(ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData, __NameProperty_11) == 0x00000C, "Member 'ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData::__NameProperty_11' has a wrong offset!");
static_assert(offsetof(ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData, __StructProperty_12) == 0x000018, "Member 'ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData::__StructProperty_12' has a wrong offset!");
static_assert(offsetof(ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000038, "Member 'ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000B8, "Member 'ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000D0, "Member 'ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh) == 0x000100, "Member 'ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig) == 0x000130, "Member 'ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x000160, "Member 'ABP_CLL_ChargedJumpLegs::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");

}

