#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLL_Mortar_Leg_R

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function ABP_CLL_Mortar_Leg_R.ABP_CLL_Mortar_Leg_R_C.OnTagRemoved_2211413D49389D129FEC6C8C0A79E6A5
// 0x0008 (0x0008 - 0x0000)
struct ABP_CLL_Mortar_Leg_R_C_OnTagRemoved_2211413D49389D129FEC6C8C0A79E6A5 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLL_Mortar_Leg_R_C_OnTagRemoved_2211413D49389D129FEC6C8C0A79E6A5) == 0x000004, "Wrong alignment on ABP_CLL_Mortar_Leg_R_C_OnTagRemoved_2211413D49389D129FEC6C8C0A79E6A5");
static_assert(sizeof(ABP_CLL_Mortar_Leg_R_C_OnTagRemoved_2211413D49389D129FEC6C8C0A79E6A5) == 0x000008, "Wrong size on ABP_CLL_Mortar_Leg_R_C_OnTagRemoved_2211413D49389D129FEC6C8C0A79E6A5");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R_C_OnTagRemoved_2211413D49389D129FEC6C8C0A79E6A5, Tag) == 0x000000, "Member 'ABP_CLL_Mortar_Leg_R_C_OnTagRemoved_2211413D49389D129FEC6C8C0A79E6A5::Tag' has a wrong offset!");

// Function ABP_CLL_Mortar_Leg_R.ABP_CLL_Mortar_Leg_R_C.OnTagAdded_2211413D49389D129FEC6C8C0A79E6A5
// 0x0008 (0x0008 - 0x0000)
struct ABP_CLL_Mortar_Leg_R_C_OnTagAdded_2211413D49389D129FEC6C8C0A79E6A5 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLL_Mortar_Leg_R_C_OnTagAdded_2211413D49389D129FEC6C8C0A79E6A5) == 0x000004, "Wrong alignment on ABP_CLL_Mortar_Leg_R_C_OnTagAdded_2211413D49389D129FEC6C8C0A79E6A5");
static_assert(sizeof(ABP_CLL_Mortar_Leg_R_C_OnTagAdded_2211413D49389D129FEC6C8C0A79E6A5) == 0x000008, "Wrong size on ABP_CLL_Mortar_Leg_R_C_OnTagAdded_2211413D49389D129FEC6C8C0A79E6A5");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R_C_OnTagAdded_2211413D49389D129FEC6C8C0A79E6A5, Tag) == 0x000000, "Member 'ABP_CLL_Mortar_Leg_R_C_OnTagAdded_2211413D49389D129FEC6C8C0A79E6A5::Tag' has a wrong offset!");

// Function ABP_CLL_Mortar_Leg_R.ABP_CLL_Mortar_Leg_R_C.ExecuteUbergraph_ABP_CLL_Mortar_Leg_R
// 0x0060 (0x0060 - 0x0000)
struct ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EA0[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R) == 0x000008, "Wrong alignment on ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R");
static_assert(sizeof(ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R) == 0x000060, "Wrong size on ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R, EntryPoint) == 0x000000, "Member 'ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R, Temp_struct_Variable) == 0x000004, "Member 'ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R, K2Node_CustomEvent_Tag_1) == 0x00000C, "Member 'ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R, K2Node_CustomEvent_Tag) == 0x000024, "Member 'ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000040, "Member 'ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000048, "Member 'ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue) == 0x000050, "Member 'ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'ABP_CLL_Mortar_Leg_R_C_ExecuteUbergraph_ABP_CLL_Mortar_Leg_R::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ABP_CLL_Mortar_Leg_R.ABP_CLL_Mortar_Leg_R_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_CLL_Mortar_Leg_R_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_CLL_Mortar_Leg_R_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_CLL_Mortar_Leg_R_C_AnimGraph");
static_assert(sizeof(ABP_CLL_Mortar_Leg_R_C_AnimGraph) == 0x000010, "Wrong size on ABP_CLL_Mortar_Leg_R_C_AnimGraph");
static_assert(offsetof(ABP_CLL_Mortar_Leg_R_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_CLL_Mortar_Leg_R_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

