#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CLA_Default_Leg_Jungl

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_CLA_Default_Leg_Jungl.ABP_CLA_Default_Leg_Jungl_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_CLA_Default_Leg_Jungl_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_CLA_Default_Leg_Jungl_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_CLA_Default_Leg_Jungl_C_AnimGraph");
static_assert(sizeof(ABP_CLA_Default_Leg_Jungl_C_AnimGraph) == 0x000010, "Wrong size on ABP_CLA_Default_Leg_Jungl_C_AnimGraph");
static_assert(offsetof(ABP_CLA_Default_Leg_Jungl_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_CLA_Default_Leg_Jungl_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_CLA_Default_Leg_Jungl.ABP_CLA_Default_Leg_Jungl_C.ExecuteUbergraph_ABP_CLA_Default_Leg_Jungl
// 0x0004 (0x0004 - 0x0000)
struct ABP_CLA_Default_Leg_Jungl_C_ExecuteUbergraph_ABP_CLA_Default_Leg_Jungl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CLA_Default_Leg_Jungl_C_ExecuteUbergraph_ABP_CLA_Default_Leg_Jungl) == 0x000004, "Wrong alignment on ABP_CLA_Default_Leg_Jungl_C_ExecuteUbergraph_ABP_CLA_Default_Leg_Jungl");
static_assert(sizeof(ABP_CLA_Default_Leg_Jungl_C_ExecuteUbergraph_ABP_CLA_Default_Leg_Jungl) == 0x000004, "Wrong size on ABP_CLA_Default_Leg_Jungl_C_ExecuteUbergraph_ABP_CLA_Default_Leg_Jungl");
static_assert(offsetof(ABP_CLA_Default_Leg_Jungl_C_ExecuteUbergraph_ABP_CLA_Default_Leg_Jungl, EntryPoint) == 0x000000, "Member 'ABP_CLA_Default_Leg_Jungl_C_ExecuteUbergraph_ABP_CLA_Default_Leg_Jungl::EntryPoint' has a wrong offset!");

}

