#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_LimbAttachment_RightArm

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_LimbAttachment_RightArm.ABP_LimbAttachment_RightArm_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_LimbAttachment_RightArm_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_LimbAttachment_RightArm_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_LimbAttachment_RightArm_C_AnimGraph");
static_assert(sizeof(ABP_LimbAttachment_RightArm_C_AnimGraph) == 0x000010, "Wrong size on ABP_LimbAttachment_RightArm_C_AnimGraph");
static_assert(offsetof(ABP_LimbAttachment_RightArm_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_LimbAttachment_RightArm_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_LimbAttachment_RightArm.ABP_LimbAttachment_RightArm_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_LimbAttachment_RightArm_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_LimbAttachment_RightArm_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_LimbAttachment_RightArm_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_LimbAttachment_RightArm_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_LimbAttachment_RightArm_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_LimbAttachment_RightArm_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_LimbAttachment_RightArm_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_LimbAttachment_RightArm.ABP_LimbAttachment_RightArm_C.ExecuteUbergraph_ABP_LimbAttachment_RightArm
// 0x0020 (0x0020 - 0x0000)
struct ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57AC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzLimbAttachingReplica*                K2Node_DynamicCast_AsGz_Limb_Attaching_Replica;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57AD[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm) == 0x000008, "Wrong alignment on ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm");
static_assert(sizeof(ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm) == 0x000020, "Wrong size on ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm");
static_assert(offsetof(ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm, EntryPoint) == 0x000000, "Member 'ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm, K2Node_DynamicCast_AsGz_Limb_Attaching_Replica) == 0x000010, "Member 'ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm::K2Node_DynamicCast_AsGz_Limb_Attaching_Replica' has a wrong offset!");
static_assert(offsetof(ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm, K2Node_Event_DeltaTimeX) == 0x00001C, "Member 'ABP_LimbAttachment_RightArm_C_ExecuteUbergraph_ABP_LimbAttachment_RightArm::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

