#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Redepoyment_Terminal_01

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Redepoyment_Terminal_01.ABP_Redepoyment_Terminal_01_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Redepoyment_Terminal_01_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Redepoyment_Terminal_01_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Redepoyment_Terminal_01_C_AnimGraph");
static_assert(sizeof(ABP_Redepoyment_Terminal_01_C_AnimGraph) == 0x000010, "Wrong size on ABP_Redepoyment_Terminal_01_C_AnimGraph");
static_assert(offsetof(ABP_Redepoyment_Terminal_01_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_Redepoyment_Terminal_01_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_Redepoyment_Terminal_01.ABP_Redepoyment_Terminal_01_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Redepoyment_Terminal_01_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Redepoyment_Terminal_01_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Redepoyment_Terminal_01_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Redepoyment_Terminal_01_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Redepoyment_Terminal_01_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Redepoyment_Terminal_01_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Redepoyment_Terminal_01_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Redepoyment_Terminal_01.ABP_Redepoyment_Terminal_01_C.ExecuteUbergraph_ABP_Redepoyment_Terminal_01
// 0x0020 (0x0020 - 0x0000)
struct ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D1[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RedeploymentTerminal_C*             K2Node_DynamicCast_AsBP_Redeployment_Terminal;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D2[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01) == 0x000008, "Wrong alignment on ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01");
static_assert(sizeof(ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01) == 0x000020, "Wrong size on ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01");
static_assert(offsetof(ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01, EntryPoint) == 0x000000, "Member 'ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01, K2Node_DynamicCast_AsBP_Redeployment_Terminal) == 0x000010, "Member 'ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01::K2Node_DynamicCast_AsBP_Redeployment_Terminal' has a wrong offset!");
static_assert(offsetof(ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01, K2Node_Event_DeltaTimeX) == 0x00001C, "Member 'ABP_Redepoyment_Terminal_01_C_ExecuteUbergraph_ABP_Redepoyment_Terminal_01::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

