#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ALI_ItemAnimLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.Aiming_Correction
// 0x0020 (0x0020 - 0x0000)
struct ALI_ItemAnimLayer_C_Aiming_Correction final
{
public:
	struct FPoseLink                              Aim_pose;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_Aiming_Correction;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_Aiming_Correction) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_Aiming_Correction");
static_assert(sizeof(ALI_ItemAnimLayer_C_Aiming_Correction) == 0x000020, "Wrong size on ALI_ItemAnimLayer_C_Aiming_Correction");
static_assert(offsetof(ALI_ItemAnimLayer_C_Aiming_Correction, Aim_pose) == 0x000000, "Member 'ALI_ItemAnimLayer_C_Aiming_Correction::Aim_pose' has a wrong offset!");
static_assert(offsetof(ALI_ItemAnimLayer_C_Aiming_Correction, Param_Aiming_Correction) == 0x000010, "Member 'ALI_ItemAnimLayer_C_Aiming_Correction::Param_Aiming_Correction' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.DamagedBody_CycleState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_DamagedBody_CycleState final
{
public:
	struct FPoseLink                              Param_DamagedBody_CycleState;                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_DamagedBody_CycleState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_DamagedBody_CycleState");
static_assert(sizeof(ALI_ItemAnimLayer_C_DamagedBody_CycleState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_DamagedBody_CycleState");
static_assert(offsetof(ALI_ItemAnimLayer_C_DamagedBody_CycleState, Param_DamagedBody_CycleState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_DamagedBody_CycleState::Param_DamagedBody_CycleState' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.DamagedBody_EnterState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_DamagedBody_EnterState final
{
public:
	struct FPoseLink                              Param_DamagedBody_EnterState;                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_DamagedBody_EnterState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_DamagedBody_EnterState");
static_assert(sizeof(ALI_ItemAnimLayer_C_DamagedBody_EnterState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_DamagedBody_EnterState");
static_assert(offsetof(ALI_ItemAnimLayer_C_DamagedBody_EnterState, Param_DamagedBody_EnterState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_DamagedBody_EnterState::Param_DamagedBody_EnterState' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.DamagedBody_ExitState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_DamagedBody_ExitState final
{
public:
	struct FPoseLink                              Param_DamagedBody_ExitState;                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_DamagedBody_ExitState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_DamagedBody_ExitState");
static_assert(sizeof(ALI_ItemAnimLayer_C_DamagedBody_ExitState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_DamagedBody_ExitState");
static_assert(offsetof(ALI_ItemAnimLayer_C_DamagedBody_ExitState, Param_DamagedBody_ExitState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_DamagedBody_ExitState::Param_DamagedBody_ExitState' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.DamagedBody_IdleState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_DamagedBody_IdleState final
{
public:
	struct FPoseLink                              Param_DamagedBody_IdleState;                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_DamagedBody_IdleState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_DamagedBody_IdleState");
static_assert(sizeof(ALI_ItemAnimLayer_C_DamagedBody_IdleState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_DamagedBody_IdleState");
static_assert(offsetof(ALI_ItemAnimLayer_C_DamagedBody_IdleState, Param_DamagedBody_IdleState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_DamagedBody_IdleState::Param_DamagedBody_IdleState' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.FullBody_Aiming
// 0x0030 (0x0030 - 0x0000)
struct ALI_ItemAnimLayer_C_FullBody_Aiming final
{
public:
	struct FPoseLink                              PreAimPose;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        AimYaw;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AimPitch;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              Param_FullBody_Aiming;                             // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_FullBody_Aiming) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_FullBody_Aiming");
static_assert(sizeof(ALI_ItemAnimLayer_C_FullBody_Aiming) == 0x000030, "Wrong size on ALI_ItemAnimLayer_C_FullBody_Aiming");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_Aiming, PreAimPose) == 0x000000, "Member 'ALI_ItemAnimLayer_C_FullBody_Aiming::PreAimPose' has a wrong offset!");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_Aiming, AimYaw) == 0x000010, "Member 'ALI_ItemAnimLayer_C_FullBody_Aiming::AimYaw' has a wrong offset!");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_Aiming, AimPitch) == 0x000018, "Member 'ALI_ItemAnimLayer_C_FullBody_Aiming::AimPitch' has a wrong offset!");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_Aiming, Param_FullBody_Aiming) == 0x000020, "Member 'ALI_ItemAnimLayer_C_FullBody_Aiming::Param_FullBody_Aiming' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.FullBody_AnimAbility
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_FullBody_AnimAbility final
{
public:
	struct FPoseLink                              Param_FullBody_AnimAbility;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_FullBody_AnimAbility) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_FullBody_AnimAbility");
static_assert(sizeof(ALI_ItemAnimLayer_C_FullBody_AnimAbility) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_FullBody_AnimAbility");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_AnimAbility, Param_FullBody_AnimAbility) == 0x000000, "Member 'ALI_ItemAnimLayer_C_FullBody_AnimAbility::Param_FullBody_AnimAbility' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.FullBody_CycleState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_FullBody_CycleState final
{
public:
	struct FPoseLink                              Param_FullBody_CycleState;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_FullBody_CycleState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_FullBody_CycleState");
static_assert(sizeof(ALI_ItemAnimLayer_C_FullBody_CycleState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_FullBody_CycleState");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_CycleState, Param_FullBody_CycleState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_FullBody_CycleState::Param_FullBody_CycleState' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.FullBody_FallLandState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_FullBody_FallLandState final
{
public:
	struct FPoseLink                              Param_FullBody_FallLandState;                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_FullBody_FallLandState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_FullBody_FallLandState");
static_assert(sizeof(ALI_ItemAnimLayer_C_FullBody_FallLandState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_FullBody_FallLandState");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_FallLandState, Param_FullBody_FallLandState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_FullBody_FallLandState::Param_FullBody_FallLandState' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.FullBody_FallLoopState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_FullBody_FallLoopState final
{
public:
	struct FPoseLink                              Param_FullBody_FallLoopState;                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_FullBody_FallLoopState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_FullBody_FallLoopState");
static_assert(sizeof(ALI_ItemAnimLayer_C_FullBody_FallLoopState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_FullBody_FallLoopState");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_FallLoopState, Param_FullBody_FallLoopState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_FullBody_FallLoopState::Param_FullBody_FallLoopState' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.FullBody_IdleState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_FullBody_IdleState final
{
public:
	struct FPoseLink                              Param_FullBody_IdleState;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_FullBody_IdleState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_FullBody_IdleState");
static_assert(sizeof(ALI_ItemAnimLayer_C_FullBody_IdleState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_FullBody_IdleState");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_IdleState, Param_FullBody_IdleState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_FullBody_IdleState::Param_FullBody_IdleState' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.FullBody_JumpApexState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_FullBody_JumpApexState final
{
public:
	struct FPoseLink                              Param_FullBody_JumpApexState;                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_FullBody_JumpApexState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_FullBody_JumpApexState");
static_assert(sizeof(ALI_ItemAnimLayer_C_FullBody_JumpApexState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_FullBody_JumpApexState");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_JumpApexState, Param_FullBody_JumpApexState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_FullBody_JumpApexState::Param_FullBody_JumpApexState' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.FullBody_JumpStartLoopState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_FullBody_JumpStartLoopState final
{
public:
	struct FPoseLink                              Param_FullBody_JumpStartLoopState;                 // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_FullBody_JumpStartLoopState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_FullBody_JumpStartLoopState");
static_assert(sizeof(ALI_ItemAnimLayer_C_FullBody_JumpStartLoopState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_FullBody_JumpStartLoopState");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_JumpStartLoopState, Param_FullBody_JumpStartLoopState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_FullBody_JumpStartLoopState::Param_FullBody_JumpStartLoopState' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.FullBody_JumpStartState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_FullBody_JumpStartState final
{
public:
	struct FPoseLink                              Param_FullBody_JumpStartState;                     // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_FullBody_JumpStartState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_FullBody_JumpStartState");
static_assert(sizeof(ALI_ItemAnimLayer_C_FullBody_JumpStartState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_FullBody_JumpStartState");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_JumpStartState, Param_FullBody_JumpStartState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_FullBody_JumpStartState::Param_FullBody_JumpStartState' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.FullBody_PivotState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_FullBody_PivotState final
{
public:
	struct FPoseLink                              Param_FullBody_PivotState;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_FullBody_PivotState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_FullBody_PivotState");
static_assert(sizeof(ALI_ItemAnimLayer_C_FullBody_PivotState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_FullBody_PivotState");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_PivotState, Param_FullBody_PivotState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_FullBody_PivotState::Param_FullBody_PivotState' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.FullBody_StartState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_FullBody_StartState final
{
public:
	struct FPoseLink                              Param_FullBody_StartState;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_FullBody_StartState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_FullBody_StartState");
static_assert(sizeof(ALI_ItemAnimLayer_C_FullBody_StartState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_FullBody_StartState");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_StartState, Param_FullBody_StartState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_FullBody_StartState::Param_FullBody_StartState' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.FullBody_StopState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_FullBody_StopState final
{
public:
	struct FPoseLink                              Param_FullBody_StopState;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_FullBody_StopState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_FullBody_StopState");
static_assert(sizeof(ALI_ItemAnimLayer_C_FullBody_StopState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_FullBody_StopState");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBody_StopState, Param_FullBody_StopState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_FullBody_StopState::Param_FullBody_StopState' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.FullBodyAdditives
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_FullBodyAdditives final
{
public:
	struct FPoseLink                              Param_FullBodyAdditives;                           // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_FullBodyAdditives) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_FullBodyAdditives");
static_assert(sizeof(ALI_ItemAnimLayer_C_FullBodyAdditives) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_FullBodyAdditives");
static_assert(offsetof(ALI_ItemAnimLayer_C_FullBodyAdditives, Param_FullBodyAdditives) == 0x000000, "Member 'ALI_ItemAnimLayer_C_FullBodyAdditives::Param_FullBodyAdditives' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.KneeSlide_State
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_KneeSlide_State final
{
public:
	struct FPoseLink                              Param_KneeSlide_State;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_KneeSlide_State) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_KneeSlide_State");
static_assert(sizeof(ALI_ItemAnimLayer_C_KneeSlide_State) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_KneeSlide_State");
static_assert(offsetof(ALI_ItemAnimLayer_C_KneeSlide_State, Param_KneeSlide_State) == 0x000000, "Member 'ALI_ItemAnimLayer_C_KneeSlide_State::Param_KneeSlide_State' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.Limbless_State
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_Limbless_State final
{
public:
	struct FPoseLink                              Param_Limbless_State;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_Limbless_State) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_Limbless_State");
static_assert(sizeof(ALI_ItemAnimLayer_C_Limbless_State) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_Limbless_State");
static_assert(offsetof(ALI_ItemAnimLayer_C_Limbless_State, Param_Limbless_State) == 0x000000, "Member 'ALI_ItemAnimLayer_C_Limbless_State::Param_Limbless_State' has a wrong offset!");

// Function ALI_ItemAnimLayer.ALI_ItemAnimLayer_C.NPC_CoverState
// 0x0010 (0x0010 - 0x0000)
struct ALI_ItemAnimLayer_C_NPC_CoverState final
{
public:
	struct FPoseLink                              Param_NPC_CoverState;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_ItemAnimLayer_C_NPC_CoverState) == 0x000008, "Wrong alignment on ALI_ItemAnimLayer_C_NPC_CoverState");
static_assert(sizeof(ALI_ItemAnimLayer_C_NPC_CoverState) == 0x000010, "Wrong size on ALI_ItemAnimLayer_C_NPC_CoverState");
static_assert(offsetof(ALI_ItemAnimLayer_C_NPC_CoverState, Param_NPC_CoverState) == 0x000000, "Member 'ALI_ItemAnimLayer_C_NPC_CoverState::Param_NPC_CoverState' has a wrong offset!");

}

