#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimStruct_AimingCorrection

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct AnimStruct_AimingCorrection.AnimStruct_AimingCorrection
// 0x0020 (0x0020 - 0x0000)
struct FAnimStruct_AimingCorrection final
{
public:
	class UAnimSequence*                          RightArmRightAim_22_7BA59378452CC529B54A3FA76D52814D; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          RightArmLeftAim_23_9C6505B941654122C72A9CB06003D9A6; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          LeftArmRightAim_24_F27E3D3749987BC0B28960910C40AFC0; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          LeftArmLeftAim_25_A2CA6FAB4EF662F986B5A9A573F2D602; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FAnimStruct_AimingCorrection) == 0x000008, "Wrong alignment on FAnimStruct_AimingCorrection");
static_assert(sizeof(FAnimStruct_AimingCorrection) == 0x000020, "Wrong size on FAnimStruct_AimingCorrection");
static_assert(offsetof(FAnimStruct_AimingCorrection, RightArmRightAim_22_7BA59378452CC529B54A3FA76D52814D) == 0x000000, "Member 'FAnimStruct_AimingCorrection::RightArmRightAim_22_7BA59378452CC529B54A3FA76D52814D' has a wrong offset!");
static_assert(offsetof(FAnimStruct_AimingCorrection, RightArmLeftAim_23_9C6505B941654122C72A9CB06003D9A6) == 0x000008, "Member 'FAnimStruct_AimingCorrection::RightArmLeftAim_23_9C6505B941654122C72A9CB06003D9A6' has a wrong offset!");
static_assert(offsetof(FAnimStruct_AimingCorrection, LeftArmRightAim_24_F27E3D3749987BC0B28960910C40AFC0) == 0x000010, "Member 'FAnimStruct_AimingCorrection::LeftArmRightAim_24_F27E3D3749987BC0B28960910C40AFC0' has a wrong offset!");
static_assert(offsetof(FAnimStruct_AimingCorrection, LeftArmLeftAim_25_A2CA6FAB4EF662F986B5A9A573F2D602) == 0x000018, "Member 'FAnimStruct_AimingCorrection::LeftArmLeftAim_25_A2CA6FAB4EF662F986B5A9A573F2D602' has a wrong offset!");

}

