#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimStruct_StanceTransitions

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct AnimStruct_StanceTransitions.AnimStruct_StanceTransitions
// 0x0048 (0x0048 - 0x0000)
struct FAnimStruct_StanceTransitions final
{
public:
	class UAnimSequence*                          ADStoADS_41_7BA59378452CC529B54A3FA76D52814D;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          ADStoHipfire_42_9C6505B941654122C72A9CB06003D9A6;  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          ADStoRelaxed_43_F27E3D3749987BC0B28960910C40AFC0;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          HipfiretoADS_44_A2CA6FAB4EF662F986B5A9A573F2D602;  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          HipfiretoHipfire_45_27F8CFCC47C0A5938080E9A9F81B4B41; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          HipfiretoRelaxed_46_2D789F434A6811688B38B6BB5668711F; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          RelaxedtoADS_48_992D924744AED646A1FEE2B552B673C0;  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          RelaxedtoHipfire_49_DA53721D488D825F32B75590C805D639; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          RelaxedtoRelaxed_50_5DF3610443549D1660F2D999834C93B1; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FAnimStruct_StanceTransitions) == 0x000008, "Wrong alignment on FAnimStruct_StanceTransitions");
static_assert(sizeof(FAnimStruct_StanceTransitions) == 0x000048, "Wrong size on FAnimStruct_StanceTransitions");
static_assert(offsetof(FAnimStruct_StanceTransitions, ADStoADS_41_7BA59378452CC529B54A3FA76D52814D) == 0x000000, "Member 'FAnimStruct_StanceTransitions::ADStoADS_41_7BA59378452CC529B54A3FA76D52814D' has a wrong offset!");
static_assert(offsetof(FAnimStruct_StanceTransitions, ADStoHipfire_42_9C6505B941654122C72A9CB06003D9A6) == 0x000008, "Member 'FAnimStruct_StanceTransitions::ADStoHipfire_42_9C6505B941654122C72A9CB06003D9A6' has a wrong offset!");
static_assert(offsetof(FAnimStruct_StanceTransitions, ADStoRelaxed_43_F27E3D3749987BC0B28960910C40AFC0) == 0x000010, "Member 'FAnimStruct_StanceTransitions::ADStoRelaxed_43_F27E3D3749987BC0B28960910C40AFC0' has a wrong offset!");
static_assert(offsetof(FAnimStruct_StanceTransitions, HipfiretoADS_44_A2CA6FAB4EF662F986B5A9A573F2D602) == 0x000018, "Member 'FAnimStruct_StanceTransitions::HipfiretoADS_44_A2CA6FAB4EF662F986B5A9A573F2D602' has a wrong offset!");
static_assert(offsetof(FAnimStruct_StanceTransitions, HipfiretoHipfire_45_27F8CFCC47C0A5938080E9A9F81B4B41) == 0x000020, "Member 'FAnimStruct_StanceTransitions::HipfiretoHipfire_45_27F8CFCC47C0A5938080E9A9F81B4B41' has a wrong offset!");
static_assert(offsetof(FAnimStruct_StanceTransitions, HipfiretoRelaxed_46_2D789F434A6811688B38B6BB5668711F) == 0x000028, "Member 'FAnimStruct_StanceTransitions::HipfiretoRelaxed_46_2D789F434A6811688B38B6BB5668711F' has a wrong offset!");
static_assert(offsetof(FAnimStruct_StanceTransitions, RelaxedtoADS_48_992D924744AED646A1FEE2B552B673C0) == 0x000030, "Member 'FAnimStruct_StanceTransitions::RelaxedtoADS_48_992D924744AED646A1FEE2B552B673C0' has a wrong offset!");
static_assert(offsetof(FAnimStruct_StanceTransitions, RelaxedtoHipfire_49_DA53721D488D825F32B75590C805D639) == 0x000038, "Member 'FAnimStruct_StanceTransitions::RelaxedtoHipfire_49_DA53721D488D825F32B75590C805D639' has a wrong offset!");
static_assert(offsetof(FAnimStruct_StanceTransitions, RelaxedtoRelaxed_50_5DF3610443549D1660F2D999834C93B1) == 0x000040, "Member 'FAnimStruct_StanceTransitions::RelaxedtoRelaxed_50_5DF3610443549D1660F2D999834C93B1' has a wrong offset!");

}

