#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_M_01_JumpBoost_Legs_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_M_01_JumpBoost_Legs_01.AnimBP_M_01_JumpBoost_Legs_01_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBP_M_01_JumpBoost_Legs_01_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBP_M_01_JumpBoost_Legs_01_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBP_M_01_JumpBoost_Legs_01_C_AnimGraph");
static_assert(sizeof(AnimBP_M_01_JumpBoost_Legs_01_C_AnimGraph) == 0x000010, "Wrong size on AnimBP_M_01_JumpBoost_Legs_01_C_AnimGraph");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function AnimBP_M_01_JumpBoost_Legs_01.AnimBP_M_01_JumpBoost_Legs_01_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_M_01_JumpBoost_Legs_01_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_M_01_JumpBoost_Legs_01_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_M_01_JumpBoost_Legs_01_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_M_01_JumpBoost_Legs_01_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_M_01_JumpBoost_Legs_01_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function AnimBP_M_01_JumpBoost_Legs_01.AnimBP_M_01_JumpBoost_Legs_01_C.ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01
// 0x00A8 (0x00A8 - 0x0000)
struct AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68F3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68F4[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68F5[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character_1;               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68F6[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01) == 0x000008, "Wrong alignment on AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01");
static_assert(sizeof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01) == 0x0000A8, "Wrong size on AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01, EntryPoint) == 0x000000, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01, CallFunc_GetOwningComponent_ReturnValue) == 0x000010, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01, K2Node_DynamicCast_AsGz_Character) == 0x000018, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01, K2Node_Event_DeltaTimeX) == 0x000024, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01, CallFunc_Normal_ReturnValue) == 0x000030, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x000048, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000050, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01, CallFunc_GetVelocity_ReturnValue) == 0x000068, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01, K2Node_DynamicCast_AsGz_Character_1) == 0x000080, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01::K2Node_DynamicCast_AsGz_Character_1' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01, CallFunc_LessLess_VectorRotator_ReturnValue) == 0x000090, "Member 'AnimBP_M_01_JumpBoost_Legs_01_C_ExecuteUbergraph_AnimBP_M_01_JumpBoost_Legs_01::CallFunc_LessLess_VectorRotator_ReturnValue' has a wrong offset!");

}

