#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimStruct_ArmedStates

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct AnimStruct_ArmedStates.AnimStruct_ArmedStates
// 0x0018 (0x0018 - 0x0000)
struct FAnimStruct_ArmedStates final
{
public:
	class UAnimSequence*                          ADS_2_E4C3B62043CFDD82D81CEA9328420920;            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Hipfire_4_4A5F9CAA4DEC191854BCC8A7C6383153;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Relaxed_6_8A8E73484CD0D2902C487FB2EF20B16A;        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FAnimStruct_ArmedStates) == 0x000008, "Wrong alignment on FAnimStruct_ArmedStates");
static_assert(sizeof(FAnimStruct_ArmedStates) == 0x000018, "Wrong size on FAnimStruct_ArmedStates");
static_assert(offsetof(FAnimStruct_ArmedStates, ADS_2_E4C3B62043CFDD82D81CEA9328420920) == 0x000000, "Member 'FAnimStruct_ArmedStates::ADS_2_E4C3B62043CFDD82D81CEA9328420920' has a wrong offset!");
static_assert(offsetof(FAnimStruct_ArmedStates, Hipfire_4_4A5F9CAA4DEC191854BCC8A7C6383153) == 0x000008, "Member 'FAnimStruct_ArmedStates::Hipfire_4_4A5F9CAA4DEC191854BCC8A7C6383153' has a wrong offset!");
static_assert(offsetof(FAnimStruct_ArmedStates, Relaxed_6_8A8E73484CD0D2902C487FB2EF20B16A) == 0x000010, "Member 'FAnimStruct_ArmedStates::Relaxed_6_8A8E73484CD0D2902C487FB2EF20B16A' has a wrong offset!");

}

