#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_M_01_JumpBoost_Legs_01

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_M_01_JumpBoost_Legs_01.AnimBP_M_01_JumpBoost_Legs_01_C.AnimBlueprintGeneratedConstantData
// 0x015F (0x0160 - 0x0001)
struct AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_68EF[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_7;                                  // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_8;                                  // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68F0[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_9;                                // 0x0018(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0038(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh;                    // 0x00D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0100(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                          // 0x0130(0x0030)()
};
static_assert(alignof(AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData) == 0x000160, "Wrong size on AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData, __NameProperty_7) == 0x000004, "Member 'AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData::__NameProperty_7' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData, __NameProperty_8) == 0x00000C, "Member 'AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData::__NameProperty_8' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData, __StructProperty_9) == 0x000018, "Member 'AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData::__StructProperty_9' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000038, "Member 'AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000B8, "Member 'AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh) == 0x0000D0, "Member 'AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000100, "Member 'AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig) == 0x000130, "Member 'AnimBP_M_01_JumpBoost_Legs_01::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig' has a wrong offset!");

}

