#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Authentication

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "Authentication_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Authentication.AuthenticationBlueprintApi
// 0x0000 (0x0028 - 0x0028)
class UAuthenticationBlueprintApi final : public UBlueprintFunctionLibrary
{
public:
	static void DeleteUser(TDelegate<void(bool bResponse)> ResponseDelegate);
	static void RegisterStateChangedCallback(TDelegate<void(const struct FAuthenticationStateChangedResponse& Response)> ResponseDelegate);
	static void SetUnityEnvironmentName(const class FString& Value);
	static void SetUnityProjectId(const struct FGuid& Value);
	static void SignInAnonymously(const struct FAuthenticationSignInOptions& OPTIONS, TDelegate<void(const struct FAuthenticationResponse& Response)> ResponseDelegate);
	static bool SignOut(bool bClearCredentials);

	void AuthenticationDeleteUserDelegate__DelegateSignature(bool bResponse);
	void AuthenticationGetUserDelegate__DelegateSignature(const struct FAuthenticationUserResponse& Response);
	void AuthenticationPlayerProfileChangedResponseDelegate__DelegateSignature(const struct FAuthenticationPlayerProfileChangedResponse& Response);
	void AuthenticationPlayerProfileDeletedResponseDelegate__DelegateSignature(const struct FAuthenticationPlayerProfileDeletedResponse& Response);
	void AuthenticationResponseDelegate__DelegateSignature(const struct FAuthenticationResponse& Response);
	void AuthenticationStateChangedResponseDelegate__DelegateSignature(const struct FAuthenticationStateChangedResponse& Response);
	void RegisterProfileChangedCallback(TDelegate<void(const struct FAuthenticationPlayerProfileChangedResponse& Response)> ResponseDelegate);
	void RegisterProfileDeletedCallback(TDelegate<void(const struct FAuthenticationPlayerProfileDeletedResponse& Response)> ResponseDelegate);
	void SwitchProfile(const class FString& ProfileName);

	class FString GetAccessToken() const;
	class FString GetCurrentProfileName() const;
	TArray<class FString> GetProfileNames() const;
	class FString GetSessionToken() const;
	EAuthenticationStates GetState() const;
	class FString GetUnityEnvironmentName() const;
	struct FGuid GetUnityProjectId() const;
	class FString GetUserId() const;
	void GetUserInfo(TDelegate<void(const struct FAuthenticationUserResponse& Response)> ResponseDelegate) const;
	bool IsAnonymous() const;
	bool IsAuthorized() const;
	bool IsExpired() const;
	bool IsSignedIn() const;
	bool ProfileExists(const class FString& ProfileName) const;
	bool SessionTokenExists() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationBlueprintApi">();
	}
	static class UAuthenticationBlueprintApi* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationBlueprintApi>();
	}
};
static_assert(alignof(UAuthenticationBlueprintApi) == 0x000008, "Wrong alignment on UAuthenticationBlueprintApi");
static_assert(sizeof(UAuthenticationBlueprintApi) == 0x000028, "Wrong size on UAuthenticationBlueprintApi");

// Class Authentication.AuthenticationPlayerPrefsSaveGame
// 0x0050 (0x0078 - 0x0028)
class UAuthenticationPlayerPrefsSaveGame final : public USaveGame
{
public:
	uint8                                         Pad_244A[0x50];                                    // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationPlayerPrefsSaveGame">();
	}
	static class UAuthenticationPlayerPrefsSaveGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationPlayerPrefsSaveGame>();
	}
};
static_assert(alignof(UAuthenticationPlayerPrefsSaveGame) == 0x000008, "Wrong alignment on UAuthenticationPlayerPrefsSaveGame");
static_assert(sizeof(UAuthenticationPlayerPrefsSaveGame) == 0x000078, "Wrong size on UAuthenticationPlayerPrefsSaveGame");

// Class Authentication.AuthenticationSettings
// 0x0030 (0x0058 - 0x0028)
class UAuthenticationSettings final : public UObject
{
public:
	class FString                                 DefaultPlayerProfileName;                          // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ProjectID;                                         // 0x0038(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EnvironmentName;                                   // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationSettings">();
	}
	static class UAuthenticationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationSettings>();
	}
};
static_assert(alignof(UAuthenticationSettings) == 0x000008, "Wrong alignment on UAuthenticationSettings");
static_assert(sizeof(UAuthenticationSettings) == 0x000058, "Wrong size on UAuthenticationSettings");
static_assert(offsetof(UAuthenticationSettings, DefaultPlayerProfileName) == 0x000028, "Member 'UAuthenticationSettings::DefaultPlayerProfileName' has a wrong offset!");
static_assert(offsetof(UAuthenticationSettings, ProjectID) == 0x000038, "Member 'UAuthenticationSettings::ProjectID' has a wrong offset!");
static_assert(offsetof(UAuthenticationSettings, EnvironmentName) == 0x000048, "Member 'UAuthenticationSettings::EnvironmentName' has a wrong offset!");

// Class Authentication.AuthenticationSubsystem
// 0x0018 (0x0048 - 0x0030)
class UAuthenticationSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_244B[0x18];                                    // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationSubsystem">();
	}
	static class UAuthenticationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationSubsystem>();
	}
};
static_assert(alignof(UAuthenticationSubsystem) == 0x000008, "Wrong alignment on UAuthenticationSubsystem");
static_assert(sizeof(UAuthenticationSubsystem) == 0x000048, "Wrong size on UAuthenticationSubsystem");

}

