#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Authentication

#include "Basic.hpp"

#include "Authentication_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Authentication.AuthenticationBlueprintApi.DeleteUser
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_DeleteUser final
{
public:
	TDelegate<void(bool bResponse)>               ResponseDelegate;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_DeleteUser) == 0x000004, "Wrong alignment on AuthenticationBlueprintApi_DeleteUser");
static_assert(sizeof(AuthenticationBlueprintApi_DeleteUser) == 0x000010, "Wrong size on AuthenticationBlueprintApi_DeleteUser");
static_assert(offsetof(AuthenticationBlueprintApi_DeleteUser, ResponseDelegate) == 0x000000, "Member 'AuthenticationBlueprintApi_DeleteUser::ResponseDelegate' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.RegisterStateChangedCallback
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_RegisterStateChangedCallback final
{
public:
	TDelegate<void(const struct FAuthenticationStateChangedResponse& Response)> ResponseDelegate;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_RegisterStateChangedCallback) == 0x000004, "Wrong alignment on AuthenticationBlueprintApi_RegisterStateChangedCallback");
static_assert(sizeof(AuthenticationBlueprintApi_RegisterStateChangedCallback) == 0x000010, "Wrong size on AuthenticationBlueprintApi_RegisterStateChangedCallback");
static_assert(offsetof(AuthenticationBlueprintApi_RegisterStateChangedCallback, ResponseDelegate) == 0x000000, "Member 'AuthenticationBlueprintApi_RegisterStateChangedCallback::ResponseDelegate' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.SetUnityEnvironmentName
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_SetUnityEnvironmentName final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_SetUnityEnvironmentName) == 0x000008, "Wrong alignment on AuthenticationBlueprintApi_SetUnityEnvironmentName");
static_assert(sizeof(AuthenticationBlueprintApi_SetUnityEnvironmentName) == 0x000010, "Wrong size on AuthenticationBlueprintApi_SetUnityEnvironmentName");
static_assert(offsetof(AuthenticationBlueprintApi_SetUnityEnvironmentName, Value) == 0x000000, "Member 'AuthenticationBlueprintApi_SetUnityEnvironmentName::Value' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.SetUnityProjectId
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_SetUnityProjectId final
{
public:
	struct FGuid                                  Value;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_SetUnityProjectId) == 0x000004, "Wrong alignment on AuthenticationBlueprintApi_SetUnityProjectId");
static_assert(sizeof(AuthenticationBlueprintApi_SetUnityProjectId) == 0x000010, "Wrong size on AuthenticationBlueprintApi_SetUnityProjectId");
static_assert(offsetof(AuthenticationBlueprintApi_SetUnityProjectId, Value) == 0x000000, "Member 'AuthenticationBlueprintApi_SetUnityProjectId::Value' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.SignInAnonymously
// 0x0028 (0x0028 - 0x0000)
struct AuthenticationBlueprintApi_SignInAnonymously final
{
public:
	struct FAuthenticationSignInOptions           OPTIONS;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAuthenticationResponse& Response)> ResponseDelegate;                                  // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_SignInAnonymously) == 0x000008, "Wrong alignment on AuthenticationBlueprintApi_SignInAnonymously");
static_assert(sizeof(AuthenticationBlueprintApi_SignInAnonymously) == 0x000028, "Wrong size on AuthenticationBlueprintApi_SignInAnonymously");
static_assert(offsetof(AuthenticationBlueprintApi_SignInAnonymously, OPTIONS) == 0x000000, "Member 'AuthenticationBlueprintApi_SignInAnonymously::OPTIONS' has a wrong offset!");
static_assert(offsetof(AuthenticationBlueprintApi_SignInAnonymously, ResponseDelegate) == 0x000018, "Member 'AuthenticationBlueprintApi_SignInAnonymously::ResponseDelegate' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.SignOut
// 0x0002 (0x0002 - 0x0000)
struct AuthenticationBlueprintApi_SignOut final
{
public:
	bool                                          bClearCredentials;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_SignOut) == 0x000001, "Wrong alignment on AuthenticationBlueprintApi_SignOut");
static_assert(sizeof(AuthenticationBlueprintApi_SignOut) == 0x000002, "Wrong size on AuthenticationBlueprintApi_SignOut");
static_assert(offsetof(AuthenticationBlueprintApi_SignOut, bClearCredentials) == 0x000000, "Member 'AuthenticationBlueprintApi_SignOut::bClearCredentials' has a wrong offset!");
static_assert(offsetof(AuthenticationBlueprintApi_SignOut, ReturnValue) == 0x000001, "Member 'AuthenticationBlueprintApi_SignOut::ReturnValue' has a wrong offset!");

// DelegateFunction Authentication.AuthenticationBlueprintApi.AuthenticationDeleteUserDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct AuthenticationBlueprintApi_AuthenticationDeleteUserDelegate__DelegateSignature final
{
public:
	bool                                          bResponse;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_AuthenticationDeleteUserDelegate__DelegateSignature) == 0x000001, "Wrong alignment on AuthenticationBlueprintApi_AuthenticationDeleteUserDelegate__DelegateSignature");
static_assert(sizeof(AuthenticationBlueprintApi_AuthenticationDeleteUserDelegate__DelegateSignature) == 0x000001, "Wrong size on AuthenticationBlueprintApi_AuthenticationDeleteUserDelegate__DelegateSignature");
static_assert(offsetof(AuthenticationBlueprintApi_AuthenticationDeleteUserDelegate__DelegateSignature, bResponse) == 0x000000, "Member 'AuthenticationBlueprintApi_AuthenticationDeleteUserDelegate__DelegateSignature::bResponse' has a wrong offset!");

// DelegateFunction Authentication.AuthenticationBlueprintApi.AuthenticationGetUserDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct AuthenticationBlueprintApi_AuthenticationGetUserDelegate__DelegateSignature final
{
public:
	struct FAuthenticationUserResponse            Response;                                          // 0x0000(0x0038)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_AuthenticationGetUserDelegate__DelegateSignature) == 0x000008, "Wrong alignment on AuthenticationBlueprintApi_AuthenticationGetUserDelegate__DelegateSignature");
static_assert(sizeof(AuthenticationBlueprintApi_AuthenticationGetUserDelegate__DelegateSignature) == 0x000038, "Wrong size on AuthenticationBlueprintApi_AuthenticationGetUserDelegate__DelegateSignature");
static_assert(offsetof(AuthenticationBlueprintApi_AuthenticationGetUserDelegate__DelegateSignature, Response) == 0x000000, "Member 'AuthenticationBlueprintApi_AuthenticationGetUserDelegate__DelegateSignature::Response' has a wrong offset!");

// DelegateFunction Authentication.AuthenticationBlueprintApi.AuthenticationPlayerProfileChangedResponseDelegate__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct AuthenticationBlueprintApi_AuthenticationPlayerProfileChangedResponseDelegate__DelegateSignature final
{
public:
	struct FAuthenticationPlayerProfileChangedResponse Response;                                          // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_AuthenticationPlayerProfileChangedResponseDelegate__DelegateSignature) == 0x000008, "Wrong alignment on AuthenticationBlueprintApi_AuthenticationPlayerProfileChangedResponseDelegate__DelegateSignature");
static_assert(sizeof(AuthenticationBlueprintApi_AuthenticationPlayerProfileChangedResponseDelegate__DelegateSignature) == 0x000040, "Wrong size on AuthenticationBlueprintApi_AuthenticationPlayerProfileChangedResponseDelegate__DelegateSignature");
static_assert(offsetof(AuthenticationBlueprintApi_AuthenticationPlayerProfileChangedResponseDelegate__DelegateSignature, Response) == 0x000000, "Member 'AuthenticationBlueprintApi_AuthenticationPlayerProfileChangedResponseDelegate__DelegateSignature::Response' has a wrong offset!");

// DelegateFunction Authentication.AuthenticationBlueprintApi.AuthenticationPlayerProfileDeletedResponseDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct AuthenticationBlueprintApi_AuthenticationPlayerProfileDeletedResponseDelegate__DelegateSignature final
{
public:
	struct FAuthenticationPlayerProfileDeletedResponse Response;                                          // 0x0000(0x0030)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_AuthenticationPlayerProfileDeletedResponseDelegate__DelegateSignature) == 0x000008, "Wrong alignment on AuthenticationBlueprintApi_AuthenticationPlayerProfileDeletedResponseDelegate__DelegateSignature");
static_assert(sizeof(AuthenticationBlueprintApi_AuthenticationPlayerProfileDeletedResponseDelegate__DelegateSignature) == 0x000030, "Wrong size on AuthenticationBlueprintApi_AuthenticationPlayerProfileDeletedResponseDelegate__DelegateSignature");
static_assert(offsetof(AuthenticationBlueprintApi_AuthenticationPlayerProfileDeletedResponseDelegate__DelegateSignature, Response) == 0x000000, "Member 'AuthenticationBlueprintApi_AuthenticationPlayerProfileDeletedResponseDelegate__DelegateSignature::Response' has a wrong offset!");

// DelegateFunction Authentication.AuthenticationBlueprintApi.AuthenticationResponseDelegate__DelegateSignature
// 0x0048 (0x0048 - 0x0000)
struct AuthenticationBlueprintApi_AuthenticationResponseDelegate__DelegateSignature final
{
public:
	struct FAuthenticationResponse                Response;                                          // 0x0000(0x0048)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_AuthenticationResponseDelegate__DelegateSignature) == 0x000008, "Wrong alignment on AuthenticationBlueprintApi_AuthenticationResponseDelegate__DelegateSignature");
static_assert(sizeof(AuthenticationBlueprintApi_AuthenticationResponseDelegate__DelegateSignature) == 0x000048, "Wrong size on AuthenticationBlueprintApi_AuthenticationResponseDelegate__DelegateSignature");
static_assert(offsetof(AuthenticationBlueprintApi_AuthenticationResponseDelegate__DelegateSignature, Response) == 0x000000, "Member 'AuthenticationBlueprintApi_AuthenticationResponseDelegate__DelegateSignature::Response' has a wrong offset!");

// DelegateFunction Authentication.AuthenticationBlueprintApi.AuthenticationStateChangedResponseDelegate__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct AuthenticationBlueprintApi_AuthenticationStateChangedResponseDelegate__DelegateSignature final
{
public:
	struct FAuthenticationStateChangedResponse    Response;                                          // 0x0000(0x0002)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_AuthenticationStateChangedResponseDelegate__DelegateSignature) == 0x000001, "Wrong alignment on AuthenticationBlueprintApi_AuthenticationStateChangedResponseDelegate__DelegateSignature");
static_assert(sizeof(AuthenticationBlueprintApi_AuthenticationStateChangedResponseDelegate__DelegateSignature) == 0x000002, "Wrong size on AuthenticationBlueprintApi_AuthenticationStateChangedResponseDelegate__DelegateSignature");
static_assert(offsetof(AuthenticationBlueprintApi_AuthenticationStateChangedResponseDelegate__DelegateSignature, Response) == 0x000000, "Member 'AuthenticationBlueprintApi_AuthenticationStateChangedResponseDelegate__DelegateSignature::Response' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.RegisterProfileChangedCallback
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_RegisterProfileChangedCallback final
{
public:
	TDelegate<void(const struct FAuthenticationPlayerProfileChangedResponse& Response)> ResponseDelegate;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_RegisterProfileChangedCallback) == 0x000004, "Wrong alignment on AuthenticationBlueprintApi_RegisterProfileChangedCallback");
static_assert(sizeof(AuthenticationBlueprintApi_RegisterProfileChangedCallback) == 0x000010, "Wrong size on AuthenticationBlueprintApi_RegisterProfileChangedCallback");
static_assert(offsetof(AuthenticationBlueprintApi_RegisterProfileChangedCallback, ResponseDelegate) == 0x000000, "Member 'AuthenticationBlueprintApi_RegisterProfileChangedCallback::ResponseDelegate' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.RegisterProfileDeletedCallback
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_RegisterProfileDeletedCallback final
{
public:
	TDelegate<void(const struct FAuthenticationPlayerProfileDeletedResponse& Response)> ResponseDelegate;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_RegisterProfileDeletedCallback) == 0x000004, "Wrong alignment on AuthenticationBlueprintApi_RegisterProfileDeletedCallback");
static_assert(sizeof(AuthenticationBlueprintApi_RegisterProfileDeletedCallback) == 0x000010, "Wrong size on AuthenticationBlueprintApi_RegisterProfileDeletedCallback");
static_assert(offsetof(AuthenticationBlueprintApi_RegisterProfileDeletedCallback, ResponseDelegate) == 0x000000, "Member 'AuthenticationBlueprintApi_RegisterProfileDeletedCallback::ResponseDelegate' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.SwitchProfile
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_SwitchProfile final
{
public:
	class FString                                 ProfileName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_SwitchProfile) == 0x000008, "Wrong alignment on AuthenticationBlueprintApi_SwitchProfile");
static_assert(sizeof(AuthenticationBlueprintApi_SwitchProfile) == 0x000010, "Wrong size on AuthenticationBlueprintApi_SwitchProfile");
static_assert(offsetof(AuthenticationBlueprintApi_SwitchProfile, ProfileName) == 0x000000, "Member 'AuthenticationBlueprintApi_SwitchProfile::ProfileName' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.GetAccessToken
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_GetAccessToken final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_GetAccessToken) == 0x000008, "Wrong alignment on AuthenticationBlueprintApi_GetAccessToken");
static_assert(sizeof(AuthenticationBlueprintApi_GetAccessToken) == 0x000010, "Wrong size on AuthenticationBlueprintApi_GetAccessToken");
static_assert(offsetof(AuthenticationBlueprintApi_GetAccessToken, ReturnValue) == 0x000000, "Member 'AuthenticationBlueprintApi_GetAccessToken::ReturnValue' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.GetCurrentProfileName
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_GetCurrentProfileName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_GetCurrentProfileName) == 0x000008, "Wrong alignment on AuthenticationBlueprintApi_GetCurrentProfileName");
static_assert(sizeof(AuthenticationBlueprintApi_GetCurrentProfileName) == 0x000010, "Wrong size on AuthenticationBlueprintApi_GetCurrentProfileName");
static_assert(offsetof(AuthenticationBlueprintApi_GetCurrentProfileName, ReturnValue) == 0x000000, "Member 'AuthenticationBlueprintApi_GetCurrentProfileName::ReturnValue' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.GetProfileNames
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_GetProfileNames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_GetProfileNames) == 0x000008, "Wrong alignment on AuthenticationBlueprintApi_GetProfileNames");
static_assert(sizeof(AuthenticationBlueprintApi_GetProfileNames) == 0x000010, "Wrong size on AuthenticationBlueprintApi_GetProfileNames");
static_assert(offsetof(AuthenticationBlueprintApi_GetProfileNames, ReturnValue) == 0x000000, "Member 'AuthenticationBlueprintApi_GetProfileNames::ReturnValue' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.GetSessionToken
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_GetSessionToken final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_GetSessionToken) == 0x000008, "Wrong alignment on AuthenticationBlueprintApi_GetSessionToken");
static_assert(sizeof(AuthenticationBlueprintApi_GetSessionToken) == 0x000010, "Wrong size on AuthenticationBlueprintApi_GetSessionToken");
static_assert(offsetof(AuthenticationBlueprintApi_GetSessionToken, ReturnValue) == 0x000000, "Member 'AuthenticationBlueprintApi_GetSessionToken::ReturnValue' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.GetState
// 0x0001 (0x0001 - 0x0000)
struct AuthenticationBlueprintApi_GetState final
{
public:
	EAuthenticationStates                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_GetState) == 0x000001, "Wrong alignment on AuthenticationBlueprintApi_GetState");
static_assert(sizeof(AuthenticationBlueprintApi_GetState) == 0x000001, "Wrong size on AuthenticationBlueprintApi_GetState");
static_assert(offsetof(AuthenticationBlueprintApi_GetState, ReturnValue) == 0x000000, "Member 'AuthenticationBlueprintApi_GetState::ReturnValue' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.GetUnityEnvironmentName
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_GetUnityEnvironmentName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_GetUnityEnvironmentName) == 0x000008, "Wrong alignment on AuthenticationBlueprintApi_GetUnityEnvironmentName");
static_assert(sizeof(AuthenticationBlueprintApi_GetUnityEnvironmentName) == 0x000010, "Wrong size on AuthenticationBlueprintApi_GetUnityEnvironmentName");
static_assert(offsetof(AuthenticationBlueprintApi_GetUnityEnvironmentName, ReturnValue) == 0x000000, "Member 'AuthenticationBlueprintApi_GetUnityEnvironmentName::ReturnValue' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.GetUnityProjectId
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_GetUnityProjectId final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_GetUnityProjectId) == 0x000004, "Wrong alignment on AuthenticationBlueprintApi_GetUnityProjectId");
static_assert(sizeof(AuthenticationBlueprintApi_GetUnityProjectId) == 0x000010, "Wrong size on AuthenticationBlueprintApi_GetUnityProjectId");
static_assert(offsetof(AuthenticationBlueprintApi_GetUnityProjectId, ReturnValue) == 0x000000, "Member 'AuthenticationBlueprintApi_GetUnityProjectId::ReturnValue' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.GetUserId
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_GetUserId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_GetUserId) == 0x000008, "Wrong alignment on AuthenticationBlueprintApi_GetUserId");
static_assert(sizeof(AuthenticationBlueprintApi_GetUserId) == 0x000010, "Wrong size on AuthenticationBlueprintApi_GetUserId");
static_assert(offsetof(AuthenticationBlueprintApi_GetUserId, ReturnValue) == 0x000000, "Member 'AuthenticationBlueprintApi_GetUserId::ReturnValue' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.GetUserInfo
// 0x0010 (0x0010 - 0x0000)
struct AuthenticationBlueprintApi_GetUserInfo final
{
public:
	TDelegate<void(const struct FAuthenticationUserResponse& Response)> ResponseDelegate;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_GetUserInfo) == 0x000004, "Wrong alignment on AuthenticationBlueprintApi_GetUserInfo");
static_assert(sizeof(AuthenticationBlueprintApi_GetUserInfo) == 0x000010, "Wrong size on AuthenticationBlueprintApi_GetUserInfo");
static_assert(offsetof(AuthenticationBlueprintApi_GetUserInfo, ResponseDelegate) == 0x000000, "Member 'AuthenticationBlueprintApi_GetUserInfo::ResponseDelegate' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.IsAnonymous
// 0x0001 (0x0001 - 0x0000)
struct AuthenticationBlueprintApi_IsAnonymous final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_IsAnonymous) == 0x000001, "Wrong alignment on AuthenticationBlueprintApi_IsAnonymous");
static_assert(sizeof(AuthenticationBlueprintApi_IsAnonymous) == 0x000001, "Wrong size on AuthenticationBlueprintApi_IsAnonymous");
static_assert(offsetof(AuthenticationBlueprintApi_IsAnonymous, ReturnValue) == 0x000000, "Member 'AuthenticationBlueprintApi_IsAnonymous::ReturnValue' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.IsAuthorized
// 0x0001 (0x0001 - 0x0000)
struct AuthenticationBlueprintApi_IsAuthorized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_IsAuthorized) == 0x000001, "Wrong alignment on AuthenticationBlueprintApi_IsAuthorized");
static_assert(sizeof(AuthenticationBlueprintApi_IsAuthorized) == 0x000001, "Wrong size on AuthenticationBlueprintApi_IsAuthorized");
static_assert(offsetof(AuthenticationBlueprintApi_IsAuthorized, ReturnValue) == 0x000000, "Member 'AuthenticationBlueprintApi_IsAuthorized::ReturnValue' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.IsExpired
// 0x0001 (0x0001 - 0x0000)
struct AuthenticationBlueprintApi_IsExpired final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_IsExpired) == 0x000001, "Wrong alignment on AuthenticationBlueprintApi_IsExpired");
static_assert(sizeof(AuthenticationBlueprintApi_IsExpired) == 0x000001, "Wrong size on AuthenticationBlueprintApi_IsExpired");
static_assert(offsetof(AuthenticationBlueprintApi_IsExpired, ReturnValue) == 0x000000, "Member 'AuthenticationBlueprintApi_IsExpired::ReturnValue' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.IsSignedIn
// 0x0001 (0x0001 - 0x0000)
struct AuthenticationBlueprintApi_IsSignedIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_IsSignedIn) == 0x000001, "Wrong alignment on AuthenticationBlueprintApi_IsSignedIn");
static_assert(sizeof(AuthenticationBlueprintApi_IsSignedIn) == 0x000001, "Wrong size on AuthenticationBlueprintApi_IsSignedIn");
static_assert(offsetof(AuthenticationBlueprintApi_IsSignedIn, ReturnValue) == 0x000000, "Member 'AuthenticationBlueprintApi_IsSignedIn::ReturnValue' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.ProfileExists
// 0x0018 (0x0018 - 0x0000)
struct AuthenticationBlueprintApi_ProfileExists final
{
public:
	class FString                                 ProfileName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2449[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AuthenticationBlueprintApi_ProfileExists) == 0x000008, "Wrong alignment on AuthenticationBlueprintApi_ProfileExists");
static_assert(sizeof(AuthenticationBlueprintApi_ProfileExists) == 0x000018, "Wrong size on AuthenticationBlueprintApi_ProfileExists");
static_assert(offsetof(AuthenticationBlueprintApi_ProfileExists, ProfileName) == 0x000000, "Member 'AuthenticationBlueprintApi_ProfileExists::ProfileName' has a wrong offset!");
static_assert(offsetof(AuthenticationBlueprintApi_ProfileExists, ReturnValue) == 0x000010, "Member 'AuthenticationBlueprintApi_ProfileExists::ReturnValue' has a wrong offset!");

// Function Authentication.AuthenticationBlueprintApi.SessionTokenExists
// 0x0001 (0x0001 - 0x0000)
struct AuthenticationBlueprintApi_SessionTokenExists final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationBlueprintApi_SessionTokenExists) == 0x000001, "Wrong alignment on AuthenticationBlueprintApi_SessionTokenExists");
static_assert(sizeof(AuthenticationBlueprintApi_SessionTokenExists) == 0x000001, "Wrong size on AuthenticationBlueprintApi_SessionTokenExists");
static_assert(offsetof(AuthenticationBlueprintApi_SessionTokenExists, ReturnValue) == 0x000000, "Member 'AuthenticationBlueprintApi_SessionTokenExists::ReturnValue' has a wrong offset!");

}

