#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_Test

#include "Basic.hpp"

#include "Structure_structs.hpp"


namespace SDK::Params
{

// Function BI_Test.BI_Test_C.NewFunction
// 0x00D0 (0x00D0 - 0x0000)
struct BI_Test_C_NewFunction final
{
public:
	struct FStructure                             Structure_Input;                                   // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	double                                        Directional_Intensity;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Directional_Intensity_Output;                      // 0x00C8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_Test_C_NewFunction) == 0x000008, "Wrong alignment on BI_Test_C_NewFunction");
static_assert(sizeof(BI_Test_C_NewFunction) == 0x0000D0, "Wrong size on BI_Test_C_NewFunction");
static_assert(offsetof(BI_Test_C_NewFunction, Structure_Input) == 0x000000, "Member 'BI_Test_C_NewFunction::Structure_Input' has a wrong offset!");
static_assert(offsetof(BI_Test_C_NewFunction, Directional_Intensity) == 0x0000C0, "Member 'BI_Test_C_NewFunction::Directional_Intensity' has a wrong offset!");
static_assert(offsetof(BI_Test_C_NewFunction, Directional_Intensity_Output) == 0x0000C8, "Member 'BI_Test_C_NewFunction::Directional_Intensity_Output' has a wrong offset!");

// Function BI_Test.BI_Test_C.Whatever
// 0x00C0 (0x00C0 - 0x0000)
struct BI_Test_C_Whatever final
{
public:
	struct FStructure                             WhateverStrut;                                     // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BI_Test_C_Whatever) == 0x000008, "Wrong alignment on BI_Test_C_Whatever");
static_assert(sizeof(BI_Test_C_Whatever) == 0x0000C0, "Wrong size on BI_Test_C_Whatever");
static_assert(offsetof(BI_Test_C_Whatever, WhateverStrut) == 0x000000, "Member 'BI_Test_C_Whatever::WhateverStrut' has a wrong offset!");

}

