#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AI_InterestPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AI_InterestPoint.BP_AI_InterestPoint_C.ExecuteUbergraph_BP_AI_InterestPoint
// 0x0010 (0x0010 - 0x0000)
struct BP_AI_InterestPoint_C_ExecuteUbergraph_BP_AI_InterestPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C5D[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AI_InterestPoint_C_ExecuteUbergraph_BP_AI_InterestPoint) == 0x000008, "Wrong alignment on BP_AI_InterestPoint_C_ExecuteUbergraph_BP_AI_InterestPoint");
static_assert(sizeof(BP_AI_InterestPoint_C_ExecuteUbergraph_BP_AI_InterestPoint) == 0x000010, "Wrong size on BP_AI_InterestPoint_C_ExecuteUbergraph_BP_AI_InterestPoint");
static_assert(offsetof(BP_AI_InterestPoint_C_ExecuteUbergraph_BP_AI_InterestPoint, EntryPoint) == 0x000000, "Member 'BP_AI_InterestPoint_C_ExecuteUbergraph_BP_AI_InterestPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AI_InterestPoint_C_ExecuteUbergraph_BP_AI_InterestPoint, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000004, "Member 'BP_AI_InterestPoint_C_ExecuteUbergraph_BP_AI_InterestPoint::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AI_InterestPoint_C_ExecuteUbergraph_BP_AI_InterestPoint, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000008, "Member 'BP_AI_InterestPoint_C_ExecuteUbergraph_BP_AI_InterestPoint::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

