#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AlarmTriggerComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AlarmTriggerComponent.BP_AlarmTriggerComponent_C.Trigger
// 0x0018 (0x0018 - 0x0000)
struct BP_AlarmTriggerComponent_C_Trigger final
{
public:
	struct FVector                                PlayerLastLocation;                                // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AlarmTriggerComponent_C_Trigger) == 0x000008, "Wrong alignment on BP_AlarmTriggerComponent_C_Trigger");
static_assert(sizeof(BP_AlarmTriggerComponent_C_Trigger) == 0x000018, "Wrong size on BP_AlarmTriggerComponent_C_Trigger");
static_assert(offsetof(BP_AlarmTriggerComponent_C_Trigger, PlayerLastLocation) == 0x000000, "Member 'BP_AlarmTriggerComponent_C_Trigger::PlayerLastLocation' has a wrong offset!");

// Function BP_AlarmTriggerComponent.BP_AlarmTriggerComponent_C.OnTriggerStateChange__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct BP_AlarmTriggerComponent_C_OnTriggerStateChange__DelegateSignature final
{
public:
	class UBP_Component_Trigger_C*                TriggerComp;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_Triggered;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A07[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PlayerLastLocation;                                // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AlarmTriggerComponent_C_OnTriggerStateChange__DelegateSignature) == 0x000008, "Wrong alignment on BP_AlarmTriggerComponent_C_OnTriggerStateChange__DelegateSignature");
static_assert(sizeof(BP_AlarmTriggerComponent_C_OnTriggerStateChange__DelegateSignature) == 0x000028, "Wrong size on BP_AlarmTriggerComponent_C_OnTriggerStateChange__DelegateSignature");
static_assert(offsetof(BP_AlarmTriggerComponent_C_OnTriggerStateChange__DelegateSignature, TriggerComp) == 0x000000, "Member 'BP_AlarmTriggerComponent_C_OnTriggerStateChange__DelegateSignature::TriggerComp' has a wrong offset!");
static_assert(offsetof(BP_AlarmTriggerComponent_C_OnTriggerStateChange__DelegateSignature, Param_Triggered) == 0x000008, "Member 'BP_AlarmTriggerComponent_C_OnTriggerStateChange__DelegateSignature::Param_Triggered' has a wrong offset!");
static_assert(offsetof(BP_AlarmTriggerComponent_C_OnTriggerStateChange__DelegateSignature, PlayerLastLocation) == 0x000010, "Member 'BP_AlarmTriggerComponent_C_OnTriggerStateChange__DelegateSignature::PlayerLastLocation' has a wrong offset!");

// Function BP_AlarmTriggerComponent.BP_AlarmTriggerComponent_C.isTriggered
// 0x0001 (0x0001 - 0x0000)
struct BP_AlarmTriggerComponent_C_IsTriggered final
{
public:
	bool                                          Param_Triggered;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AlarmTriggerComponent_C_IsTriggered) == 0x000001, "Wrong alignment on BP_AlarmTriggerComponent_C_IsTriggered");
static_assert(sizeof(BP_AlarmTriggerComponent_C_IsTriggered) == 0x000001, "Wrong size on BP_AlarmTriggerComponent_C_IsTriggered");
static_assert(offsetof(BP_AlarmTriggerComponent_C_IsTriggered, Param_Triggered) == 0x000000, "Member 'BP_AlarmTriggerComponent_C_IsTriggered::Param_Triggered' has a wrong offset!");

// Function BP_AlarmTriggerComponent.BP_AlarmTriggerComponent_C.ExecuteUbergraph_BP_AlarmTriggerComponent
// 0x0028 (0x0028 - 0x0000)
struct BP_AlarmTriggerComponent_C_ExecuteUbergraph_BP_AlarmTriggerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A08[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_PlayerLastLocation;             // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AlarmTriggerComponent_C_ExecuteUbergraph_BP_AlarmTriggerComponent) == 0x000008, "Wrong alignment on BP_AlarmTriggerComponent_C_ExecuteUbergraph_BP_AlarmTriggerComponent");
static_assert(sizeof(BP_AlarmTriggerComponent_C_ExecuteUbergraph_BP_AlarmTriggerComponent) == 0x000028, "Wrong size on BP_AlarmTriggerComponent_C_ExecuteUbergraph_BP_AlarmTriggerComponent");
static_assert(offsetof(BP_AlarmTriggerComponent_C_ExecuteUbergraph_BP_AlarmTriggerComponent, EntryPoint) == 0x000000, "Member 'BP_AlarmTriggerComponent_C_ExecuteUbergraph_BP_AlarmTriggerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AlarmTriggerComponent_C_ExecuteUbergraph_BP_AlarmTriggerComponent, K2Node_CustomEvent_PlayerLastLocation) == 0x000008, "Member 'BP_AlarmTriggerComponent_C_ExecuteUbergraph_BP_AlarmTriggerComponent::K2Node_CustomEvent_PlayerLastLocation' has a wrong offset!");
static_assert(offsetof(BP_AlarmTriggerComponent_C_ExecuteUbergraph_BP_AlarmTriggerComponent, CallFunc_IsServer_ReturnValue) == 0x000020, "Member 'BP_AlarmTriggerComponent_C_ExecuteUbergraph_BP_AlarmTriggerComponent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AlarmTriggerComponent_C_ExecuteUbergraph_BP_AlarmTriggerComponent, CallFunc_IsServer_ReturnValue_1) == 0x000021, "Member 'BP_AlarmTriggerComponent_C_ExecuteUbergraph_BP_AlarmTriggerComponent::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");

}

