#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ATPCScript_UnlinkCharacterControllerRotation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AdvancedThirdPersonCamera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ATPCScript_UnlinkCharacterControllerRotation.BP_ATPCScript_UnlinkCharacterControllerRotation_C
// 0x0010 (0x0050 - 0x0040)
class UBP_ATPCScript_UnlinkCharacterControllerRotation_C final : public UATPCCameraModeScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Previous_Use_Controller_Rotation_Yaw;              // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceTrueOnExit;                                   // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation(int32 EntryPoint);
	void K2_OnEnterCameraMode(class UATPCCameraComponent* Camera);
	void K2_OnExitCameraMode(class UATPCCameraComponent* Camera);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ATPCScript_UnlinkCharacterControllerRotation_C">();
	}
	static class UBP_ATPCScript_UnlinkCharacterControllerRotation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ATPCScript_UnlinkCharacterControllerRotation_C>();
	}
};
static_assert(alignof(UBP_ATPCScript_UnlinkCharacterControllerRotation_C) == 0x000008, "Wrong alignment on UBP_ATPCScript_UnlinkCharacterControllerRotation_C");
static_assert(sizeof(UBP_ATPCScript_UnlinkCharacterControllerRotation_C) == 0x000050, "Wrong size on UBP_ATPCScript_UnlinkCharacterControllerRotation_C");
static_assert(offsetof(UBP_ATPCScript_UnlinkCharacterControllerRotation_C, UberGraphFrame) == 0x000040, "Member 'UBP_ATPCScript_UnlinkCharacterControllerRotation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ATPCScript_UnlinkCharacterControllerRotation_C, Previous_Use_Controller_Rotation_Yaw) == 0x000048, "Member 'UBP_ATPCScript_UnlinkCharacterControllerRotation_C::Previous_Use_Controller_Rotation_Yaw' has a wrong offset!");
static_assert(offsetof(UBP_ATPCScript_UnlinkCharacterControllerRotation_C, ForceTrueOnExit) == 0x000049, "Member 'UBP_ATPCScript_UnlinkCharacterControllerRotation_C::ForceTrueOnExit' has a wrong offset!");

}

