#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIProcessTarget

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AIProcessTarget.BP_AIProcessTarget_C.ExecuteUbergraph_BP_AIProcessTarget
// 0x0140 (0x0140 - 0x0000)
struct BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5977[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawnOwner_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCVoiceComponent_C*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartSound_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5978[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzAIController*                        CallFunc_GetAIController_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActorPerceptionUpdateInfo             K2Node_CustomEvent_UpdateInfo;                     // 0x0028(0x0068)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5979[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAISense>                   CallFunc_GetSenseClassForStimulus_ReturnValue;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_597A[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIPerceptionComponent*                 CallFunc_GetAIPerceptionComponent_ReturnValue;     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_597B[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_597C[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FActorPerceptionUpdateInfo& UpdateInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_597D[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_597E[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzAIController*                        CallFunc_GetAIController_ReturnValue_1;            // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzAIController*                        CallFunc_GetAIController_ReturnValue_2;            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawnOwner_ReturnValue_1;               // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetTeamAttitude_ReturnValue;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_597F[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzAIController*                        CallFunc_GetAIController_ReturnValue_3;            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryAddUniqueTarget_ReturnValue;           // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryAddUniqueTarget_ReturnValue_1;         // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryAddUniqueTarget_ReturnValue_2;         // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryAddUniqueTarget_ReturnValue_3;         // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5980[0x3];                                     // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RequestControllerSenseTeamEvent_EventRange_ImplicitCast; // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RequestControllerPredictionEvent_PredictionTime_ImplicitCast; // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RequestControllerSenseTeamEvent_EventRange_ImplicitCast_1; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget) == 0x000008, "Wrong alignment on BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget");
static_assert(sizeof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget) == 0x000140, "Wrong size on BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, EntryPoint) == 0x000000, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_GetPawnOwner_ReturnValue) == 0x000008, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_GetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_StartSound_ReturnValue) == 0x000019, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_StartSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_GetAIController_ReturnValue) == 0x000020, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, K2Node_CustomEvent_UpdateInfo) == 0x000028, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::K2Node_CustomEvent_UpdateInfo' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_GetSenseClassForStimulus_ReturnValue) == 0x000098, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_GetSenseClassForStimulus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_GetClassDisplayName_ReturnValue) == 0x0000A0, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B0, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, K2Node_SwitchName_CmpSuccess) == 0x0000B8, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_GetAIPerceptionComponent_ReturnValue) == 0x0000C0, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_GetAIPerceptionComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, K2Node_Event_EndPlayReason) == 0x0000C8, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_GetOwner_ReturnValue) == 0x0000D0, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_HasAuthority_ReturnValue) == 0x0000D8, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, K2Node_CreateDelegate_OutputDelegate) == 0x0000DC, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_GetOwner_ReturnValue_1) == 0x0000F0, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_HasAuthority_ReturnValue_1) == 0x0000F8, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_GetAIController_ReturnValue_1) == 0x000100, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_GetAIController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_GetAIController_ReturnValue_2) == 0x000108, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_GetAIController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_GetPawnOwner_ReturnValue_1) == 0x000110, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_GetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_GetTeamAttitude_ReturnValue) == 0x000118, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_GetTeamAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_GetAIController_ReturnValue_3) == 0x000120, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_GetAIController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, K2Node_SwitchEnum_CmpSuccess) == 0x000128, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_TryAddUniqueTarget_ReturnValue) == 0x000129, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_TryAddUniqueTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_TryAddUniqueTarget_ReturnValue_1) == 0x00012A, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_TryAddUniqueTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_TryAddUniqueTarget_ReturnValue_2) == 0x00012B, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_TryAddUniqueTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_TryAddUniqueTarget_ReturnValue_3) == 0x00012C, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_TryAddUniqueTarget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_RequestControllerSenseTeamEvent_EventRange_ImplicitCast) == 0x000130, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_RequestControllerSenseTeamEvent_EventRange_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_RequestControllerPredictionEvent_PredictionTime_ImplicitCast) == 0x000134, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_RequestControllerPredictionEvent_PredictionTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget, CallFunc_RequestControllerSenseTeamEvent_EventRange_ImplicitCast_1) == 0x000138, "Member 'BP_AIProcessTarget_C_ExecuteUbergraph_BP_AIProcessTarget::CallFunc_RequestControllerSenseTeamEvent_EventRange_ImplicitCast_1' has a wrong offset!");

// Function BP_AIProcessTarget.BP_AIProcessTarget_C.OnTargetPerceptionInfoUpdated
// 0x0068 (0x0068 - 0x0000)
struct BP_AIProcessTarget_C_OnTargetPerceptionInfoUpdated final
{
public:
	struct FActorPerceptionUpdateInfo             UpdateInfo;                                        // 0x0000(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_AIProcessTarget_C_OnTargetPerceptionInfoUpdated) == 0x000008, "Wrong alignment on BP_AIProcessTarget_C_OnTargetPerceptionInfoUpdated");
static_assert(sizeof(BP_AIProcessTarget_C_OnTargetPerceptionInfoUpdated) == 0x000068, "Wrong size on BP_AIProcessTarget_C_OnTargetPerceptionInfoUpdated");
static_assert(offsetof(BP_AIProcessTarget_C_OnTargetPerceptionInfoUpdated, UpdateInfo) == 0x000000, "Member 'BP_AIProcessTarget_C_OnTargetPerceptionInfoUpdated::UpdateInfo' has a wrong offset!");

// Function BP_AIProcessTarget.BP_AIProcessTarget_C.PlaySound
// 0x0040 (0x0040 - 0x0000)
struct BP_AIProcessTarget_C_PlaySound final
{
public:
	struct FGameplayTag                           AITag;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5981[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAIVoiceComponent*                    AIVoiceCmp;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzAIController*                        Controller;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5982[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAIVoiceComponent*                    CallFunc_GetAIVoiceComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzAIController*                        CallFunc_GetAIController_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartSound_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIProcessTarget_C_PlaySound) == 0x000008, "Wrong alignment on BP_AIProcessTarget_C_PlaySound");
static_assert(sizeof(BP_AIProcessTarget_C_PlaySound) == 0x000040, "Wrong size on BP_AIProcessTarget_C_PlaySound");
static_assert(offsetof(BP_AIProcessTarget_C_PlaySound, AITag) == 0x000000, "Member 'BP_AIProcessTarget_C_PlaySound::AITag' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_PlaySound, Return) == 0x000008, "Member 'BP_AIProcessTarget_C_PlaySound::Return' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_PlaySound, AIVoiceCmp) == 0x000010, "Member 'BP_AIProcessTarget_C_PlaySound::AIVoiceCmp' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_PlaySound, Controller) == 0x000018, "Member 'BP_AIProcessTarget_C_PlaySound::Controller' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_PlaySound, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_AIProcessTarget_C_PlaySound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_PlaySound, CallFunc_GetAIVoiceComponent_ReturnValue) == 0x000028, "Member 'BP_AIProcessTarget_C_PlaySound::CallFunc_GetAIVoiceComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_PlaySound, CallFunc_GetAIController_ReturnValue) == 0x000030, "Member 'BP_AIProcessTarget_C_PlaySound::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_PlaySound, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_AIProcessTarget_C_PlaySound::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIProcessTarget_C_PlaySound, CallFunc_StartSound_ReturnValue) == 0x000039, "Member 'BP_AIProcessTarget_C_PlaySound::CallFunc_StartSound_ReturnValue' has a wrong offset!");

// Function BP_AIProcessTarget.BP_AIProcessTarget_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_AIProcessTarget_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIProcessTarget_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_AIProcessTarget_C_ReceiveEndPlay");
static_assert(sizeof(BP_AIProcessTarget_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_AIProcessTarget_C_ReceiveEndPlay");
static_assert(offsetof(BP_AIProcessTarget_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_AIProcessTarget_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

