#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ATPCScript_CharacterFadeDistance

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ATPCScript_CharacterFadeDistance.BP_ATPCScript_CharacterFadeDistance_C.ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance
// 0x0020 (0x0020 - 0x0000)
struct BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UATPCCameraComponent*                   K2Node_Event_Camera_1;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraComponent*                   K2Node_Event_Camera;                               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance) == 0x000008, "Wrong alignment on BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance");
static_assert(sizeof(BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance) == 0x000020, "Wrong size on BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance");
static_assert(offsetof(BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance, EntryPoint) == 0x000000, "Member 'BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance, K2Node_Event_Camera_1) == 0x000008, "Member 'BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance::K2Node_Event_Camera_1' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance, K2Node_Event_Camera) == 0x000010, "Member 'BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance::K2Node_Event_Camera' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000018, "Member 'BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x00001C, "Member 'BP_ATPCScript_CharacterFadeDistance_C_ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

// Function BP_ATPCScript_CharacterFadeDistance.BP_ATPCScript_CharacterFadeDistance_C.K2_OnEnterCameraMode
// 0x0008 (0x0008 - 0x0000)
struct BP_ATPCScript_CharacterFadeDistance_C_K2_OnEnterCameraMode final
{
public:
	class UATPCCameraComponent*                   Camera;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ATPCScript_CharacterFadeDistance_C_K2_OnEnterCameraMode) == 0x000008, "Wrong alignment on BP_ATPCScript_CharacterFadeDistance_C_K2_OnEnterCameraMode");
static_assert(sizeof(BP_ATPCScript_CharacterFadeDistance_C_K2_OnEnterCameraMode) == 0x000008, "Wrong size on BP_ATPCScript_CharacterFadeDistance_C_K2_OnEnterCameraMode");
static_assert(offsetof(BP_ATPCScript_CharacterFadeDistance_C_K2_OnEnterCameraMode, Camera) == 0x000000, "Member 'BP_ATPCScript_CharacterFadeDistance_C_K2_OnEnterCameraMode::Camera' has a wrong offset!");

// Function BP_ATPCScript_CharacterFadeDistance.BP_ATPCScript_CharacterFadeDistance_C.K2_OnExitCameraMode
// 0x0008 (0x0008 - 0x0000)
struct BP_ATPCScript_CharacterFadeDistance_C_K2_OnExitCameraMode final
{
public:
	class UATPCCameraComponent*                   Camera;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ATPCScript_CharacterFadeDistance_C_K2_OnExitCameraMode) == 0x000008, "Wrong alignment on BP_ATPCScript_CharacterFadeDistance_C_K2_OnExitCameraMode");
static_assert(sizeof(BP_ATPCScript_CharacterFadeDistance_C_K2_OnExitCameraMode) == 0x000008, "Wrong size on BP_ATPCScript_CharacterFadeDistance_C_K2_OnExitCameraMode");
static_assert(offsetof(BP_ATPCScript_CharacterFadeDistance_C_K2_OnExitCameraMode, Camera) == 0x000000, "Member 'BP_ATPCScript_CharacterFadeDistance_C_K2_OnExitCameraMode::Camera' has a wrong offset!");

}

