#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ATPCScript_CharacterFadeDistance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AdvancedThirdPersonCamera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ATPCScript_CharacterFadeDistance.BP_ATPCScript_CharacterFadeDistance_C
// 0x0018 (0x0058 - 0x0040)
class UBP_ATPCScript_CharacterFadeDistance_C final : public UATPCCameraModeScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         OriginalFadeDistance;                              // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5799[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TargetFadeDistance;                                // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ATPCScript_CharacterFadeDistance(int32 EntryPoint);
	void K2_OnEnterCameraMode(class UATPCCameraComponent* Camera);
	void K2_OnExitCameraMode(class UATPCCameraComponent* Camera);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ATPCScript_CharacterFadeDistance_C">();
	}
	static class UBP_ATPCScript_CharacterFadeDistance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ATPCScript_CharacterFadeDistance_C>();
	}
};
static_assert(alignof(UBP_ATPCScript_CharacterFadeDistance_C) == 0x000008, "Wrong alignment on UBP_ATPCScript_CharacterFadeDistance_C");
static_assert(sizeof(UBP_ATPCScript_CharacterFadeDistance_C) == 0x000058, "Wrong size on UBP_ATPCScript_CharacterFadeDistance_C");
static_assert(offsetof(UBP_ATPCScript_CharacterFadeDistance_C, UberGraphFrame) == 0x000040, "Member 'UBP_ATPCScript_CharacterFadeDistance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ATPCScript_CharacterFadeDistance_C, OriginalFadeDistance) == 0x000048, "Member 'UBP_ATPCScript_CharacterFadeDistance_C::OriginalFadeDistance' has a wrong offset!");
static_assert(offsetof(UBP_ATPCScript_CharacterFadeDistance_C, TargetFadeDistance) == 0x000050, "Member 'UBP_ATPCScript_CharacterFadeDistance_C::TargetFadeDistance' has a wrong offset!");

}

