#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ApplyEffectTrigger

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GzGameplayEffectsHandleArray_structs.hpp"


namespace SDK::Params
{

// Function BP_ApplyEffectTrigger.BP_ApplyEffectTrigger_C.ApplyGameplayEffects
// 0x0040 (0x0040 - 0x0000)
struct BP_ApplyEffectTrigger_C_ApplyGameplayEffects final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6949[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_694A[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApplyEffectTrigger_C_ApplyGameplayEffects) == 0x000008, "Wrong alignment on BP_ApplyEffectTrigger_C_ApplyGameplayEffects");
static_assert(sizeof(BP_ApplyEffectTrigger_C_ApplyGameplayEffects) == 0x000040, "Wrong size on BP_ApplyEffectTrigger_C_ApplyGameplayEffects");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ApplyGameplayEffects, Actor) == 0x000000, "Member 'BP_ApplyEffectTrigger_C_ApplyGameplayEffects::Actor' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ApplyGameplayEffects, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'BP_ApplyEffectTrigger_C_ApplyGameplayEffects::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ApplyGameplayEffects, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_ApplyEffectTrigger_C_ApplyGameplayEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ApplyGameplayEffects, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_ApplyEffectTrigger_C_ApplyGameplayEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ApplyGameplayEffects, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_ApplyEffectTrigger_C_ApplyGameplayEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ApplyGameplayEffects, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_ApplyEffectTrigger_C_ApplyGameplayEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ApplyGameplayEffects, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_ApplyEffectTrigger_C_ApplyGameplayEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ApplyGameplayEffects, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00002C, "Member 'BP_ApplyEffectTrigger_C_ApplyGameplayEffects::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ApplyGameplayEffects, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_ApplyEffectTrigger_C_ApplyGameplayEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ApplyGameplayEffects, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'BP_ApplyEffectTrigger_C_ApplyGameplayEffects::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_ApplyEffectTrigger.BP_ApplyEffectTrigger_C.ApplyTags
// 0x0010 (0x0010 - 0x0000)
struct BP_ApplyEffectTrigger_C_ApplyTags final
{
public:
	class AGzCharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApplyEffectTrigger_C_ApplyTags) == 0x000008, "Wrong alignment on BP_ApplyEffectTrigger_C_ApplyTags");
static_assert(sizeof(BP_ApplyEffectTrigger_C_ApplyTags) == 0x000010, "Wrong size on BP_ApplyEffectTrigger_C_ApplyTags");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ApplyTags, Character) == 0x000000, "Member 'BP_ApplyEffectTrigger_C_ApplyTags::Character' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ApplyTags, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x000008, "Member 'BP_ApplyEffectTrigger_C_ApplyTags::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");

// Function BP_ApplyEffectTrigger.BP_ApplyEffectTrigger_C.ExecuteUbergraph_BP_ApplyEffectTrigger
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_694B[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character_1;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_694C[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           Temp_object_Variable;                              // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_694D[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           Temp_object_Variable_1;                            // 0x0058(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGzGameplayEffectsHandleArray          CallFunc_Map_Find_Value;                           // 0x0060(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_694E[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger) == 0x000008, "Wrong alignment on BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger");
static_assert(sizeof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger) == 0x0000A8, "Wrong size on BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, EntryPoint) == 0x000000, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, K2Node_Event_OtherActor_1) == 0x000010, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, K2Node_Event_OtherActor) == 0x000018, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, K2Node_DynamicCast_AsGz_Character) == 0x000020, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, K2Node_DynamicCast_AsGz_Character_1) == 0x000030, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::K2Node_DynamicCast_AsGz_Character_1' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000040, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, Temp_object_Variable) == 0x000048, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, CallFunc_Map_Remove_ReturnValue) == 0x000050, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, Temp_object_Variable_1) == 0x000058, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, CallFunc_Map_Find_Value) == 0x000060, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, CallFunc_Map_Find_ReturnValue) == 0x000090, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, CallFunc_Array_Get_Item) == 0x000098, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x0000A1, "Member 'BP_ApplyEffectTrigger_C_ExecuteUbergraph_BP_ApplyEffectTrigger::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");

// Function BP_ApplyEffectTrigger.BP_ApplyEffectTrigger_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_ApplyEffectTrigger_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApplyEffectTrigger_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_ApplyEffectTrigger_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_ApplyEffectTrigger_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_ApplyEffectTrigger_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_ApplyEffectTrigger_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_ApplyEffectTrigger.BP_ApplyEffectTrigger_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_ApplyEffectTrigger_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApplyEffectTrigger_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_ApplyEffectTrigger_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_ApplyEffectTrigger_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_ApplyEffectTrigger_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_ApplyEffectTrigger_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_ApplyEffectTrigger_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

}

