#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ATPCScript_InterpolateCameraRotation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AdvancedThirdPersonCamera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ATPCScript_InterpolateCameraRotation.BP_ATPCScript_InterpolateCameraRotation_C
// 0x0058 (0x0098 - 0x0040)
class UBP_ATPCScript_InterpolateCameraRotation_C final : public UATPCCameraModeScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        InterpolationSpeed;                                // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               StartRotation;                                     // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               TargetRotation;                                    // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseRotationCurve;                                  // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5786[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           RotationCurve;                                     // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TimeInMode;                                        // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation(int32 EntryPoint);
	void InterpolateToTargetRotation(double DeltaSeconds, const struct FRotator& ActualTargetRotation);
	void K2_OnEnterCameraMode(class UATPCCameraComponent* Camera);
	void K2_Tick(class UATPCCameraComponent* Camera, float DeltaSeconds);
	void UpdateRotation(double DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ATPCScript_InterpolateCameraRotation_C">();
	}
	static class UBP_ATPCScript_InterpolateCameraRotation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ATPCScript_InterpolateCameraRotation_C>();
	}
};
static_assert(alignof(UBP_ATPCScript_InterpolateCameraRotation_C) == 0x000008, "Wrong alignment on UBP_ATPCScript_InterpolateCameraRotation_C");
static_assert(sizeof(UBP_ATPCScript_InterpolateCameraRotation_C) == 0x000098, "Wrong size on UBP_ATPCScript_InterpolateCameraRotation_C");
static_assert(offsetof(UBP_ATPCScript_InterpolateCameraRotation_C, UberGraphFrame) == 0x000040, "Member 'UBP_ATPCScript_InterpolateCameraRotation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ATPCScript_InterpolateCameraRotation_C, InterpolationSpeed) == 0x000048, "Member 'UBP_ATPCScript_InterpolateCameraRotation_C::InterpolationSpeed' has a wrong offset!");
static_assert(offsetof(UBP_ATPCScript_InterpolateCameraRotation_C, StartRotation) == 0x000050, "Member 'UBP_ATPCScript_InterpolateCameraRotation_C::StartRotation' has a wrong offset!");
static_assert(offsetof(UBP_ATPCScript_InterpolateCameraRotation_C, TargetRotation) == 0x000068, "Member 'UBP_ATPCScript_InterpolateCameraRotation_C::TargetRotation' has a wrong offset!");
static_assert(offsetof(UBP_ATPCScript_InterpolateCameraRotation_C, UseRotationCurve) == 0x000080, "Member 'UBP_ATPCScript_InterpolateCameraRotation_C::UseRotationCurve' has a wrong offset!");
static_assert(offsetof(UBP_ATPCScript_InterpolateCameraRotation_C, RotationCurve) == 0x000088, "Member 'UBP_ATPCScript_InterpolateCameraRotation_C::RotationCurve' has a wrong offset!");
static_assert(offsetof(UBP_ATPCScript_InterpolateCameraRotation_C, TimeInMode) == 0x000090, "Member 'UBP_ATPCScript_InterpolateCameraRotation_C::TimeInMode' has a wrong offset!");

}

