#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AlarmTriggerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AlarmTriggerComponent.BP_AlarmTriggerComponent_C
// 0x0020 (0x00C8 - 0x00A8)
class UBP_AlarmTriggerComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Triggered;                                         // 0x00B0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A06[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnTriggerStateChange;                              // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Trigger(const struct FVector& PlayerLastLocation);
	void Reset();
	void OnTriggerStateChange__DelegateSignature(class UBP_Component_Trigger_C* TriggerComp, bool Param_Triggered, const struct FVector& PlayerLastLocation);
	void OnRep_Triggered();
	void IsTriggered(bool* Param_Triggered);
	void ExecuteUbergraph_BP_AlarmTriggerComponent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AlarmTriggerComponent_C">();
	}
	static class UBP_AlarmTriggerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AlarmTriggerComponent_C>();
	}
};
static_assert(alignof(UBP_AlarmTriggerComponent_C) == 0x000008, "Wrong alignment on UBP_AlarmTriggerComponent_C");
static_assert(sizeof(UBP_AlarmTriggerComponent_C) == 0x0000C8, "Wrong size on UBP_AlarmTriggerComponent_C");
static_assert(offsetof(UBP_AlarmTriggerComponent_C, UberGraphFrame) == 0x0000A8, "Member 'UBP_AlarmTriggerComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AlarmTriggerComponent_C, Triggered) == 0x0000B0, "Member 'UBP_AlarmTriggerComponent_C::Triggered' has a wrong offset!");
static_assert(offsetof(UBP_AlarmTriggerComponent_C, OnTriggerStateChange) == 0x0000B8, "Member 'UBP_AlarmTriggerComponent_C::OnTriggerStateChange' has a wrong offset!");

}

