#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AKSoundSource

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AKSoundSource.BP_AKSoundSource_C
// 0x0020 (0x02C0 - 0x02A0)
class ABP_AKSoundSource_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          StartSound;                                        // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void AttachToOwner();
	void CustomEvent(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo);
	void ExecuteUbergraph_BP_AKSoundSource(int32 EntryPoint);
	void Play(class UAkAudioEvent* AkEvent);
	void PlayAndDestroy(class UAkAudioEvent* AkEvent, double MaxTime);
	void PlayStartSound();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AKSoundSource_C">();
	}
	static class ABP_AKSoundSource_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AKSoundSource_C>();
	}
};
static_assert(alignof(ABP_AKSoundSource_C) == 0x000008, "Wrong alignment on ABP_AKSoundSource_C");
static_assert(sizeof(ABP_AKSoundSource_C) == 0x0002C0, "Wrong size on ABP_AKSoundSource_C");
static_assert(offsetof(ABP_AKSoundSource_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_AKSoundSource_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AKSoundSource_C, Ak) == 0x0002A8, "Member 'ABP_AKSoundSource_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_AKSoundSource_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_AKSoundSource_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AKSoundSource_C, StartSound) == 0x0002B8, "Member 'ABP_AKSoundSource_C::StartSound' has a wrong offset!");

}

