#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ATPCScript_InterpolateCameraRotation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ATPCScript_InterpolateCameraRotation.BP_ATPCScript_InterpolateCameraRotation_C.ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation
// 0x0058 (0x0058 - 0x0000)
struct BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5787[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UATPCCameraComponent*                   K2Node_Event_Camera_1;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraComponent*                   K2Node_Event_Camera;                               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5788[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_UpdateRotation_DeltaSeconds_ImplicitCast; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation) == 0x000008, "Wrong alignment on BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation");
static_assert(sizeof(BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation) == 0x000058, "Wrong size on BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation, EntryPoint) == 0x000000, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation, K2Node_Event_Camera_1) == 0x000008, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation::K2Node_Event_Camera_1' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation, K2Node_Event_Camera) == 0x000010, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation::K2Node_Event_Camera' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation, CallFunc_GetControlRotation_ReturnValue) == 0x000030, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation, CallFunc_UpdateRotation_DeltaSeconds_ImplicitCast) == 0x000048, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation::CallFunc_UpdateRotation_DeltaSeconds_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_ExecuteUbergraph_BP_ATPCScript_InterpolateCameraRotation::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_ATPCScript_InterpolateCameraRotation.BP_ATPCScript_InterpolateCameraRotation_C.InterpolateToTargetRotation
// 0x00C0 (0x00C0 - 0x0000)
struct BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation final
{
public:
	double                                        DeltaSeconds;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ActualTargetRotation;                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5789[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578A[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RInterpTo_DeltaTime_ImplicitCast;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578B[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RInterpTo_InterpSpeed_ImplicitCast;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578C[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation) == 0x000008, "Wrong alignment on BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation");
static_assert(sizeof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation) == 0x0000C0, "Wrong size on BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, DeltaSeconds) == 0x000000, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, ActualTargetRotation) == 0x000008, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::ActualTargetRotation' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_BreakRotator_Roll) == 0x000020, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_BreakRotator_Pitch) == 0x000024, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_BreakRotator_Yaw) == 0x000028, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_BreakRotator_Roll_1) == 0x000038, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_BreakRotator_Pitch_1) == 0x00003C, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_BreakRotator_Yaw_1) == 0x000040, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_GetControlRotation_ReturnValue) == 0x000048, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_MakeRotator_ReturnValue) == 0x000068, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_RInterpTo_ReturnValue) == 0x000080, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_RInterpTo_DeltaTime_ImplicitCast) == 0x000098, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_RInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0000A0, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_RInterpTo_InterpSpeed_ImplicitCast) == 0x0000A8, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_RInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0000B0, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0000B8, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_InterpolateToTargetRotation::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_ATPCScript_InterpolateCameraRotation.BP_ATPCScript_InterpolateCameraRotation_C.K2_OnEnterCameraMode
// 0x0008 (0x0008 - 0x0000)
struct BP_ATPCScript_InterpolateCameraRotation_C_K2_OnEnterCameraMode final
{
public:
	class UATPCCameraComponent*                   Camera;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ATPCScript_InterpolateCameraRotation_C_K2_OnEnterCameraMode) == 0x000008, "Wrong alignment on BP_ATPCScript_InterpolateCameraRotation_C_K2_OnEnterCameraMode");
static_assert(sizeof(BP_ATPCScript_InterpolateCameraRotation_C_K2_OnEnterCameraMode) == 0x000008, "Wrong size on BP_ATPCScript_InterpolateCameraRotation_C_K2_OnEnterCameraMode");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_K2_OnEnterCameraMode, Camera) == 0x000000, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_K2_OnEnterCameraMode::Camera' has a wrong offset!");

// Function BP_ATPCScript_InterpolateCameraRotation.BP_ATPCScript_InterpolateCameraRotation_C.K2_Tick
// 0x0010 (0x0010 - 0x0000)
struct BP_ATPCScript_InterpolateCameraRotation_C_K2_Tick final
{
public:
	class UATPCCameraComponent*                   Camera;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ATPCScript_InterpolateCameraRotation_C_K2_Tick) == 0x000008, "Wrong alignment on BP_ATPCScript_InterpolateCameraRotation_C_K2_Tick");
static_assert(sizeof(BP_ATPCScript_InterpolateCameraRotation_C_K2_Tick) == 0x000010, "Wrong size on BP_ATPCScript_InterpolateCameraRotation_C_K2_Tick");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_K2_Tick, Camera) == 0x000000, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_K2_Tick::Camera' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_K2_Tick, DeltaSeconds) == 0x000008, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_K2_Tick::DeltaSeconds' has a wrong offset!");

// Function BP_ATPCScript_InterpolateCameraRotation.BP_ATPCScript_InterpolateCameraRotation_C.UpdateRotation
// 0x0060 (0x0060 - 0x0000)
struct BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation final
{
public:
	double                                        DeltaSeconds;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorValue_ReturnValue;               // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetVectorValue_InTime_ImplicitCast;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation) == 0x000008, "Wrong alignment on BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation");
static_assert(sizeof(BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation) == 0x000060, "Wrong size on BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation, DeltaSeconds) == 0x000000, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation, CallFunc_GetVectorValue_ReturnValue) == 0x000008, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation::CallFunc_GetVectorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation, CallFunc_BreakVector_X) == 0x000020, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation, CallFunc_BreakVector_Y) == 0x000028, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation, CallFunc_BreakVector_Z) == 0x000030, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation, CallFunc_MakeRotator_ReturnValue) == 0x000038, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation, CallFunc_GetVectorValue_InTime_ImplicitCast) == 0x000050, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation::CallFunc_GetVectorValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000054, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x000058, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x00005C, "Member 'BP_ATPCScript_InterpolateCameraRotation_C_UpdateRotation::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

}

