#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ATPCScript_UnlinkCharacterControllerRotation

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ATPCScript_UnlinkCharacterControllerRotation.BP_ATPCScript_UnlinkCharacterControllerRotation_C.ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation
// 0x0048 (0x0048 - 0x0000)
struct BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5717[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UATPCCameraComponent*                   K2Node_Event_Camera_1;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraComponent*                   K2Node_Event_Camera;                               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5718[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character_1;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation) == 0x000008, "Wrong alignment on BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation");
static_assert(sizeof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation) == 0x000048, "Wrong size on BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation");
static_assert(offsetof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation, EntryPoint) == 0x000000, "Member 'BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation, Temp_bool_Variable) == 0x000004, "Member 'BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation, Temp_bool_Variable_1) == 0x000005, "Member 'BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation, K2Node_Event_Camera_1) == 0x000008, "Member 'BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation::K2Node_Event_Camera_1' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation, K2Node_Event_Camera) == 0x000010, "Member 'BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation::K2Node_Event_Camera' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000018, "Member 'BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000020, "Member 'BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation, K2Node_DynamicCast_AsGz_Player_Character) == 0x000028, "Member 'BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation, K2Node_DynamicCast_AsGz_Player_Character_1) == 0x000038, "Member 'BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation::K2Node_DynamicCast_AsGz_Player_Character_1' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation, K2Node_Select_Default) == 0x000041, "Member 'BP_ATPCScript_UnlinkCharacterControllerRotation_C_ExecuteUbergraph_BP_ATPCScript_UnlinkCharacterControllerRotation::K2Node_Select_Default' has a wrong offset!");

// Function BP_ATPCScript_UnlinkCharacterControllerRotation.BP_ATPCScript_UnlinkCharacterControllerRotation_C.K2_OnEnterCameraMode
// 0x0008 (0x0008 - 0x0000)
struct BP_ATPCScript_UnlinkCharacterControllerRotation_C_K2_OnEnterCameraMode final
{
public:
	class UATPCCameraComponent*                   Camera;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_K2_OnEnterCameraMode) == 0x000008, "Wrong alignment on BP_ATPCScript_UnlinkCharacterControllerRotation_C_K2_OnEnterCameraMode");
static_assert(sizeof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_K2_OnEnterCameraMode) == 0x000008, "Wrong size on BP_ATPCScript_UnlinkCharacterControllerRotation_C_K2_OnEnterCameraMode");
static_assert(offsetof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_K2_OnEnterCameraMode, Camera) == 0x000000, "Member 'BP_ATPCScript_UnlinkCharacterControllerRotation_C_K2_OnEnterCameraMode::Camera' has a wrong offset!");

// Function BP_ATPCScript_UnlinkCharacterControllerRotation.BP_ATPCScript_UnlinkCharacterControllerRotation_C.K2_OnExitCameraMode
// 0x0008 (0x0008 - 0x0000)
struct BP_ATPCScript_UnlinkCharacterControllerRotation_C_K2_OnExitCameraMode final
{
public:
	class UATPCCameraComponent*                   Camera;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_K2_OnExitCameraMode) == 0x000008, "Wrong alignment on BP_ATPCScript_UnlinkCharacterControllerRotation_C_K2_OnExitCameraMode");
static_assert(sizeof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_K2_OnExitCameraMode) == 0x000008, "Wrong size on BP_ATPCScript_UnlinkCharacterControllerRotation_C_K2_OnExitCameraMode");
static_assert(offsetof(BP_ATPCScript_UnlinkCharacterControllerRotation_C_K2_OnExitCameraMode, Camera) == 0x000000, "Member 'BP_ATPCScript_UnlinkCharacterControllerRotation_C_K2_OnExitCameraMode::Camera' has a wrong offset!");

}

