#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ApplyEffectTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GzGameplayEffectsHandleArray_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ApplyEffectTrigger.BP_ApplyEffectTrigger_C
// 0x00B8 (0x0360 - 0x02A8)
class ABP_ApplyEffectTrigger_C : public ATriggerBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UClass*>                         EffectsToApply;                                    // 0x02B0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FGameplayTagContainer                  TagsToApply;                                       // 0x02C0(0x0020)(Edit, BlueprintVisible)
	TMap<class AActor*, struct FGzGameplayEffectsHandleArray> ActorsToActiveEffectsAndTags;                      // 0x02E0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FGzGameplayEffectsHandleArray          TempAppliedEffectsHandlesAndTags;                  // 0x0330(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ApplyGameplayEffects(class AActor* Actor);
	void ApplyTags(class AGzCharacter* Character);
	void ExecuteUbergraph_BP_ApplyEffectTrigger(int32 EntryPoint);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ApplyEffectTrigger_C">();
	}
	static class ABP_ApplyEffectTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ApplyEffectTrigger_C>();
	}
};
static_assert(alignof(ABP_ApplyEffectTrigger_C) == 0x000008, "Wrong alignment on ABP_ApplyEffectTrigger_C");
static_assert(sizeof(ABP_ApplyEffectTrigger_C) == 0x000360, "Wrong size on ABP_ApplyEffectTrigger_C");
static_assert(offsetof(ABP_ApplyEffectTrigger_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_ApplyEffectTrigger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ApplyEffectTrigger_C, EffectsToApply) == 0x0002B0, "Member 'ABP_ApplyEffectTrigger_C::EffectsToApply' has a wrong offset!");
static_assert(offsetof(ABP_ApplyEffectTrigger_C, TagsToApply) == 0x0002C0, "Member 'ABP_ApplyEffectTrigger_C::TagsToApply' has a wrong offset!");
static_assert(offsetof(ABP_ApplyEffectTrigger_C, ActorsToActiveEffectsAndTags) == 0x0002E0, "Member 'ABP_ApplyEffectTrigger_C::ActorsToActiveEffectsAndTags' has a wrong offset!");
static_assert(offsetof(ABP_ApplyEffectTrigger_C, TempAppliedEffectsHandlesAndTags) == 0x000330, "Member 'ABP_ApplyEffectTrigger_C::TempAppliedEffectsHandlesAndTags' has a wrong offset!");

}

