#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIProcessTarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "G01_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIProcessTarget.BP_AIProcessTarget_C
// 0x0040 (0x01D8 - 0x0198)
class UBP_AIProcessTarget_C final : public UGzAIProcessTargetComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0198(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        TeamSenseInformRange;                              // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PredictionTime;                                    // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Stimulus_Location;                                 // 0x01B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Update_Info_Target;                                // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Update_Info_Target_Id;                             // 0x01D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Successfully_Sensed;                               // 0x01D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AIProcessTarget(int32 EntryPoint);
	void OnTargetPerceptionInfoUpdated(const struct FActorPerceptionUpdateInfo& UpdateInfo);
	void PlaySound(const struct FGameplayTag& AITag, bool* Return);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIProcessTarget_C">();
	}
	static class UBP_AIProcessTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AIProcessTarget_C>();
	}
};
static_assert(alignof(UBP_AIProcessTarget_C) == 0x000008, "Wrong alignment on UBP_AIProcessTarget_C");
static_assert(sizeof(UBP_AIProcessTarget_C) == 0x0001D8, "Wrong size on UBP_AIProcessTarget_C");
static_assert(offsetof(UBP_AIProcessTarget_C, UberGraphFrame) == 0x000198, "Member 'UBP_AIProcessTarget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AIProcessTarget_C, TeamSenseInformRange) == 0x0001A0, "Member 'UBP_AIProcessTarget_C::TeamSenseInformRange' has a wrong offset!");
static_assert(offsetof(UBP_AIProcessTarget_C, PredictionTime) == 0x0001A8, "Member 'UBP_AIProcessTarget_C::PredictionTime' has a wrong offset!");
static_assert(offsetof(UBP_AIProcessTarget_C, Stimulus_Location) == 0x0001B0, "Member 'UBP_AIProcessTarget_C::Stimulus_Location' has a wrong offset!");
static_assert(offsetof(UBP_AIProcessTarget_C, Update_Info_Target) == 0x0001C8, "Member 'UBP_AIProcessTarget_C::Update_Info_Target' has a wrong offset!");
static_assert(offsetof(UBP_AIProcessTarget_C, Update_Info_Target_Id) == 0x0001D0, "Member 'UBP_AIProcessTarget_C::Update_Info_Target_Id' has a wrong offset!");
static_assert(offsetof(UBP_AIProcessTarget_C, Successfully_Sensed) == 0x0001D4, "Member 'UBP_AIProcessTarget_C::Successfully_Sensed' has a wrong offset!");

}

