#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ATPCScript_SetFreeCam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AdvancedThirdPersonCamera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ATPCScript_SetFreeCam.BP_ATPCScript_SetFreeCam_C
// 0x0030 (0x0070 - 0x0040)
class UBP_ATPCScript_SetFreeCam_C final : public UATPCCameraModeScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        ResetCameraSpeed;                                  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DesiredOnExitCameraRotation;                       // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bResetCameraRotationInstantly;                     // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ATPCScript_SetFreeCam(int32 EntryPoint);
	void GetCameraLocationObject(class UATPCCameraLocationObject** CameraLocationObject);
	void K2_OnEnterCameraMode(class UATPCCameraComponent* Camera);
	void K2_OnExitCameraMode(class UATPCCameraComponent* Camera);
	void OnDesiredCameraRotationReached();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ATPCScript_SetFreeCam_C">();
	}
	static class UBP_ATPCScript_SetFreeCam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ATPCScript_SetFreeCam_C>();
	}
};
static_assert(alignof(UBP_ATPCScript_SetFreeCam_C) == 0x000008, "Wrong alignment on UBP_ATPCScript_SetFreeCam_C");
static_assert(sizeof(UBP_ATPCScript_SetFreeCam_C) == 0x000070, "Wrong size on UBP_ATPCScript_SetFreeCam_C");
static_assert(offsetof(UBP_ATPCScript_SetFreeCam_C, UberGraphFrame) == 0x000040, "Member 'UBP_ATPCScript_SetFreeCam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ATPCScript_SetFreeCam_C, ResetCameraSpeed) == 0x000048, "Member 'UBP_ATPCScript_SetFreeCam_C::ResetCameraSpeed' has a wrong offset!");
static_assert(offsetof(UBP_ATPCScript_SetFreeCam_C, DesiredOnExitCameraRotation) == 0x000050, "Member 'UBP_ATPCScript_SetFreeCam_C::DesiredOnExitCameraRotation' has a wrong offset!");
static_assert(offsetof(UBP_ATPCScript_SetFreeCam_C, bResetCameraRotationInstantly) == 0x000068, "Member 'UBP_ATPCScript_SetFreeCam_C::bResetCameraRotationInstantly' has a wrong offset!");

}

