#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleRoyaleZone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BattleRoyaleZone.BP_BattleRoyaleZone_C
// 0x0028 (0x0388 - 0x0360)
class ABP_BattleRoyaleZone_C final : public AGzBattleRoyaleZone
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bShouldPause;                                      // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5778[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnOverloadStart;                                   // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABP_LandingLocationMarker_C*            LandingLocationMarker;                             // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveOnOverloadStart();
	void ReceiveOnOverloadDataUpdate();
	void Spawn_System_On_Parent_Object(class UStaticMeshComponent* Locator, class UNiagaraSystem* NiagaraSystem);
	void OnUnpause();
	void ReceiveBeginPlay();
	void K2_OnReset();
	void OnRadiusUpdated(float NewRadius);
	void ExecuteUbergraph_BP_BattleRoyaleZone(int32 EntryPoint);
	void OnOverloadStart__DelegateSignature();
	void DestroyLandingLocationMarker();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BattleRoyaleZone_C">();
	}
	static class ABP_BattleRoyaleZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BattleRoyaleZone_C>();
	}
};
static_assert(alignof(ABP_BattleRoyaleZone_C) == 0x000008, "Wrong alignment on ABP_BattleRoyaleZone_C");
static_assert(sizeof(ABP_BattleRoyaleZone_C) == 0x000388, "Wrong size on ABP_BattleRoyaleZone_C");
static_assert(offsetof(ABP_BattleRoyaleZone_C, UberGraphFrame) == 0x000360, "Member 'ABP_BattleRoyaleZone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BattleRoyaleZone_C, bShouldPause) == 0x000368, "Member 'ABP_BattleRoyaleZone_C::bShouldPause' has a wrong offset!");
static_assert(offsetof(ABP_BattleRoyaleZone_C, OnOverloadStart) == 0x000370, "Member 'ABP_BattleRoyaleZone_C::OnOverloadStart' has a wrong offset!");
static_assert(offsetof(ABP_BattleRoyaleZone_C, LandingLocationMarker) == 0x000380, "Member 'ABP_BattleRoyaleZone_C::LandingLocationMarker' has a wrong offset!");

}

