#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleRoyaleHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BattleRoyaleHUD.BP_BattleRoyaleHUD_C
// 0x0048 (0x04F8 - 0x04B0)
class ABP_BattleRoyaleHUD_C final : public AGzHUDBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWBP_PreMatchCountdownOverlay_C*        PreMatchCountDownWidget;                           // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_LoadoutSelectionScreen_PreMatch_C* Loadout_Selection_Widget;                          // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          BlockCreatepreMatch;                               // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5166[0x7];                                     // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ActiveStageTags;                                   // 0x04D8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DeletePreMatchWidget();
	void ExecuteUbergraph_BP_BattleRoyaleHUD(int32 EntryPoint);
	void OnMatchStageChanged();
	void ReceiveOnPawnChanged(class APawn* Pawn);
	void Try_Skip_Loadout();
	void TryCreateLoadoutSelectionMenu();
	void UpdateCountdownWidgets(const struct FGameplayTagContainer& Param_ActiveStageTags);
	void UpdatePostMatch(const struct FGameplayTagContainer& Param_ActiveStageTags);
	void UpdatePreMatchWidgets(const struct FGameplayTagContainer& Param_ActiveStageTags);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BattleRoyaleHUD_C">();
	}
	static class ABP_BattleRoyaleHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BattleRoyaleHUD_C>();
	}
};
static_assert(alignof(ABP_BattleRoyaleHUD_C) == 0x000008, "Wrong alignment on ABP_BattleRoyaleHUD_C");
static_assert(sizeof(ABP_BattleRoyaleHUD_C) == 0x0004F8, "Wrong size on ABP_BattleRoyaleHUD_C");
static_assert(offsetof(ABP_BattleRoyaleHUD_C, UberGraphFrame) == 0x0004B0, "Member 'ABP_BattleRoyaleHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BattleRoyaleHUD_C, DefaultSceneRoot) == 0x0004B8, "Member 'ABP_BattleRoyaleHUD_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BattleRoyaleHUD_C, PreMatchCountDownWidget) == 0x0004C0, "Member 'ABP_BattleRoyaleHUD_C::PreMatchCountDownWidget' has a wrong offset!");
static_assert(offsetof(ABP_BattleRoyaleHUD_C, Loadout_Selection_Widget) == 0x0004C8, "Member 'ABP_BattleRoyaleHUD_C::Loadout_Selection_Widget' has a wrong offset!");
static_assert(offsetof(ABP_BattleRoyaleHUD_C, BlockCreatepreMatch) == 0x0004D0, "Member 'ABP_BattleRoyaleHUD_C::BlockCreatepreMatch' has a wrong offset!");
static_assert(offsetof(ABP_BattleRoyaleHUD_C, ActiveStageTags) == 0x0004D8, "Member 'ABP_BattleRoyaleHUD_C::ActiveStageTags' has a wrong offset!");

}

