#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BarrierComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BarrierComponent.BP_BarrierComponent_C
// 0x00F0 (0x01E0 - 0x00F0)
class UBP_BarrierComponent_C final : public UGzLimbAbilityComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                Start;                                             // 0x00F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0110(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Object_Types;                                      // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        MaxDistance;                                       // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzMultiPartCharacter*                  As_Gz_Multi_Part_Character;                        // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_Barrier_Preview_C*                  Preview_Actor;                                     // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Height;                                            // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreviewAnchor;                                     // 0x0158(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreviewUp;                                         // 0x0170(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreviewRight;                                      // 0x0188(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               PreviewRot;                                        // 0x01A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        Width;                                             // 0x01B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HeightResult;                                      // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WidthResultR;                                      // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WidthHalf;                                         // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WidthResultL;                                      // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivatePreview();
	void BoxsTrace(bool bRight, double* Param_Width);
	void DeactivatePreview();
	void ExecuteUbergraph_BP_BarrierComponent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void Setup_Height_And_Width();
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BarrierComponent_C">();
	}
	static class UBP_BarrierComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BarrierComponent_C>();
	}
};
static_assert(alignof(UBP_BarrierComponent_C) == 0x000008, "Wrong alignment on UBP_BarrierComponent_C");
static_assert(sizeof(UBP_BarrierComponent_C) == 0x0001E0, "Wrong size on UBP_BarrierComponent_C");
static_assert(offsetof(UBP_BarrierComponent_C, UberGraphFrame) == 0x0000F0, "Member 'UBP_BarrierComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, Start) == 0x0000F8, "Member 'UBP_BarrierComponent_C::Start' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, End) == 0x000110, "Member 'UBP_BarrierComponent_C::End' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, Object_Types) == 0x000128, "Member 'UBP_BarrierComponent_C::Object_Types' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, MaxDistance) == 0x000138, "Member 'UBP_BarrierComponent_C::MaxDistance' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, As_Gz_Multi_Part_Character) == 0x000140, "Member 'UBP_BarrierComponent_C::As_Gz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, Preview_Actor) == 0x000148, "Member 'UBP_BarrierComponent_C::Preview_Actor' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, Height) == 0x000150, "Member 'UBP_BarrierComponent_C::Height' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, PreviewAnchor) == 0x000158, "Member 'UBP_BarrierComponent_C::PreviewAnchor' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, PreviewUp) == 0x000170, "Member 'UBP_BarrierComponent_C::PreviewUp' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, PreviewRight) == 0x000188, "Member 'UBP_BarrierComponent_C::PreviewRight' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, PreviewRot) == 0x0001A0, "Member 'UBP_BarrierComponent_C::PreviewRot' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, Width) == 0x0001B8, "Member 'UBP_BarrierComponent_C::Width' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, HeightResult) == 0x0001C0, "Member 'UBP_BarrierComponent_C::HeightResult' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, WidthResultR) == 0x0001C8, "Member 'UBP_BarrierComponent_C::WidthResultR' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, WidthHalf) == 0x0001D0, "Member 'UBP_BarrierComponent_C::WidthHalf' has a wrong offset!");
static_assert(offsetof(UBP_BarrierComponent_C, WidthResultL) == 0x0001D8, "Member 'UBP_BarrierComponent_C::WidthResultL' has a wrong offset!");

}

