#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Barrier_Part

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BP_Barrier_Part.BP_Barrier_Part_C.ApplyDefilerAreaEffect
// 0x0030 (0x0030 - 0x0000)
struct BP_Barrier_Part_C_ApplyDefilerAreaEffect final
{
public:
	class UClass*                                 Effect;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64F3[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Barrier_ShockEffect_Component_C*    CallFunc_AddComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_Barrier_ShockEffect_Component_C*    CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_Part_C_ApplyDefilerAreaEffect) == 0x000008, "Wrong alignment on BP_Barrier_Part_C_ApplyDefilerAreaEffect");
static_assert(sizeof(BP_Barrier_Part_C_ApplyDefilerAreaEffect) == 0x000030, "Wrong size on BP_Barrier_Part_C_ApplyDefilerAreaEffect");
static_assert(offsetof(BP_Barrier_Part_C_ApplyDefilerAreaEffect, Effect) == 0x000000, "Member 'BP_Barrier_Part_C_ApplyDefilerAreaEffect::Effect' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ApplyDefilerAreaEffect, Actor) == 0x000008, "Member 'BP_Barrier_Part_C_ApplyDefilerAreaEffect::Actor' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ApplyDefilerAreaEffect, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'BP_Barrier_Part_C_ApplyDefilerAreaEffect::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ApplyDefilerAreaEffect, CallFunc_AddComponentByClass_ReturnValue) == 0x000018, "Member 'BP_Barrier_Part_C_ApplyDefilerAreaEffect::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ApplyDefilerAreaEffect, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_Barrier_Part_C_ApplyDefilerAreaEffect::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ApplyDefilerAreaEffect, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_Barrier_Part_C_ApplyDefilerAreaEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ApplyDefilerAreaEffect, CallFunc_IsDedicatedServer_ReturnValue) == 0x000029, "Member 'BP_Barrier_Part_C_ApplyDefilerAreaEffect::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_Barrier_Part.BP_Barrier_Part_C.ApplyDefilerDurationAreaEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_Barrier_Part_C_ApplyDefilerDurationAreaEffect final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_Part_C_ApplyDefilerDurationAreaEffect) == 0x000008, "Wrong alignment on BP_Barrier_Part_C_ApplyDefilerDurationAreaEffect");
static_assert(sizeof(BP_Barrier_Part_C_ApplyDefilerDurationAreaEffect) == 0x000008, "Wrong size on BP_Barrier_Part_C_ApplyDefilerDurationAreaEffect");
static_assert(offsetof(BP_Barrier_Part_C_ApplyDefilerDurationAreaEffect, Actor) == 0x000000, "Member 'BP_Barrier_Part_C_ApplyDefilerDurationAreaEffect::Actor' has a wrong offset!");

// Function BP_Barrier_Part.BP_Barrier_Part_C.ApplyDefilerInfinityAreaEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_Barrier_Part_C_ApplyDefilerInfinityAreaEffect final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_Part_C_ApplyDefilerInfinityAreaEffect) == 0x000008, "Wrong alignment on BP_Barrier_Part_C_ApplyDefilerInfinityAreaEffect");
static_assert(sizeof(BP_Barrier_Part_C_ApplyDefilerInfinityAreaEffect) == 0x000008, "Wrong size on BP_Barrier_Part_C_ApplyDefilerInfinityAreaEffect");
static_assert(offsetof(BP_Barrier_Part_C_ApplyDefilerInfinityAreaEffect, Actor) == 0x000000, "Member 'BP_Barrier_Part_C_ApplyDefilerInfinityAreaEffect::Actor' has a wrong offset!");

// Function BP_Barrier_Part.BP_Barrier_Part_C.ApplyGameplayEffectToTarget
// 0x0040 (0x0040 - 0x0000)
struct BP_Barrier_Part_C_ApplyGameplayEffectToTarget final
{
public:
	class UClass*                                 Effect;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64F4[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0020(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_Part_C_ApplyGameplayEffectToTarget) == 0x000008, "Wrong alignment on BP_Barrier_Part_C_ApplyGameplayEffectToTarget");
static_assert(sizeof(BP_Barrier_Part_C_ApplyGameplayEffectToTarget) == 0x000040, "Wrong size on BP_Barrier_Part_C_ApplyGameplayEffectToTarget");
static_assert(offsetof(BP_Barrier_Part_C_ApplyGameplayEffectToTarget, Effect) == 0x000000, "Member 'BP_Barrier_Part_C_ApplyGameplayEffectToTarget::Effect' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ApplyGameplayEffectToTarget, Target) == 0x000008, "Member 'BP_Barrier_Part_C_ApplyGameplayEffectToTarget::Target' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ApplyGameplayEffectToTarget, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'BP_Barrier_Part_C_ApplyGameplayEffectToTarget::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ApplyGameplayEffectToTarget, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_Barrier_Part_C_ApplyGameplayEffectToTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ApplyGameplayEffectToTarget, CallFunc_MakeEffectContext_ReturnValue) == 0x000020, "Member 'BP_Barrier_Part_C_ApplyGameplayEffectToTarget::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ApplyGameplayEffectToTarget, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000038, "Member 'BP_Barrier_Part_C_ApplyGameplayEffectToTarget::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function BP_Barrier_Part.BP_Barrier_Part_C.BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_Barrier_Part.BP_Barrier_Part_C.BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64F5[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Barrier_Part_C_BndEvt__BP_Barrier_Part_BoxTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Barrier_Part.BP_Barrier_Part_C.BoxsTrace
// 0x03A0 (0x03A0 - 0x0000)
struct BP_Barrier_Part_C_BoxsTrace final
{
public:
	struct FVector                                TraceDiraction;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_Width;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceEndLocal;                                     // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         IgnoreActorsLocal;                                 // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FVector                                TraceStartLocal;                                   // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ResultHeight;                                      // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HeightLocal;                                       // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WidthLocal;                                        // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_BoxTraceSingleForObjects_OutHit;          // 0x0190(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BoxTraceSingleForObjects_ReturnValue;     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64F6[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0290(0x0010)(ReferenceParm)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64F7[0x2];                                     // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64F8[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64F9[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_Part_C_BoxsTrace) == 0x000008, "Wrong alignment on BP_Barrier_Part_C_BoxsTrace");
static_assert(sizeof(BP_Barrier_Part_C_BoxsTrace) == 0x0003A0, "Wrong size on BP_Barrier_Part_C_BoxsTrace");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, TraceDiraction) == 0x000000, "Member 'BP_Barrier_Part_C_BoxsTrace::TraceDiraction' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, Param_Width) == 0x000018, "Member 'BP_Barrier_Part_C_BoxsTrace::Param_Width' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, TraceEndLocal) == 0x000020, "Member 'BP_Barrier_Part_C_BoxsTrace::TraceEndLocal' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, IgnoreActorsLocal) == 0x000038, "Member 'BP_Barrier_Part_C_BoxsTrace::IgnoreActorsLocal' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, TraceStartLocal) == 0x000048, "Member 'BP_Barrier_Part_C_BoxsTrace::TraceStartLocal' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, ResultHeight) == 0x000060, "Member 'BP_Barrier_Part_C_BoxsTrace::ResultHeight' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, HeightLocal) == 0x000068, "Member 'BP_Barrier_Part_C_BoxsTrace::HeightLocal' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, WidthLocal) == 0x000070, "Member 'BP_Barrier_Part_C_BoxsTrace::WidthLocal' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000078, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000090, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_GetActorUpVector_ReturnValue) == 0x000098, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_MakeVector_ReturnValue) == 0x0000B0, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000C8, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000E0, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_SelectFloat_ReturnValue) == 0x0000F8, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000100, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x000118, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000130, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000148, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_Add_VectorVector_ReturnValue) == 0x000160, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000178, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BoxTraceSingleForObjects_OutHit) == 0x000190, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BoxTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BoxTraceSingleForObjects_ReturnValue) == 0x000288, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BoxTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, K2Node_MakeArray_Array) == 0x000290, "Member 'BP_Barrier_Part_C_BoxsTrace::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_bBlockingHit) == 0x0002A0, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002A1, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_Time) == 0x0002A4, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_Distance) == 0x0002A8, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_Location) == 0x0002B0, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_ImpactPoint) == 0x0002C8, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_Normal) == 0x0002E0, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_ImpactNormal) == 0x0002F8, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_PhysMat) == 0x000310, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_HitActor) == 0x000318, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_HitComponent) == 0x000320, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_HitBoneName) == 0x000328, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_BoneName) == 0x000330, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_HitItem) == 0x000338, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_ElementIndex) == 0x00033C, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_FaceIndex) == 0x000340, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_TraceStart) == 0x000348, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_BreakHitResult_TraceEnd) == 0x000360, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000378, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_VSize_ReturnValue) == 0x000390, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BoxsTrace, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000398, "Member 'BP_Barrier_Part_C_BoxsTrace::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_Barrier_Part.BP_Barrier_Part_C.BP_OnDeath
// 0x0020 (0x0020 - 0x0000)
struct BP_Barrier_Part_C_BP_OnDeath final
{
public:
	bool                                          HasDeathHitPoint;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64FA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DeathHitPoint;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_Part_C_BP_OnDeath) == 0x000008, "Wrong alignment on BP_Barrier_Part_C_BP_OnDeath");
static_assert(sizeof(BP_Barrier_Part_C_BP_OnDeath) == 0x000020, "Wrong size on BP_Barrier_Part_C_BP_OnDeath");
static_assert(offsetof(BP_Barrier_Part_C_BP_OnDeath, HasDeathHitPoint) == 0x000000, "Member 'BP_Barrier_Part_C_BP_OnDeath::HasDeathHitPoint' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_BP_OnDeath, DeathHitPoint) == 0x000008, "Member 'BP_Barrier_Part_C_BP_OnDeath::DeathHitPoint' has a wrong offset!");

// Function BP_Barrier_Part.BP_Barrier_Part_C.CancelDefilerAreaEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_Barrier_Part_C_CancelDefilerAreaEffect final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_Part_C_CancelDefilerAreaEffect) == 0x000008, "Wrong alignment on BP_Barrier_Part_C_CancelDefilerAreaEffect");
static_assert(sizeof(BP_Barrier_Part_C_CancelDefilerAreaEffect) == 0x000008, "Wrong size on BP_Barrier_Part_C_CancelDefilerAreaEffect");
static_assert(offsetof(BP_Barrier_Part_C_CancelDefilerAreaEffect, Actor) == 0x000000, "Member 'BP_Barrier_Part_C_CancelDefilerAreaEffect::Actor' has a wrong offset!");

// Function BP_Barrier_Part.BP_Barrier_Part_C.ConvertHealthInMaterialParameter
// 0x0028 (0x0028 - 0x0000)
struct BP_Barrier_Part_C_ConvertHealthInMaterialParameter final
{
public:
	double                                        Health;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_Part_C_ConvertHealthInMaterialParameter) == 0x000008, "Wrong alignment on BP_Barrier_Part_C_ConvertHealthInMaterialParameter");
static_assert(sizeof(BP_Barrier_Part_C_ConvertHealthInMaterialParameter) == 0x000028, "Wrong size on BP_Barrier_Part_C_ConvertHealthInMaterialParameter");
static_assert(offsetof(BP_Barrier_Part_C_ConvertHealthInMaterialParameter, Health) == 0x000000, "Member 'BP_Barrier_Part_C_ConvertHealthInMaterialParameter::Health' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ConvertHealthInMaterialParameter, Param) == 0x000008, "Member 'BP_Barrier_Part_C_ConvertHealthInMaterialParameter::Param' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ConvertHealthInMaterialParameter, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Barrier_Part_C_ConvertHealthInMaterialParameter::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ConvertHealthInMaterialParameter, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'BP_Barrier_Part_C_ConvertHealthInMaterialParameter::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ConvertHealthInMaterialParameter, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_Barrier_Part_C_ConvertHealthInMaterialParameter::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_Barrier_Part.BP_Barrier_Part_C.ExecuteUbergraph_BP_Barrier_Part
// 0x0360 (0x0360 - 0x0000)
struct BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64FB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0008(0x0038)(HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_DoubleToLinearColor_ReturnValue;     // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0080(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64FC[0x2];                                     // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64FD[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x00A0(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64FE[0x1];                                     // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x00E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64FF[0x2];                                     // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayAttribute>             K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_HasDeathHitPoint;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6500[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_DeathHitPoint;                        // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorLinearColor_ReturnValue; // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ConvertHealthInMaterialParameter_Param;   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6501[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6502[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6503[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x01B0(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetTeamAttitude_ReturnValue;              // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6504[0x6];                                     // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6505[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAsyncTaskAttributeChanged*           CallFunc_ListenForAttributesChange_ReturnValue;    // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameplayAttributeValue_bFound;         // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6506[0x1];                                     // 0x02D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameplayAttributeValue_ReturnValue;    // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ConvertHealthInMaterialParameter_Param_1; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6507[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetTeamAttitude_ReturnValue_1;            // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6508[0x6];                                     // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_B_ImplicitCast;               // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToLinearColor_InDouble_ImplicitCast; // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ConvertHealthInMaterialParameter_Health_ImplicitCast; // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6509[0x4];                                     // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ConvertHealthInMaterialParameter_Health_ImplicitCast_1; // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part) == 0x000008, "Wrong alignment on BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part");
static_assert(sizeof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part) == 0x000360, "Wrong size on BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, EntryPoint) == 0x000000, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, Temp_struct_Variable) == 0x000008, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, Temp_delegate_Variable) == 0x000048, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, K2Node_MakeStruct_LinearColor) == 0x000060, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, CallFunc_Conv_DoubleToLinearColor_ReturnValue) == 0x000070, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::CallFunc_Conv_DoubleToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, Temp_delegate_Variable_1) == 0x000080, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, CallFunc_IsDedicatedServer_ReturnValue) == 0x000090, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000091, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, Temp_real_Variable) == 0x000094, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000098, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, K2Node_CustomEvent_Attribute) == 0x0000A0, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, K2Node_CustomEvent_NewValue) == 0x0000D8, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, K2Node_CustomEvent_OldValue) == 0x0000DC, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, CallFunc_HasAuthority_ReturnValue) == 0x0000E0, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x0000E1, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, Temp_bool_IsClosed_Variable) == 0x0000E2, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, K2Node_CreateDelegate_OutputDelegate) == 0x0000E4, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part, Temp_bool_Has_Been_Initd_Variable) == 0x0000F4, "Member 'BP_Barrier_Part_C_ExecuteUbergraph_BP_Barrier_Part::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
