#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Barrier_Preview

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Barrier_Preview.BP_Barrier_Preview_C.SetUp
// 0x0458 (0x0458 - 0x0000)
struct BP_Barrier_Preview_C_SetUp final
{
public:
	double                                        Height;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WidthR;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WidthL;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0078(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0170(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x0268(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x0360(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Barrier_Preview_C_SetUp) == 0x000008, "Wrong alignment on BP_Barrier_Preview_C_SetUp");
static_assert(sizeof(BP_Barrier_Preview_C_SetUp) == 0x000458, "Wrong size on BP_Barrier_Preview_C_SetUp");
static_assert(offsetof(BP_Barrier_Preview_C_SetUp, Height) == 0x000000, "Member 'BP_Barrier_Preview_C_SetUp::Height' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Preview_C_SetUp, WidthR) == 0x000008, "Member 'BP_Barrier_Preview_C_SetUp::WidthR' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Preview_C_SetUp, WidthL) == 0x000010, "Member 'BP_Barrier_Preview_C_SetUp::WidthL' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Preview_C_SetUp, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'BP_Barrier_Preview_C_SetUp::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Preview_C_SetUp, CallFunc_MakeVector_ReturnValue_1) == 0x000030, "Member 'BP_Barrier_Preview_C_SetUp::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Preview_C_SetUp, CallFunc_MakeVector_ReturnValue_2) == 0x000048, "Member 'BP_Barrier_Preview_C_SetUp::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Preview_C_SetUp, CallFunc_MakeVector_ReturnValue_3) == 0x000060, "Member 'BP_Barrier_Preview_C_SetUp::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Preview_C_SetUp, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000078, "Member 'BP_Barrier_Preview_C_SetUp::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Preview_C_SetUp, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000170, "Member 'BP_Barrier_Preview_C_SetUp::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Preview_C_SetUp, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x000268, "Member 'BP_Barrier_Preview_C_SetUp::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_Barrier_Preview_C_SetUp, CallFunc_K2_SetRelativeLocation_SweepHitResult_3) == 0x000360, "Member 'BP_Barrier_Preview_C_SetUp::CallFunc_K2_SetRelativeLocation_SweepHitResult_3' has a wrong offset!");

}

