#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleRoyalePlayerController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_MatchScreens_structs.hpp"
#include "G01_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.ToggleScreen
// 0x0030 (0x0030 - 0x0000)
struct BP_BattleRoyalePlayerController_C_ToggleScreen final
{
public:
	Enum_MatchScreens                             MatchScreen;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNavigationWidget*                    WidgetToToggle;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	Enum_MatchScreens                             Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1C[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTopWidget_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1D[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNavigationWidget*                    K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_ToggleScreen) == 0x000008, "Wrong alignment on BP_BattleRoyalePlayerController_C_ToggleScreen");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_ToggleScreen) == 0x000030, "Wrong size on BP_BattleRoyalePlayerController_C_ToggleScreen");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_ToggleScreen, MatchScreen) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_ToggleScreen::MatchScreen' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_ToggleScreen, WidgetToToggle) == 0x000008, "Member 'BP_BattleRoyalePlayerController_C_ToggleScreen::WidgetToToggle' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_ToggleScreen, Temp_byte_Variable) == 0x000010, "Member 'BP_BattleRoyalePlayerController_C_ToggleScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_ToggleScreen, CallFunc_GetNavigationRoot_ReturnValue) == 0x000018, "Member 'BP_BattleRoyalePlayerController_C_ToggleScreen::CallFunc_GetNavigationRoot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_ToggleScreen, CallFunc_IsTopWidget_ReturnValue) == 0x000020, "Member 'BP_BattleRoyalePlayerController_C_ToggleScreen::CallFunc_IsTopWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_ToggleScreen, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'BP_BattleRoyalePlayerController_C_ToggleScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_ToggleScreen, K2Node_Select_Default) == 0x000028, "Member 'BP_BattleRoyalePlayerController_C_ToggleScreen::K2Node_Select_Default' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.SelectLastActiveZone
// 0x000C (0x000C - 0x0000)
struct BP_BattleRoyalePlayerController_C_SelectLastActiveZone final
{
public:
	class FName                                   ZoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedLastZoneIndex;                             // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_SelectLastActiveZone) == 0x000004, "Wrong alignment on BP_BattleRoyalePlayerController_C_SelectLastActiveZone");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_SelectLastActiveZone) == 0x00000C, "Wrong size on BP_BattleRoyalePlayerController_C_SelectLastActiveZone");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_SelectLastActiveZone, ZoneName) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_SelectLastActiveZone::ZoneName' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_SelectLastActiveZone, SelectedLastZoneIndex) == 0x000008, "Member 'BP_BattleRoyalePlayerController_C_SelectLastActiveZone::SelectedLastZoneIndex' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.RespawnPlayerFromState
// 0x0180 (0x0180 - 0x0000)
struct BP_BattleRoyalePlayerController_C_RespawnPlayerFromState final
{
public:
	TArray<class AGzPlayerState*>                 Teammates;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FTransform                             SpawnTransform;                                    // 0x0010(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzInvComponent*                        Inventory;                                         // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         RedeploymentCost;                                  // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1E[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzInvPocket                           CurrencyPocket;                                    // 0x0080(0x0028)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1F[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D20[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_DynamicCast_AsController;                   // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D21[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerController*                    K2Node_DynamicCast_AsGz_Player_Controller;         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D22[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzInvItem                             CallFunc_RemoveItemFromPocket_ReturnValue;         // 0x00E8(0x0010)()
	int32                                         CallFunc_Get_Redeployment_Cost_ReturnValue;        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemQuantity_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D23[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D24[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzBaseCharacter*                       K2Node_DynamicCast_AsGz_Base_Character;            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D25[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzGameModeBase*                        K2Node_DynamicCast_AsGz_Game_Mode_Base;            // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D26[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzInvComponent*                        CallFunc_GetInventoryComponent_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D27[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x014C(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D28[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzInvPocket                           CallFunc_GetPocketByItemType_ReturnValue;          // 0x0158(0x0028)(ConstParm)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState) == 0x000010, "Wrong alignment on BP_BattleRoyalePlayerController_C_RespawnPlayerFromState");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState) == 0x000180, "Wrong size on BP_BattleRoyalePlayerController_C_RespawnPlayerFromState");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, Teammates) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::Teammates' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, SpawnTransform) == 0x000010, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::SpawnTransform' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, Inventory) == 0x000070, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::Inventory' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, RedeploymentCost) == 0x000078, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::RedeploymentCost' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CurrencyPocket) == 0x000080, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CurrencyPocket' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, Temp_int_Array_Index_Variable) == 0x0000A8, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_GetOwner_ReturnValue) == 0x0000C0, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, K2Node_DynamicCast_AsController) == 0x0000C8, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::K2Node_DynamicCast_AsController' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, K2Node_DynamicCast_AsGz_Player_Controller) == 0x0000D8, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::K2Node_DynamicCast_AsGz_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_IsValid_ReturnValue) == 0x0000E1, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_RemoveItemFromPocket_ReturnValue) == 0x0000E8, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_RemoveItemFromPocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_Get_Redeployment_Cost_ReturnValue) == 0x0000F8, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_Get_Redeployment_Cost_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_GetItemQuantity_ReturnValue) == 0x0000FC, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_GetItemQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000100, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, Temp_int_Loop_Counter_Variable) == 0x000104, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_Add_IntInt_ReturnValue) == 0x00010C, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_K2_GetPawn_ReturnValue) == 0x000110, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_GetGameMode_ReturnValue) == 0x000118, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, K2Node_DynamicCast_AsGz_Base_Character) == 0x000120, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::K2Node_DynamicCast_AsGz_Base_Character' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, K2Node_DynamicCast_AsGz_Game_Mode_Base) == 0x000130, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::K2Node_DynamicCast_AsGz_Game_Mode_Base' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, K2Node_DynamicCast_bSuccess_3) == 0x000138, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_GetInventoryComponent_ReturnValue) == 0x000140, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_GetInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_IsValid_ReturnValue_1) == 0x000148, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, Temp_struct_Variable) == 0x00014C, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RespawnPlayerFromState, CallFunc_GetPocketByItemType_ReturnValue) == 0x000158, "Member 'BP_BattleRoyalePlayerController_C_RespawnPlayerFromState::CallFunc_GetPocketByItemType_ReturnValue' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.RemoveWidgetFromLayer
// 0x0010 (0x0010 - 0x0000)
struct BP_BattleRoyalePlayerController_C_RemoveWidgetFromLayer final
{
public:
	class UGzNavigationWidget*                    WidgetToRemove;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_RemoveWidgetFromLayer) == 0x000008, "Wrong alignment on BP_BattleRoyalePlayerController_C_RemoveWidgetFromLayer");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_RemoveWidgetFromLayer) == 0x000010, "Wrong size on BP_BattleRoyalePlayerController_C_RemoveWidgetFromLayer");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RemoveWidgetFromLayer, WidgetToRemove) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_RemoveWidgetFromLayer::WidgetToRemove' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RemoveWidgetFromLayer, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_BattleRoyalePlayerController_C_RemoveWidgetFromLayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_RemoveWidgetFromLayer, CallFunc_IsVisible_ReturnValue) == 0x000009, "Member 'BP_BattleRoyalePlayerController_C_RemoveWidgetFromLayer::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.OpenScreen
// 0x0180 (0x0180 - 0x0000)
struct BP_BattleRoyalePlayerController_C_OpenScreen final
{
public:
	Enum_MatchScreens                             MatchScreen;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D29[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNavigationWidget*                    WidgetToOpen;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	Enum_MatchScreens                             Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D2A[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable;                           // 0x0018(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_1;                         // 0x0040(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_2;                         // 0x0068(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_3;                         // 0x0090(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_4;                         // 0x00B8(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_5;                         // 0x00E0(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_6;                         // 0x0108(0x0028)(HasGetValueTypeHash)
	Enum_MatchScreens                             Temp_byte_Variable_1;                              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D2B[0x2];                                     // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UGzNavigationWidget* NavigationWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0134(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D2C[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   K2Node_Select_Default;                             // 0x0148(0x0028)(HasGetValueTypeHash)
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue;            // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzNavigationWidget*                    K2Node_Select_Default_1;                           // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_OpenScreen) == 0x000008, "Wrong alignment on BP_BattleRoyalePlayerController_C_OpenScreen");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_OpenScreen) == 0x000180, "Wrong size on BP_BattleRoyalePlayerController_C_OpenScreen");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, MatchScreen) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::MatchScreen' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, WidgetToOpen) == 0x000008, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::WidgetToOpen' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, Temp_byte_Variable) == 0x000010, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, Temp_softclass_Variable) == 0x000018, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::Temp_softclass_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, Temp_softclass_Variable_1) == 0x000040, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::Temp_softclass_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, Temp_softclass_Variable_2) == 0x000068, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::Temp_softclass_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, Temp_softclass_Variable_3) == 0x000090, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::Temp_softclass_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, Temp_softclass_Variable_4) == 0x0000B8, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::Temp_softclass_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, Temp_softclass_Variable_5) == 0x0000E0, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::Temp_softclass_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, Temp_softclass_Variable_6) == 0x000108, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::Temp_softclass_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, Temp_byte_Variable_1) == 0x000130, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, CallFunc_IsValid_ReturnValue) == 0x000131, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000134, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, CallFunc_IsActivated_ReturnValue) == 0x000144, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, K2Node_Select_Default) == 0x000148, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, CallFunc_GetNavigationRoot_ReturnValue) == 0x000170, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::CallFunc_GetNavigationRoot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenScreen, K2Node_Select_Default_1) == 0x000178, "Member 'BP_BattleRoyalePlayerController_C_OpenScreen::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.OpenPingWheel
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleRoyalePlayerController_C_OpenPingWheel final
{
public:
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_OpenPingWheel) == 0x000008, "Wrong alignment on BP_BattleRoyalePlayerController_C_OpenPingWheel");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_OpenPingWheel) == 0x000008, "Wrong size on BP_BattleRoyalePlayerController_C_OpenPingWheel");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OpenPingWheel, CallFunc_GetNavigationRoot_ReturnValue) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_OpenPingWheel::CallFunc_GetNavigationRoot_ReturnValue' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.OnScreenLoaded
// 0x0010 (0x0010 - 0x0000)
struct BP_BattleRoyalePlayerController_C_OnScreenLoaded final
{
public:
	class UGzNavigationWidget*                    NavigationWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_OnScreenLoaded) == 0x000008, "Wrong alignment on BP_BattleRoyalePlayerController_C_OnScreenLoaded");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_OnScreenLoaded) == 0x000010, "Wrong size on BP_BattleRoyalePlayerController_C_OnScreenLoaded");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OnScreenLoaded, NavigationWidget) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_OnScreenLoaded::NavigationWidget' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OnScreenLoaded, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'BP_BattleRoyalePlayerController_C_OnScreenLoaded::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.OnCinematicModeChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_BattleRoyalePlayerController_C_OnCinematicModeChanged final
{
public:
	bool                                          bNewCinematicMode;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_OnCinematicModeChanged) == 0x000001, "Wrong alignment on BP_BattleRoyalePlayerController_C_OnCinematicModeChanged");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_OnCinematicModeChanged) == 0x000001, "Wrong size on BP_BattleRoyalePlayerController_C_OnCinematicModeChanged");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_OnCinematicModeChanged, bNewCinematicMode) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_OnCinematicModeChanged::bNewCinematicMode' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.K2_DisplayDamage
// 0x0130 (0x0130 - 0x0000)
struct BP_BattleRoyalePlayerController_C_K2_DisplayDamage final
{
public:
	struct FDamageDisplayData                     DamageData;                                        // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class UGzGameUserSettings*                    CallFunc_GetGameUserSettings_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowDamageNumbers_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D2D[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D2E[0x8];                                     // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_HitFeedbackActor_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast_1; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast_2; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast_3; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast_4; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast_5; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage) == 0x000010, "Wrong alignment on BP_BattleRoyalePlayerController_C_K2_DisplayDamage");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage) == 0x000130, "Wrong size on BP_BattleRoyalePlayerController_C_K2_DisplayDamage");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, DamageData) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::DamageData' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, CallFunc_GetGameUserSettings_ReturnValue) == 0x000030, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, CallFunc_ShouldShowDamageNumbers_ReturnValue) == 0x000038, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::CallFunc_ShouldShowDamageNumbers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, CallFunc_RandomUnitVector_ReturnValue) == 0x000040, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000058, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, CallFunc_Add_VectorVector_ReturnValue) == 0x000070, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F0, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F8, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, CallFunc_SetDoublePropertyByName_Value_ImplicitCast) == 0x000100, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::CallFunc_SetDoublePropertyByName_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, CallFunc_SetDoublePropertyByName_Value_ImplicitCast_1) == 0x000108, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::CallFunc_SetDoublePropertyByName_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, CallFunc_SetDoublePropertyByName_Value_ImplicitCast_2) == 0x000110, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::CallFunc_SetDoublePropertyByName_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, CallFunc_SetDoublePropertyByName_Value_ImplicitCast_3) == 0x000118, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::CallFunc_SetDoublePropertyByName_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, CallFunc_SetDoublePropertyByName_Value_ImplicitCast_4) == 0x000120, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::CallFunc_SetDoublePropertyByName_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_K2_DisplayDamage, CallFunc_SetDoublePropertyByName_Value_ImplicitCast_5) == 0x000128, "Member 'BP_BattleRoyalePlayerController_C_K2_DisplayDamage::CallFunc_SetDoublePropertyByName_Value_ImplicitCast_5' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_6
// 0x0030 (0x0030 - 0x0000)
struct BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_6 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_6) == 0x000008, "Wrong alignment on BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_6");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_6) == 0x000030, "Wrong size on BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_6");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_6, ActionValue) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_6::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_6, ElapsedTime) == 0x000020, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_6::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_6, TriggeredTime) == 0x000024, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_6::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_6, SourceAction) == 0x000028, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_6::SourceAction' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_5
// 0x0030 (0x0030 - 0x0000)
struct BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_5 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_5) == 0x000008, "Wrong alignment on BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_5");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_5) == 0x000030, "Wrong size on BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_5");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_5, ActionValue) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_5::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_5, ElapsedTime) == 0x000020, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_5::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_5, TriggeredTime) == 0x000024, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_5::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_5, SourceAction) == 0x000028, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_VoiceChat_K2Node_EnhancedInputActionEvent_5::SourceAction' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.InpActEvt_IA_UI_QuickOrderMenu_K2Node_EnhancedInputActionEvent_9
// 0x0030 (0x0030 - 0x0000)
struct BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_QuickOrderMenu_K2Node_EnhancedInputActionEvent_9 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_QuickOrderMenu_K2Node_EnhancedInputActionEvent_9) == 0x000008, "Wrong alignment on BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_QuickOrderMenu_K2Node_EnhancedInputActionEvent_9");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_QuickOrderMenu_K2Node_EnhancedInputActionEvent_9) == 0x000030, "Wrong size on BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_QuickOrderMenu_K2Node_EnhancedInputActionEvent_9");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_QuickOrderMenu_K2Node_EnhancedInputActionEvent_9, ActionValue) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_QuickOrderMenu_K2Node_EnhancedInputActionEvent_9::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_QuickOrderMenu_K2Node_EnhancedInputActionEvent_9, ElapsedTime) == 0x000020, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_QuickOrderMenu_K2Node_EnhancedInputActionEvent_9::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_QuickOrderMenu_K2Node_EnhancedInputActionEvent_9, TriggeredTime) == 0x000024, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_QuickOrderMenu_K2Node_EnhancedInputActionEvent_9::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_QuickOrderMenu_K2Node_EnhancedInputActionEvent_9, SourceAction) == 0x000028, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_UI_QuickOrderMenu_K2Node_EnhancedInputActionEvent_9::SourceAction' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.InpActEvt_IA_DebugPPSaturationInc_K2Node_EnhancedInputActionEvent_13
// 0x0030 (0x0030 - 0x0000)
struct BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationInc_K2Node_EnhancedInputActionEvent_13 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationInc_K2Node_EnhancedInputActionEvent_13) == 0x000008, "Wrong alignment on BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationInc_K2Node_EnhancedInputActionEvent_13");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationInc_K2Node_EnhancedInputActionEvent_13) == 0x000030, "Wrong size on BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationInc_K2Node_EnhancedInputActionEvent_13");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationInc_K2Node_EnhancedInputActionEvent_13, ActionValue) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationInc_K2Node_EnhancedInputActionEvent_13::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationInc_K2Node_EnhancedInputActionEvent_13, ElapsedTime) == 0x000020, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationInc_K2Node_EnhancedInputActionEvent_13::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationInc_K2Node_EnhancedInputActionEvent_13, TriggeredTime) == 0x000024, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationInc_K2Node_EnhancedInputActionEvent_13::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationInc_K2Node_EnhancedInputActionEvent_13, SourceAction) == 0x000028, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationInc_K2Node_EnhancedInputActionEvent_13::SourceAction' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.InpActEvt_IA_DebugPPSaturationDec_K2Node_EnhancedInputActionEvent_14
// 0x0030 (0x0030 - 0x0000)
struct BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationDec_K2Node_EnhancedInputActionEvent_14 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationDec_K2Node_EnhancedInputActionEvent_14) == 0x000008, "Wrong alignment on BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationDec_K2Node_EnhancedInputActionEvent_14");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationDec_K2Node_EnhancedInputActionEvent_14) == 0x000030, "Wrong size on BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationDec_K2Node_EnhancedInputActionEvent_14");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationDec_K2Node_EnhancedInputActionEvent_14, ActionValue) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationDec_K2Node_EnhancedInputActionEvent_14::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationDec_K2Node_EnhancedInputActionEvent_14, ElapsedTime) == 0x000020, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationDec_K2Node_EnhancedInputActionEvent_14::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationDec_K2Node_EnhancedInputActionEvent_14, TriggeredTime) == 0x000024, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationDec_K2Node_EnhancedInputActionEvent_14::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationDec_K2Node_EnhancedInputActionEvent_14, SourceAction) == 0x000028, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPSaturationDec_K2Node_EnhancedInputActionEvent_14::SourceAction' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.InpActEvt_IA_DebugPPGammaInc_K2Node_EnhancedInputActionEvent_17
// 0x0030 (0x0030 - 0x0000)
struct BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaInc_K2Node_EnhancedInputActionEvent_17 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaInc_K2Node_EnhancedInputActionEvent_17) == 0x000008, "Wrong alignment on BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaInc_K2Node_EnhancedInputActionEvent_17");
static_assert(sizeof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaInc_K2Node_EnhancedInputActionEvent_17) == 0x000030, "Wrong size on BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaInc_K2Node_EnhancedInputActionEvent_17");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaInc_K2Node_EnhancedInputActionEvent_17, ActionValue) == 0x000000, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaInc_K2Node_EnhancedInputActionEvent_17::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaInc_K2Node_EnhancedInputActionEvent_17, ElapsedTime) == 0x000020, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaInc_K2Node_EnhancedInputActionEvent_17::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaInc_K2Node_EnhancedInputActionEvent_17, TriggeredTime) == 0x000024, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaInc_K2Node_EnhancedInputActionEvent_17::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaInc_K2Node_EnhancedInputActionEvent_17, SourceAction) == 0x000028, "Member 'BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaInc_K2Node_EnhancedInputActionEvent_17::SourceAction' has a wrong offset!");

// Function BP_BattleRoyalePlayerController.BP_BattleRoyalePlayerController_C.InpActEvt_IA_DebugPPGammaDec_K2Node_EnhancedInputActionEvent_18
// 0x0030 (0x0030 - 0x0000)
struct BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaDec_K2Node_EnhancedInputActionEvent_18 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaDec_K2Node_EnhancedInputActionEvent_18) == 0x000008, "Wrong alignment on BP_BattleRoyalePlayerController_C_InpActEvt_IA_DebugPPGammaDec_K2Node_EnhancedInputActionEvent_18");
