#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleRoyaleZone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleRoyaleZone.BP_BattleRoyaleZone_C.Spawn System On Parent Object
// 0x0048 (0x0048 - 0x0000)
struct BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object final
{
public:
	class UStaticMeshComponent*                   Locator;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NiagaraSystem;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object) == 0x000008, "Wrong alignment on BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object");
static_assert(sizeof(BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object) == 0x000048, "Wrong size on BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object");
static_assert(offsetof(BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object, Locator) == 0x000000, "Member 'BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object::Locator' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object, NiagaraSystem) == 0x000008, "Member 'BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000028, "Member 'BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000040, "Member 'BP_BattleRoyaleZone_C_Spawn_System_On_Parent_Object::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function BP_BattleRoyaleZone.BP_BattleRoyaleZone_C.OnRadiusUpdated
// 0x0050 (0x0050 - 0x0000)
struct BP_BattleRoyaleZone_C_OnRadiusUpdated final
{
public:
	float                                         NewRadius;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShrinking_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5779[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzBattleRoyaleZoneManager*             CallFunc_Instance_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzBattleRoyaleZoneManager*             CallFunc_Instance_ReturnValue_1;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_577A[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_577B[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_B_ImplicitCast;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyaleZone_C_OnRadiusUpdated) == 0x000008, "Wrong alignment on BP_BattleRoyaleZone_C_OnRadiusUpdated");
static_assert(sizeof(BP_BattleRoyaleZone_C_OnRadiusUpdated) == 0x000050, "Wrong size on BP_BattleRoyaleZone_C_OnRadiusUpdated");
static_assert(offsetof(BP_BattleRoyaleZone_C_OnRadiusUpdated, NewRadius) == 0x000000, "Member 'BP_BattleRoyaleZone_C_OnRadiusUpdated::NewRadius' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_OnRadiusUpdated, CallFunc_IsShrinking_ReturnValue) == 0x000004, "Member 'BP_BattleRoyaleZone_C_OnRadiusUpdated::CallFunc_IsShrinking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_OnRadiusUpdated, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_BattleRoyaleZone_C_OnRadiusUpdated::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_OnRadiusUpdated, CallFunc_Instance_ReturnValue) == 0x000018, "Member 'BP_BattleRoyaleZone_C_OnRadiusUpdated::CallFunc_Instance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_OnRadiusUpdated, CallFunc_Instance_ReturnValue_1) == 0x000020, "Member 'BP_BattleRoyaleZone_C_OnRadiusUpdated::CallFunc_Instance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_OnRadiusUpdated, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_BattleRoyaleZone_C_OnRadiusUpdated::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_OnRadiusUpdated, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BP_BattleRoyaleZone_C_OnRadiusUpdated::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_OnRadiusUpdated, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'BP_BattleRoyaleZone_C_OnRadiusUpdated::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_OnRadiusUpdated, CallFunc_BooleanAND_ReturnValue_1) == 0x000039, "Member 'BP_BattleRoyaleZone_C_OnRadiusUpdated::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_OnRadiusUpdated, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'BP_BattleRoyaleZone_C_OnRadiusUpdated::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_OnRadiusUpdated, CallFunc_LessEqual_DoubleDouble_B_ImplicitCast) == 0x000048, "Member 'BP_BattleRoyaleZone_C_OnRadiusUpdated::CallFunc_LessEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_BattleRoyaleZone.BP_BattleRoyaleZone_C.ExecuteUbergraph_BP_BattleRoyaleZone
// 0x0320 (0x0320 - 0x0000)
struct BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float NewRadius)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShrinking_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_577C[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetLandingZoneOrigin_ReturnValue;         // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_577D[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0060(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_BreakVector_X;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_577E[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00C0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_577F[0x1];                                     // 0x01BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5780[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5781[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5782[0x8];                                     // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_LandingLocationMarker_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone) == 0x000010, "Wrong alignment on BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone");
static_assert(sizeof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone) == 0x000320, "Wrong size on BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, EntryPoint) == 0x000000, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, Temp_bool_IsClosed_Variable) == 0x000006, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_HasAuthority_ReturnValue) == 0x000007, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_IsShrinking_ReturnValue) == 0x000018, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_IsShrinking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_IsServer_ReturnValue) == 0x000019, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_GetLandingZoneOrigin_ReturnValue) == 0x000020, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_GetLandingZoneOrigin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakVector2D_X) == 0x000038, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakVector2D_Y) == 0x000040, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, Temp_object_Variable) == 0x000060, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakVector_X) == 0x000070, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakVector_Y) == 0x000078, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakVector_Z) == 0x000080, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_MakeVector_ReturnValue) == 0x000088, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_LineTraceSingle_OutHit) == 0x0000C0, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_LineTraceSingle_ReturnValue) == 0x0001B8, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_bBlockingHit) == 0x0001B9, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001BA, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_Time) == 0x0001BC, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_Distance) == 0x0001C0, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_Location) == 0x0001C8, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_ImpactPoint) == 0x0001E0, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_Normal) == 0x0001F8, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_ImpactNormal) == 0x000210, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_PhysMat) == 0x000228, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_HitActor) == 0x000230, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_HitComponent) == 0x000238, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_HitBoneName) == 0x000240, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_BoneName) == 0x000248, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_HitItem) == 0x000250, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_ElementIndex) == 0x000254, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_FaceIndex) == 0x000258, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_TraceStart) == 0x000260, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BreakHitResult_TraceEnd) == 0x000278, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_SelectVector_ReturnValue) == 0x000290, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_MakeTransform_ReturnValue) == 0x0002B0, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000310, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone, CallFunc_FinishSpawningActor_ReturnValue) == 0x000318, "Member 'BP_BattleRoyaleZone_C_ExecuteUbergraph_BP_BattleRoyaleZone::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

