#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Barrier_ShockEffect_Component

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Barrier_ShockEffect_Component.BP_Barrier_ShockEffect_Component_C.AddEffect
// 0x0028 (0x0028 - 0x0000)
struct BP_Barrier_ShockEffect_Component_C_AddEffect final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_646F[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMultiPartCharacter*                  K2Node_DynamicCast_AsGz_Multi_Part_Character;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6470[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_ShockEffect_Component_C_AddEffect) == 0x000008, "Wrong alignment on BP_Barrier_ShockEffect_Component_C_AddEffect");
static_assert(sizeof(BP_Barrier_ShockEffect_Component_C_AddEffect) == 0x000028, "Wrong size on BP_Barrier_ShockEffect_Component_C_AddEffect");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_AddEffect, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_Barrier_ShockEffect_Component_C_AddEffect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_AddEffect, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_Barrier_ShockEffect_Component_C_AddEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_AddEffect, K2Node_DynamicCast_AsGz_Multi_Part_Character) == 0x000010, "Member 'BP_Barrier_ShockEffect_Component_C_AddEffect::K2Node_DynamicCast_AsGz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_AddEffect, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Barrier_ShockEffect_Component_C_AddEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_AddEffect, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000020, "Member 'BP_Barrier_ShockEffect_Component_C_AddEffect::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function BP_Barrier_ShockEffect_Component.BP_Barrier_ShockEffect_Component_C.ExecuteUbergraph_BP_Barrier_ShockEffect_Component
// 0x0060 (0x0060 - 0x0000)
struct BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6471[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component) == 0x000008, "Wrong alignment on BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component");
static_assert(sizeof(BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component) == 0x000060, "Wrong size on BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component, EntryPoint) == 0x000000, "Member 'BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component, K2Node_CustomEvent_Tag_1) == 0x000004, "Member 'BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component, K2Node_CustomEvent_Tag) == 0x00001C, "Member 'BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component, Temp_struct_Variable) == 0x000034, "Member 'BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component, K2Node_Event_EndPlayReason) == 0x00003C, "Member 'BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000048, "Member 'BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue) == 0x000050, "Member 'BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_Barrier_ShockEffect_Component_C_ExecuteUbergraph_BP_Barrier_ShockEffect_Component::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Barrier_ShockEffect_Component.BP_Barrier_ShockEffect_Component_C.OnTagAdded_53E30CA143DE74D9594CB2B67AC55D1A
// 0x0008 (0x0008 - 0x0000)
struct BP_Barrier_ShockEffect_Component_C_OnTagAdded_53E30CA143DE74D9594CB2B67AC55D1A final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_ShockEffect_Component_C_OnTagAdded_53E30CA143DE74D9594CB2B67AC55D1A) == 0x000004, "Wrong alignment on BP_Barrier_ShockEffect_Component_C_OnTagAdded_53E30CA143DE74D9594CB2B67AC55D1A");
static_assert(sizeof(BP_Barrier_ShockEffect_Component_C_OnTagAdded_53E30CA143DE74D9594CB2B67AC55D1A) == 0x000008, "Wrong size on BP_Barrier_ShockEffect_Component_C_OnTagAdded_53E30CA143DE74D9594CB2B67AC55D1A");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_OnTagAdded_53E30CA143DE74D9594CB2B67AC55D1A, Tag) == 0x000000, "Member 'BP_Barrier_ShockEffect_Component_C_OnTagAdded_53E30CA143DE74D9594CB2B67AC55D1A::Tag' has a wrong offset!");

// Function BP_Barrier_ShockEffect_Component.BP_Barrier_ShockEffect_Component_C.OnTagRemoved_53E30CA143DE74D9594CB2B67AC55D1A
// 0x0008 (0x0008 - 0x0000)
struct BP_Barrier_ShockEffect_Component_C_OnTagRemoved_53E30CA143DE74D9594CB2B67AC55D1A final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_ShockEffect_Component_C_OnTagRemoved_53E30CA143DE74D9594CB2B67AC55D1A) == 0x000004, "Wrong alignment on BP_Barrier_ShockEffect_Component_C_OnTagRemoved_53E30CA143DE74D9594CB2B67AC55D1A");
static_assert(sizeof(BP_Barrier_ShockEffect_Component_C_OnTagRemoved_53E30CA143DE74D9594CB2B67AC55D1A) == 0x000008, "Wrong size on BP_Barrier_ShockEffect_Component_C_OnTagRemoved_53E30CA143DE74D9594CB2B67AC55D1A");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_OnTagRemoved_53E30CA143DE74D9594CB2B67AC55D1A, Tag) == 0x000000, "Member 'BP_Barrier_ShockEffect_Component_C_OnTagRemoved_53E30CA143DE74D9594CB2B67AC55D1A::Tag' has a wrong offset!");

// Function BP_Barrier_ShockEffect_Component.BP_Barrier_ShockEffect_Component_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Barrier_ShockEffect_Component_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_ShockEffect_Component_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Barrier_ShockEffect_Component_C_ReceiveEndPlay");
static_assert(sizeof(BP_Barrier_ShockEffect_Component_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Barrier_ShockEffect_Component_C_ReceiveEndPlay");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Barrier_ShockEffect_Component_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Barrier_ShockEffect_Component.BP_Barrier_ShockEffect_Component_C.RemoveEffect
// 0x0001 (0x0001 - 0x0000)
struct BP_Barrier_ShockEffect_Component_C_RemoveEffect final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Barrier_ShockEffect_Component_C_RemoveEffect) == 0x000001, "Wrong alignment on BP_Barrier_ShockEffect_Component_C_RemoveEffect");
static_assert(sizeof(BP_Barrier_ShockEffect_Component_C_RemoveEffect) == 0x000001, "Wrong size on BP_Barrier_ShockEffect_Component_C_RemoveEffect");
static_assert(offsetof(BP_Barrier_ShockEffect_Component_C_RemoveEffect, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Barrier_ShockEffect_Component_C_RemoveEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

