#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CanInteract_LootDropContainer

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CanInteract_LootDropContainer.BP_CanInteract_LootDropContainer_C.IsInteractionConditionPassed
// 0x0028 (0x0028 - 0x0000)
struct BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed final
{
public:
	const class AGzCharacter*                     InteractedBy;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           InteractableOwner;                                 // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AB2[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzLoadoutSelectionComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanGiveLoadout_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed) == 0x000008, "Wrong alignment on BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed");
static_assert(sizeof(BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed) == 0x000028, "Wrong size on BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed");
static_assert(offsetof(BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed, InteractedBy) == 0x000000, "Member 'BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed::InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed, InteractableOwner) == 0x000008, "Member 'BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed::InteractableOwner' has a wrong offset!");
static_assert(offsetof(BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed, ReturnValue) == 0x000010, "Member 'BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed, CallFunc_CanGiveLoadout_ReturnValue) == 0x000020, "Member 'BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed::CallFunc_CanGiveLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_CanInteract_LootDropContainer_C_IsInteractionConditionPassed::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

