#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Cloak_Field

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Cloak_Field.BP_Cloak_Field_C.ExecuteUbergraph_BP_Cloak_Field
// 0x0160 (0x0160 - 0x0000)
struct BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Radius;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D18[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0060(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field) == 0x000008, "Wrong alignment on BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field");
static_assert(sizeof(BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field) == 0x000160, "Wrong size on BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field");
static_assert(offsetof(BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field, EntryPoint) == 0x000000, "Member 'BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field, K2Node_CustomEvent_Radius) == 0x000008, "Member 'BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field::K2Node_CustomEvent_Radius' has a wrong offset!");
static_assert(offsetof(BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000060, "Member 'BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000158, "Member 'BP_Cloak_Field_C_ExecuteUbergraph_BP_Cloak_Field::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_Cloak_Field.BP_Cloak_Field_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Cloak_Field_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cloak_Field_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Cloak_Field_C_ReceiveTick");
static_assert(sizeof(BP_Cloak_Field_C_ReceiveTick) == 0x000004, "Wrong size on BP_Cloak_Field_C_ReceiveTick");
static_assert(offsetof(BP_Cloak_Field_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Cloak_Field_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Cloak_Field.BP_Cloak_Field_C.Update
// 0x0008 (0x0008 - 0x0000)
struct BP_Cloak_Field_C_Update final
{
public:
	double                                        Radius;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cloak_Field_C_Update) == 0x000008, "Wrong alignment on BP_Cloak_Field_C_Update");
static_assert(sizeof(BP_Cloak_Field_C_Update) == 0x000008, "Wrong size on BP_Cloak_Field_C_Update");
static_assert(offsetof(BP_Cloak_Field_C_Update, Radius) == 0x000000, "Member 'BP_Cloak_Field_C_Update::Radius' has a wrong offset!");

}

