#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConvoyVehicleBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_ConvoyVehicleBase.BP_ConvoyVehicleBase_C.Editor_SnapToSplinePoint
// 0x0170 (0x0170 - 0x0000)
struct BP_ConvoyVehicleBase_C_Editor_SnapToSplinePoint final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E89[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtSplinePoint_ReturnValue;    // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0070(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConvoyVehicleBase_C_Editor_SnapToSplinePoint) == 0x000010, "Wrong alignment on BP_ConvoyVehicleBase_C_Editor_SnapToSplinePoint");
static_assert(sizeof(BP_ConvoyVehicleBase_C_Editor_SnapToSplinePoint) == 0x000170, "Wrong size on BP_ConvoyVehicleBase_C_Editor_SnapToSplinePoint");
static_assert(offsetof(BP_ConvoyVehicleBase_C_Editor_SnapToSplinePoint, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_ConvoyVehicleBase_C_Editor_SnapToSplinePoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_Editor_SnapToSplinePoint, CallFunc_GetTransformAtSplinePoint_ReturnValue) == 0x000010, "Member 'BP_ConvoyVehicleBase_C_Editor_SnapToSplinePoint::CallFunc_GetTransformAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_Editor_SnapToSplinePoint, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000070, "Member 'BP_ConvoyVehicleBase_C_Editor_SnapToSplinePoint::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_Editor_SnapToSplinePoint, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000168, "Member 'BP_ConvoyVehicleBase_C_Editor_SnapToSplinePoint::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function BP_ConvoyVehicleBase.BP_ConvoyVehicleBase_C.ExecuteUbergraph_BP_ConvoyVehicleBase
// 0x0048 (0x0048 - 0x0000)
struct BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Stop;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E8A[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0018(0x0018)()
	double                                        CallFunc_GetDestroyedStoppingDistance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E8B[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_StopMoving_StopDistance_ImplicitCast;     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase) == 0x000008, "Wrong alignment on BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase");
static_assert(sizeof(BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase) == 0x000048, "Wrong size on BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase");
static_assert(offsetof(BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase, EntryPoint) == 0x000000, "Member 'BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase, K2Node_Event_Stop) == 0x000004, "Member 'BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase::K2Node_Event_Stop' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase, CallFunc_Greater_IntInt_ReturnValue) == 0x000009, "Member 'BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase, CallFunc_MakeEffectContext_ReturnValue) == 0x000018, "Member 'BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase, CallFunc_GetDestroyedStoppingDistance_ReturnValue) == 0x000030, "Member 'BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase::CallFunc_GetDestroyedStoppingDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000038, "Member 'BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase, CallFunc_StopMoving_StopDistance_ImplicitCast) == 0x000044, "Member 'BP_ConvoyVehicleBase_C_ExecuteUbergraph_BP_ConvoyVehicleBase::CallFunc_StopMoving_StopDistance_ImplicitCast' has a wrong offset!");

// Function BP_ConvoyVehicleBase.BP_ConvoyVehicleBase_C.GetDestroyedStoppingDistance
// 0x0058 (0x0058 - 0x0000)
struct BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Gravity;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FrictionCoefficient;                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentSpeed_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E8C[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Square_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Square_A_ImplicitCast;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance) == 0x000008, "Wrong alignment on BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance");
static_assert(sizeof(BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance) == 0x000058, "Wrong size on BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance");
static_assert(offsetof(BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance, ReturnValue) == 0x000000, "Member 'BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance, Gravity) == 0x000008, "Member 'BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance::Gravity' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance, FrictionCoefficient) == 0x000010, "Member 'BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance::FrictionCoefficient' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance, CallFunc_GetCurrentSpeed_ReturnValue) == 0x000018, "Member 'BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance::CallFunc_GetCurrentSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance, CallFunc_Square_ReturnValue) == 0x000028, "Member 'BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000040, "Member 'BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance, CallFunc_Square_A_ImplicitCast) == 0x000048, "Member 'BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance::CallFunc_Square_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000050, "Member 'BP_ConvoyVehicleBase_C_GetDestroyedStoppingDistance::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_ConvoyVehicleBase.BP_ConvoyVehicleBase_C.ReceiveWaitOnStop
// 0x0004 (0x0004 - 0x0000)
struct BP_ConvoyVehicleBase_C_ReceiveWaitOnStop final
{
public:
	int32                                         Stop;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConvoyVehicleBase_C_ReceiveWaitOnStop) == 0x000004, "Wrong alignment on BP_ConvoyVehicleBase_C_ReceiveWaitOnStop");
static_assert(sizeof(BP_ConvoyVehicleBase_C_ReceiveWaitOnStop) == 0x000004, "Wrong size on BP_ConvoyVehicleBase_C_ReceiveWaitOnStop");
static_assert(offsetof(BP_ConvoyVehicleBase_C_ReceiveWaitOnStop, Stop) == 0x000000, "Member 'BP_ConvoyVehicleBase_C_ReceiveWaitOnStop::Stop' has a wrong offset!");

// Function BP_ConvoyVehicleBase.BP_ConvoyVehicleBase_C.TryMoveToNextStop
// 0x0002 (0x0002 - 0x0000)
struct BP_ConvoyVehicleBase_C_TryMoveToNextStop final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConvoyVehicleBase_C_TryMoveToNextStop) == 0x000001, "Wrong alignment on BP_ConvoyVehicleBase_C_TryMoveToNextStop");
static_assert(sizeof(BP_ConvoyVehicleBase_C_TryMoveToNextStop) == 0x000002, "Wrong size on BP_ConvoyVehicleBase_C_TryMoveToNextStop");
static_assert(offsetof(BP_ConvoyVehicleBase_C_TryMoveToNextStop, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_ConvoyVehicleBase_C_TryMoveToNextStop::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConvoyVehicleBase_C_TryMoveToNextStop, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_ConvoyVehicleBase_C_TryMoveToNextStop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

