#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CyberlimbsDummyPlayerDummy

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CyberlimbsDummyPlayerDummy.BP_CyberlimbsDummyPlayerDummy_C.AddDampedImpulse
// 0x0018 (0x0018 - 0x0000)
struct BP_CyberlimbsDummyPlayerDummy_C_AddDampedImpulse final
{
public:
	struct FVector                                Impulse;                                           // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CyberlimbsDummyPlayerDummy_C_AddDampedImpulse) == 0x000008, "Wrong alignment on BP_CyberlimbsDummyPlayerDummy_C_AddDampedImpulse");
static_assert(sizeof(BP_CyberlimbsDummyPlayerDummy_C_AddDampedImpulse) == 0x000018, "Wrong size on BP_CyberlimbsDummyPlayerDummy_C_AddDampedImpulse");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AddDampedImpulse, Impulse) == 0x000000, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AddDampedImpulse::Impulse' has a wrong offset!");

// Function BP_CyberlimbsDummyPlayerDummy.BP_CyberlimbsDummyPlayerDummy_C.AttachNewLimb
// 0x01A0 (0x01A0 - 0x0000)
struct BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb final
{
public:
	EGzLimbType                                   LimbType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_617A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzInvItem                             NewLimbItem;                                       // 0x0008(0x0010)(Edit, BlueprintVisible)
	EGzLimbType                                   Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_617B[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzItemData*                            CallFunc_GetItemData_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        Temp_struct_Variable;                              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        Temp_struct_Variable_1;                            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        Temp_struct_Variable_2;                            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0058(0x00B0)()
	struct FPrimaryAssetId                        K2Node_Select_Default;                             // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetObjectFromPrimaryAssetId_ReturnValue;  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzInvComponent*                        CallFunc_GetInventoryComponent_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzBodyPartItemData*                    K2Node_DynamicCast_AsGz_Body_Part_Item_Data;       // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddItem_ReturnValue;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_617C[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzLimbInvItem                         K2Node_MakeStruct_GzLimbInvItem;                   // 0x0138(0x0058)()
	struct FGzInvItem                             CallFunc_MakeItemFromLimb_ReturnValue;             // 0x0190(0x0010)()
};
static_assert(alignof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb) == 0x000008, "Wrong alignment on BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb");
static_assert(sizeof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb) == 0x0001A0, "Wrong size on BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, LimbType) == 0x000000, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::LimbType' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, NewLimbItem) == 0x000008, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::NewLimbItem' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, Temp_byte_Variable) == 0x000018, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, CallFunc_GetItemData_ReturnValue) == 0x000020, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, Temp_struct_Variable) == 0x000028, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, Temp_struct_Variable_1) == 0x000038, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, Temp_struct_Variable_2) == 0x000048, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, K2Node_MakeStruct_GameplayEventData) == 0x000058, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, K2Node_Select_Default) == 0x000108, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, CallFunc_GetObjectFromPrimaryAssetId_ReturnValue) == 0x000118, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::CallFunc_GetObjectFromPrimaryAssetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, CallFunc_GetInventoryComponent_ReturnValue) == 0x000120, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::CallFunc_GetInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, K2Node_DynamicCast_AsGz_Body_Part_Item_Data) == 0x000128, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::K2Node_DynamicCast_AsGz_Body_Part_Item_Data' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, CallFunc_AddItem_ReturnValue) == 0x000131, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::CallFunc_AddItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, K2Node_MakeStruct_GzLimbInvItem) == 0x000138, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::K2Node_MakeStruct_GzLimbInvItem' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb, CallFunc_MakeItemFromLimb_ReturnValue) == 0x000190, "Member 'BP_CyberlimbsDummyPlayerDummy_C_AttachNewLimb::CallFunc_MakeItemFromLimb_ReturnValue' has a wrong offset!");

// Function BP_CyberlimbsDummyPlayerDummy.BP_CyberlimbsDummyPlayerDummy_C.ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy
// 0x03B0 (0x03B0 - 0x0000)
struct BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_617D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute_4;                    // 0x0010(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_4;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue_4;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_617E[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0068(0x0038)(HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute_3;                    // 0x00A0(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_3;                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue_3;                     // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable_1;                            // 0x00F8(0x0038)(HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute_2;                    // 0x0140(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_2;                     // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue_2;                     // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable_2;                            // 0x0188(0x0038)(HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute_1;                    // 0x01D0(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_1;                     // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue_1;                     // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_7;                              // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable_3;                            // 0x0218(0x0038)(HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0250(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0260(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_8;                              // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_9;                              // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable_4;                            // 0x02A8(0x0038)(HasGetValueTypeHash)
	class UGzFeedbackProviderSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           CallFunc_ListenForAttributeChange_ReturnValue;     // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           CallFunc_ListenForAttributeChange_ReturnValue_1;   // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_617F[0x6];                                     // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAsyncTaskAttributeChanged*           CallFunc_ListenForAttributeChange_ReturnValue_2;   // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           CallFunc_ListenForAttributeChange_ReturnValue_3;   // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6180[0x6];                                     // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAsyncTaskAttributeChanged*           CallFunc_ListenForAttributeChange_ReturnValue_4;   // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6181[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0338(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6182[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Impulse;                              // 0x0358(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGzHitResponseData                     K2Node_MakeStruct_GzHitResponseData;               // 0x0370(0x0038)(NoDestructor)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy) == 0x000008, "Wrong alignment on BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy");
static_assert(sizeof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy) == 0x0003B0, "Wrong size on BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, EntryPoint) == 0x000000, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_Attribute_4) == 0x000010, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_Attribute_4' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_NewValue_4) == 0x000048, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_NewValue_4' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_OldValue_4) == 0x00004C, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_OldValue_4' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000050, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_real_Variable) == 0x000058, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_real_Variable_1) == 0x00005C, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000060, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_struct_Variable) == 0x000068, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_Attribute_3) == 0x0000A0, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_Attribute_3' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_NewValue_3) == 0x0000D8, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_NewValue_3' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_OldValue_3) == 0x0000DC, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_OldValue_3' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CreateDelegate_OutputDelegate) == 0x0000E0, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_real_Variable_2) == 0x0000F0, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_real_Variable_3) == 0x0000F4, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_struct_Variable_1) == 0x0000F8, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CreateDelegate_OutputDelegate_1) == 0x000130, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_Attribute_2) == 0x000140, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_Attribute_2' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_NewValue_2) == 0x000178, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_NewValue_2' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_OldValue_2) == 0x00017C, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_OldValue_2' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_real_Variable_4) == 0x000180, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_real_Variable_5) == 0x000184, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_struct_Variable_2) == 0x000188, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001C0, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_Attribute_1) == 0x0001D0, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_Attribute_1' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_NewValue_1) == 0x000208, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_OldValue_1) == 0x00020C, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_OldValue_1' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_real_Variable_6) == 0x000210, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_real_Variable_7) == 0x000214, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_struct_Variable_3) == 0x000218, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CreateDelegate_OutputDelegate_3) == 0x000250, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_Attribute) == 0x000260, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_NewValue) == 0x000298, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CustomEvent_OldValue) == 0x00029C, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_real_Variable_8) == 0x0002A0, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_real_Variable_9) == 0x0002A4, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, Temp_struct_Variable_4) == 0x0002A8, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0002E0, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x0002E8, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_ListenForAttributeChange_ReturnValue) == 0x0002F0, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_ListenForAttributeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_ListenForAttributeChange_ReturnValue_1) == 0x0002F8, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_ListenForAttributeChange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_IsValid_ReturnValue) == 0x000300, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_IsValid_ReturnValue_1) == 0x000301, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_ListenForAttributeChange_ReturnValue_2) == 0x000308, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_ListenForAttributeChange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_ListenForAttributeChange_ReturnValue_3) == 0x000310, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_ListenForAttributeChange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_IsValid_ReturnValue_2) == 0x000318, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_IsValid_ReturnValue_3) == 0x000319, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_ListenForAttributeChange_ReturnValue_4) == 0x000320, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_ListenForAttributeChange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_IsValid_ReturnValue_4) == 0x000328, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000330, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_CreateDelegate_OutputDelegate_4) == 0x000338, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_K2_GetPawn_ReturnValue) == 0x000348, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_IsPlayerControlled_ReturnValue) == 0x000350, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_Event_Impulse) == 0x000358, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_Event_Impulse' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, K2Node_MakeStruct_GzHitResponseData) == 0x000370, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::K2Node_MakeStruct_GzHitResponseData' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0003A8, "Member 'BP_CyberlimbsDummyPlayerDummy_C_ExecuteUbergraph_BP_CyberlimbsDummyPlayerDummy::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_CyberlimbsDummyPlayerDummy.BP_CyberlimbsDummyPlayerDummy_C.GetLimbItem
// 0x01B8 (0x01B8 - 0x0000)
struct BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem final
{
public:
	EGzLimbType                                   LimbType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6183[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzLimbInvItem                         Limb_Item;                                         // 0x0008(0x0058)(Parm, OutParm)
	class UObject*                                CallFunc_GetObjectFromPrimaryAssetId_ReturnValue;  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6184[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzBodyPartItemData*                    K2Node_DynamicCast_AsGz_Body_Part_Item_Data;       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6185[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetObjectFromPrimaryAssetId_ReturnValue_1; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGzLimbInvItem                         K2Node_MakeStruct_GzLimbInvItem;                   // 0x0088(0x0058)()
	class UGzBodyPartItemData*                    K2Node_DynamicCast_AsGz_Body_Part_Item_Data_1;     // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6186[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzLimbInvItem                         K2Node_MakeStruct_GzLimbInvItem_1;                 // 0x00F0(0x0058)()
	class UObject*                                CallFunc_GetObjectFromPrimaryAssetId_ReturnValue_2; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzBodyPartItemData*                    K2Node_DynamicCast_AsGz_Body_Part_Item_Data_2;     // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6187[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzLimbInvItem                         K2Node_MakeStruct_GzLimbInvItem_2;                 // 0x0160(0x0058)()
};
static_assert(alignof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem) == 0x000008, "Wrong alignment on BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem");
static_assert(sizeof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem) == 0x0001B8, "Wrong size on BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, LimbType) == 0x000000, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::LimbType' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, Limb_Item) == 0x000008, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::Limb_Item' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, CallFunc_GetObjectFromPrimaryAssetId_ReturnValue) == 0x000060, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::CallFunc_GetObjectFromPrimaryAssetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, K2Node_SwitchEnum_CmpSuccess) == 0x000068, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, K2Node_DynamicCast_AsGz_Body_Part_Item_Data) == 0x000070, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::K2Node_DynamicCast_AsGz_Body_Part_Item_Data' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, CallFunc_GetObjectFromPrimaryAssetId_ReturnValue_1) == 0x000080, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::CallFunc_GetObjectFromPrimaryAssetId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, K2Node_MakeStruct_GzLimbInvItem) == 0x000088, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::K2Node_MakeStruct_GzLimbInvItem' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, K2Node_DynamicCast_AsGz_Body_Part_Item_Data_1) == 0x0000E0, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::K2Node_DynamicCast_AsGz_Body_Part_Item_Data_1' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, K2Node_MakeStruct_GzLimbInvItem_1) == 0x0000F0, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::K2Node_MakeStruct_GzLimbInvItem_1' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, CallFunc_GetObjectFromPrimaryAssetId_ReturnValue_2) == 0x000148, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::CallFunc_GetObjectFromPrimaryAssetId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, K2Node_DynamicCast_AsGz_Body_Part_Item_Data_2) == 0x000150, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::K2Node_DynamicCast_AsGz_Body_Part_Item_Data_2' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, K2Node_DynamicCast_bSuccess_2) == 0x000158, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem, K2Node_MakeStruct_GzLimbInvItem_2) == 0x000160, "Member 'BP_CyberlimbsDummyPlayerDummy_C_GetLimbItem::K2Node_MakeStruct_GzLimbInvItem_2' has a wrong offset!");

// Function BP_CyberlimbsDummyPlayerDummy.BP_CyberlimbsDummyPlayerDummy_C.OnAttributeChanged_72526699439C27C16244F4BF62D625F7
// 0x0040 (0x0040 - 0x0000)
struct BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_72526699439C27C16244F4BF62D625F7 final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_72526699439C27C16244F4BF62D625F7) == 0x000008, "Wrong alignment on BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_72526699439C27C16244F4BF62D625F7");
static_assert(sizeof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_72526699439C27C16244F4BF62D625F7) == 0x000040, "Wrong size on BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_72526699439C27C16244F4BF62D625F7");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_72526699439C27C16244F4BF62D625F7, Attribute) == 0x000000, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_72526699439C27C16244F4BF62D625F7::Attribute' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_72526699439C27C16244F4BF62D625F7, NewValue) == 0x000038, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_72526699439C27C16244F4BF62D625F7::NewValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_72526699439C27C16244F4BF62D625F7, OldValue) == 0x00003C, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_72526699439C27C16244F4BF62D625F7::OldValue' has a wrong offset!");

// Function BP_CyberlimbsDummyPlayerDummy.BP_CyberlimbsDummyPlayerDummy_C.OnAttributeChanged_88F63EA441B89C72D89D97B526C77AA6
// 0x0040 (0x0040 - 0x0000)
struct BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_88F63EA441B89C72D89D97B526C77AA6 final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_88F63EA441B89C72D89D97B526C77AA6) == 0x000008, "Wrong alignment on BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_88F63EA441B89C72D89D97B526C77AA6");
static_assert(sizeof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_88F63EA441B89C72D89D97B526C77AA6) == 0x000040, "Wrong size on BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_88F63EA441B89C72D89D97B526C77AA6");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_88F63EA441B89C72D89D97B526C77AA6, Attribute) == 0x000000, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_88F63EA441B89C72D89D97B526C77AA6::Attribute' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_88F63EA441B89C72D89D97B526C77AA6, NewValue) == 0x000038, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_88F63EA441B89C72D89D97B526C77AA6::NewValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_88F63EA441B89C72D89D97B526C77AA6, OldValue) == 0x00003C, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_88F63EA441B89C72D89D97B526C77AA6::OldValue' has a wrong offset!");

// Function BP_CyberlimbsDummyPlayerDummy.BP_CyberlimbsDummyPlayerDummy_C.OnAttributeChanged_8B20D2FD4E65AD15C18B4D8FFAA64443
// 0x0040 (0x0040 - 0x0000)
struct BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_8B20D2FD4E65AD15C18B4D8FFAA64443 final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_8B20D2FD4E65AD15C18B4D8FFAA64443) == 0x000008, "Wrong alignment on BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_8B20D2FD4E65AD15C18B4D8FFAA64443");
static_assert(sizeof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_8B20D2FD4E65AD15C18B4D8FFAA64443) == 0x000040, "Wrong size on BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_8B20D2FD4E65AD15C18B4D8FFAA64443");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_8B20D2FD4E65AD15C18B4D8FFAA64443, Attribute) == 0x000000, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_8B20D2FD4E65AD15C18B4D8FFAA64443::Attribute' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_8B20D2FD4E65AD15C18B4D8FFAA64443, NewValue) == 0x000038, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_8B20D2FD4E65AD15C18B4D8FFAA64443::NewValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_8B20D2FD4E65AD15C18B4D8FFAA64443, OldValue) == 0x00003C, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_8B20D2FD4E65AD15C18B4D8FFAA64443::OldValue' has a wrong offset!");

// Function BP_CyberlimbsDummyPlayerDummy.BP_CyberlimbsDummyPlayerDummy_C.OnAttributeChanged_AABF4C8141D66983D935B78C980B9D2F
// 0x0040 (0x0040 - 0x0000)
struct BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_AABF4C8141D66983D935B78C980B9D2F final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_AABF4C8141D66983D935B78C980B9D2F) == 0x000008, "Wrong alignment on BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_AABF4C8141D66983D935B78C980B9D2F");
static_assert(sizeof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_AABF4C8141D66983D935B78C980B9D2F) == 0x000040, "Wrong size on BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_AABF4C8141D66983D935B78C980B9D2F");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_AABF4C8141D66983D935B78C980B9D2F, Attribute) == 0x000000, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_AABF4C8141D66983D935B78C980B9D2F::Attribute' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_AABF4C8141D66983D935B78C980B9D2F, NewValue) == 0x000038, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_AABF4C8141D66983D935B78C980B9D2F::NewValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_AABF4C8141D66983D935B78C980B9D2F, OldValue) == 0x00003C, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_AABF4C8141D66983D935B78C980B9D2F::OldValue' has a wrong offset!");

// Function BP_CyberlimbsDummyPlayerDummy.BP_CyberlimbsDummyPlayerDummy_C.OnAttributeChanged_DCB0028C4B12318184EB748B126EBC3E
// 0x0040 (0x0040 - 0x0000)
struct BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_DCB0028C4B12318184EB748B126EBC3E final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_DCB0028C4B12318184EB748B126EBC3E) == 0x000008, "Wrong alignment on BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_DCB0028C4B12318184EB748B126EBC3E");
static_assert(sizeof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_DCB0028C4B12318184EB748B126EBC3E) == 0x000040, "Wrong size on BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_DCB0028C4B12318184EB748B126EBC3E");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_DCB0028C4B12318184EB748B126EBC3E, Attribute) == 0x000000, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_DCB0028C4B12318184EB748B126EBC3E::Attribute' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_DCB0028C4B12318184EB748B126EBC3E, NewValue) == 0x000038, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_DCB0028C4B12318184EB748B126EBC3E::NewValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_DCB0028C4B12318184EB748B126EBC3E, OldValue) == 0x00003C, "Member 'BP_CyberlimbsDummyPlayerDummy_C_OnAttributeChanged_DCB0028C4B12318184EB748B126EBC3E::OldValue' has a wrong offset!");

// Function BP_CyberlimbsDummyPlayerDummy.BP_CyberlimbsDummyPlayerDummy_C.RestoreLimbs
// 0x0050 (0x0050 - 0x0000)
struct BP_CyberlimbsDummyPlayerDummy_C_RestoreLimbs final
{
public:
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6188[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6189[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2;  // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CyberlimbsDummyPlayerDummy_C_RestoreLimbs) == 0x000008, "Wrong alignment on BP_CyberlimbsDummyPlayerDummy_C_RestoreLimbs");
static_assert(sizeof(BP_CyberlimbsDummyPlayerDummy_C_RestoreLimbs) == 0x000050, "Wrong size on BP_CyberlimbsDummyPlayerDummy_C_RestoreLimbs");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_RestoreLimbs, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000000, "Member 'BP_CyberlimbsDummyPlayerDummy_C_RestoreLimbs::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyberlimbsDummyPlayerDummy_C_RestoreLimbs, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000008, "Member 'BP_CyberlimbsDummyPlayerDummy_C_RestoreLimbs::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
