#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Component_Trigger

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Component_Trigger.BP_Component_Trigger_C.OnTriggerStateChange__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Component_Trigger_C_OnTriggerStateChange__DelegateSignature final
{
public:
	class UBP_Component_Trigger_C*                TriggerComp;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_Triggered;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Component_Trigger_C_OnTriggerStateChange__DelegateSignature) == 0x000008, "Wrong alignment on BP_Component_Trigger_C_OnTriggerStateChange__DelegateSignature");
static_assert(sizeof(BP_Component_Trigger_C_OnTriggerStateChange__DelegateSignature) == 0x000010, "Wrong size on BP_Component_Trigger_C_OnTriggerStateChange__DelegateSignature");
static_assert(offsetof(BP_Component_Trigger_C_OnTriggerStateChange__DelegateSignature, TriggerComp) == 0x000000, "Member 'BP_Component_Trigger_C_OnTriggerStateChange__DelegateSignature::TriggerComp' has a wrong offset!");
static_assert(offsetof(BP_Component_Trigger_C_OnTriggerStateChange__DelegateSignature, Param_Triggered) == 0x000008, "Member 'BP_Component_Trigger_C_OnTriggerStateChange__DelegateSignature::Param_Triggered' has a wrong offset!");

// Function BP_Component_Trigger.BP_Component_Trigger_C.ExecuteUbergraph_BP_Component_Trigger
// 0x0018 (0x0018 - 0x0000)
struct BP_Component_Trigger_C_ExecuteUbergraph_BP_Component_Trigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B98[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Component_Trigger_C_ExecuteUbergraph_BP_Component_Trigger) == 0x000008, "Wrong alignment on BP_Component_Trigger_C_ExecuteUbergraph_BP_Component_Trigger");
static_assert(sizeof(BP_Component_Trigger_C_ExecuteUbergraph_BP_Component_Trigger) == 0x000018, "Wrong size on BP_Component_Trigger_C_ExecuteUbergraph_BP_Component_Trigger");
static_assert(offsetof(BP_Component_Trigger_C_ExecuteUbergraph_BP_Component_Trigger, EntryPoint) == 0x000000, "Member 'BP_Component_Trigger_C_ExecuteUbergraph_BP_Component_Trigger::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Component_Trigger_C_ExecuteUbergraph_BP_Component_Trigger, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_Component_Trigger_C_ExecuteUbergraph_BP_Component_Trigger::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Trigger_C_ExecuteUbergraph_BP_Component_Trigger, CallFunc_IsServer_ReturnValue) == 0x000010, "Member 'BP_Component_Trigger_C_ExecuteUbergraph_BP_Component_Trigger::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Trigger_C_ExecuteUbergraph_BP_Component_Trigger, CallFunc_IsServer_ReturnValue_1) == 0x000011, "Member 'BP_Component_Trigger_C_ExecuteUbergraph_BP_Component_Trigger::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");

// Function BP_Component_Trigger.BP_Component_Trigger_C.isTriggered
// 0x0001 (0x0001 - 0x0000)
struct BP_Component_Trigger_C_IsTriggered final
{
public:
	bool                                          Param_Triggered;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Component_Trigger_C_IsTriggered) == 0x000001, "Wrong alignment on BP_Component_Trigger_C_IsTriggered");
static_assert(sizeof(BP_Component_Trigger_C_IsTriggered) == 0x000001, "Wrong size on BP_Component_Trigger_C_IsTriggered");
static_assert(offsetof(BP_Component_Trigger_C_IsTriggered, Param_Triggered) == 0x000000, "Member 'BP_Component_Trigger_C_IsTriggered::Param_Triggered' has a wrong offset!");

}

