#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CloakComponent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_CloakComponent.BP_CloakComponent_C.ExecuteUbergraph_BP_CloakComponent
// 0x0130 (0x0130 - 0x0000)
struct BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64B7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMultiPartCharacter*                  CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0010(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0068(0x0038)(HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x00A0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x00B0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bActive)>                 K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64B8[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64B9[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayAttribute>             K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	class AGzMultiPartCharacter*                  CallFunc_GetOwnerCharacter_ReturnValue_1;          // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzAbilitySystemComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzMultiPartCharacter*                  CallFunc_GetOwnerCharacter_ReturnValue_2;          // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           CallFunc_ListenForAttributesChange_ReturnValue;    // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bActive;                        // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent) == 0x000008, "Wrong alignment on BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent");
static_assert(sizeof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent) == 0x000130, "Wrong size on BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, EntryPoint) == 0x000000, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000008, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, K2Node_CustomEvent_Attribute) == 0x000010, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, K2Node_CustomEvent_NewValue) == 0x000048, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, K2Node_CustomEvent_OldValue) == 0x00004C, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, Temp_real_Variable) == 0x000060, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, Temp_real_Variable_1) == 0x000064, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, Temp_struct_Variable) == 0x000068, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, Temp_delegate_Variable) == 0x0000A0, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, Temp_delegate_Variable_1) == 0x0000B0, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, CallFunc_PostEvent_ReturnValue) == 0x0000C0, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C4, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000D4, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, CallFunc_GetOwner_ReturnValue) == 0x0000D8, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, CallFunc_HasAuthority_ReturnValue) == 0x0000E0, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000E8, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000F0, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, K2Node_MakeArray_Array) == 0x0000F8, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, CallFunc_GetOwnerCharacter_ReturnValue_1) == 0x000108, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::CallFunc_GetOwnerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000110, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, CallFunc_GetOwnerCharacter_ReturnValue_2) == 0x000118, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::CallFunc_GetOwnerCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, CallFunc_ListenForAttributesChange_ReturnValue) == 0x000120, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::CallFunc_ListenForAttributesChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, CallFunc_PostEvent_ReturnValue_1) == 0x000128, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, CallFunc_IsValid_ReturnValue) == 0x00012C, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, CallFunc_IsValid_ReturnValue_1) == 0x00012D, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent, K2Node_CustomEvent_bActive) == 0x00012E, "Member 'BP_CloakComponent_C_ExecuteUbergraph_BP_CloakComponent::K2Node_CustomEvent_bActive' has a wrong offset!");

// Function BP_CloakComponent.BP_CloakComponent_C.HandlUpdateCloakState
// 0x0048 (0x0048 - 0x0000)
struct BP_CloakComponent_C_HandlUpdateCloakState final
{
public:
	bool                                          bActivve;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64BA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_CloakAbilityComponent_C*>    CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64BB[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CloakAbilityComponent_C*            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64BC[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CloakComponent_C_HandlUpdateCloakState) == 0x000008, "Wrong alignment on BP_CloakComponent_C_HandlUpdateCloakState");
static_assert(sizeof(BP_CloakComponent_C_HandlUpdateCloakState) == 0x000048, "Wrong size on BP_CloakComponent_C_HandlUpdateCloakState");
static_assert(offsetof(BP_CloakComponent_C_HandlUpdateCloakState, bActivve) == 0x000000, "Member 'BP_CloakComponent_C_HandlUpdateCloakState::bActivve' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_HandlUpdateCloakState, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_CloakComponent_C_HandlUpdateCloakState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_HandlUpdateCloakState, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_CloakComponent_C_HandlUpdateCloakState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_HandlUpdateCloakState, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_CloakComponent_C_HandlUpdateCloakState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_HandlUpdateCloakState, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_CloakComponent_C_HandlUpdateCloakState::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_HandlUpdateCloakState, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'BP_CloakComponent_C_HandlUpdateCloakState::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_HandlUpdateCloakState, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_CloakComponent_C_HandlUpdateCloakState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_HandlUpdateCloakState, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_CloakComponent_C_HandlUpdateCloakState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_HandlUpdateCloakState, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_CloakComponent_C_HandlUpdateCloakState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_HandlUpdateCloakState, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_CloakComponent_C_HandlUpdateCloakState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_HandlUpdateCloakState, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_CloakComponent_C_HandlUpdateCloakState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CloakComponent.BP_CloakComponent_C.OnAttributeChanged_78E6166B44666C26F57FBC8A8B33103C
// 0x0040 (0x0040 - 0x0000)
struct BP_CloakComponent_C_OnAttributeChanged_78E6166B44666C26F57FBC8A8B33103C final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CloakComponent_C_OnAttributeChanged_78E6166B44666C26F57FBC8A8B33103C) == 0x000008, "Wrong alignment on BP_CloakComponent_C_OnAttributeChanged_78E6166B44666C26F57FBC8A8B33103C");
static_assert(sizeof(BP_CloakComponent_C_OnAttributeChanged_78E6166B44666C26F57FBC8A8B33103C) == 0x000040, "Wrong size on BP_CloakComponent_C_OnAttributeChanged_78E6166B44666C26F57FBC8A8B33103C");
static_assert(offsetof(BP_CloakComponent_C_OnAttributeChanged_78E6166B44666C26F57FBC8A8B33103C, Attribute) == 0x000000, "Member 'BP_CloakComponent_C_OnAttributeChanged_78E6166B44666C26F57FBC8A8B33103C::Attribute' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_OnAttributeChanged_78E6166B44666C26F57FBC8A8B33103C, NewValue) == 0x000038, "Member 'BP_CloakComponent_C_OnAttributeChanged_78E6166B44666C26F57FBC8A8B33103C::NewValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_OnAttributeChanged_78E6166B44666C26F57FBC8A8B33103C, OldValue) == 0x00003C, "Member 'BP_CloakComponent_C_OnAttributeChanged_78E6166B44666C26F57FBC8A8B33103C::OldValue' has a wrong offset!");

// Function BP_CloakComponent.BP_CloakComponent_C.OnStateChanged_Event
// 0x0001 (0x0001 - 0x0000)
struct BP_CloakComponent_C_OnStateChanged_Event final
{
public:
	bool                                          Param_bActive;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CloakComponent_C_OnStateChanged_Event) == 0x000001, "Wrong alignment on BP_CloakComponent_C_OnStateChanged_Event");
static_assert(sizeof(BP_CloakComponent_C_OnStateChanged_Event) == 0x000001, "Wrong size on BP_CloakComponent_C_OnStateChanged_Event");
static_assert(offsetof(BP_CloakComponent_C_OnStateChanged_Event, Param_bActive) == 0x000000, "Member 'BP_CloakComponent_C_OnStateChanged_Event::Param_bActive' has a wrong offset!");

// Function BP_CloakComponent.BP_CloakComponent_C.SetOwnerMaterial
// 0x0018 (0x0018 - 0x0000)
struct BP_CloakComponent_C_SetOwnerMaterial final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzMultiPartCharacter*                  K2Node_DynamicCast_AsGz_Multi_Part_Character;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CloakComponent_C_SetOwnerMaterial) == 0x000008, "Wrong alignment on BP_CloakComponent_C_SetOwnerMaterial");
static_assert(sizeof(BP_CloakComponent_C_SetOwnerMaterial) == 0x000018, "Wrong size on BP_CloakComponent_C_SetOwnerMaterial");
static_assert(offsetof(BP_CloakComponent_C_SetOwnerMaterial, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_CloakComponent_C_SetOwnerMaterial::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_SetOwnerMaterial, K2Node_DynamicCast_AsGz_Multi_Part_Character) == 0x000008, "Member 'BP_CloakComponent_C_SetOwnerMaterial::K2Node_DynamicCast_AsGz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_SetOwnerMaterial, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_CloakComponent_C_SetOwnerMaterial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CloakComponent_C_SetOwnerMaterial, CallFunc_IsLocallyControlled_ReturnValue) == 0x000011, "Member 'BP_CloakComponent_C_SetOwnerMaterial::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

}

