#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Component_Triggerable

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Component_Triggerable.BP_Component_Triggerable_C.VerifyTriggerActors
// 0x0060 (0x0060 - 0x0000)
struct BP_Component_Triggerable_C_VerifyTriggerActors final
{
public:
	TArray<class AActor*>                         Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class AActor*>                         VerifiedTriggerActors;                             // 0x0010(0x0010)(Parm, OutParm)
	TArray<class AActor*>                         Verified;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_Component_Trigger_C*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_665E[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_665F[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Component_Triggerable_C_VerifyTriggerActors) == 0x000008, "Wrong alignment on BP_Component_Triggerable_C_VerifyTriggerActors");
static_assert(sizeof(BP_Component_Triggerable_C_VerifyTriggerActors) == 0x000060, "Wrong size on BP_Component_Triggerable_C_VerifyTriggerActors");
static_assert(offsetof(BP_Component_Triggerable_C_VerifyTriggerActors, Array) == 0x000000, "Member 'BP_Component_Triggerable_C_VerifyTriggerActors::Array' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_VerifyTriggerActors, VerifiedTriggerActors) == 0x000010, "Member 'BP_Component_Triggerable_C_VerifyTriggerActors::VerifiedTriggerActors' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_VerifyTriggerActors, Verified) == 0x000020, "Member 'BP_Component_Triggerable_C_VerifyTriggerActors::Verified' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_VerifyTriggerActors, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_Component_Triggerable_C_VerifyTriggerActors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_VerifyTriggerActors, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_Component_Triggerable_C_VerifyTriggerActors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_VerifyTriggerActors, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_Component_Triggerable_C_VerifyTriggerActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_VerifyTriggerActors, CallFunc_GetComponentByClass_ReturnValue) == 0x000040, "Member 'BP_Component_Triggerable_C_VerifyTriggerActors::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_VerifyTriggerActors, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_Component_Triggerable_C_VerifyTriggerActors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_VerifyTriggerActors, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'BP_Component_Triggerable_C_VerifyTriggerActors::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_VerifyTriggerActors, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_Component_Triggerable_C_VerifyTriggerActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_VerifyTriggerActors, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'BP_Component_Triggerable_C_VerifyTriggerActors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_VerifyTriggerActors, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'BP_Component_Triggerable_C_VerifyTriggerActors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_VerifyTriggerActors, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BP_Component_Triggerable_C_VerifyTriggerActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Component_Triggerable.BP_Component_Triggerable_C.OnTriggerStateChange
// 0x0020 (0x0020 - 0x0000)
struct BP_Component_Triggerable_C_OnTriggerStateChange final
{
public:
	class UBP_Component_Trigger_C*                TriggerComp;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_Triggered;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6660[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Component_Trigger_C*                TriggerComponent;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6661[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Component_Triggerable_C_OnTriggerStateChange) == 0x000008, "Wrong alignment on BP_Component_Triggerable_C_OnTriggerStateChange");
static_assert(sizeof(BP_Component_Triggerable_C_OnTriggerStateChange) == 0x000020, "Wrong size on BP_Component_Triggerable_C_OnTriggerStateChange");
static_assert(offsetof(BP_Component_Triggerable_C_OnTriggerStateChange, TriggerComp) == 0x000000, "Member 'BP_Component_Triggerable_C_OnTriggerStateChange::TriggerComp' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_OnTriggerStateChange, Param_Triggered) == 0x000008, "Member 'BP_Component_Triggerable_C_OnTriggerStateChange::Param_Triggered' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_OnTriggerStateChange, TriggerComponent) == 0x000010, "Member 'BP_Component_Triggerable_C_OnTriggerStateChange::TriggerComponent' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_OnTriggerStateChange, CallFunc_Array_RemoveItem_ReturnValue) == 0x000018, "Member 'BP_Component_Triggerable_C_OnTriggerStateChange::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_OnTriggerStateChange, CallFunc_Array_Contains_ReturnValue) == 0x000019, "Member 'BP_Component_Triggerable_C_OnTriggerStateChange::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_OnTriggerStateChange, CallFunc_Array_AddUnique_ReturnValue) == 0x00001C, "Member 'BP_Component_Triggerable_C_OnTriggerStateChange::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_Component_Triggerable.BP_Component_Triggerable_C.GetTriggeredState
// 0x0001 (0x0001 - 0x0000)
struct BP_Component_Triggerable_C_GetTriggeredState final
{
public:
	bool                                          Param_HasTriggered;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Component_Triggerable_C_GetTriggeredState) == 0x000001, "Wrong alignment on BP_Component_Triggerable_C_GetTriggeredState");
static_assert(sizeof(BP_Component_Triggerable_C_GetTriggeredState) == 0x000001, "Wrong size on BP_Component_Triggerable_C_GetTriggeredState");
static_assert(offsetof(BP_Component_Triggerable_C_GetTriggeredState, Param_HasTriggered) == 0x000000, "Member 'BP_Component_Triggerable_C_GetTriggeredState::Param_HasTriggered' has a wrong offset!");

// Function BP_Component_Triggerable.BP_Component_Triggerable_C.ExecuteUbergraph_BP_Component_Triggerable
// 0x0088 (0x0088 - 0x0000)
struct BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_Component_Trigger_C* TriggerComp, bool Triggered)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6662[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_VerifyTriggerActors_VerifiedTriggerActors; // 0x0020(0x0010)(ReferenceParm)
	TDelegate<void(class UBP_Component_Trigger_C* TriggerComp, bool Triggered)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6663[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_TriggerActor;                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_Component_Trigger_C*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_Component_Trigger_C*                CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6664[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6665[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6666[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_Component_Trigger_C*                CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable) == 0x000008, "Wrong alignment on BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable");
static_assert(sizeof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable) == 0x000088, "Wrong size on BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, EntryPoint) == 0x000000, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, CallFunc_IsServer_ReturnValue) == 0x000018, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, CallFunc_VerifyTriggerActors_VerifiedTriggerActors) == 0x000020, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::CallFunc_VerifyTriggerActors_VerifiedTriggerActors' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, K2Node_CustomEvent_TriggerActor) == 0x000048, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::K2Node_CustomEvent_TriggerActor' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000058, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, Temp_int_Array_Index_Variable) == 0x000070, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000080, "Member 'BP_Component_Triggerable_C_ExecuteUbergraph_BP_Component_Triggerable::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");

// Function BP_Component_Triggerable.BP_Component_Triggerable_C.EvaluateGateCondition
// 0x0014 (0x0014 - 0x0000)
struct BP_Component_Triggerable_C_EvaluateGateCondition final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6667[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Component_Triggerable_C_EvaluateGateCondition) == 0x000004, "Wrong alignment on BP_Component_Triggerable_C_EvaluateGateCondition");
static_assert(sizeof(BP_Component_Triggerable_C_EvaluateGateCondition) == 0x000014, "Wrong size on BP_Component_Triggerable_C_EvaluateGateCondition");
static_assert(offsetof(BP_Component_Triggerable_C_EvaluateGateCondition, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'BP_Component_Triggerable_C_EvaluateGateCondition::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_EvaluateGateCondition, CallFunc_Array_Length_ReturnValue_1) == 0x000004, "Member 'BP_Component_Triggerable_C_EvaluateGateCondition::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_EvaluateGateCondition, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_Component_Triggerable_C_EvaluateGateCondition::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_EvaluateGateCondition, CallFunc_Array_Length_ReturnValue_2) == 0x00000C, "Member 'BP_Component_Triggerable_C_EvaluateGateCondition::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_EvaluateGateCondition, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'BP_Component_Triggerable_C_EvaluateGateCondition::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_Triggerable_C_EvaluateGateCondition, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BP_Component_Triggerable_C_EvaluateGateCondition::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_Component_Triggerable.BP_Component_Triggerable_C.AddTriggerActor
// 0x0008 (0x0008 - 0x0000)
struct BP_Component_Triggerable_C_AddTriggerActor final
{
public:
	class AActor*                                 TriggerActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Component_Triggerable_C_AddTriggerActor) == 0x000008, "Wrong alignment on BP_Component_Triggerable_C_AddTriggerActor");
static_assert(sizeof(BP_Component_Triggerable_C_AddTriggerActor) == 0x000008, "Wrong size on BP_Component_Triggerable_C_AddTriggerActor");
static_assert(offsetof(BP_Component_Triggerable_C_AddTriggerActor, TriggerActor) == 0x000000, "Member 'BP_Component_Triggerable_C_AddTriggerActor::TriggerActor' has a wrong offset!");

}

