#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterNameWidgetComponent

#include "Basic.hpp"

#include "G01_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterNameWidgetComponent.BP_CharacterNameWidgetComponent_C.ExecuteUbergraph_BP_CharacterNameWidgetComponent
// 0x0078 (0x0078 - 0x0000)
struct BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4726[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4727[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetPersistentPlayerState_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EGzWorldVisibilityState NewState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character_1;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzWorldVisibilityState                       K2Node_CustomEvent_NewState;                       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4728[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzCharacterWorldVisibilityComponent*   CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4729[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PlayerName_C*                      K2Node_DynamicCast_AsWBP_Player_Name;              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent) == 0x000008, "Wrong alignment on BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent");
static_assert(sizeof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent) == 0x000078, "Wrong size on BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, EntryPoint) == 0x000000, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, K2Node_DynamicCast_AsGz_Character) == 0x000010, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, CallFunc_GetPersistentPlayerState_ReturnValue) == 0x000020, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::CallFunc_GetPersistentPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000028, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, K2Node_DynamicCast_AsGz_Character_1) == 0x000040, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::K2Node_DynamicCast_AsGz_Character_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, K2Node_CustomEvent_NewState) == 0x000049, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, CallFunc_GetWidget_ReturnValue) == 0x000058, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, K2Node_DynamicCast_AsWBP_Player_Name) == 0x000068, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::K2Node_DynamicCast_AsWBP_Player_Name' has a wrong offset!");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BP_CharacterNameWidgetComponent_C_ExecuteUbergraph_BP_CharacterNameWidgetComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BP_CharacterNameWidgetComponent.BP_CharacterNameWidgetComponent_C.OnVisibilityStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_CharacterNameWidgetComponent_C_OnVisibilityStateChanged final
{
public:
	EGzWorldVisibilityState                       NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterNameWidgetComponent_C_OnVisibilityStateChanged) == 0x000001, "Wrong alignment on BP_CharacterNameWidgetComponent_C_OnVisibilityStateChanged");
static_assert(sizeof(BP_CharacterNameWidgetComponent_C_OnVisibilityStateChanged) == 0x000001, "Wrong size on BP_CharacterNameWidgetComponent_C_OnVisibilityStateChanged");
static_assert(offsetof(BP_CharacterNameWidgetComponent_C_OnVisibilityStateChanged, NewState) == 0x000000, "Member 'BP_CharacterNameWidgetComponent_C_OnVisibilityStateChanged::NewState' has a wrong offset!");

}

