#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeploymentPlaneTrack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DeploymentPlaneTrack.BP_DeploymentPlaneTrack_C.ReverseSpline
// 0x01B0 (0x01B0 - 0x0000)
struct BP_DeploymentPlaneTrack_C_ReverseSpline final
{
public:
	TArray<struct FSplinePoint>                   NewSplinePoints;                                   // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue;             // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5796[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplinePointType                              CallFunc_GetSplinePointType_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5797[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetScaleAtSplinePoint_ReturnValue;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtSplinePoint_ReturnValue;     // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue; // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetArriveTangentAtSplinePoint_ReturnValue; // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue_1;           // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSplinePoint                           K2Node_MakeStruct_SplinePoint;                     // 0x0110(0x0088)(NoDestructor)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue_1;    // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5798[0x3];                                     // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_InputKey_ImplicitCast;           // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeploymentPlaneTrack_C_ReverseSpline) == 0x000008, "Wrong alignment on BP_DeploymentPlaneTrack_C_ReverseSpline");
static_assert(sizeof(BP_DeploymentPlaneTrack_C_ReverseSpline) == 0x0001B0, "Wrong size on BP_DeploymentPlaneTrack_C_ReverseSpline");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, NewSplinePoints) == 0x000000, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::NewSplinePoints' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, Temp_int_Variable) == 0x000010, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000018, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_Conv_IntToVector_ReturnValue) == 0x000020, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_Conv_IntToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000038, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000040, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_GetSplinePointType_ReturnValue) == 0x000048, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_GetSplinePointType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_GetScaleAtSplinePoint_ReturnValue) == 0x000050, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_GetScaleAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_GetRotationAtSplinePoint_ReturnValue) == 0x000068, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_GetRotationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue) == 0x000080, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_GetArriveTangentAtSplinePoint_ReturnValue) == 0x000098, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_GetArriveTangentAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x0000B0, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000C8, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_Conv_IntToVector_ReturnValue_1) == 0x0000E0, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_Conv_IntToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000F8, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, K2Node_MakeStruct_SplinePoint) == 0x000110, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::K2Node_MakeStruct_SplinePoint' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_GetNumberOfSplinePoints_ReturnValue_1) == 0x000198, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_GetNumberOfSplinePoints_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_Array_Add_ReturnValue) == 0x00019C, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0001A0, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001A4, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPlaneTrack_C_ReverseSpline, K2Node_MakeStruct_InputKey_ImplicitCast) == 0x0001A8, "Member 'BP_DeploymentPlaneTrack_C_ReverseSpline::K2Node_MakeStruct_InputKey_ImplicitCast' has a wrong offset!");

}

