#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DropPodLandingLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DropPodLandingLocation.BP_DropPodLandingLocation_C.CanBeUsed
// 0x0058 (0x0058 - 0x0000)
struct BP_DropPodLandingLocation_C_CanBeUsed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C40[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_BoxOverlapActors_OutActors;               // 0x0040(0x0010)(ReferenceParm)
	bool                                          CallFunc_BoxOverlapActors_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DropPodLandingLocation_C_CanBeUsed) == 0x000008, "Wrong alignment on BP_DropPodLandingLocation_C_CanBeUsed");
static_assert(sizeof(BP_DropPodLandingLocation_C_CanBeUsed) == 0x000058, "Wrong size on BP_DropPodLandingLocation_C_CanBeUsed");
static_assert(offsetof(BP_DropPodLandingLocation_C_CanBeUsed, ReturnValue) == 0x000000, "Member 'BP_DropPodLandingLocation_C_CanBeUsed::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_CanBeUsed, Temp_object_Variable) == 0x000008, "Member 'BP_DropPodLandingLocation_C_CanBeUsed::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_CanBeUsed, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_DropPodLandingLocation_C_CanBeUsed::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_CanBeUsed, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_DropPodLandingLocation_C_CanBeUsed::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_CanBeUsed, CallFunc_BoxOverlapActors_OutActors) == 0x000040, "Member 'BP_DropPodLandingLocation_C_CanBeUsed::CallFunc_BoxOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_CanBeUsed, CallFunc_BoxOverlapActors_ReturnValue) == 0x000050, "Member 'BP_DropPodLandingLocation_C_CanBeUsed::CallFunc_BoxOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_CanBeUsed, CallFunc_Not_PreBool_ReturnValue) == 0x000051, "Member 'BP_DropPodLandingLocation_C_CanBeUsed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_DropPodLandingLocation.BP_DropPodLandingLocation_C.Destroy VFX
// 0x0002 (0x0002 - 0x0000)
struct BP_DropPodLandingLocation_C_Destroy_VFX final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DropPodLandingLocation_C_Destroy_VFX) == 0x000001, "Wrong alignment on BP_DropPodLandingLocation_C_Destroy_VFX");
static_assert(sizeof(BP_DropPodLandingLocation_C_Destroy_VFX) == 0x000002, "Wrong size on BP_DropPodLandingLocation_C_Destroy_VFX");
static_assert(offsetof(BP_DropPodLandingLocation_C_Destroy_VFX, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_DropPodLandingLocation_C_Destroy_VFX::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_Destroy_VFX, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_DropPodLandingLocation_C_Destroy_VFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_DropPodLandingLocation.BP_DropPodLandingLocation_C.ExecuteUbergraph_BP_DropPodLandingLocation
// 0x0020 (0x0020 - 0x0000)
struct BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C41[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzProceduralTrackTransport*            K2Node_Event_Transport;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DeliveryTransport_DropPod_C*        K2Node_DynamicCast_AsBP_Delivery_Transport_Drop_Pod; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation) == 0x000008, "Wrong alignment on BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation");
static_assert(sizeof(BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation) == 0x000020, "Wrong size on BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation");
static_assert(offsetof(BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation, EntryPoint) == 0x000000, "Member 'BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation, K2Node_Event_Transport) == 0x000008, "Member 'BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation::K2Node_Event_Transport' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation, K2Node_DynamicCast_AsBP_Delivery_Transport_Drop_Pod) == 0x000010, "Member 'BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation::K2Node_DynamicCast_AsBP_Delivery_Transport_Drop_Pod' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_DropPodLandingLocation_C_ExecuteUbergraph_BP_DropPodLandingLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_DropPodLandingLocation.BP_DropPodLandingLocation_C.OnDeliveryTriggered
// 0x0008 (0x0008 - 0x0000)
struct BP_DropPodLandingLocation_C_OnDeliveryTriggered final
{
public:
	class AGzProceduralTrackTransport*            Transport;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DropPodLandingLocation_C_OnDeliveryTriggered) == 0x000008, "Wrong alignment on BP_DropPodLandingLocation_C_OnDeliveryTriggered");
static_assert(sizeof(BP_DropPodLandingLocation_C_OnDeliveryTriggered) == 0x000008, "Wrong size on BP_DropPodLandingLocation_C_OnDeliveryTriggered");
static_assert(offsetof(BP_DropPodLandingLocation_C_OnDeliveryTriggered, Transport) == 0x000000, "Member 'BP_DropPodLandingLocation_C_OnDeliveryTriggered::Transport' has a wrong offset!");

// Function BP_DropPodLandingLocation.BP_DropPodLandingLocation_C.SpawnVFX
// 0x0070 (0x0070 - 0x0000)
struct BP_DropPodLandingLocation_C_SpawnVFX final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_VFX_LoadoutDrop_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DropPodLandingLocation_C_SpawnVFX) == 0x000010, "Wrong alignment on BP_DropPodLandingLocation_C_SpawnVFX");
static_assert(sizeof(BP_DropPodLandingLocation_C_SpawnVFX) == 0x000070, "Wrong size on BP_DropPodLandingLocation_C_SpawnVFX");
static_assert(offsetof(BP_DropPodLandingLocation_C_SpawnVFX, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'BP_DropPodLandingLocation_C_SpawnVFX::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_SpawnVFX, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'BP_DropPodLandingLocation_C_SpawnVFX::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_SpawnVFX, CallFunc_FinishSpawningActor_ReturnValue) == 0x000068, "Member 'BP_DropPodLandingLocation_C_SpawnVFX::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_DropPodLandingLocation.BP_DropPodLandingLocation_C.SpawnVolume
// 0x0090 (0x0090 - 0x0000)
struct BP_DropPodLandingLocation_C_SpawnVolume final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C42[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_LoadoutDropRestrictionVolume_C*     CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DropPodLandingLocation_C_SpawnVolume) == 0x000010, "Wrong alignment on BP_DropPodLandingLocation_C_SpawnVolume");
static_assert(sizeof(BP_DropPodLandingLocation_C_SpawnVolume) == 0x000090, "Wrong size on BP_DropPodLandingLocation_C_SpawnVolume");
static_assert(offsetof(BP_DropPodLandingLocation_C_SpawnVolume, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_DropPodLandingLocation_C_SpawnVolume::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_SpawnVolume, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000020, "Member 'BP_DropPodLandingLocation_C_SpawnVolume::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_SpawnVolume, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'BP_DropPodLandingLocation_C_SpawnVolume::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DropPodLandingLocation_C_SpawnVolume, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'BP_DropPodLandingLocation_C_SpawnVolume::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

