#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DisarmerGadget

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "G01_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.AddImpulseDelay
// 0x0020 (0x0020 - 0x0000)
struct BP_DisarmerGadget_C_AddImpulseDelay final
{
public:
	class UCharacterMovementComponent*            Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impulse;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DisarmerGadget_C_AddImpulseDelay) == 0x000008, "Wrong alignment on BP_DisarmerGadget_C_AddImpulseDelay");
static_assert(sizeof(BP_DisarmerGadget_C_AddImpulseDelay) == 0x000020, "Wrong size on BP_DisarmerGadget_C_AddImpulseDelay");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseDelay, Target) == 0x000000, "Member 'BP_DisarmerGadget_C_AddImpulseDelay::Target' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseDelay, Impulse) == 0x000008, "Member 'BP_DisarmerGadget_C_AddImpulseDelay::Impulse' has a wrong offset!");

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.AddImpulseToCharacter
// 0x00D8 (0x00D8 - 0x0000)
struct BP_DisarmerGadget_C_AddImpulseToCharacter final
{
public:
	class AGzMultiPartCharacter*                  HitCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DisarmerGadget_C_AddImpulseToCharacter) == 0x000008, "Wrong alignment on BP_DisarmerGadget_C_AddImpulseToCharacter");
static_assert(sizeof(BP_DisarmerGadget_C_AddImpulseToCharacter) == 0x0000D8, "Wrong size on BP_DisarmerGadget_C_AddImpulseToCharacter");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseToCharacter, HitCharacter) == 0x000000, "Member 'BP_DisarmerGadget_C_AddImpulseToCharacter::HitCharacter' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseToCharacter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_DisarmerGadget_C_AddImpulseToCharacter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseToCharacter, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000020, "Member 'BP_DisarmerGadget_C_AddImpulseToCharacter::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseToCharacter, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000038, "Member 'BP_DisarmerGadget_C_AddImpulseToCharacter::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseToCharacter, CallFunc_Normal_ReturnValue) == 0x000050, "Member 'BP_DisarmerGadget_C_AddImpulseToCharacter::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseToCharacter, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000068, "Member 'BP_DisarmerGadget_C_AddImpulseToCharacter::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseToCharacter, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000080, "Member 'BP_DisarmerGadget_C_AddImpulseToCharacter::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseToCharacter, CallFunc_BreakVector_X) == 0x000098, "Member 'BP_DisarmerGadget_C_AddImpulseToCharacter::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseToCharacter, CallFunc_BreakVector_Y) == 0x0000A0, "Member 'BP_DisarmerGadget_C_AddImpulseToCharacter::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseToCharacter, CallFunc_BreakVector_Z) == 0x0000A8, "Member 'BP_DisarmerGadget_C_AddImpulseToCharacter::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseToCharacter, CallFunc_Abs_ReturnValue) == 0x0000B0, "Member 'BP_DisarmerGadget_C_AddImpulseToCharacter::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseToCharacter, CallFunc_MakeVector_ReturnValue) == 0x0000B8, "Member 'BP_DisarmerGadget_C_AddImpulseToCharacter::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_AddImpulseToCharacter, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x0000D0, "Member 'BP_DisarmerGadget_C_AddImpulseToCharacter::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156E[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_DisarmerGadget_C_BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.BP_OnDeath
// 0x0020 (0x0020 - 0x0000)
struct BP_DisarmerGadget_C_BP_OnDeath final
{
public:
	bool                                          HasDeathHitPoint;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DeathHitPoint;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DisarmerGadget_C_BP_OnDeath) == 0x000008, "Wrong alignment on BP_DisarmerGadget_C_BP_OnDeath");
static_assert(sizeof(BP_DisarmerGadget_C_BP_OnDeath) == 0x000020, "Wrong size on BP_DisarmerGadget_C_BP_OnDeath");
static_assert(offsetof(BP_DisarmerGadget_C_BP_OnDeath, HasDeathHitPoint) == 0x000000, "Member 'BP_DisarmerGadget_C_BP_OnDeath::HasDeathHitPoint' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_BP_OnDeath, DeathHitPoint) == 0x000008, "Member 'BP_DisarmerGadget_C_BP_OnDeath::DeathHitPoint' has a wrong offset!");

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.DismemberCharacter
// 0x0100 (0x0100 - 0x0000)
struct BP_DisarmerGadget_C_DismemberCharacter final
{
public:
	class AGzMultiPartCharacter*                  HitCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1570[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1571[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzLimbComponent*                       CallFunc_GetLimbComponent_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzLimbComponent*                       CallFunc_GetLimbComponent_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzBodyPartItemData*                    CallFunc_GetBodyPartItemData_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzBodyPartItemData*                    CallFunc_GetBodyPartItemData_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1572[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzLimbComponent*                       CallFunc_GetLimbComponent_ReturnValue_2;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzLimbComponent*                       CallFunc_GetLimbComponent_ReturnValue_3;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzBodyPartItemData*                    CallFunc_GetBodyPartItemData_ReturnValue_2;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzBodyPartItemData*                    CallFunc_GetBodyPartItemData_ReturnValue_3;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1573[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzLimbComponent*                       CallFunc_GetLimbComponent_ReturnValue_4;           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzBodyPartItemData*                    CallFunc_GetBodyPartItemData_ReturnValue_4;        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzLimbComponent*                       CallFunc_GetLimbComponent_ReturnValue_5;           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1574[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzBodyPartItemData*                    CallFunc_GetBodyPartItemData_ReturnValue_5;        // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1575[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DisarmerGadget_C_DismemberCharacter) == 0x000008, "Wrong alignment on BP_DisarmerGadget_C_DismemberCharacter");
static_assert(sizeof(BP_DisarmerGadget_C_DismemberCharacter) == 0x000100, "Wrong size on BP_DisarmerGadget_C_DismemberCharacter");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, HitCharacter) == 0x000000, "Member 'BP_DisarmerGadget_C_DismemberCharacter::HitCharacter' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_MakeLiteralByte_ReturnValue) == 0x000008, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_BreakVector_X) == 0x000028, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_BreakVector_Y) == 0x000030, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_BreakVector_Z) == 0x000038, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000040, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000041, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000042, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000043, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_GetLimbComponent_ReturnValue) == 0x000048, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_GetLimbComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_GetLimbComponent_ReturnValue_1) == 0x000050, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_GetLimbComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_GetBodyPartItemData_ReturnValue) == 0x000058, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_GetBodyPartItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_GetBodyPartItemData_ReturnValue_1) == 0x000060, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_GetBodyPartItemData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_GetLimbComponent_ReturnValue_2) == 0x000070, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_GetLimbComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_GetLimbComponent_ReturnValue_3) == 0x000078, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_GetLimbComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_GetBodyPartItemData_ReturnValue_2) == 0x000080, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_GetBodyPartItemData_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_GetBodyPartItemData_ReturnValue_3) == 0x000088, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_GetBodyPartItemData_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_IsValid_ReturnValue_2) == 0x000090, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_IsValid_ReturnValue_3) == 0x000091, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000092, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_GetLimbComponent_ReturnValue_4) == 0x000098, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_GetLimbComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_GetBodyPartItemData_ReturnValue_4) == 0x0000A0, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_GetBodyPartItemData_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_GetLimbComponent_ReturnValue_5) == 0x0000A8, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_GetLimbComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_IsValid_ReturnValue_4) == 0x0000B0, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_GetBodyPartItemData_ReturnValue_5) == 0x0000B8, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_GetBodyPartItemData_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_IsValid_ReturnValue_5) == 0x0000C0, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000C8, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_BreakVector_X_1) == 0x0000E0, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_BreakVector_Y_1) == 0x0000E8, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_BreakVector_Z_1) == 0x0000F0, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_DismemberCharacter, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'BP_DisarmerGadget_C_DismemberCharacter::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.ExecuteUbergraph_BP_DisarmerGadget
// 0x02D8 (0x02D8 - 0x0000)
struct BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1576[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1577[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1578[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0080(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UCharacterMovementComponent*            K2Node_CustomEvent_Target;                         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Impulse;                        // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_HasDeathHitPoint;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1579[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_DeathHitPoint;                        // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_157A[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x01C0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget) == 0x000008, "Wrong alignment on BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget");
static_assert(sizeof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget) == 0x0002D8, "Wrong size on BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, EntryPoint) == 0x000000, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000018, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, CallFunc_MakeRotator_ReturnValue) == 0x000038, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, CallFunc_HasAuthority_ReturnValue_1) == 0x000050, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, CallFunc_GetInstigator_ReturnValue) == 0x000058, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000060, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, K2Node_ComponentBoundEvent_OtherActor) == 0x000068, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, K2Node_ComponentBoundEvent_OtherComp) == 0x000070, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000078, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, K2Node_ComponentBoundEvent_bFromSweep) == 0x00007C, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, K2Node_ComponentBoundEvent_SweepResult) == 0x000080, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, K2Node_CustomEvent_Target) == 0x000178, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, K2Node_CustomEvent_Impulse) == 0x000180, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::K2Node_CustomEvent_Impulse' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, K2Node_Event_HasDeathHitPoint) == 0x000198, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::K2Node_Event_HasDeathHitPoint' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, K2Node_Event_DeathHitPoint) == 0x0001A0, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::K2Node_Event_DeathHitPoint' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, CallFunc_HasAuthority_ReturnValue_2) == 0x0001B8, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0001C0, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0002B8, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x0002C0, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x0002C8, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0002D0, "Member 'BP_DisarmerGadget_C_ExecuteUbergraph_BP_DisarmerGadget::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.GetVFXTransformFromSocket
// 0x0018 (0x0018 - 0x0000)
struct BP_DisarmerGadget_C_GetVFXTransformFromSocket final
{
public:
	class USceneComponent*                        Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   InSocketName;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DisarmerGadget_C_GetVFXTransformFromSocket) == 0x000008, "Wrong alignment on BP_DisarmerGadget_C_GetVFXTransformFromSocket");
static_assert(sizeof(BP_DisarmerGadget_C_GetVFXTransformFromSocket) == 0x000018, "Wrong size on BP_DisarmerGadget_C_GetVFXTransformFromSocket");
static_assert(offsetof(BP_DisarmerGadget_C_GetVFXTransformFromSocket, Mesh) == 0x000000, "Member 'BP_DisarmerGadget_C_GetVFXTransformFromSocket::Mesh' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_GetVFXTransformFromSocket, InSocketName) == 0x000008, "Member 'BP_DisarmerGadget_C_GetVFXTransformFromSocket::InSocketName' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_GetVFXTransformFromSocket, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000010, "Member 'BP_DisarmerGadget_C_GetVFXTransformFromSocket::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.HandleOverlap
// 0x0070 (0x0070 - 0x0000)
struct BP_DisarmerGadget_C_HandleOverlap final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzMultiPartCharacter*                  K2Node_DynamicCast_AsGz_Multi_Part_Character;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetTeamAttitude_ReturnValue;              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_157B[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_157C[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DisarmerGadget_C_HandleOverlap) == 0x000008, "Wrong alignment on BP_DisarmerGadget_C_HandleOverlap");
static_assert(sizeof(BP_DisarmerGadget_C_HandleOverlap) == 0x000070, "Wrong size on BP_DisarmerGadget_C_HandleOverlap");
static_assert(offsetof(BP_DisarmerGadget_C_HandleOverlap, Object) == 0x000000, "Member 'BP_DisarmerGadget_C_HandleOverlap::Object' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_HandleOverlap, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'BP_DisarmerGadget_C_HandleOverlap::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_HandleOverlap, K2Node_DynamicCast_AsGz_Multi_Part_Character) == 0x000010, "Member 'BP_DisarmerGadget_C_HandleOverlap::K2Node_DynamicCast_AsGz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_HandleOverlap, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_DisarmerGadget_C_HandleOverlap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_HandleOverlap, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_DisarmerGadget_C_HandleOverlap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_HandleOverlap, CallFunc_IsValid_ReturnValue_1) == 0x00001A, "Member 'BP_DisarmerGadget_C_HandleOverlap::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_HandleOverlap, CallFunc_GetTeamAttitude_ReturnValue) == 0x00001B, "Member 'BP_DisarmerGadget_C_HandleOverlap::CallFunc_GetTeamAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_HandleOverlap, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001C, "Member 'BP_DisarmerGadget_C_HandleOverlap::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_HandleOverlap, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000020, "Member 'BP_DisarmerGadget_C_HandleOverlap::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_HandleOverlap, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BP_DisarmerGadget_C_HandleOverlap::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_HandleOverlap, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'BP_DisarmerGadget_C_HandleOverlap::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_HandleOverlap, CallFunc_HasAuthority_ReturnValue) == 0x000068, "Member 'BP_DisarmerGadget_C_HandleOverlap::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_HandleOverlap, CallFunc_PostEventAtLocation_ReturnValue) == 0x00006C, "Member 'BP_DisarmerGadget_C_HandleOverlap::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.MakeFX
// 0x0050 (0x0050 - 0x0000)
struct BP_DisarmerGadget_C_MakeFX final
{
public:
	class UNiagaraSystem*                         SystemTemplate;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEvent;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_157D[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DisarmerGadget_C_MakeFX) == 0x000008, "Wrong alignment on BP_DisarmerGadget_C_MakeFX");
static_assert(sizeof(BP_DisarmerGadget_C_MakeFX) == 0x000050, "Wrong size on BP_DisarmerGadget_C_MakeFX");
static_assert(offsetof(BP_DisarmerGadget_C_MakeFX, SystemTemplate) == 0x000000, "Member 'BP_DisarmerGadget_C_MakeFX::SystemTemplate' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_MakeFX, AkEvent) == 0x000008, "Member 'BP_DisarmerGadget_C_MakeFX::AkEvent' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_MakeFX, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_DisarmerGadget_C_MakeFX::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_MakeFX, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'BP_DisarmerGadget_C_MakeFX::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_MakeFX, CallFunc_PostEventAtLocation_ReturnValue) == 0x000040, "Member 'BP_DisarmerGadget_C_MakeFX::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_MakeFX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000048, "Member 'BP_DisarmerGadget_C_MakeFX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.Move
// 0x0170 (0x0170 - 0x0000)
struct BP_DisarmerGadget_C_Move final
{
public:
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_157E[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGzGadgetMoveData                      K2Node_MakeStruct_GzGadgetMoveData;                // 0x00E0(0x0090)(NoDestructor)
};
static_assert(alignof(BP_DisarmerGadget_C_Move) == 0x000010, "Wrong alignment on BP_DisarmerGadget_C_Move");
static_assert(sizeof(BP_DisarmerGadget_C_Move) == 0x000170, "Wrong size on BP_DisarmerGadget_C_Move");
static_assert(offsetof(BP_DisarmerGadget_C_Move, CallFunc_GetActorScale3D_ReturnValue) == 0x000000, "Member 'BP_DisarmerGadget_C_Move::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_Move, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_DisarmerGadget_C_Move::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_Move, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000080, "Member 'BP_DisarmerGadget_C_Move::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_Move, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000098, "Member 'BP_DisarmerGadget_C_Move::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_Move, CallFunc_Normal_ReturnValue) == 0x0000B0, "Member 'BP_DisarmerGadget_C_Move::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_Move, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000C8, "Member 'BP_DisarmerGadget_C_Move::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_Move, K2Node_MakeStruct_GzGadgetMoveData) == 0x0000E0, "Member 'BP_DisarmerGadget_C_Move::K2Node_MakeStruct_GzGadgetMoveData' has a wrong offset!");

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.ReadyToDestroy
// 0x0001 (0x0001 - 0x0000)
struct BP_DisarmerGadget_C_ReadyToDestroy final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DisarmerGadget_C_ReadyToDestroy) == 0x000001, "Wrong alignment on BP_DisarmerGadget_C_ReadyToDestroy");
static_assert(sizeof(BP_DisarmerGadget_C_ReadyToDestroy) == 0x000001, "Wrong size on BP_DisarmerGadget_C_ReadyToDestroy");
static_assert(offsetof(BP_DisarmerGadget_C_ReadyToDestroy, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_DisarmerGadget_C_ReadyToDestroy::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.SetHP
// 0x0070 (0x0070 - 0x0000)
struct BP_DisarmerGadget_C_SetHP final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, float>              K2Node_MakeMap_Map;                                // 0x0018(0x0050)(ConstParm)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue; // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DisarmerGadget_C_SetHP) == 0x000008, "Wrong alignment on BP_DisarmerGadget_C_SetHP");
static_assert(sizeof(BP_DisarmerGadget_C_SetHP) == 0x000070, "Wrong size on BP_DisarmerGadget_C_SetHP");
static_assert(offsetof(BP_DisarmerGadget_C_SetHP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_DisarmerGadget_C_SetHP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_SetHP, K2Node_MakeMap_Map) == 0x000018, "Member 'BP_DisarmerGadget_C_SetHP::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_SetHP, CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue) == 0x000068, "Member 'BP_DisarmerGadget_C_SetHP::CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue' has a wrong offset!");

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.SpawnActivationVFX
// 0x0038 (0x0038 - 0x0000)
struct BP_DisarmerGadget_C_SpawnActivationVFX final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DisarmerGadget_C_SpawnActivationVFX) == 0x000008, "Wrong alignment on BP_DisarmerGadget_C_SpawnActivationVFX");
static_assert(sizeof(BP_DisarmerGadget_C_SpawnActivationVFX) == 0x000038, "Wrong size on BP_DisarmerGadget_C_SpawnActivationVFX");
static_assert(offsetof(BP_DisarmerGadget_C_SpawnActivationVFX, Location) == 0x000000, "Member 'BP_DisarmerGadget_C_SpawnActivationVFX::Location' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_SpawnActivationVFX, Rotation) == 0x000018, "Member 'BP_DisarmerGadget_C_SpawnActivationVFX::Rotation' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_SpawnActivationVFX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000030, "Member 'BP_DisarmerGadget_C_SpawnActivationVFX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.TearOffLimbFromCharacter
// 0x0010 (0x0010 - 0x0000)
struct BP_DisarmerGadget_C_TearOffLimbFromCharacter final
{
public:
	EGzLimbType                                   LimbType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_157F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMultiPartCharacter*                  HitCharacter;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DisarmerGadget_C_TearOffLimbFromCharacter) == 0x000008, "Wrong alignment on BP_DisarmerGadget_C_TearOffLimbFromCharacter");
static_assert(sizeof(BP_DisarmerGadget_C_TearOffLimbFromCharacter) == 0x000010, "Wrong size on BP_DisarmerGadget_C_TearOffLimbFromCharacter");
static_assert(offsetof(BP_DisarmerGadget_C_TearOffLimbFromCharacter, LimbType) == 0x000000, "Member 'BP_DisarmerGadget_C_TearOffLimbFromCharacter::LimbType' has a wrong offset!");
static_assert(offsetof(BP_DisarmerGadget_C_TearOffLimbFromCharacter, HitCharacter) == 0x000008, "Member 'BP_DisarmerGadget_C_TearOffLimbFromCharacter::HitCharacter' has a wrong offset!");

// Function BP_DisarmerGadget.BP_DisarmerGadget_C.CanAttachTo
// 0x0020 (0x0020 - 0x0000)
struct BP_DisarmerGadget_C_CanAttachTo final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
