#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeploymentPawn

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_DeploymentPawn.BP_DeploymentPawn_C.ExecuteUbergraph_BP_DeploymentPawn
// 0x0170 (0x0170 - 0x0000)
struct BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E34[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x00D8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0100(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E35[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_6;                              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_0;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7_0;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E36[0x3];                                     // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x013C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0150(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCanPawnDeploy;                       // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E37[0x3];                                     // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AddControllerYawInput_Val_ImplicitCast;   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddControllerPitchInput_Val_ImplicitCast; // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn) == 0x000008, "Wrong alignment on BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn");
static_assert(sizeof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn) == 0x000170, "Wrong size on BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, EntryPoint) == 0x000000, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x000008, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x000028, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x00002C, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x000030, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_object_Variable) == 0x000038, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue) == 0x000040, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_real_Variable) == 0x000048, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_real_Variable_1) == 0x000050, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_real_Variable_0) == 0x000058, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_real_Variable_1_0) == 0x000060, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_real_Variable_2) == 0x000068, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000070, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000090, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000094, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000098, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1) == 0x0000A0, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_object_Variable_1) == 0x0000A8, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_real_Variable_3) == 0x0000B0, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_real_Variable_3_0) == 0x0000B8, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_real_Variable_4) == 0x0000C0, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_real_Variable_5) == 0x0000C8, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_real_Variable_4_0) == 0x0000D0, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_real_Variable_4_0' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, K2Node_EnhancedInputActionEvent_ActionValue) == 0x0000D8, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x0000F8, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x0000FC, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000100, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_object_Variable_2) == 0x000108, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000110, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_real_Variable_6) == 0x000118, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_real_Variable_7) == 0x000120, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_real_Variable_6_0) == 0x000128, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_real_Variable_6_0' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_real_Variable_7_0) == 0x000130, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_real_Variable_7_0' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_bool_Variable) == 0x000138, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_delegate_Variable) == 0x00013C, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, CallFunc_PostEvent_ReturnValue) == 0x00014C, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, Temp_delegate_Variable_1) == 0x000150, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, CallFunc_PostEvent_ReturnValue_1) == 0x000160, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, K2Node_Event_bCanPawnDeploy) == 0x000164, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::K2Node_Event_bCanPawnDeploy' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, CallFunc_AddControllerYawInput_Val_ImplicitCast) == 0x000168, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::CallFunc_AddControllerYawInput_Val_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn, CallFunc_AddControllerPitchInput_Val_ImplicitCast) == 0x00016C, "Member 'BP_DeploymentPawn_C_ExecuteUbergraph_BP_DeploymentPawn::CallFunc_AddControllerPitchInput_Val_ImplicitCast' has a wrong offset!");

// Function BP_DeploymentPawn.BP_DeploymentPawn_C.InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct BP_DeploymentPawn_C_InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeploymentPawn_C_InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on BP_DeploymentPawn_C_InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(BP_DeploymentPawn_C_InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on BP_DeploymentPawn_C_InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(BP_DeploymentPawn_C_InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'BP_DeploymentPawn_C_InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'BP_DeploymentPawn_C_InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'BP_DeploymentPawn_C_InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'BP_DeploymentPawn_C_InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function BP_DeploymentPawn.BP_DeploymentPawn_C.InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct BP_DeploymentPawn_C_InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeploymentPawn_C_InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on BP_DeploymentPawn_C_InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(BP_DeploymentPawn_C_InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on BP_DeploymentPawn_C_InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(BP_DeploymentPawn_C_InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'BP_DeploymentPawn_C_InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'BP_DeploymentPawn_C_InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'BP_DeploymentPawn_C_InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'BP_DeploymentPawn_C_InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function BP_DeploymentPawn.BP_DeploymentPawn_C.InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2
// 0x0030 (0x0030 - 0x0000)
struct BP_DeploymentPawn_C_InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeploymentPawn_C_InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2) == 0x000008, "Wrong alignment on BP_DeploymentPawn_C_InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2");
static_assert(sizeof(BP_DeploymentPawn_C_InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2) == 0x000030, "Wrong size on BP_DeploymentPawn_C_InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2");
static_assert(offsetof(BP_DeploymentPawn_C_InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2, ActionValue) == 0x000000, "Member 'BP_DeploymentPawn_C_InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2, ElapsedTime) == 0x000020, "Member 'BP_DeploymentPawn_C_InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2, TriggeredTime) == 0x000024, "Member 'BP_DeploymentPawn_C_InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_DeploymentPawn_C_InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2, SourceAction) == 0x000028, "Member 'BP_DeploymentPawn_C_InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2::SourceAction' has a wrong offset!");

// Function BP_DeploymentPawn.BP_DeploymentPawn_C.ReceiveDeployment__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_DeploymentPawn_C_ReceiveDeployment__DelegateSignature final
{
public:
	bool                                          Param_CanDeploy;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeploymentPawn_C_ReceiveDeployment__DelegateSignature) == 0x000001, "Wrong alignment on BP_DeploymentPawn_C_ReceiveDeployment__DelegateSignature");
static_assert(sizeof(BP_DeploymentPawn_C_ReceiveDeployment__DelegateSignature) == 0x000001, "Wrong size on BP_DeploymentPawn_C_ReceiveDeployment__DelegateSignature");
static_assert(offsetof(BP_DeploymentPawn_C_ReceiveDeployment__DelegateSignature, Param_CanDeploy) == 0x000000, "Member 'BP_DeploymentPawn_C_ReceiveDeployment__DelegateSignature::Param_CanDeploy' has a wrong offset!");

// Function BP_DeploymentPawn.BP_DeploymentPawn_C.ReceiveDeploymentAllowed
// 0x0001 (0x0001 - 0x0000)
struct BP_DeploymentPawn_C_ReceiveDeploymentAllowed final
{
public:
	bool                                          bCanPawnDeploy;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeploymentPawn_C_ReceiveDeploymentAllowed) == 0x000001, "Wrong alignment on BP_DeploymentPawn_C_ReceiveDeploymentAllowed");
static_assert(sizeof(BP_DeploymentPawn_C_ReceiveDeploymentAllowed) == 0x000001, "Wrong size on BP_DeploymentPawn_C_ReceiveDeploymentAllowed");
static_assert(offsetof(BP_DeploymentPawn_C_ReceiveDeploymentAllowed, bCanPawnDeploy) == 0x000000, "Member 'BP_DeploymentPawn_C_ReceiveDeploymentAllowed::bCanPawnDeploy' has a wrong offset!");

// Function BP_DeploymentPawn.BP_DeploymentPawn_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_DeploymentPawn_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeploymentPawn_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_DeploymentPawn_C_ReceiveEndPlay");
static_assert(sizeof(BP_DeploymentPawn_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_DeploymentPawn_C_ReceiveEndPlay");
static_assert(offsetof(BP_DeploymentPawn_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_DeploymentPawn_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

