#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DomeShieldComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DomeShieldComponent.BP_DomeShieldComponent_C
// 0x0040 (0x0130 - 0x00F0)
class UBP_DomeShieldComponent_C final : public UGzLimbAbilityComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        ChargeProgress;                                    // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChargeDuration;                                    // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OldChargeProgress;                                 // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMaxChargeReached;                                // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnComponentRemove;                                 // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_DomeShieldComponent(int32 EntryPoint);
	void OnComponentRemove__DelegateSignature();
	void OnMaxChargeReached__DelegateSignature();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DomeShieldComponent_C">();
	}
	static class UBP_DomeShieldComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DomeShieldComponent_C>();
	}
};
static_assert(alignof(UBP_DomeShieldComponent_C) == 0x000008, "Wrong alignment on UBP_DomeShieldComponent_C");
static_assert(sizeof(UBP_DomeShieldComponent_C) == 0x000130, "Wrong size on UBP_DomeShieldComponent_C");
static_assert(offsetof(UBP_DomeShieldComponent_C, UberGraphFrame) == 0x0000F0, "Member 'UBP_DomeShieldComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_DomeShieldComponent_C, ChargeProgress) == 0x0000F8, "Member 'UBP_DomeShieldComponent_C::ChargeProgress' has a wrong offset!");
static_assert(offsetof(UBP_DomeShieldComponent_C, ChargeDuration) == 0x000100, "Member 'UBP_DomeShieldComponent_C::ChargeDuration' has a wrong offset!");
static_assert(offsetof(UBP_DomeShieldComponent_C, OldChargeProgress) == 0x000108, "Member 'UBP_DomeShieldComponent_C::OldChargeProgress' has a wrong offset!");
static_assert(offsetof(UBP_DomeShieldComponent_C, OnMaxChargeReached) == 0x000110, "Member 'UBP_DomeShieldComponent_C::OnMaxChargeReached' has a wrong offset!");
static_assert(offsetof(UBP_DomeShieldComponent_C, OnComponentRemove) == 0x000120, "Member 'UBP_DomeShieldComponent_C::OnComponentRemove' has a wrong offset!");

}

