#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DropPodLandingLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DropPodLandingLocation.BP_DropPodLandingLocation_C
// 0x0040 (0x02F0 - 0x02B0)
class ABP_DropPodLandingLocation_C final : public AGzProcedureTrackTransportLandingLocation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      DropPodLandingSmoke;                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Drop_Area;                                         // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_VFX_LoadoutDrop_C*                  VFX;                                               // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_LoadoutDropRestrictionVolume_C*     Volume;                                            // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_DeliveryTransport_DropPod_C*        DeliveryTransportDropPod;                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool CanBeUsed();
	void Destroy_VFX();
	void DestroyVolume();
	void ExecuteUbergraph_BP_DropPodLandingLocation(int32 EntryPoint);
	void OnDeliveryTriggered(class AGzProceduralTrackTransport* Transport);
	void ReceiveBeginPlay();
	void SetTimerTillVFXDestroy();
	void SpawnVFX();
	void SpawnVolume();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DropPodLandingLocation_C">();
	}
	static class ABP_DropPodLandingLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DropPodLandingLocation_C>();
	}
};
static_assert(alignof(ABP_DropPodLandingLocation_C) == 0x000008, "Wrong alignment on ABP_DropPodLandingLocation_C");
static_assert(sizeof(ABP_DropPodLandingLocation_C) == 0x0002F0, "Wrong size on ABP_DropPodLandingLocation_C");
static_assert(offsetof(ABP_DropPodLandingLocation_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_DropPodLandingLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DropPodLandingLocation_C, DropPodLandingSmoke) == 0x0002B8, "Member 'ABP_DropPodLandingLocation_C::DropPodLandingSmoke' has a wrong offset!");
static_assert(offsetof(ABP_DropPodLandingLocation_C, TextRender) == 0x0002C0, "Member 'ABP_DropPodLandingLocation_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_DropPodLandingLocation_C, Drop_Area) == 0x0002C8, "Member 'ABP_DropPodLandingLocation_C::Drop_Area' has a wrong offset!");
static_assert(offsetof(ABP_DropPodLandingLocation_C, DefaultSceneRoot) == 0x0002D0, "Member 'ABP_DropPodLandingLocation_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DropPodLandingLocation_C, VFX) == 0x0002D8, "Member 'ABP_DropPodLandingLocation_C::VFX' has a wrong offset!");
static_assert(offsetof(ABP_DropPodLandingLocation_C, Volume) == 0x0002E0, "Member 'ABP_DropPodLandingLocation_C::Volume' has a wrong offset!");
static_assert(offsetof(ABP_DropPodLandingLocation_C, DeliveryTransportDropPod) == 0x0002E8, "Member 'ABP_DropPodLandingLocation_C::DeliveryTransportDropPod' has a wrong offset!");

}

