#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DataLayerManager

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DataLayerManager.BP_DataLayerManager_C.InpActEvt_NumPadOne_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_DataLayerManager_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataLayerManager_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on BP_DataLayerManager_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_0");
static_assert(sizeof(BP_DataLayerManager_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on BP_DataLayerManager_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_0");
static_assert(offsetof(BP_DataLayerManager_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'BP_DataLayerManager_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function BP_DataLayerManager.BP_DataLayerManager_C.ExecuteUbergraph_BP_DataLayerManager
// 0x0060 (0x0060 - 0x0000)
struct BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_666F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDataLayerRuntimeState                        Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDataLayerRuntimeState                        Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6670[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0018(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6671[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActorDataLayer                        CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6672[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataLayerSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDataLayerRuntimeState                        CallFunc_GetDataLayerRuntimeState_ReturnValue;     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDataLayerRuntimeState                        K2Node_Select_Default;                             // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager) == 0x000008, "Wrong alignment on BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager");
static_assert(sizeof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager) == 0x000060, "Wrong size on BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, EntryPoint) == 0x000000, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, Temp_byte_Variable) == 0x000010, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, Temp_byte_Variable_1) == 0x000011, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, K2Node_InputKeyEvent_Key) == 0x000018, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, Temp_bool_Variable) == 0x00003C, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000050, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, CallFunc_GetDataLayerRuntimeState_ReturnValue) == 0x000058, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::CallFunc_GetDataLayerRuntimeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000059, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager, K2Node_Select_Default) == 0x00005A, "Member 'BP_DataLayerManager_C_ExecuteUbergraph_BP_DataLayerManager::K2Node_Select_Default' has a wrong offset!");

}

