#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Defiler_PPFaid

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Defiler_PPFaid.BP_Defiler_PPFaid_C.ExecuteUbergraph_BP_Defiler_PPFaid
// 0x0010 (0x0010 - 0x0000)
struct BP_Defiler_PPFaid_C_ExecuteUbergraph_BP_Defiler_PPFaid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_PPFaid_C_ExecuteUbergraph_BP_Defiler_PPFaid) == 0x000008, "Wrong alignment on BP_Defiler_PPFaid_C_ExecuteUbergraph_BP_Defiler_PPFaid");
static_assert(sizeof(BP_Defiler_PPFaid_C_ExecuteUbergraph_BP_Defiler_PPFaid) == 0x000010, "Wrong size on BP_Defiler_PPFaid_C_ExecuteUbergraph_BP_Defiler_PPFaid");
static_assert(offsetof(BP_Defiler_PPFaid_C_ExecuteUbergraph_BP_Defiler_PPFaid, EntryPoint) == 0x000000, "Member 'BP_Defiler_PPFaid_C_ExecuteUbergraph_BP_Defiler_PPFaid::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Defiler_PPFaid_C_ExecuteUbergraph_BP_Defiler_PPFaid, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Defiler_PPFaid_C_ExecuteUbergraph_BP_Defiler_PPFaid::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Defiler_PPFaid_C_ExecuteUbergraph_BP_Defiler_PPFaid, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_Defiler_PPFaid_C_ExecuteUbergraph_BP_Defiler_PPFaid::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_Defiler_PPFaid.BP_Defiler_PPFaid_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Defiler_PPFaid_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_PPFaid_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Defiler_PPFaid_C_ReceiveTick");
static_assert(sizeof(BP_Defiler_PPFaid_C_ReceiveTick) == 0x000004, "Wrong size on BP_Defiler_PPFaid_C_ReceiveTick");
static_assert(offsetof(BP_Defiler_PPFaid_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Defiler_PPFaid_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Defiler_PPFaid.BP_Defiler_PPFaid_C.SetAlpha
// 0x0004 (0x0004 - 0x0000)
struct BP_Defiler_PPFaid_C_SetAlpha final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_PPFaid_C_SetAlpha) == 0x000004, "Wrong alignment on BP_Defiler_PPFaid_C_SetAlpha");
static_assert(sizeof(BP_Defiler_PPFaid_C_SetAlpha) == 0x000004, "Wrong size on BP_Defiler_PPFaid_C_SetAlpha");
static_assert(offsetof(BP_Defiler_PPFaid_C_SetAlpha, Value) == 0x000000, "Member 'BP_Defiler_PPFaid_C_SetAlpha::Value' has a wrong offset!");

}

