#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DomeShield_BodyPartAbilityData

#include "Basic.hpp"

#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DomeShield_BodyPartAbilityData.BP_DomeShield_BodyPartAbilityData_C
// 0x0020 (0x00A0 - 0x0080)
class UBP_DomeShield_BodyPartAbilityData_C final : public UGzBodyPartAbilityData
{
public:
	double                                        ShieldHealth;                                      // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShieldDamage;                                      // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GadgetHealth;                                      // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GadgetLifespan;                                    // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DomeShield_BodyPartAbilityData_C">();
	}
	static class UBP_DomeShield_BodyPartAbilityData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DomeShield_BodyPartAbilityData_C>();
	}
};
static_assert(alignof(UBP_DomeShield_BodyPartAbilityData_C) == 0x000008, "Wrong alignment on UBP_DomeShield_BodyPartAbilityData_C");
static_assert(sizeof(UBP_DomeShield_BodyPartAbilityData_C) == 0x0000A0, "Wrong size on UBP_DomeShield_BodyPartAbilityData_C");
static_assert(offsetof(UBP_DomeShield_BodyPartAbilityData_C, ShieldHealth) == 0x000080, "Member 'UBP_DomeShield_BodyPartAbilityData_C::ShieldHealth' has a wrong offset!");
static_assert(offsetof(UBP_DomeShield_BodyPartAbilityData_C, ShieldDamage) == 0x000088, "Member 'UBP_DomeShield_BodyPartAbilityData_C::ShieldDamage' has a wrong offset!");
static_assert(offsetof(UBP_DomeShield_BodyPartAbilityData_C, GadgetHealth) == 0x000090, "Member 'UBP_DomeShield_BodyPartAbilityData_C::GadgetHealth' has a wrong offset!");
static_assert(offsetof(UBP_DomeShield_BodyPartAbilityData_C, GadgetLifespan) == 0x000098, "Member 'UBP_DomeShield_BodyPartAbilityData_C::GadgetLifespan' has a wrong offset!");

}

