#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DisarmerGadget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "S_Disarmer_InitData_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DisarmerGadget.BP_DisarmerGadget_C
// 0x00E8 (0x03E8 - 0x0300)
class ABP_DisarmerGadget_C final : public AGzDamageableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       OverlapTrigger;                                    // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGzGadgetMovementComponent*             GzGadgetMovement;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_157A6531420AC5E24CFA6DA14FE38C5C; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_157A6531420AC5E24CFA6DA14FE38C5C; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156B[0x3];                                     // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          ShootSound;                                        // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ShootVFX;                                          // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FS_Disarmer_InitData                   InitData;                                          // 0x0358(0x0030)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Speed;                                             // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         HitVFX;                                            // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          HitSound;                                          // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ImpactImpuls;                                      // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156C[0x4];                                     // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          ActivationSound;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ActivationVFX;                                     // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   LeftArmSocket;                                     // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RightArmSocket;                                    // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LegsSocket;                                        // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            DisarmerDefaultAttributes;                         // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bOnDeath;                                          // 0x03D8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          bValidAttachment;                                  // 0x03D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156D[0x2];                                     // 0x03DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActivationDelay;                                   // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RadiusOfTrigger;                                   // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RadiusOfTriggerAfterShoot;                         // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddImpulseDelay(class UCharacterMovementComponent* Target, const struct FVector& Impulse);
	void AddImpulseToCharacter(class AGzMultiPartCharacter* HitCharacter);
	void BndEvt__BP_DisarmerGadget_GzGadgetMovement_K2Node_ComponentBoundEvent_0_GzOnPosition__DelegateSignature();
	void BndEvt__BP_DisarmerGadget_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BP_OnDeath(bool HasDeathHitPoint, const struct FVector& DeathHitPoint);
	void DestroyVisualSequence();
	void DismemberCharacter(class AGzMultiPartCharacter* HitCharacter);
	void ExecuteUbergraph_BP_DisarmerGadget(int32 EntryPoint);
	void GetVFXTransformFromSocket(class USceneComponent* Mesh, class FName InSocketName);
	void HandleOverlap(const class UObject* Object);
	void MakeFX(class UNiagaraSystem* SystemTemplate, class UAkAudioEvent* AkEvent);
	void Move();
	void OnDeathRep();
	void OnRep_bOnDeath();
	void ReadyToDestroy();
	void ReceiveBeginPlay();
	void SetHP();
	void SpawnActivationVFX(const struct FVector& Location, const struct FRotator& Rotation);
	void TearOffLimbFromCharacter(EGzLimbType LimbType, class AGzMultiPartCharacter* HitCharacter);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

	bool CanAttachTo(class AActor* Actor) const;
	bool IsValidAttachment() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DisarmerGadget_C">();
	}
	static class ABP_DisarmerGadget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DisarmerGadget_C>();
	}
};
static_assert(alignof(ABP_DisarmerGadget_C) == 0x000008, "Wrong alignment on ABP_DisarmerGadget_C");
static_assert(sizeof(ABP_DisarmerGadget_C) == 0x0003E8, "Wrong size on ABP_DisarmerGadget_C");
static_assert(offsetof(ABP_DisarmerGadget_C, UberGraphFrame) == 0x000300, "Member 'ABP_DisarmerGadget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, OverlapTrigger) == 0x000308, "Member 'ABP_DisarmerGadget_C::OverlapTrigger' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, Cube) == 0x000310, "Member 'ABP_DisarmerGadget_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, Sphere) == 0x000318, "Member 'ABP_DisarmerGadget_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, GzGadgetMovement) == 0x000320, "Member 'ABP_DisarmerGadget_C::GzGadgetMovement' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, Scene) == 0x000328, "Member 'ABP_DisarmerGadget_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, Niagara) == 0x000330, "Member 'ABP_DisarmerGadget_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, Timeline_NewTrack_0_157A6531420AC5E24CFA6DA14FE38C5C) == 0x000338, "Member 'ABP_DisarmerGadget_C::Timeline_NewTrack_0_157A6531420AC5E24CFA6DA14FE38C5C' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, Timeline__Direction_157A6531420AC5E24CFA6DA14FE38C5C) == 0x00033C, "Member 'ABP_DisarmerGadget_C::Timeline__Direction_157A6531420AC5E24CFA6DA14FE38C5C' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, Timeline) == 0x000340, "Member 'ABP_DisarmerGadget_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, ShootSound) == 0x000348, "Member 'ABP_DisarmerGadget_C::ShootSound' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, ShootVFX) == 0x000350, "Member 'ABP_DisarmerGadget_C::ShootVFX' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, InitData) == 0x000358, "Member 'ABP_DisarmerGadget_C::InitData' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, Speed) == 0x000388, "Member 'ABP_DisarmerGadget_C::Speed' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, HitVFX) == 0x000390, "Member 'ABP_DisarmerGadget_C::HitVFX' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, HitSound) == 0x000398, "Member 'ABP_DisarmerGadget_C::HitSound' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, ImpactImpuls) == 0x0003A0, "Member 'ABP_DisarmerGadget_C::ImpactImpuls' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, ActivationSound) == 0x0003A8, "Member 'ABP_DisarmerGadget_C::ActivationSound' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, ActivationVFX) == 0x0003B0, "Member 'ABP_DisarmerGadget_C::ActivationVFX' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, LeftArmSocket) == 0x0003B8, "Member 'ABP_DisarmerGadget_C::LeftArmSocket' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, RightArmSocket) == 0x0003C0, "Member 'ABP_DisarmerGadget_C::RightArmSocket' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, LegsSocket) == 0x0003C8, "Member 'ABP_DisarmerGadget_C::LegsSocket' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, DisarmerDefaultAttributes) == 0x0003D0, "Member 'ABP_DisarmerGadget_C::DisarmerDefaultAttributes' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, bOnDeath) == 0x0003D8, "Member 'ABP_DisarmerGadget_C::bOnDeath' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, bValidAttachment) == 0x0003D9, "Member 'ABP_DisarmerGadget_C::bValidAttachment' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, ActivationDelay) == 0x0003DC, "Member 'ABP_DisarmerGadget_C::ActivationDelay' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, RadiusOfTrigger) == 0x0003E0, "Member 'ABP_DisarmerGadget_C::RadiusOfTrigger' has a wrong offset!");
static_assert(offsetof(ABP_DisarmerGadget_C, RadiusOfTriggerAfterShoot) == 0x0003E4, "Member 'ABP_DisarmerGadget_C::RadiusOfTriggerAfterShoot' has a wrong offset!");

}

