#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DomeShieldComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DomeShieldComponent.BP_DomeShieldComponent_C.ExecuteUbergraph_BP_DomeShieldComponent
// 0x0068 (0x0068 - 0x0000)
struct BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BF5[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BF6[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BF7[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent) == 0x000008, "Wrong alignment on BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent");
static_assert(sizeof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent) == 0x000068, "Wrong size on BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent");
static_assert(offsetof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent, EntryPoint) == 0x000000, "Member 'BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent, CallFunc_FClamp_ReturnValue) == 0x000028, "Member 'BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent, CallFunc_BooleanAND_ReturnValue) == 0x000031, "Member 'BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000038, "Member 'BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent, K2Node_Event_EndPlayReason) == 0x000058, "Member 'BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'BP_DomeShieldComponent_C_ExecuteUbergraph_BP_DomeShieldComponent::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_DomeShieldComponent.BP_DomeShieldComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_DomeShieldComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DomeShieldComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_DomeShieldComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_DomeShieldComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_DomeShieldComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_DomeShieldComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_DomeShieldComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_DomeShieldComponent.BP_DomeShieldComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DomeShieldComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DomeShieldComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DomeShieldComponent_C_ReceiveTick");
static_assert(sizeof(BP_DomeShieldComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_DomeShieldComponent_C_ReceiveTick");
static_assert(offsetof(BP_DomeShieldComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DomeShieldComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

