#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DroneGoblin

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DroneGoblin.BP_DroneGoblin_C.ApplyDamage
// 0x0030 (0x0030 - 0x0000)
struct BP_DroneGoblin_C_ApplyDamage final
{
public:
	double                                        Damage;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6147[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DroneGoblinLootContainer_C*         CallFunc_SpawnCrate_CreatedCrate;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6148[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DroneGoblin_C_ApplyDamage) == 0x000008, "Wrong alignment on BP_DroneGoblin_C_ApplyDamage");
static_assert(sizeof(BP_DroneGoblin_C_ApplyDamage) == 0x000030, "Wrong size on BP_DroneGoblin_C_ApplyDamage");
static_assert(offsetof(BP_DroneGoblin_C_ApplyDamage, Damage) == 0x000000, "Member 'BP_DroneGoblin_C_ApplyDamage::Damage' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ApplyDamage, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'BP_DroneGoblin_C_ApplyDamage::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ApplyDamage, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000009, "Member 'BP_DroneGoblin_C_ApplyDamage::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ApplyDamage, CallFunc_SpawnCrate_CreatedCrate) == 0x000010, "Member 'BP_DroneGoblin_C_ApplyDamage::CallFunc_SpawnCrate_CreatedCrate' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ApplyDamage, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BP_DroneGoblin_C_ApplyDamage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ApplyDamage, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000019, "Member 'BP_DroneGoblin_C_ApplyDamage::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ApplyDamage, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'BP_DroneGoblin_C_ApplyDamage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ApplyDamage, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_DroneGoblin_C_ApplyDamage::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ApplyDamage, CallFunc_FMax_ReturnValue) == 0x000028, "Member 'BP_DroneGoblin_C_ApplyDamage::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function BP_DroneGoblin.BP_DroneGoblin_C.BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_0_GzSingleHitDamageReceived__DelegateSignature
// 0x01F8 (0x01F8 - 0x0000)
struct BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_0_GzSingleHitDamageReceived__DelegateSignature final
{
public:
	class UGzDamageableComponent*                 Receiver;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGzSingleHitDamage                     Hit;                                               // 0x0008(0x01F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_0_GzSingleHitDamageReceived__DelegateSignature) == 0x000008, "Wrong alignment on BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_0_GzSingleHitDamageReceived__DelegateSignature");
static_assert(sizeof(BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_0_GzSingleHitDamageReceived__DelegateSignature) == 0x0001F8, "Wrong size on BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_0_GzSingleHitDamageReceived__DelegateSignature");
static_assert(offsetof(BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_0_GzSingleHitDamageReceived__DelegateSignature, Receiver) == 0x000000, "Member 'BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_0_GzSingleHitDamageReceived__DelegateSignature::Receiver' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_0_GzSingleHitDamageReceived__DelegateSignature, Hit) == 0x000008, "Member 'BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_0_GzSingleHitDamageReceived__DelegateSignature::Hit' has a wrong offset!");

// Function BP_DroneGoblin.BP_DroneGoblin_C.BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_1_GzMultiHitDamageReceived__DelegateSignature
// 0x0050 (0x0050 - 0x0000)
struct BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_1_GzMultiHitDamageReceived__DelegateSignature final
{
public:
	class UGzDamageableComponent*                 Receiver;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGzMultiHitDamage                      Hit;                                               // 0x0008(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_1_GzMultiHitDamageReceived__DelegateSignature) == 0x000008, "Wrong alignment on BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_1_GzMultiHitDamageReceived__DelegateSignature");
static_assert(sizeof(BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_1_GzMultiHitDamageReceived__DelegateSignature) == 0x000050, "Wrong size on BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_1_GzMultiHitDamageReceived__DelegateSignature");
static_assert(offsetof(BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_1_GzMultiHitDamageReceived__DelegateSignature, Receiver) == 0x000000, "Member 'BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_1_GzMultiHitDamageReceived__DelegateSignature::Receiver' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_1_GzMultiHitDamageReceived__DelegateSignature, Hit) == 0x000008, "Member 'BP_DroneGoblin_C_BndEvt__BP_DroneGoblin_GzDamageable_K2Node_ComponentBoundEvent_1_GzMultiHitDamageReceived__DelegateSignature::Hit' has a wrong offset!");

// Function BP_DroneGoblin.BP_DroneGoblin_C.ExecuteUbergraph_BP_DroneGoblin
// 0x0328 (0x0328 - 0x0000)
struct BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6149[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614A[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614B[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614C[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzDamageableComponent*                 K2Node_ComponentBoundEvent_Receiver_1;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGzSingleHitDamage                     K2Node_ComponentBoundEvent_Hit_1;                  // 0x0078(0x01F0)(ConstParm, ContainsInstancedReference)
	class UGzDamageableComponent*                 K2Node_ComponentBoundEvent_Receiver;               // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGzMultiHitDamage                      K2Node_ComponentBoundEvent_Hit;                    // 0x0270(0x0048)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_GetBaseSimpleHitDamage_ReturnValue;       // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBaseMultiHitDamage_ReturnValue;        // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x02C0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x02D0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614D[0x3];                                     // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614E[0x3];                                     // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614F[0x4];                                     // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0300(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue_1;      // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6150[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ApplyDamage_Damage_ImplicitCast;          // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ApplyDamage_Damage_ImplicitCast_1;        // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin) == 0x000008, "Wrong alignment on BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin");
static_assert(sizeof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin) == 0x000328, "Wrong size on BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, EntryPoint) == 0x000000, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000020, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, Temp_delegate_Variable) == 0x000028, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_HasAuthority_ReturnValue) == 0x000038, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, Temp_delegate_Variable_1) == 0x000058, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_HasAuthority_ReturnValue_1) == 0x000068, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, K2Node_ComponentBoundEvent_Receiver_1) == 0x000070, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::K2Node_ComponentBoundEvent_Receiver_1' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, K2Node_ComponentBoundEvent_Hit_1) == 0x000078, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::K2Node_ComponentBoundEvent_Hit_1' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, K2Node_ComponentBoundEvent_Receiver) == 0x000268, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::K2Node_ComponentBoundEvent_Receiver' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, K2Node_ComponentBoundEvent_Hit) == 0x000270, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_GetBaseSimpleHitDamage_ReturnValue) == 0x0002B8, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_GetBaseSimpleHitDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_GetBaseMultiHitDamage_ReturnValue) == 0x0002BC, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_GetBaseMultiHitDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, Temp_delegate_Variable_2) == 0x0002C0, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, Temp_delegate_Variable_3) == 0x0002D0, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_HasAuthority_ReturnValue_2) == 0x0002E0, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_PostEvent_ReturnValue) == 0x0002E4, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_IsValid_ReturnValue) == 0x0002E8, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002EC, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000300, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x000308, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_PostAssociatedAkEvent_ReturnValue_1) == 0x00030C, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_PostAssociatedAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_PostEvent_ReturnValue_1) == 0x000310, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_ApplyDamage_Damage_ImplicitCast) == 0x000318, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_ApplyDamage_Damage_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin, CallFunc_ApplyDamage_Damage_ImplicitCast_1) == 0x000320, "Member 'BP_DroneGoblin_C_ExecuteUbergraph_BP_DroneGoblin::CallFunc_ApplyDamage_Damage_ImplicitCast_1' has a wrong offset!");

// Function BP_DroneGoblin.BP_DroneGoblin_C.OnCrateReplaced__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_DroneGoblin_C_OnCrateReplaced__DelegateSignature final
{
public:
	class AActor*                                 NewCrateRef;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DroneGoblin_C_OnCrateReplaced__DelegateSignature) == 0x000008, "Wrong alignment on BP_DroneGoblin_C_OnCrateReplaced__DelegateSignature");
static_assert(sizeof(BP_DroneGoblin_C_OnCrateReplaced__DelegateSignature) == 0x000008, "Wrong size on BP_DroneGoblin_C_OnCrateReplaced__DelegateSignature");
static_assert(offsetof(BP_DroneGoblin_C_OnCrateReplaced__DelegateSignature, NewCrateRef) == 0x000000, "Member 'BP_DroneGoblin_C_OnCrateReplaced__DelegateSignature::NewCrateRef' has a wrong offset!");

// Function BP_DroneGoblin.BP_DroneGoblin_C.OnHealthChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_DroneGoblin_C_OnHealthChanged__DelegateSignature final
{
public:
	double                                        NewHealth;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DroneGoblin_C_OnHealthChanged__DelegateSignature) == 0x000008, "Wrong alignment on BP_DroneGoblin_C_OnHealthChanged__DelegateSignature");
static_assert(sizeof(BP_DroneGoblin_C_OnHealthChanged__DelegateSignature) == 0x000008, "Wrong size on BP_DroneGoblin_C_OnHealthChanged__DelegateSignature");
static_assert(offsetof(BP_DroneGoblin_C_OnHealthChanged__DelegateSignature, NewHealth) == 0x000000, "Member 'BP_DroneGoblin_C_OnHealthChanged__DelegateSignature::NewHealth' has a wrong offset!");

// Function BP_DroneGoblin.BP_DroneGoblin_C.OnRep_DroneHealth
// 0x0010 (0x0010 - 0x0000)
struct BP_DroneGoblin_C_OnRep_DroneHealth final
{
public:
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DroneGoblin_C_OnRep_DroneHealth) == 0x000008, "Wrong alignment on BP_DroneGoblin_C_OnRep_DroneHealth");
static_assert(sizeof(BP_DroneGoblin_C_OnRep_DroneHealth) == 0x000010, "Wrong size on BP_DroneGoblin_C_OnRep_DroneHealth");
static_assert(offsetof(BP_DroneGoblin_C_OnRep_DroneHealth, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_DroneGoblin_C_OnRep_DroneHealth::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_OnRep_DroneHealth, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_DroneGoblin_C_OnRep_DroneHealth::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_DroneGoblin.BP_DroneGoblin_C.SpawnCrate
// 0x0080 (0x0080 - 0x0000)
struct BP_DroneGoblin_C_SpawnCrate final
{
public:
	class ABP_DroneGoblinLootContainer_C*         CreatedCrate;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6151[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DroneGoblinLootContainer_C*         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DroneGoblin_C_SpawnCrate) == 0x000010, "Wrong alignment on BP_DroneGoblin_C_SpawnCrate");
static_assert(sizeof(BP_DroneGoblin_C_SpawnCrate) == 0x000080, "Wrong size on BP_DroneGoblin_C_SpawnCrate");
static_assert(offsetof(BP_DroneGoblin_C_SpawnCrate, CreatedCrate) == 0x000000, "Member 'BP_DroneGoblin_C_SpawnCrate::CreatedCrate' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_SpawnCrate, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'BP_DroneGoblin_C_SpawnCrate::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_SpawnCrate, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'BP_DroneGoblin_C_SpawnCrate::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneGoblin_C_SpawnCrate, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'BP_DroneGoblin_C_SpawnCrate::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_DroneGoblin.BP_DroneGoblin_C.GetDefilerTargetType
// 0x0001 (0x0001 - 0x0000)
struct BP_DroneGoblin_C_GetDefilerTargetType final
{
public:
	EGzDefilerTargetType                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DroneGoblin_C_GetDefilerTargetType) == 0x000001, "Wrong alignment on BP_DroneGoblin_C_GetDefilerTargetType");
static_assert(sizeof(BP_DroneGoblin_C_GetDefilerTargetType) == 0x000001, "Wrong size on BP_DroneGoblin_C_GetDefilerTargetType");
static_assert(offsetof(BP_DroneGoblin_C_GetDefilerTargetType, ReturnValue) == 0x000000, "Member 'BP_DroneGoblin_C_GetDefilerTargetType::ReturnValue' has a wrong offset!");

}

