#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DefaultWeaponMagazineProp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DefaultWeaponMagazineProp.BP_DefaultWeaponMagazineProp_C
// 0x0020 (0x02C0 - 0x02A0)
class ABP_DefaultWeaponMagazineProp_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGzSurfaceTypeEvents*                   GroundHitSounds;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebug;                                            // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DebugSurface(class AActor* Actor, const struct FHitResult& Hit);
	void ExecuteUbergraph_BP_DefaultWeaponMagazineProp(int32 EntryPoint);
	void NewFunction(const struct FHitResult& Hit);
	void OnActorHit_Event(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DefaultWeaponMagazineProp_C">();
	}
	static class ABP_DefaultWeaponMagazineProp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DefaultWeaponMagazineProp_C>();
	}
};
static_assert(alignof(ABP_DefaultWeaponMagazineProp_C) == 0x000008, "Wrong alignment on ABP_DefaultWeaponMagazineProp_C");
static_assert(sizeof(ABP_DefaultWeaponMagazineProp_C) == 0x0002C0, "Wrong size on ABP_DefaultWeaponMagazineProp_C");
static_assert(offsetof(ABP_DefaultWeaponMagazineProp_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_DefaultWeaponMagazineProp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DefaultWeaponMagazineProp_C, StaticMesh) == 0x0002A8, "Member 'ABP_DefaultWeaponMagazineProp_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_DefaultWeaponMagazineProp_C, GroundHitSounds) == 0x0002B0, "Member 'ABP_DefaultWeaponMagazineProp_C::GroundHitSounds' has a wrong offset!");
static_assert(offsetof(ABP_DefaultWeaponMagazineProp_C, bDebug) == 0x0002B8, "Member 'ABP_DefaultWeaponMagazineProp_C::bDebug' has a wrong offset!");

}

