#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Defiler_Component

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "S_Defiler_TapeInitData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_Defiler_Component.BP_Defiler_Component_C.ApplyDefilerBuffEffect
// 0x0018 (0x0018 - 0x0000)
struct BP_Defiler_Component_C_ApplyDefilerBuffEffect final
{
public:
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_656A[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_ApplyDefilerBuffEffect) == 0x000008, "Wrong alignment on BP_Defiler_Component_C_ApplyDefilerBuffEffect");
static_assert(sizeof(BP_Defiler_Component_C_ApplyDefilerBuffEffect) == 0x000018, "Wrong size on BP_Defiler_Component_C_ApplyDefilerBuffEffect");
static_assert(offsetof(BP_Defiler_Component_C_ApplyDefilerBuffEffect, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000000, "Member 'BP_Defiler_Component_C_ApplyDefilerBuffEffect::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ApplyDefilerBuffEffect, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_Defiler_Component_C_ApplyDefilerBuffEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ApplyDefilerBuffEffect, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00000C, "Member 'BP_Defiler_Component_C_ApplyDefilerBuffEffect::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function BP_Defiler_Component.BP_Defiler_Component_C.CheckReload
// 0x0028 (0x0028 - 0x0000)
struct BP_Defiler_Component_C_CheckReload final
{
public:
	bool                                          Reloaded;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_656B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_656C[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_CheckReload) == 0x000008, "Wrong alignment on BP_Defiler_Component_C_CheckReload");
static_assert(sizeof(BP_Defiler_Component_C_CheckReload) == 0x000028, "Wrong size on BP_Defiler_Component_C_CheckReload");
static_assert(offsetof(BP_Defiler_Component_C_CheckReload, Reloaded) == 0x000000, "Member 'BP_Defiler_Component_C_CheckReload::Reloaded' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_CheckReload, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000004, "Member 'BP_Defiler_Component_C_CheckReload::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_CheckReload, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_Defiler_Component_C_CheckReload::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_CheckReload, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Defiler_Component_C_CheckReload::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_CheckReload, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'BP_Defiler_Component_C_CheckReload::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_CheckReload, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000020, "Member 'BP_Defiler_Component_C_CheckReload::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_Defiler_Component.BP_Defiler_Component_C.Enable Vision
// 0x0010 (0x0010 - 0x0000)
struct BP_Defiler_Component_C_Enable_Vision final
{
public:
	const class UActorComponent*                  Temp_object_Variable;                              // 0x0000(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_Enable_Vision) == 0x000008, "Wrong alignment on BP_Defiler_Component_C_Enable_Vision");
static_assert(sizeof(BP_Defiler_Component_C_Enable_Vision) == 0x000010, "Wrong size on BP_Defiler_Component_C_Enable_Vision");
static_assert(offsetof(BP_Defiler_Component_C_Enable_Vision, Temp_object_Variable) == 0x000000, "Member 'BP_Defiler_Component_C_Enable_Vision::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Enable_Vision, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_Defiler_Component_C_Enable_Vision::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Defiler_Component.BP_Defiler_Component_C.ExecuteUbergraph_BP_Defiler_Component
// 0x0190 (0x0190 - 0x0000)
struct BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_656D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzProgressLogUISubsystem*              CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_656E[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_656F[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6570[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6571[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6572[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzProgressLogUISubsystem*              CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Spawn_Transform_Location;       // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Hit_Actor;                      // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HandLocation;                   // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_InNormal;                       // 0x00A8(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SpendCharge_ChargesEnd;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6573[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UActorComponent*                  Temp_object_Variable;                              // 0x00D0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzBodyPartAbilityData*                 CallFunc_BP_GetAbilityData_ReturnValue;            // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzBodyPartAbilityData_Defiler*         K2Node_DynamicCast_AsGz_Body_Part_Ability_Data_Defiler; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6574[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzMultiPartCharacter*                  K2Node_DynamicCast_AsGz_Multi_Part_Character;      // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6575[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6576[0x6];                                     // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Defiler_VisionComponent_C*          CallFunc_AddComponentByClass_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_Defiler_VisionComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0134(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6577[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue_1;  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6578[0x2];                                     // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartProgress_ReturnValue;                // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6579[0x2];                                     // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_657A[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_657B[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_ReloadCurrent_ImplicitCast;     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component) == 0x000008, "Wrong alignment on BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component");
static_assert(sizeof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component) == 0x000190, "Wrong size on BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, EntryPoint) == 0x000000, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_CustomEvent_Tag) == 0x000014, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, Temp_struct_Variable) == 0x00001C, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_GetOwner_ReturnValue_1) == 0x000040, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_HasAuthority_ReturnValue) == 0x000048, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_HasAuthority_ReturnValue_1) == 0x000049, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_CreateDelegate_OutputDelegate_1) == 0x00004C, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_Event_EndPlayReason) == 0x00005C, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_Event_DeltaSeconds) == 0x000060, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000068, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_CustomEvent_Spawn_Transform_Location) == 0x000070, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_CustomEvent_Spawn_Transform_Location' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_CustomEvent_Hit_Actor) == 0x000088, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_CustomEvent_Hit_Actor' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_CustomEvent_HandLocation) == 0x000090, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_CustomEvent_HandLocation' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_CustomEvent_InNormal) == 0x0000A8, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_CustomEvent_InNormal' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_SpendCharge_ChargesEnd) == 0x0000C8, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_SpendCharge_ChargesEnd' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000C9, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, Temp_object_Variable) == 0x0000D0, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_BP_GetAbilityData_ReturnValue) == 0x0000D8, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_BP_GetAbilityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_DynamicCast_AsGz_Body_Part_Ability_Data_Defiler) == 0x0000E0, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_DynamicCast_AsGz_Body_Part_Ability_Data_Defiler' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_GetOwner_ReturnValue_2) == 0x0000F0, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_GetOwner_ReturnValue_3) == 0x0000F8, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_DynamicCast_AsGz_Multi_Part_Character) == 0x000100, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_DynamicCast_AsGz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_DynamicCast_AsPawn) == 0x000110, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_DynamicCast_bSuccess_2) == 0x000118, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_IsLocallyControlled_ReturnValue) == 0x000119, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_AddComponentByClass_ReturnValue) == 0x000120, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_GetComponentByClass_ReturnValue) == 0x000128, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000130, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_CustomEvent_Tag_1) == 0x000134, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000140, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_GetServerWorldTimeSeconds_ReturnValue_1) == 0x000148, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_GetServerWorldTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_IsValid_ReturnValue_1) == 0x00014C, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_IsValidClass_ReturnValue) == 0x00014D, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_StartProgress_ReturnValue) == 0x000150, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_StartProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_IsValid_ReturnValue_2) == 0x000154, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_IsValid_ReturnValue_3) == 0x000155, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000158, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_IsValid_ReturnValue_4) == 0x000160, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue) == 0x000168, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_IsValid_ReturnValue_5) == 0x000170, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000178, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000180, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component, K2Node_VariableSet_ReloadCurrent_ImplicitCast) == 0x000188, "Member 'BP_Defiler_Component_C_ExecuteUbergraph_BP_Defiler_Component::K2Node_VariableSet_ReloadCurrent_ImplicitCast' has a wrong offset!");

// Function BP_Defiler_Component.BP_Defiler_Component_C.IsCharged
// 0x0002 (0x0002 - 0x0000)
struct BP_Defiler_Component_C_IsCharged final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_IsCharged) == 0x000001, "Wrong alignment on BP_Defiler_Component_C_IsCharged");
static_assert(sizeof(BP_Defiler_Component_C_IsCharged) == 0x000002, "Wrong size on BP_Defiler_Component_C_IsCharged");
static_assert(offsetof(BP_Defiler_Component_C_IsCharged, NewParam) == 0x000000, "Member 'BP_Defiler_Component_C_IsCharged::NewParam' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_IsCharged, CallFunc_Greater_IntInt_ReturnValue) == 0x000001, "Member 'BP_Defiler_Component_C_IsCharged::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Defiler_Component.BP_Defiler_Component_C.OnChargesChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_Defiler_Component_C_OnChargesChanged__DelegateSignature final
{
public:
	int32                                         Param_Charges;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_OnChargesChanged__DelegateSignature) == 0x000004, "Wrong alignment on BP_Defiler_Component_C_OnChargesChanged__DelegateSignature");
static_assert(sizeof(BP_Defiler_Component_C_OnChargesChanged__DelegateSignature) == 0x000004, "Wrong size on BP_Defiler_Component_C_OnChargesChanged__DelegateSignature");
static_assert(offsetof(BP_Defiler_Component_C_OnChargesChanged__DelegateSignature, Param_Charges) == 0x000000, "Member 'BP_Defiler_Component_C_OnChargesChanged__DelegateSignature::Param_Charges' has a wrong offset!");

// Function BP_Defiler_Component.BP_Defiler_Component_C.OnTagAdded_E4CFBB254667CBC696E1509E34080D91
// 0x0008 (0x0008 - 0x0000)
struct BP_Defiler_Component_C_OnTagAdded_E4CFBB254667CBC696E1509E34080D91 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_OnTagAdded_E4CFBB254667CBC696E1509E34080D91) == 0x000004, "Wrong alignment on BP_Defiler_Component_C_OnTagAdded_E4CFBB254667CBC696E1509E34080D91");
static_assert(sizeof(BP_Defiler_Component_C_OnTagAdded_E4CFBB254667CBC696E1509E34080D91) == 0x000008, "Wrong size on BP_Defiler_Component_C_OnTagAdded_E4CFBB254667CBC696E1509E34080D91");
static_assert(offsetof(BP_Defiler_Component_C_OnTagAdded_E4CFBB254667CBC696E1509E34080D91, Tag) == 0x000000, "Member 'BP_Defiler_Component_C_OnTagAdded_E4CFBB254667CBC696E1509E34080D91::Tag' has a wrong offset!");

// Function BP_Defiler_Component.BP_Defiler_Component_C.OnTagRemoved_E4CFBB254667CBC696E1509E34080D91
// 0x0008 (0x0008 - 0x0000)
struct BP_Defiler_Component_C_OnTagRemoved_E4CFBB254667CBC696E1509E34080D91 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_OnTagRemoved_E4CFBB254667CBC696E1509E34080D91) == 0x000004, "Wrong alignment on BP_Defiler_Component_C_OnTagRemoved_E4CFBB254667CBC696E1509E34080D91");
static_assert(sizeof(BP_Defiler_Component_C_OnTagRemoved_E4CFBB254667CBC696E1509E34080D91) == 0x000008, "Wrong size on BP_Defiler_Component_C_OnTagRemoved_E4CFBB254667CBC696E1509E34080D91");
static_assert(offsetof(BP_Defiler_Component_C_OnTagRemoved_E4CFBB254667CBC696E1509E34080D91, Tag) == 0x000000, "Member 'BP_Defiler_Component_C_OnTagRemoved_E4CFBB254667CBC696E1509E34080D91::Tag' has a wrong offset!");

// Function BP_Defiler_Component.BP_Defiler_Component_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Defiler_Component_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Defiler_Component_C_ReceiveEndPlay");
static_assert(sizeof(BP_Defiler_Component_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Defiler_Component_C_ReceiveEndPlay");
static_assert(offsetof(BP_Defiler_Component_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Defiler_Component_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Defiler_Component.BP_Defiler_Component_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Defiler_Component_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Defiler_Component_C_ReceiveTick");
static_assert(sizeof(BP_Defiler_Component_C_ReceiveTick) == 0x000004, "Wrong size on BP_Defiler_Component_C_ReceiveTick");
static_assert(offsetof(BP_Defiler_Component_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Defiler_Component_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Defiler_Component.BP_Defiler_Component_C.RemoveDefilerBuffEffect
// 0x0018 (0x0018 - 0x0000)
struct BP_Defiler_Component_C_RemoveDefilerBuffEffect final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_657C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_RemoveDefilerBuffEffect) == 0x000008, "Wrong alignment on BP_Defiler_Component_C_RemoveDefilerBuffEffect");
static_assert(sizeof(BP_Defiler_Component_C_RemoveDefilerBuffEffect) == 0x000018, "Wrong size on BP_Defiler_Component_C_RemoveDefilerBuffEffect");
static_assert(offsetof(BP_Defiler_Component_C_RemoveDefilerBuffEffect, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Defiler_Component_C_RemoveDefilerBuffEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_RemoveDefilerBuffEffect, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'BP_Defiler_Component_C_RemoveDefilerBuffEffect::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_RemoveDefilerBuffEffect, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000010, "Member 'BP_Defiler_Component_C_RemoveDefilerBuffEffect::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");

// Function BP_Defiler_Component.BP_Defiler_Component_C.Request Spawn Tape
// 0x0200 (0x0200 - 0x0000)
struct BP_Defiler_Component_C_Request_Spawn_Tape final
{
public:
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_657D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzMultiPartCharacter*                  K2Node_DynamicCast_AsGz_Multi_Part_Character;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_657E[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzCombatComponent*                     CallFunc_GetCombatComponent_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_GetViewHitResult_ReturnValue;             // 0x0028(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_657F[0x1];                                     // 0x0123(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6580[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6581[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_ReloadCurrent_ImplicitCast;     // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_Request_Spawn_Tape) == 0x000008, "Wrong alignment on BP_Defiler_Component_C_Request_Spawn_Tape");
static_assert(sizeof(BP_Defiler_Component_C_Request_Spawn_Tape) == 0x000200, "Wrong size on BP_Defiler_Component_C_Request_Spawn_Tape");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000000, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, K2Node_DynamicCast_AsGz_Multi_Part_Character) == 0x000010, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::K2Node_DynamicCast_AsGz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_GetCombatComponent_ReturnValue) == 0x000020, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_GetCombatComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_GetViewHitResult_ReturnValue) == 0x000028, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_GetViewHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_bBlockingHit) == 0x000121, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_bInitialOverlap) == 0x000122, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_Time) == 0x000124, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_Distance) == 0x000128, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_Location) == 0x000130, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_ImpactPoint) == 0x000148, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_Normal) == 0x000160, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_ImpactNormal) == 0x000178, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_PhysMat) == 0x000190, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_HitActor) == 0x000198, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_HitComponent) == 0x0001A0, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_HitBoneName) == 0x0001A8, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_BoneName) == 0x0001B0, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_HitItem) == 0x0001B8, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_ElementIndex) == 0x0001BC, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_FaceIndex) == 0x0001C0, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_TraceStart) == 0x0001C8, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, CallFunc_BreakHitResult_TraceEnd) == 0x0001E0, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_Request_Spawn_Tape, K2Node_VariableSet_ReloadCurrent_ImplicitCast) == 0x0001F8, "Member 'BP_Defiler_Component_C_Request_Spawn_Tape::K2Node_VariableSet_ReloadCurrent_ImplicitCast' has a wrong offset!");

// Function BP_Defiler_Component.BP_Defiler_Component_C.SetCurrentCharges
// 0x0018 (0x0018 - 0x0000)
struct BP_Defiler_Component_C_SetCurrentCharges final
{
public:
	int32                                         Param_Charges;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6582[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6583[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetCurrentSecondaryCharges_Current_ImplicitCast; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_SetCurrentCharges) == 0x000008, "Wrong alignment on BP_Defiler_Component_C_SetCurrentCharges");
static_assert(sizeof(BP_Defiler_Component_C_SetCurrentCharges) == 0x000018, "Wrong size on BP_Defiler_Component_C_SetCurrentCharges");
static_assert(offsetof(BP_Defiler_Component_C_SetCurrentCharges, Param_Charges) == 0x000000, "Member 'BP_Defiler_Component_C_SetCurrentCharges::Param_Charges' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_SetCurrentCharges, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'BP_Defiler_Component_C_SetCurrentCharges::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_SetCurrentCharges, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'BP_Defiler_Component_C_SetCurrentCharges::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_SetCurrentCharges, CallFunc_SetCurrentSecondaryCharges_Current_ImplicitCast) == 0x000014, "Member 'BP_Defiler_Component_C_SetCurrentCharges::CallFunc_SetCurrentSecondaryCharges_Current_ImplicitCast' has a wrong offset!");

// Function BP_Defiler_Component.BP_Defiler_Component_C.SpawnTapeOnServer
// 0x0050 (0x0050 - 0x0000)
struct BP_Defiler_Component_C_SpawnTapeOnServer final
{
public:
	struct FVector                                Spawn_Transform_Location;                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Hit_Actor;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HandLocation;                                      // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InNormal;                                          // 0x0038(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_SpawnTapeOnServer) == 0x000008, "Wrong alignment on BP_Defiler_Component_C_SpawnTapeOnServer");
static_assert(sizeof(BP_Defiler_Component_C_SpawnTapeOnServer) == 0x000050, "Wrong size on BP_Defiler_Component_C_SpawnTapeOnServer");
static_assert(offsetof(BP_Defiler_Component_C_SpawnTapeOnServer, Spawn_Transform_Location) == 0x000000, "Member 'BP_Defiler_Component_C_SpawnTapeOnServer::Spawn_Transform_Location' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_SpawnTapeOnServer, Hit_Actor) == 0x000018, "Member 'BP_Defiler_Component_C_SpawnTapeOnServer::Hit_Actor' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_SpawnTapeOnServer, HandLocation) == 0x000020, "Member 'BP_Defiler_Component_C_SpawnTapeOnServer::HandLocation' has a wrong offset!");
static_assert(offsetof(BP_Defiler_Component_C_SpawnTapeOnServer, InNormal) == 0x000038, "Member 'BP_Defiler_Component_C_SpawnTapeOnServer::InNormal' has a wrong offset!");

// Function BP_Defiler_Component.BP_Defiler_Component_C.SpendCharge
// 0x0130 (0x0130 - 0x0000)
struct BP_Defiler_Component_C_SpendCharge final
{
public:
	struct FVector                                Spawn_Transform_Location;                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Hit_Actor;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HandLocation;                                      // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InNormal;                                          // 0x0038(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChargesEnd;                                        // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6584[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Defiler_TapeInitData                K2Node_MakeStruct_S_Defiler_TapeInitData;          // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6585[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Defiler_HackTape_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6586[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_MakeStruct_Radius_9_841B14C94D296990F84F3EABF76B99DF_ImplicitCast; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_PulsePeriod_8_A52E446A4E063D6DD00792A4E7972E08_ImplicitCast; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_Lifetime_7_1F76AE0A4FF48910D8D4229024BFE7AC_ImplicitCast; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_Component_C_SpendCharge) == 0x000010, "Wrong alignment on BP_Defiler_Component_C_SpendCharge");
