#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Debug_Lobby_IdlePoses

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Debug_Lobby_IdlePoses.BP_Debug_Lobby_IdlePoses_C.ExecuteUbergraph_BP_Debug_Lobby_IdlePoses
// 0x0030 (0x0030 - 0x0000)
struct BP_Debug_Lobby_IdlePoses_C_ExecuteUbergraph_BP_Debug_Lobby_IdlePoses final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A40[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Debug_Lobby_IdlePoses_C*           CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Debug_Lobby_IdlePoses_C_ExecuteUbergraph_BP_Debug_Lobby_IdlePoses) == 0x000008, "Wrong alignment on BP_Debug_Lobby_IdlePoses_C_ExecuteUbergraph_BP_Debug_Lobby_IdlePoses");
static_assert(sizeof(BP_Debug_Lobby_IdlePoses_C_ExecuteUbergraph_BP_Debug_Lobby_IdlePoses) == 0x000030, "Wrong size on BP_Debug_Lobby_IdlePoses_C_ExecuteUbergraph_BP_Debug_Lobby_IdlePoses");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_ExecuteUbergraph_BP_Debug_Lobby_IdlePoses, EntryPoint) == 0x000000, "Member 'BP_Debug_Lobby_IdlePoses_C_ExecuteUbergraph_BP_Debug_Lobby_IdlePoses::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_ExecuteUbergraph_BP_Debug_Lobby_IdlePoses, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_Debug_Lobby_IdlePoses_C_ExecuteUbergraph_BP_Debug_Lobby_IdlePoses::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_ExecuteUbergraph_BP_Debug_Lobby_IdlePoses, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_Debug_Lobby_IdlePoses_C_ExecuteUbergraph_BP_Debug_Lobby_IdlePoses::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_ExecuteUbergraph_BP_Debug_Lobby_IdlePoses, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BP_Debug_Lobby_IdlePoses_C_ExecuteUbergraph_BP_Debug_Lobby_IdlePoses::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BP_Debug_Lobby_IdlePoses.BP_Debug_Lobby_IdlePoses_C.SpawnTeammates
// 0x01D0 (0x01D0 - 0x0000)
struct BP_Debug_Lobby_IdlePoses_C_SpawnTeammates final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A41[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Hideout_Player_C*                  K2Node_DynamicCast_AsABP_Hideout_Player;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A42[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A43[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HideoutPlayerCharacter_C*           CallFunc_GetActorOfClass_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Hideout_Player_C*                  K2Node_DynamicCast_AsABP_Hideout_Player_1;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A44[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Hideout_Player_C*                  K2Node_DynamicCast_AsABP_Hideout_Player_2;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A45[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PartyMemberDisplaySlot_C*>   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0060(0x0010)(ReferenceParm)
	class ABP_PartyMemberDisplaySlot_C*           CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A46[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A47[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A48[0x8];                                     // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0140(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HideoutPlayerCharacter_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_HideoutPlayerCharacter_C*           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates) == 0x000010, "Wrong alignment on BP_Debug_Lobby_IdlePoses_C_SpawnTeammates");
static_assert(sizeof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates) == 0x0001D0, "Wrong size on BP_Debug_Lobby_IdlePoses_C_SpawnTeammates");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, K2Node_DynamicCast_AsABP_Hideout_Player) == 0x000010, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::K2Node_DynamicCast_AsABP_Hideout_Player' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_GetActorOfClass_ReturnValue) == 0x000028, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000030, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, K2Node_DynamicCast_AsABP_Hideout_Player_1) == 0x000038, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::K2Node_DynamicCast_AsABP_Hideout_Player_1' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000048, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, K2Node_DynamicCast_AsABP_Hideout_Player_2) == 0x000050, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::K2Node_DynamicCast_AsABP_Hideout_Player_2' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_GetAllActorsOfClass_OutActors) == 0x000060, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000080, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A0, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000120, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000138, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_MakeTransform_ReturnValue_1) == 0x000140, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001A0, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0001A8, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0001B0, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_GetDisplayName_ReturnValue) == 0x0001B8, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_Lobby_IdlePoses_C_SpawnTeammates, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0001C8, "Member 'BP_Debug_Lobby_IdlePoses_C_SpawnTeammates::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

}

