#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeploymentPawn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DeploymentPawn.BP_DeploymentPawn_C
// 0x0028 (0x03D8 - 0x03B0)
class ABP_DeploymentPawn_C final : public AGzDeploymentPawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       Camera;                                            // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     PlayerCharacter;                                   // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ReceiveDeployment;                                 // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_DeploymentPawn(int32 EntryPoint);
	void InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_LookUp_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void ReceiveBeginPlay();
	void ReceiveDeployment__DelegateSignature(bool Param_CanDeploy);
	void ReceiveDeploymentAllowed(bool bCanPawnDeploy);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DeploymentPawn_C">();
	}
	static class ABP_DeploymentPawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DeploymentPawn_C>();
	}
};
static_assert(alignof(ABP_DeploymentPawn_C) == 0x000008, "Wrong alignment on ABP_DeploymentPawn_C");
static_assert(sizeof(ABP_DeploymentPawn_C) == 0x0003D8, "Wrong size on ABP_DeploymentPawn_C");
static_assert(offsetof(ABP_DeploymentPawn_C, UberGraphFrame) == 0x0003B0, "Member 'ABP_DeploymentPawn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DeploymentPawn_C, Camera) == 0x0003B8, "Member 'ABP_DeploymentPawn_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_DeploymentPawn_C, PlayerCharacter) == 0x0003C0, "Member 'ABP_DeploymentPawn_C::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(ABP_DeploymentPawn_C, ReceiveDeployment) == 0x0003C8, "Member 'ABP_DeploymentPawn_C::ReceiveDeployment' has a wrong offset!");

}

