#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeliveryTransport_DropPod

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.Animate Container Dissolving A
// 0x0040 (0x0040 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A final
{
public:
	double                                        InDissolveAnimationValue;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterialCache;                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6850[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6851[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A) == 0x000008, "Wrong alignment on BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A) == 0x000040, "Wrong size on BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A, InDissolveAnimationValue) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A::InDissolveAnimationValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A, DynamicMaterialCache) == 0x000008, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A::DynamicMaterialCache' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000038, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00003C, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_Dissolving_A::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.Animate Container DissolvingB
// 0x0040 (0x0040 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB final
{
public:
	double                                        InDissolveAnimationValue;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterialCache;                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6852[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6853[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB) == 0x000008, "Wrong alignment on BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB) == 0x000040, "Wrong size on BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB, InDissolveAnimationValue) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB::InDissolveAnimationValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB, DynamicMaterialCache) == 0x000008, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB::DynamicMaterialCache' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000038, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00003C, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingB::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.Animate Container DissolvingC
// 0x0040 (0x0040 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC final
{
public:
	double                                        InDissolveAnimationValue;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterialCache;                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6854[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6855[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC) == 0x000008, "Wrong alignment on BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC) == 0x000040, "Wrong size on BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC, InDissolveAnimationValue) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC::InDissolveAnimationValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC, DynamicMaterialCache) == 0x000008, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC::DynamicMaterialCache' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000038, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00003C, "Member 'BP_DeliveryTransport_DropPod_C_Animate_Container_DissolvingC::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.BndEvt__BP_DeliveryTransport_DropPod_GzInteractable_K2Node_ComponentBoundEvent_0_GzOnInteract__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzInteractable_K2Node_ComponentBoundEvent_0_GzOnInteract__DelegateSignature final
{
public:
	class AActor*                                 InteractedBy;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         Interactable;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzInteractable_K2Node_ComponentBoundEvent_0_GzOnInteract__DelegateSignature) == 0x000008, "Wrong alignment on BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzInteractable_K2Node_ComponentBoundEvent_0_GzOnInteract__DelegateSignature");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzInteractable_K2Node_ComponentBoundEvent_0_GzOnInteract__DelegateSignature) == 0x000010, "Wrong size on BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzInteractable_K2Node_ComponentBoundEvent_0_GzOnInteract__DelegateSignature");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzInteractable_K2Node_ComponentBoundEvent_0_GzOnInteract__DelegateSignature, InteractedBy) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzInteractable_K2Node_ComponentBoundEvent_0_GzOnInteract__DelegateSignature::InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzInteractable_K2Node_ComponentBoundEvent_0_GzOnInteract__DelegateSignature, Interactable) == 0x000008, "Member 'BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzInteractable_K2Node_ComponentBoundEvent_0_GzOnInteract__DelegateSignature::Interactable' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.BndEvt__BP_DeliveryTransport_DropPod_GzLoadoutSelection_K2Node_ComponentBoundEvent_2_GzOnLoadoutGiven__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzLoadoutSelection_K2Node_ComponentBoundEvent_2_GzOnLoadoutGiven__DelegateSignature final
{
public:
	int32                                         PlayerId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzLoadoutSelection_K2Node_ComponentBoundEvent_2_GzOnLoadoutGiven__DelegateSignature) == 0x000004, "Wrong alignment on BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzLoadoutSelection_K2Node_ComponentBoundEvent_2_GzOnLoadoutGiven__DelegateSignature");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzLoadoutSelection_K2Node_ComponentBoundEvent_2_GzOnLoadoutGiven__DelegateSignature) == 0x000004, "Wrong size on BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzLoadoutSelection_K2Node_ComponentBoundEvent_2_GzOnLoadoutGiven__DelegateSignature");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzLoadoutSelection_K2Node_ComponentBoundEvent_2_GzOnLoadoutGiven__DelegateSignature, PlayerId) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzLoadoutSelection_K2Node_ComponentBoundEvent_2_GzOnLoadoutGiven__DelegateSignature::PlayerId' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.BndEvt__BP_DeliveryTransport_DropPod_GzZoneTracking_K2Node_ComponentBoundEvent_1_ZoneSideSwitched__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzZoneTracking_K2Node_ComponentBoundEvent_1_ZoneSideSwitched__DelegateSignature final
{
public:
	bool                                          bInZone;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzZoneTracking_K2Node_ComponentBoundEvent_1_ZoneSideSwitched__DelegateSignature) == 0x000001, "Wrong alignment on BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzZoneTracking_K2Node_ComponentBoundEvent_1_ZoneSideSwitched__DelegateSignature");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzZoneTracking_K2Node_ComponentBoundEvent_1_ZoneSideSwitched__DelegateSignature) == 0x000001, "Wrong size on BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzZoneTracking_K2Node_ComponentBoundEvent_1_ZoneSideSwitched__DelegateSignature");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzZoneTracking_K2Node_ComponentBoundEvent_1_ZoneSideSwitched__DelegateSignature, bInZone) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_BndEvt__BP_DeliveryTransport_DropPod_GzZoneTracking_K2Node_ComponentBoundEvent_1_ZoneSideSwitched__DelegateSignature::bInZone' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.Calculate Close to Ground Level
// 0x0150 (0x0150 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6856[0xE];                                     // 0x0002(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0070(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6857[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DropPodLandingSmoke_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDistanceToNextStop_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level) == 0x000010, "Wrong alignment on BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level) == 0x000150, "Wrong size on BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level, CallFunc_HasAuthority_ReturnValue) == 0x000001, "Member 'BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level, Temp_delegate_Variable) == 0x000070, "Member 'BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level, CallFunc_BreakTransform_Location) == 0x000080, "Member 'BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level, CallFunc_BreakTransform_Rotation) == 0x000098, "Member 'BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level, CallFunc_BreakTransform_Scale) == 0x0000B0, "Member 'BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x0000C8, "Member 'BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000130, "Member 'BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level, CallFunc_FinishSpawningActor_ReturnValue) == 0x000138, "Member 'BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level, CallFunc_GetDistanceToNextStop_ReturnValue) == 0x000140, "Member 'BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level::CallFunc_GetDistanceToNextStop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000148, "Member 'BP_DeliveryTransport_DropPod_C_Calculate_Close_to_Ground_Level::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.ConsumeLoadout
// 0x0030 (0x0030 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_ConsumeLoadout final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6858[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6859[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_ConsumeLoadout) == 0x000004, "Wrong alignment on BP_DeliveryTransport_DropPod_C_ConsumeLoadout");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_ConsumeLoadout) == 0x000030, "Wrong size on BP_DeliveryTransport_DropPod_C_ConsumeLoadout");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_ConsumeLoadout, Temp_delegate_Variable) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_ConsumeLoadout::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_ConsumeLoadout, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'BP_DeliveryTransport_DropPod_C_ConsumeLoadout::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_ConsumeLoadout, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'BP_DeliveryTransport_DropPod_C_ConsumeLoadout::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_ConsumeLoadout, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_DeliveryTransport_DropPod_C_ConsumeLoadout::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_ConsumeLoadout, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x00001C, "Member 'BP_DeliveryTransport_DropPod_C_ConsumeLoadout::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_ConsumeLoadout, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000020, "Member 'BP_DeliveryTransport_DropPod_C_ConsumeLoadout::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_ConsumeLoadout, K2Node_SwitchInteger_CmpSuccess) == 0x000024, "Member 'BP_DeliveryTransport_DropPod_C_ConsumeLoadout::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_ConsumeLoadout, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_DeliveryTransport_DropPod_C_ConsumeLoadout::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_ConsumeLoadout, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x00002C, "Member 'BP_DeliveryTransport_DropPod_C_ConsumeLoadout::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.CreateMarker
// 0x00A8 (0x00A8 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_CreateMarker final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_685A[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzGameState*                           K2Node_DynamicCast_AsGz_Game_State;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_685B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGzPlayerState*>                 CallFunc_GetPlayerStates_PlayerStates;             // 0x0028(0x0010)(ReferenceParm)
	class UGzServerMarkerSubsystem*               CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_685C[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzServerMarkerBuildDataActor          K2Node_MakeStruct_GzServerMarkerBuildDataActor;    // 0x0050(0x0050)()
	int32                                         CallFunc_CreateMarkerForActor_ReturnValue;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_CreateMarker) == 0x000008, "Wrong alignment on BP_DeliveryTransport_DropPod_C_CreateMarker");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_CreateMarker) == 0x0000A8, "Wrong size on BP_DeliveryTransport_DropPod_C_CreateMarker");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_CreateMarker, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_CreateMarker::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_CreateMarker, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_DeliveryTransport_DropPod_C_CreateMarker::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_CreateMarker, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_DeliveryTransport_DropPod_C_CreateMarker::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_CreateMarker, CallFunc_HasAuthority_ReturnValue) == 0x00000C, "Member 'BP_DeliveryTransport_DropPod_C_CreateMarker::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_CreateMarker, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'BP_DeliveryTransport_DropPod_C_CreateMarker::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_CreateMarker, K2Node_DynamicCast_AsGz_Game_State) == 0x000018, "Member 'BP_DeliveryTransport_DropPod_C_CreateMarker::K2Node_DynamicCast_AsGz_Game_State' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_CreateMarker, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_DeliveryTransport_DropPod_C_CreateMarker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_CreateMarker, CallFunc_GetPlayerStates_PlayerStates) == 0x000028, "Member 'BP_DeliveryTransport_DropPod_C_CreateMarker::CallFunc_GetPlayerStates_PlayerStates' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_CreateMarker, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000038, "Member 'BP_DeliveryTransport_DropPod_C_CreateMarker::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_CreateMarker, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_DeliveryTransport_DropPod_C_CreateMarker::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_CreateMarker, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_DeliveryTransport_DropPod_C_CreateMarker::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_CreateMarker, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BP_DeliveryTransport_DropPod_C_CreateMarker::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_CreateMarker, K2Node_MakeStruct_GzServerMarkerBuildDataActor) == 0x000050, "Member 'BP_DeliveryTransport_DropPod_C_CreateMarker::K2Node_MakeStruct_GzServerMarkerBuildDataActor' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_CreateMarker, CallFunc_CreateMarkerForActor_ReturnValue) == 0x0000A0, "Member 'BP_DeliveryTransport_DropPod_C_CreateMarker::CallFunc_CreateMarkerForActor_ReturnValue' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.Disolve Animation A
// 0x0018 (0x0018 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_Disolve_Animation_A final
{
public:
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_685D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_Disolve_Animation_A) == 0x000008, "Wrong alignment on BP_DeliveryTransport_DropPod_C_Disolve_Animation_A");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_Disolve_Animation_A) == 0x000018, "Wrong size on BP_DeliveryTransport_DropPod_C_Disolve_Animation_A");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Disolve_Animation_A, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_Disolve_Animation_A::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Disolve_Animation_A, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_DeliveryTransport_DropPod_C_Disolve_Animation_A::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Disolve_Animation_A, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'BP_DeliveryTransport_DropPod_C_Disolve_Animation_A::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.Disolve AnimationB
// 0x0018 (0x0018 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_Disolve_AnimationB final
{
public:
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_685E[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_Disolve_AnimationB) == 0x000008, "Wrong alignment on BP_DeliveryTransport_DropPod_C_Disolve_AnimationB");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_Disolve_AnimationB) == 0x000018, "Wrong size on BP_DeliveryTransport_DropPod_C_Disolve_AnimationB");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Disolve_AnimationB, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_Disolve_AnimationB::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Disolve_AnimationB, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_DeliveryTransport_DropPod_C_Disolve_AnimationB::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Disolve_AnimationB, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'BP_DeliveryTransport_DropPod_C_Disolve_AnimationB::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.Disolve AnimationC
// 0x0018 (0x0018 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_Disolve_AnimationC final
{
public:
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_685F[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_Disolve_AnimationC) == 0x000008, "Wrong alignment on BP_DeliveryTransport_DropPod_C_Disolve_AnimationC");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_Disolve_AnimationC) == 0x000018, "Wrong size on BP_DeliveryTransport_DropPod_C_Disolve_AnimationC");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Disolve_AnimationC, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_Disolve_AnimationC::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Disolve_AnimationC, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_DeliveryTransport_DropPod_C_Disolve_AnimationC::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Disolve_AnimationC, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'BP_DeliveryTransport_DropPod_C_Disolve_AnimationC::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.Dissolve Container
// 0x0038 (0x0038 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_Dissolve_Container final
{
public:
	TArray<class UMaterialInstanceDynamic*>       Temp_object_Variable;                              // 0x0000(0x0010)(ReferenceParm)
	TArray<class UMaterialInstanceDynamic*>       Temp_object_Variable_1;                            // 0x0010(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_Dissolve_Container) == 0x000008, "Wrong alignment on BP_DeliveryTransport_DropPod_C_Dissolve_Container");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_Dissolve_Container) == 0x000038, "Wrong size on BP_DeliveryTransport_DropPod_C_Dissolve_Container");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_Container, Temp_object_Variable) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_Container::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_Container, Temp_object_Variable_1) == 0x000010, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_Container::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_Container, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_Container::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_Container, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_Container::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.Dissolve ContainerA
// 0x0038 (0x0038 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6860[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6861[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA) == 0x000008, "Wrong alignment on BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA) == 0x000038, "Wrong size on BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA, CallFunc_Array_Add_ReturnValue) == 0x000008, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000010, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA, CallFunc_Array_Add_ReturnValue_1) == 0x000018, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerA::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.Dissolve ContainerB
// 0x0038 (0x0038 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6862[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6863[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB) == 0x000008, "Wrong alignment on BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB) == 0x000038, "Wrong size on BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB, CallFunc_Array_Add_ReturnValue) == 0x000008, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000010, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB, CallFunc_Array_Add_ReturnValue_1) == 0x000018, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerB::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.Dissolve ContainerC
// 0x0038 (0x0038 - 0x0000)
struct BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6864[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6865[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC) == 0x000008, "Wrong alignment on BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC");
static_assert(sizeof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC) == 0x000038, "Wrong size on BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC, CallFunc_Array_Add_ReturnValue) == 0x000008, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000010, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC, CallFunc_Array_Add_ReturnValue_1) == 0x000018, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BP_DeliveryTransport_DropPod_C_Dissolve_ContainerC::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_DeliveryTransport_DropPod.BP_DeliveryTransport_DropPod_C.DropPodLanded
// 0x002C (0x002C - 0x0000)
struct BP_DeliveryTransport_DropPod_C_DropPodLanded final
{
public:
