#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DomeGadget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_DomeGadget.BP_DomeGadget_C.BP_OnDeath
// 0x0020 (0x0020 - 0x0000)
struct BP_DomeGadget_C_BP_OnDeath final
{
public:
	bool                                          HasDeathHitPoint;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DeathHitPoint;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DomeGadget_C_BP_OnDeath) == 0x000008, "Wrong alignment on BP_DomeGadget_C_BP_OnDeath");
static_assert(sizeof(BP_DomeGadget_C_BP_OnDeath) == 0x000020, "Wrong size on BP_DomeGadget_C_BP_OnDeath");
static_assert(offsetof(BP_DomeGadget_C_BP_OnDeath, HasDeathHitPoint) == 0x000000, "Member 'BP_DomeGadget_C_BP_OnDeath::HasDeathHitPoint' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_BP_OnDeath, DeathHitPoint) == 0x000008, "Member 'BP_DomeGadget_C_BP_OnDeath::DeathHitPoint' has a wrong offset!");

// Function BP_DomeGadget.BP_DomeGadget_C.BP_OnHealthChange
// 0x0004 (0x0004 - 0x0000)
struct BP_DomeGadget_C_BP_OnHealthChange final
{
public:
	float                                         Health;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DomeGadget_C_BP_OnHealthChange) == 0x000004, "Wrong alignment on BP_DomeGadget_C_BP_OnHealthChange");
static_assert(sizeof(BP_DomeGadget_C_BP_OnHealthChange) == 0x000004, "Wrong size on BP_DomeGadget_C_BP_OnHealthChange");
static_assert(offsetof(BP_DomeGadget_C_BP_OnHealthChange, Health) == 0x000000, "Member 'BP_DomeGadget_C_BP_OnHealthChange::Health' has a wrong offset!");

// Function BP_DomeGadget.BP_DomeGadget_C.CreateDestroyFX
// 0x0038 (0x0038 - 0x0000)
struct BP_DomeGadget_C_CreateDestroyFX final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661E[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DomeGadget_C_CreateDestroyFX) == 0x000008, "Wrong alignment on BP_DomeGadget_C_CreateDestroyFX");
static_assert(sizeof(BP_DomeGadget_C_CreateDestroyFX) == 0x000038, "Wrong size on BP_DomeGadget_C_CreateDestroyFX");
static_assert(offsetof(BP_DomeGadget_C_CreateDestroyFX, Temp_delegate_Variable) == 0x000000, "Member 'BP_DomeGadget_C_CreateDestroyFX::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_CreateDestroyFX, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_DomeGadget_C_CreateDestroyFX::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_CreateDestroyFX, CallFunc_PostEvent_ReturnValue) == 0x000028, "Member 'BP_DomeGadget_C_CreateDestroyFX::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_CreateDestroyFX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000030, "Member 'BP_DomeGadget_C_CreateDestroyFX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function BP_DomeGadget.BP_DomeGadget_C.CreateDetonationFX
// 0x0038 (0x0038 - 0x0000)
struct BP_DomeGadget_C_CreateDetonationFX final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661F[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DomeGadget_C_CreateDetonationFX) == 0x000008, "Wrong alignment on BP_DomeGadget_C_CreateDetonationFX");
static_assert(sizeof(BP_DomeGadget_C_CreateDetonationFX) == 0x000038, "Wrong size on BP_DomeGadget_C_CreateDetonationFX");
static_assert(offsetof(BP_DomeGadget_C_CreateDetonationFX, Temp_delegate_Variable) == 0x000000, "Member 'BP_DomeGadget_C_CreateDetonationFX::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_CreateDetonationFX, CallFunc_PostEvent_ReturnValue) == 0x000010, "Member 'BP_DomeGadget_C_CreateDetonationFX::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_CreateDetonationFX, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_DomeGadget_C_CreateDetonationFX::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_CreateDetonationFX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000030, "Member 'BP_DomeGadget_C_CreateDetonationFX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function BP_DomeGadget.BP_DomeGadget_C.ExecuteUbergraph_BP_DomeGadget
// 0x0030 (0x0030 - 0x0000)
struct BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Health;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_HasDeathHitPoint;                     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6620[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_DeathHitPoint;                        // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget) == 0x000008, "Wrong alignment on BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget");
static_assert(sizeof(BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget) == 0x000030, "Wrong size on BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget");
static_assert(offsetof(BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget, EntryPoint) == 0x000000, "Member 'BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget, K2Node_Event_Health) == 0x000004, "Member 'BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget::K2Node_Event_Health' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget, K2Node_Event_HasDeathHitPoint) == 0x000009, "Member 'BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget::K2Node_Event_HasDeathHitPoint' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget, K2Node_Event_DeathHitPoint) == 0x000010, "Member 'BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget::K2Node_Event_DeathHitPoint' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'BP_DomeGadget_C_ExecuteUbergraph_BP_DomeGadget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_DomeGadget.BP_DomeGadget_C.Init Gadget Health and Lifespan
// 0x0068 (0x0068 - 0x0000)
struct BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6621[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, float>              K2Node_MakeMap_Map;                                // 0x0008(0x0050)(ConstParm)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue; // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeMap_Value_0_ImplicitCast;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetLifeSpan_InLifespan_ImplicitCast;      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan) == 0x000008, "Wrong alignment on BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan");
static_assert(sizeof(BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan) == 0x000068, "Wrong size on BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan");
static_assert(offsetof(BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan, K2Node_MakeMap_Map) == 0x000008, "Member 'BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan, CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue) == 0x000058, "Member 'BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan::CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan, K2Node_MakeMap_Value_0_ImplicitCast) == 0x000060, "Member 'BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan::K2Node_MakeMap_Value_0_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan, CallFunc_SetLifeSpan_InLifespan_ImplicitCast) == 0x000064, "Member 'BP_DomeGadget_C_Init_Gadget_Health_and_Lifespan::CallFunc_SetLifeSpan_InLifespan_ImplicitCast' has a wrong offset!");

// Function BP_DomeGadget.BP_DomeGadget_C.OnShieldDestroyed
// 0x0008 (0x0008 - 0x0000)
struct BP_DomeGadget_C_OnShieldDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DomeGadget_C_OnShieldDestroyed) == 0x000008, "Wrong alignment on BP_DomeGadget_C_OnShieldDestroyed");
static_assert(sizeof(BP_DomeGadget_C_OnShieldDestroyed) == 0x000008, "Wrong size on BP_DomeGadget_C_OnShieldDestroyed");
static_assert(offsetof(BP_DomeGadget_C_OnShieldDestroyed, DestroyedActor) == 0x000000, "Member 'BP_DomeGadget_C_OnShieldDestroyed::DestroyedActor' has a wrong offset!");

// Function BP_DomeGadget.BP_DomeGadget_C.SetOwningCharacter
// 0x0010 (0x0010 - 0x0000)
struct BP_DomeGadget_C_SetOwningCharacter final
{
public:
	class AGzMultiPartCharacter*                  K2Node_DynamicCast_AsGz_Multi_Part_Character;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DomeGadget_C_SetOwningCharacter) == 0x000008, "Wrong alignment on BP_DomeGadget_C_SetOwningCharacter");
static_assert(sizeof(BP_DomeGadget_C_SetOwningCharacter) == 0x000010, "Wrong size on BP_DomeGadget_C_SetOwningCharacter");
static_assert(offsetof(BP_DomeGadget_C_SetOwningCharacter, K2Node_DynamicCast_AsGz_Multi_Part_Character) == 0x000000, "Member 'BP_DomeGadget_C_SetOwningCharacter::K2Node_DynamicCast_AsGz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_SetOwningCharacter, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'BP_DomeGadget_C_SetOwningCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_DomeGadget.BP_DomeGadget_C.SpawnDomeShield
// 0x0090 (0x0090 - 0x0000)
struct BP_DomeGadget_C_SpawnDomeShield final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6622[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6623[0xC];                                     // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DomeShield_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DomeGadget_C_SpawnDomeShield) == 0x000010, "Wrong alignment on BP_DomeGadget_C_SpawnDomeShield");
static_assert(sizeof(BP_DomeGadget_C_SpawnDomeShield) == 0x000090, "Wrong size on BP_DomeGadget_C_SpawnDomeShield");
static_assert(offsetof(BP_DomeGadget_C_SpawnDomeShield, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_DomeGadget_C_SpawnDomeShield::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_SpawnDomeShield, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_DomeGadget_C_SpawnDomeShield::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_SpawnDomeShield, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BP_DomeGadget_C_SpawnDomeShield::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_SpawnDomeShield, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'BP_DomeGadget_C_SpawnDomeShield::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DomeGadget_C_SpawnDomeShield, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'BP_DomeGadget_C_SpawnDomeShield::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

