#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DroneGoblinSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DroneGoblinSpawner.BP_DroneGoblinSpawner_C
// 0x0020 (0x02D8 - 0x02B8)
class ABP_DroneGoblinSpawner_C final : public AGzDroneGoblinSpawner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMissionResourceComponent*              MissionResource;                                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DroneGoblinSpawner(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DroneGoblinSpawner_C">();
	}
	static class ABP_DroneGoblinSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DroneGoblinSpawner_C>();
	}
};
static_assert(alignof(ABP_DroneGoblinSpawner_C) == 0x000008, "Wrong alignment on ABP_DroneGoblinSpawner_C");
static_assert(sizeof(ABP_DroneGoblinSpawner_C) == 0x0002D8, "Wrong size on ABP_DroneGoblinSpawner_C");
static_assert(offsetof(ABP_DroneGoblinSpawner_C, UberGraphFrame) == 0x0002B8, "Member 'ABP_DroneGoblinSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DroneGoblinSpawner_C, MissionResource) == 0x0002C0, "Member 'ABP_DroneGoblinSpawner_C::MissionResource' has a wrong offset!");
static_assert(offsetof(ABP_DroneGoblinSpawner_C, StaticMesh) == 0x0002C8, "Member 'ABP_DroneGoblinSpawner_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_DroneGoblinSpawner_C, DefaultSceneRoot) == 0x0002D0, "Member 'ABP_DroneGoblinSpawner_C::DefaultSceneRoot' has a wrong offset!");

}

