#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Defiler_VisionArea

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function BP_Defiler_VisionArea.BP_Defiler_VisionArea_C.Add PPFaind Actor
// 0x0110 (0x0110 - 0x0000)
struct BP_Defiler_VisionArea_C_Add_PPFaind_Actor final
{
public:
	class AActor*                                 ParentActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Defiler_PPFaid_C*                   FaidActor;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_ComponentMin_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Defiler_PPFaid_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_VisionArea_C_Add_PPFaind_Actor) == 0x000010, "Wrong alignment on BP_Defiler_VisionArea_C_Add_PPFaind_Actor");
static_assert(sizeof(BP_Defiler_VisionArea_C_Add_PPFaind_Actor) == 0x000110, "Wrong size on BP_Defiler_VisionArea_C_Add_PPFaind_Actor");
static_assert(offsetof(BP_Defiler_VisionArea_C_Add_PPFaind_Actor, ParentActor) == 0x000000, "Member 'BP_Defiler_VisionArea_C_Add_PPFaind_Actor::ParentActor' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_Add_PPFaind_Actor, FaidActor) == 0x000008, "Member 'BP_Defiler_VisionArea_C_Add_PPFaind_Actor::FaidActor' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_Add_PPFaind_Actor, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_Defiler_VisionArea_C_Add_PPFaind_Actor::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_Add_PPFaind_Actor, CallFunc_GetActorBounds_Origin) == 0x000018, "Member 'BP_Defiler_VisionArea_C_Add_PPFaind_Actor::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_Add_PPFaind_Actor, CallFunc_GetActorBounds_BoxExtent) == 0x000030, "Member 'BP_Defiler_VisionArea_C_Add_PPFaind_Actor::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_Add_PPFaind_Actor, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000048, "Member 'BP_Defiler_VisionArea_C_Add_PPFaind_Actor::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_Add_PPFaind_Actor, CallFunc_Divide_VectorVector_ReturnValue) == 0x000060, "Member 'BP_Defiler_VisionArea_C_Add_PPFaind_Actor::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_Add_PPFaind_Actor, CallFunc_Vector_ComponentMin_ReturnValue) == 0x000078, "Member 'BP_Defiler_VisionArea_C_Add_PPFaind_Actor::CallFunc_Vector_ComponentMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_Add_PPFaind_Actor, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'BP_Defiler_VisionArea_C_Add_PPFaind_Actor::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_Add_PPFaind_Actor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F0, "Member 'BP_Defiler_VisionArea_C_Add_PPFaind_Actor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_Add_PPFaind_Actor, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F8, "Member 'BP_Defiler_VisionArea_C_Add_PPFaind_Actor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_Add_PPFaind_Actor, CallFunc_K2_AttachToActor_ReturnValue) == 0x000100, "Member 'BP_Defiler_VisionArea_C_Add_PPFaind_Actor::CallFunc_K2_AttachToActor_ReturnValue' has a wrong offset!");

// Function BP_Defiler_VisionArea.BP_Defiler_VisionArea_C.BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A3[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Defiler_VisionArea.BP_Defiler_VisionArea_C.BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Defiler_VisionArea_C_BndEvt__BP_Defiler_VisionArea_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_Defiler_VisionArea.BP_Defiler_VisionArea_C.CalculateDistanceToScaned
// 0x0098 (0x0098 - 0x0000)
struct BP_Defiler_VisionArea_C_CalculateDistanceToScaned final
{
public:
	const class AActor*                           In_OtherActor;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          OutInRange;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A4[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutDistanceToScaned;                               // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutAlpha;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScanOnCharacterTimeLocal;                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScanTimeLocal;                                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetTimeLocal;                                   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceToScaned;                                  // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A5[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A6[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue;      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A7[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned) == 0x000008, "Wrong alignment on BP_Defiler_VisionArea_C_CalculateDistanceToScaned");
static_assert(sizeof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned) == 0x000098, "Wrong size on BP_Defiler_VisionArea_C_CalculateDistanceToScaned");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, In_OtherActor) == 0x000000, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::In_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, OutInRange) == 0x000008, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::OutInRange' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, OutDistanceToScaned) == 0x00000C, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::OutDistanceToScaned' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, OutAlpha) == 0x000010, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::OutAlpha' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, ScanOnCharacterTimeLocal) == 0x000018, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::ScanOnCharacterTimeLocal' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, ScanTimeLocal) == 0x000020, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::ScanTimeLocal' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, TargetTimeLocal) == 0x000028, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::TargetTimeLocal' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, DistanceToScaned) == 0x000030, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::DistanceToScaned' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000034, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000035, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, CallFunc_SelectFloat_ReturnValue) == 0x000060, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000070, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000078, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000080, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, CallFunc_GetHorizontalDistanceTo_ReturnValue) == 0x000088, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::CallFunc_GetHorizontalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_CalculateDistanceToScaned, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000090, "Member 'BP_Defiler_VisionArea_C_CalculateDistanceToScaned::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_Defiler_VisionArea.BP_Defiler_VisionArea_C.DisableVIsion
// 0x0008 (0x0008 - 0x0000)
struct BP_Defiler_VisionArea_C_DisableVIsion final
{
public:
	class UPrimitiveComponent*                    CallFunc_GetCollisionComponent_Comp;               // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_VisionArea_C_DisableVIsion) == 0x000008, "Wrong alignment on BP_Defiler_VisionArea_C_DisableVIsion");
static_assert(sizeof(BP_Defiler_VisionArea_C_DisableVIsion) == 0x000008, "Wrong size on BP_Defiler_VisionArea_C_DisableVIsion");
static_assert(offsetof(BP_Defiler_VisionArea_C_DisableVIsion, CallFunc_GetCollisionComponent_Comp) == 0x000000, "Member 'BP_Defiler_VisionArea_C_DisableVIsion::CallFunc_GetCollisionComponent_Comp' has a wrong offset!");

// Function BP_Defiler_VisionArea.BP_Defiler_VisionArea_C.EnableVision
// 0x0180 (0x0180 - 0x0000)
struct BP_Defiler_VisionArea_C_EnableVision final
{
public:
	double                                        InVisionTimeStart;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InVisionLocationStart;                             // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InRadius;                                          // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InScanPeriod;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A8[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0040(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A9[0x3];                                     // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x013C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetCollisionComponent_Comp;               // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_VisionArea_C_EnableVision) == 0x000008, "Wrong alignment on BP_Defiler_VisionArea_C_EnableVision");
static_assert(sizeof(BP_Defiler_VisionArea_C_EnableVision) == 0x000180, "Wrong size on BP_Defiler_VisionArea_C_EnableVision");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, InVisionTimeStart) == 0x000000, "Member 'BP_Defiler_VisionArea_C_EnableVision::InVisionTimeStart' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, InVisionLocationStart) == 0x000008, "Member 'BP_Defiler_VisionArea_C_EnableVision::InVisionLocationStart' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, InRadius) == 0x000020, "Member 'BP_Defiler_VisionArea_C_EnableVision::InRadius' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, InScanPeriod) == 0x000028, "Member 'BP_Defiler_VisionArea_C_EnableVision::InScanPeriod' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000030, "Member 'BP_Defiler_VisionArea_C_EnableVision::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_Defiler_VisionArea_C_EnableVision::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000040, "Member 'BP_Defiler_VisionArea_C_EnableVision::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000138, "Member 'BP_Defiler_VisionArea_C_EnableVision::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, Temp_delegate_Variable) == 0x00013C, "Member 'BP_Defiler_VisionArea_C_EnableVision::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, CallFunc_PostEvent_ReturnValue) == 0x00014C, "Member 'BP_Defiler_VisionArea_C_EnableVision::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000150, "Member 'BP_Defiler_VisionArea_C_EnableVision::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000158, "Member 'BP_Defiler_VisionArea_C_EnableVision::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, CallFunc_GetCollisionComponent_Comp) == 0x000168, "Member 'BP_Defiler_VisionArea_C_EnableVision::CallFunc_GetCollisionComponent_Comp' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000170, "Member 'BP_Defiler_VisionArea_C_EnableVision::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_EnableVision, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000178, "Member 'BP_Defiler_VisionArea_C_EnableVision::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

// Function BP_Defiler_VisionArea.BP_Defiler_VisionArea_C.ExecuteUbergraph_BP_Defiler_VisionArea
// 0x01D8 (0x01D8 - 0x0000)
struct BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63AA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63AB[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           Temp_object_Variable;                              // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63AC[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63AD[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63AE[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Defiler_VisionComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63AF[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0078(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63B0[0x2];                                     // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Map_Find_Value;                           // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzDefilerTargetType                          CallFunc_Check_Haked_Actor_Type_DefilerType;       // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Haked_Actor_Type_AnyDistance;       // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63B1[0x3];                                     // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Defiler_PPFaid_C*                   CallFunc_Add_PPFaind_Actor_FaidActor;              // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63B2[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  K2Node_DynamicCast_AsBP_Player_Character;          // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63B3[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Defiler_PPFaid_C*                   CallFunc_Array_Get_Item;                           // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63B4[0x3];                                     // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzDefilerTargetType                          CallFunc_Check_Haked_Actor_Type_DefilerType_1;     // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Haked_Actor_Type_AnyDistance_1;     // 0x01D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea) == 0x000008, "Wrong alignment on BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea");
static_assert(sizeof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea) == 0x0001D8, "Wrong size on BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, EntryPoint) == 0x000000, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, Temp_object_Variable) == 0x000018, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_GetOwner_ReturnValue_1) == 0x000030, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_GetOwner_ReturnValue_2) == 0x000040, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000058, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000060, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000068, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000070, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, K2Node_ComponentBoundEvent_bFromSweep) == 0x000074, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, K2Node_ComponentBoundEvent_SweepResult) == 0x000078, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000170, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, K2Node_ComponentBoundEvent_OtherActor) == 0x000178, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, K2Node_ComponentBoundEvent_OtherComp) == 0x000180, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000188, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00018C, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x00018D, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_Map_Find_Value) == 0x000190, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_Map_Find_ReturnValue) == 0x000198, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_Map_Remove_ReturnValue) == 0x000199, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_IsValid_ReturnValue_2) == 0x00019A, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_Check_Haked_Actor_Type_DefilerType) == 0x00019B, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_Check_Haked_Actor_Type_DefilerType' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_Check_Haked_Actor_Type_AnyDistance) == 0x00019C, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_Check_Haked_Actor_Type_AnyDistance' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_Add_PPFaind_Actor_FaidActor) == 0x0001A0, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_Add_PPFaind_Actor_FaidActor' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A8, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, K2Node_DynamicCast_AsBP_Player_Character) == 0x0001B0, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::K2Node_DynamicCast_AsBP_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_Array_Get_Item) == 0x0001C0, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_IsValid_ReturnValue_3) == 0x0001C8, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_Array_Length_ReturnValue) == 0x0001CC, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_Less_IntInt_ReturnValue) == 0x0001D0, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_IsValid_ReturnValue_4) == 0x0001D1, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_Check_Haked_Actor_Type_DefilerType_1) == 0x0001D2, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_Check_Haked_Actor_Type_DefilerType_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_Check_Haked_Actor_Type_AnyDistance_1) == 0x0001D3, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_Check_Haked_Actor_Type_AnyDistance_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001D4, "Member 'BP_Defiler_VisionArea_C_ExecuteUbergraph_BP_Defiler_VisionArea::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BP_Defiler_VisionArea.BP_Defiler_VisionArea_C.GetCollisionComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_Defiler_VisionArea_C_GetCollisionComponent final
{
public:
	class UPrimitiveComponent*                    Comp;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_VisionArea_C_GetCollisionComponent) == 0x000008, "Wrong alignment on BP_Defiler_VisionArea_C_GetCollisionComponent");
static_assert(sizeof(BP_Defiler_VisionArea_C_GetCollisionComponent) == 0x000008, "Wrong size on BP_Defiler_VisionArea_C_GetCollisionComponent");
static_assert(offsetof(BP_Defiler_VisionArea_C_GetCollisionComponent, Comp) == 0x000000, "Member 'BP_Defiler_VisionArea_C_GetCollisionComponent::Comp' has a wrong offset!");

// Function BP_Defiler_VisionArea.BP_Defiler_VisionArea_C.IsScanActive
// 0x0002 (0x0002 - 0x0000)
struct BP_Defiler_VisionArea_C_IsScanActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorTickEnabled_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_VisionArea_C_IsScanActive) == 0x000001, "Wrong alignment on BP_Defiler_VisionArea_C_IsScanActive");
static_assert(sizeof(BP_Defiler_VisionArea_C_IsScanActive) == 0x000002, "Wrong size on BP_Defiler_VisionArea_C_IsScanActive");
static_assert(offsetof(BP_Defiler_VisionArea_C_IsScanActive, bActive) == 0x000000, "Member 'BP_Defiler_VisionArea_C_IsScanActive::bActive' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_IsScanActive, CallFunc_IsActorTickEnabled_ReturnValue) == 0x000001, "Member 'BP_Defiler_VisionArea_C_IsScanActive::CallFunc_IsActorTickEnabled_ReturnValue' has a wrong offset!");

// Function BP_Defiler_VisionArea.BP_Defiler_VisionArea_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Defiler_VisionArea_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_VisionArea_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Defiler_VisionArea_C_ReceiveTick");
static_assert(sizeof(BP_Defiler_VisionArea_C_ReceiveTick) == 0x000004, "Wrong size on BP_Defiler_VisionArea_C_ReceiveTick");
static_assert(offsetof(BP_Defiler_VisionArea_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Defiler_VisionArea_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Defiler_VisionArea.BP_Defiler_VisionArea_C.SetScanRadius
// 0x0018 (0x0018 - 0x0000)
struct BP_Defiler_VisionArea_C_SetScanRadius final
{
public:
	double                                        InRadius;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63B5[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetCapsuleSize_InRadius_ImplicitCast;     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCapsuleSize_InHalfHeight_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_VisionArea_C_SetScanRadius) == 0x000008, "Wrong alignment on BP_Defiler_VisionArea_C_SetScanRadius");
static_assert(sizeof(BP_Defiler_VisionArea_C_SetScanRadius) == 0x000018, "Wrong size on BP_Defiler_VisionArea_C_SetScanRadius");
static_assert(offsetof(BP_Defiler_VisionArea_C_SetScanRadius, InRadius) == 0x000000, "Member 'BP_Defiler_VisionArea_C_SetScanRadius::InRadius' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_SetScanRadius, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_Defiler_VisionArea_C_SetScanRadius::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_SetScanRadius, CallFunc_SetCapsuleSize_InRadius_ImplicitCast) == 0x00000C, "Member 'BP_Defiler_VisionArea_C_SetScanRadius::CallFunc_SetCapsuleSize_InRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Defiler_VisionArea_C_SetScanRadius, CallFunc_SetCapsuleSize_InHalfHeight_ImplicitCast) == 0x000010, "Member 'BP_Defiler_VisionArea_C_SetScanRadius::CallFunc_SetCapsuleSize_InHalfHeight_ImplicitCast' has a wrong offset!");

// Function BP_Defiler_VisionArea.BP_Defiler_VisionArea_C.Update Scaned Actor
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Defiler_VisionArea_C_Update_Scaned_Actor final
{
public:
	class AActor*                                 ScanedActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InBlendActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Defiler_PPFaid_C*                   NewLocalVar_0;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_Defiler_PPFaid_C*                   BlendActorLocal;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        AlphaLocal;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
