#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Defiler_MarkActor

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BP_Defiler_MarkActor.BP_Defiler_MarkActor_C.AddSource
// 0x0008 (0x0008 - 0x0000)
struct BP_Defiler_MarkActor_C_AddSource final
{
public:
	const class AActor*                           Source;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_MarkActor_C_AddSource) == 0x000008, "Wrong alignment on BP_Defiler_MarkActor_C_AddSource");
static_assert(sizeof(BP_Defiler_MarkActor_C_AddSource) == 0x000008, "Wrong size on BP_Defiler_MarkActor_C_AddSource");
static_assert(offsetof(BP_Defiler_MarkActor_C_AddSource, Source) == 0x000000, "Member 'BP_Defiler_MarkActor_C_AddSource::Source' has a wrong offset!");

// Function BP_Defiler_MarkActor.BP_Defiler_MarkActor_C.DefilerTypeToStencilType
// 0x0003 (0x0003 - 0x0000)
struct BP_Defiler_MarkActor_C_DefilerTypeToStencilType final
{
public:
	EGzDefilerTargetType                          DefilerType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDepthStencilValue                            StencilType;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_MarkActor_C_DefilerTypeToStencilType) == 0x000001, "Wrong alignment on BP_Defiler_MarkActor_C_DefilerTypeToStencilType");
static_assert(sizeof(BP_Defiler_MarkActor_C_DefilerTypeToStencilType) == 0x000003, "Wrong size on BP_Defiler_MarkActor_C_DefilerTypeToStencilType");
static_assert(offsetof(BP_Defiler_MarkActor_C_DefilerTypeToStencilType, DefilerType) == 0x000000, "Member 'BP_Defiler_MarkActor_C_DefilerTypeToStencilType::DefilerType' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_DefilerTypeToStencilType, StencilType) == 0x000001, "Member 'BP_Defiler_MarkActor_C_DefilerTypeToStencilType::StencilType' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_DefilerTypeToStencilType, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'BP_Defiler_MarkActor_C_DefilerTypeToStencilType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_Defiler_MarkActor.BP_Defiler_MarkActor_C.ExecuteUbergraph_BP_Defiler_MarkActor
// 0x0290 (0x0290 - 0x0000)
struct BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B35[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B36[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0028(0x0020)()
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B37[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1; // 0x0050(0x0020)()
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B38[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMultiPartCharacter*                  K2Node_DynamicCast_AsGz_Multi_Part_Character;      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B39[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzInteractableComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B3A[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzInteractableComponent*               CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B3B[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00C0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B3C[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B3D[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetTeamAttitude_ReturnValue;              // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B3E[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B3F[0x6];                                     // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGzDefilerTarget>      K2Node_DynamicCast_AsGz_Defiler_Target;            // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B40[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGzDefilerTarget>      K2Node_DynamicCast_AsGz_Defiler_Target_1;          // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnDefilerEffectRemoved_ReturnValue;       // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnDefilerEffectApplied_ReturnValue;       // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDepthStencilValue                            CallFunc_DefilerTypeToStencilType_StencilType;     // 0x028B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor) == 0x000008, "Wrong alignment on BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor");
static_assert(sizeof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor) == 0x000290, "Wrong size on BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, EntryPoint) == 0x000000, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000028, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x000048, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, K2Node_SwitchEnum_CmpSuccess_1) == 0x000049, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1) == 0x000050, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, K2Node_Event_DeltaSeconds) == 0x000070, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x000074, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, K2Node_DynamicCast_AsGz_Multi_Part_Character) == 0x000078, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::K2Node_DynamicCast_AsGz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_GetComponentByClass_ReturnValue) == 0x000088, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000098, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_IsValid_ReturnValue_2) == 0x0000A1, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0000C0, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0001B8, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_GetOwner_ReturnValue) == 0x0001C0, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001C8, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_IsValid_ReturnValue_3) == 0x0001E0, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0001E8, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000200, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_GetOwner_ReturnValue_1) == 0x000218, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_Normal_ReturnValue) == 0x000220, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_GetTeamAttitude_ReturnValue) == 0x000238, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_GetTeamAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_MakeRotFromXZ_ReturnValue) == 0x000240, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_MakeRotFromXZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000258, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000259, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, K2Node_DynamicCast_AsGz_Defiler_Target) == 0x000260, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::K2Node_DynamicCast_AsGz_Defiler_Target' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, K2Node_DynamicCast_bSuccess_1) == 0x000270, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, K2Node_DynamicCast_AsGz_Defiler_Target_1) == 0x000278, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::K2Node_DynamicCast_AsGz_Defiler_Target_1' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, K2Node_DynamicCast_bSuccess_2) == 0x000288, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_OnDefilerEffectRemoved_ReturnValue) == 0x000289, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_OnDefilerEffectRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_OnDefilerEffectApplied_ReturnValue) == 0x00028A, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_OnDefilerEffectApplied_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor, CallFunc_DefilerTypeToStencilType_StencilType) == 0x00028B, "Member 'BP_Defiler_MarkActor_C_ExecuteUbergraph_BP_Defiler_MarkActor::CallFunc_DefilerTypeToStencilType_StencilType' has a wrong offset!");

// Function BP_Defiler_MarkActor.BP_Defiler_MarkActor_C.GetNumSources
// 0x0008 (0x0008 - 0x0000)
struct BP_Defiler_MarkActor_C_GetNumSources final
{
public:
	int32                                         Param_Sources;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_MarkActor_C_GetNumSources) == 0x000004, "Wrong alignment on BP_Defiler_MarkActor_C_GetNumSources");
static_assert(sizeof(BP_Defiler_MarkActor_C_GetNumSources) == 0x000008, "Wrong size on BP_Defiler_MarkActor_C_GetNumSources");
static_assert(offsetof(BP_Defiler_MarkActor_C_GetNumSources, Param_Sources) == 0x000000, "Member 'BP_Defiler_MarkActor_C_GetNumSources::Param_Sources' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_GetNumSources, CallFunc_Set_Length_ReturnValue) == 0x000004, "Member 'BP_Defiler_MarkActor_C_GetNumSources::CallFunc_Set_Length_ReturnValue' has a wrong offset!");

// Function BP_Defiler_MarkActor.BP_Defiler_MarkActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Defiler_MarkActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_MarkActor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Defiler_MarkActor_C_ReceiveTick");
static_assert(sizeof(BP_Defiler_MarkActor_C_ReceiveTick) == 0x000004, "Wrong size on BP_Defiler_MarkActor_C_ReceiveTick");
static_assert(offsetof(BP_Defiler_MarkActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Defiler_MarkActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Defiler_MarkActor.BP_Defiler_MarkActor_C.RemoveSource
// 0x0010 (0x0010 - 0x0000)
struct BP_Defiler_MarkActor_C_RemoveSource final
{
public:
	const class AActor*                           Source;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Disabled;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_IsEmpty_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_MarkActor_C_RemoveSource) == 0x000008, "Wrong alignment on BP_Defiler_MarkActor_C_RemoveSource");
static_assert(sizeof(BP_Defiler_MarkActor_C_RemoveSource) == 0x000010, "Wrong size on BP_Defiler_MarkActor_C_RemoveSource");
static_assert(offsetof(BP_Defiler_MarkActor_C_RemoveSource, Source) == 0x000000, "Member 'BP_Defiler_MarkActor_C_RemoveSource::Source' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_RemoveSource, Disabled) == 0x000008, "Member 'BP_Defiler_MarkActor_C_RemoveSource::Disabled' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_RemoveSource, CallFunc_Set_Remove_ReturnValue) == 0x000009, "Member 'BP_Defiler_MarkActor_C_RemoveSource::CallFunc_Set_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_RemoveSource, CallFunc_Set_IsEmpty_ReturnValue) == 0x00000A, "Member 'BP_Defiler_MarkActor_C_RemoveSource::CallFunc_Set_IsEmpty_ReturnValue' has a wrong offset!");

// Function BP_Defiler_MarkActor.BP_Defiler_MarkActor_C.SetDefilerStencil
// 0x0040 (0x0040 - 0x0000)
struct BP_Defiler_MarkActor_C_SetDefilerStencil final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDepthStencilValue                            Stencil;                                           // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B41[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B42[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_MarkActor_C_SetDefilerStencil) == 0x000008, "Wrong alignment on BP_Defiler_MarkActor_C_SetDefilerStencil");
static_assert(sizeof(BP_Defiler_MarkActor_C_SetDefilerStencil) == 0x000040, "Wrong size on BP_Defiler_MarkActor_C_SetDefilerStencil");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetDefilerStencil, Actor) == 0x000000, "Member 'BP_Defiler_MarkActor_C_SetDefilerStencil::Actor' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetDefilerStencil, bEnable) == 0x000008, "Member 'BP_Defiler_MarkActor_C_SetDefilerStencil::bEnable' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetDefilerStencil, Stencil) == 0x000009, "Member 'BP_Defiler_MarkActor_C_SetDefilerStencil::Stencil' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetDefilerStencil, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'BP_Defiler_MarkActor_C_SetDefilerStencil::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetDefilerStencil, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'BP_Defiler_MarkActor_C_SetDefilerStencil::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetDefilerStencil, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_Defiler_MarkActor_C_SetDefilerStencil::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetDefilerStencil, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_Defiler_MarkActor_C_SetDefilerStencil::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetDefilerStencil, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Defiler_MarkActor_C_SetDefilerStencil::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetDefilerStencil, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_Defiler_MarkActor_C_SetDefilerStencil::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetDefilerStencil, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_Defiler_MarkActor_C_SetDefilerStencil::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetDefilerStencil, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_Defiler_MarkActor_C_SetDefilerStencil::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Defiler_MarkActor.BP_Defiler_MarkActor_C.SetStencil
// 0x0040 (0x0040 - 0x0000)
struct BP_Defiler_MarkActor_C_SetStencil final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B43[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B44[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_MarkActor_C_SetStencil) == 0x000008, "Wrong alignment on BP_Defiler_MarkActor_C_SetStencil");
static_assert(sizeof(BP_Defiler_MarkActor_C_SetStencil) == 0x000040, "Wrong size on BP_Defiler_MarkActor_C_SetStencil");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetStencil, Actor) == 0x000000, "Member 'BP_Defiler_MarkActor_C_SetStencil::Actor' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetStencil, bEnable) == 0x000008, "Member 'BP_Defiler_MarkActor_C_SetStencil::bEnable' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetStencil, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'BP_Defiler_MarkActor_C_SetStencil::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetStencil, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_Defiler_MarkActor_C_SetStencil::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetStencil, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_Defiler_MarkActor_C_SetStencil::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetStencil, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Defiler_MarkActor_C_SetStencil::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetStencil, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_Defiler_MarkActor_C_SetStencil::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetStencil, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_Defiler_MarkActor_C_SetStencil::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetStencil, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_Defiler_MarkActor_C_SetStencil::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Defiler_MarkActor.BP_Defiler_MarkActor_C.SetStencilEnabledDefault
// 0x0002 (0x0002 - 0x0000)
struct BP_Defiler_MarkActor_C_SetStencilEnabledDefault final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDepthStencilValue                            CallFunc_DefilerTypeToStencilType_StencilType;     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Defiler_MarkActor_C_SetStencilEnabledDefault) == 0x000001, "Wrong alignment on BP_Defiler_MarkActor_C_SetStencilEnabledDefault");
static_assert(sizeof(BP_Defiler_MarkActor_C_SetStencilEnabledDefault) == 0x000002, "Wrong size on BP_Defiler_MarkActor_C_SetStencilEnabledDefault");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetStencilEnabledDefault, bEnable) == 0x000000, "Member 'BP_Defiler_MarkActor_C_SetStencilEnabledDefault::bEnable' has a wrong offset!");
static_assert(offsetof(BP_Defiler_MarkActor_C_SetStencilEnabledDefault, CallFunc_DefilerTypeToStencilType_StencilType) == 0x000001, "Member 'BP_Defiler_MarkActor_C_SetStencilEnabledDefault::CallFunc_DefilerTypeToStencilType_StencilType' has a wrong offset!");

}

