#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EmissiveBounceCard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EmissiveBounceCard.BP_EmissiveBounceCard_C.ExecuteUbergraph_BP_EmissiveBounceCard
// 0x0028 (0x0028 - 0x0000)
struct BP_EmissiveBounceCard_C_ExecuteUbergraph_BP_EmissiveBounceCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A16[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EmissiveBounceCard_C_ExecuteUbergraph_BP_EmissiveBounceCard) == 0x000008, "Wrong alignment on BP_EmissiveBounceCard_C_ExecuteUbergraph_BP_EmissiveBounceCard");
static_assert(sizeof(BP_EmissiveBounceCard_C_ExecuteUbergraph_BP_EmissiveBounceCard) == 0x000028, "Wrong size on BP_EmissiveBounceCard_C_ExecuteUbergraph_BP_EmissiveBounceCard");
static_assert(offsetof(BP_EmissiveBounceCard_C_ExecuteUbergraph_BP_EmissiveBounceCard, EntryPoint) == 0x000000, "Member 'BP_EmissiveBounceCard_C_ExecuteUbergraph_BP_EmissiveBounceCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EmissiveBounceCard_C_ExecuteUbergraph_BP_EmissiveBounceCard, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000008, "Member 'BP_EmissiveBounceCard_C_ExecuteUbergraph_BP_EmissiveBounceCard::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EmissiveBounceCard_C_ExecuteUbergraph_BP_EmissiveBounceCard, CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast) == 0x000020, "Member 'BP_EmissiveBounceCard_C_ExecuteUbergraph_BP_EmissiveBounceCard::CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast' has a wrong offset!");

// Function BP_EmissiveBounceCard.BP_EmissiveBounceCard_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct BP_EmissiveBounceCard_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A17[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_LinearColor_SetTemperature_InTemperature_ImplicitCast; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDefaultCustomPrimitiveDataFloat_Value_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EmissiveBounceCard_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_EmissiveBounceCard_C_UserConstructionScript");
static_assert(sizeof(BP_EmissiveBounceCard_C_UserConstructionScript) == 0x000028, "Wrong size on BP_EmissiveBounceCard_C_UserConstructionScript");
static_assert(offsetof(BP_EmissiveBounceCard_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000000, "Member 'BP_EmissiveBounceCard_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EmissiveBounceCard_C_UserConstructionScript, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_EmissiveBounceCard_C_UserConstructionScript::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EmissiveBounceCard_C_UserConstructionScript, CallFunc_LinearColor_SetTemperature_InTemperature_ImplicitCast) == 0x00001C, "Member 'BP_EmissiveBounceCard_C_UserConstructionScript::CallFunc_LinearColor_SetTemperature_InTemperature_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EmissiveBounceCard_C_UserConstructionScript, CallFunc_SetDefaultCustomPrimitiveDataFloat_Value_ImplicitCast) == 0x000020, "Member 'BP_EmissiveBounceCard_C_UserConstructionScript::CallFunc_SetDefaultCustomPrimitiveDataFloat_Value_ImplicitCast' has a wrong offset!");

}

