#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnclaveKillZoneExplosionVFX

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EnclaveKillZoneExplosionVFX.BP_EnclaveKillZoneExplosionVFX_C.ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX
// 0x0040 (0x0040 - 0x0000)
struct BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_615D[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX) == 0x000008, "Wrong alignment on BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX");
static_assert(sizeof(BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX) == 0x000040, "Wrong size on BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX");
static_assert(offsetof(BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX, EntryPoint) == 0x000000, "Member 'BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX, Temp_delegate_Variable) == 0x000020, "Member 'BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000030, "Member 'BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX, CallFunc_PostEvent_ReturnValue) == 0x000038, "Member 'BP_EnclaveKillZoneExplosionVFX_C_ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

}

