#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Enclave_WarningTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Enclave_WarningTrigger.BP_Enclave_WarningTrigger_C.RemoveEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_Enclave_WarningTrigger_C_RemoveEffect final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Enclave_WarningTrigger_C_RemoveEffect) == 0x000008, "Wrong alignment on BP_Enclave_WarningTrigger_C_RemoveEffect");
static_assert(sizeof(BP_Enclave_WarningTrigger_C_RemoveEffect) == 0x000008, "Wrong size on BP_Enclave_WarningTrigger_C_RemoveEffect");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_RemoveEffect, Actor) == 0x000000, "Member 'BP_Enclave_WarningTrigger_C_RemoveEffect::Actor' has a wrong offset!");

// Function BP_Enclave_WarningTrigger.BP_Enclave_WarningTrigger_C.ExecuteUbergraph_BP_Enclave_WarningTrigger
// 0x0150 (0x0150 - 0x0000)
struct BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2340[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor_1;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2341[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2342[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0058(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger) == 0x000008, "Wrong alignment on BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger");
static_assert(sizeof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger) == 0x000150, "Wrong size on BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger, EntryPoint) == 0x000000, "Member 'BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger, K2Node_CustomEvent_Actor_1) == 0x000008, "Member 'BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger::K2Node_CustomEvent_Actor_1' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger, K2Node_CustomEvent_Actor) == 0x000010, "Member 'BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000018, "Member 'BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger, K2Node_ComponentBoundEvent_OtherActor) == 0x000020, "Member 'BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger, K2Node_ComponentBoundEvent_OtherComp) == 0x000028, "Member 'BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000030, "Member 'BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000038, "Member 'BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000040, "Member 'BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000048, "Member 'BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000050, "Member 'BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger, K2Node_ComponentBoundEvent_bFromSweep) == 0x000054, "Member 'BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger, K2Node_ComponentBoundEvent_SweepResult) == 0x000058, "Member 'BP_Enclave_WarningTrigger_C_ExecuteUbergraph_BP_Enclave_WarningTrigger::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");

// Function BP_Enclave_WarningTrigger.BP_Enclave_WarningTrigger_C.BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_Enclave_WarningTrigger.BP_Enclave_WarningTrigger_C.BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2343[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Enclave_WarningTrigger_C_BndEvt__BP_Enclave_WarningTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Enclave_WarningTrigger.BP_Enclave_WarningTrigger_C.ApplyEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_Enclave_WarningTrigger_C_ApplyEffect final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Enclave_WarningTrigger_C_ApplyEffect) == 0x000008, "Wrong alignment on BP_Enclave_WarningTrigger_C_ApplyEffect");
static_assert(sizeof(BP_Enclave_WarningTrigger_C_ApplyEffect) == 0x000008, "Wrong size on BP_Enclave_WarningTrigger_C_ApplyEffect");
static_assert(offsetof(BP_Enclave_WarningTrigger_C_ApplyEffect, Actor) == 0x000000, "Member 'BP_Enclave_WarningTrigger_C_ApplyEffect::Actor' has a wrong offset!");

}

