#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnclaveWarningRadio

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_EnclaveWarningRadio.BP_EnclaveWarningRadio_C.PlaySound
// 0x0028 (0x0028 - 0x0000)
struct BP_EnclaveWarningRadio_C_PlaySound final
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnclaveWarningRadio_C_PlaySound) == 0x000008, "Wrong alignment on BP_EnclaveWarningRadio_C_PlaySound");
static_assert(sizeof(BP_EnclaveWarningRadio_C_PlaySound) == 0x000028, "Wrong size on BP_EnclaveWarningRadio_C_PlaySound");
static_assert(offsetof(BP_EnclaveWarningRadio_C_PlaySound, AkEvent) == 0x000000, "Member 'BP_EnclaveWarningRadio_C_PlaySound::AkEvent' has a wrong offset!");
static_assert(offsetof(BP_EnclaveWarningRadio_C_PlaySound, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_EnclaveWarningRadio_C_PlaySound::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnclaveWarningRadio_C_PlaySound, CallFunc_PostEventAtLocation_ReturnValue) == 0x000020, "Member 'BP_EnclaveWarningRadio_C_PlaySound::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

// Function BP_EnclaveWarningRadio.BP_EnclaveWarningRadio_C.OnRep_IsPlaying
// 0x0028 (0x0028 - 0x0000)
struct BP_EnclaveWarningRadio_C_OnRep_IsPlaying final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnclaveWarningRadio_C_OnRep_IsPlaying) == 0x000004, "Wrong alignment on BP_EnclaveWarningRadio_C_OnRep_IsPlaying");
static_assert(sizeof(BP_EnclaveWarningRadio_C_OnRep_IsPlaying) == 0x000028, "Wrong size on BP_EnclaveWarningRadio_C_OnRep_IsPlaying");
static_assert(offsetof(BP_EnclaveWarningRadio_C_OnRep_IsPlaying, Temp_delegate_Variable) == 0x000000, "Member 'BP_EnclaveWarningRadio_C_OnRep_IsPlaying::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnclaveWarningRadio_C_OnRep_IsPlaying, Temp_delegate_Variable_1) == 0x000010, "Member 'BP_EnclaveWarningRadio_C_OnRep_IsPlaying::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EnclaveWarningRadio_C_OnRep_IsPlaying, CallFunc_PostEvent_ReturnValue) == 0x000020, "Member 'BP_EnclaveWarningRadio_C_OnRep_IsPlaying::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnclaveWarningRadio_C_OnRep_IsPlaying, CallFunc_PostEvent_ReturnValue_1) == 0x000024, "Member 'BP_EnclaveWarningRadio_C_OnRep_IsPlaying::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");

// Function BP_EnclaveWarningRadio.BP_EnclaveWarningRadio_C.ExecuteUbergraph_BP_EnclaveWarningRadio
// 0x0008 (0x0008 - 0x0000)
struct BP_EnclaveWarningRadio_C_ExecuteUbergraph_BP_EnclaveWarningRadio final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnclaveWarningRadio_C_ExecuteUbergraph_BP_EnclaveWarningRadio) == 0x000004, "Wrong alignment on BP_EnclaveWarningRadio_C_ExecuteUbergraph_BP_EnclaveWarningRadio");
static_assert(sizeof(BP_EnclaveWarningRadio_C_ExecuteUbergraph_BP_EnclaveWarningRadio) == 0x000008, "Wrong size on BP_EnclaveWarningRadio_C_ExecuteUbergraph_BP_EnclaveWarningRadio");
static_assert(offsetof(BP_EnclaveWarningRadio_C_ExecuteUbergraph_BP_EnclaveWarningRadio, EntryPoint) == 0x000000, "Member 'BP_EnclaveWarningRadio_C_ExecuteUbergraph_BP_EnclaveWarningRadio::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EnclaveWarningRadio_C_ExecuteUbergraph_BP_EnclaveWarningRadio, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'BP_EnclaveWarningRadio_C_ExecuteUbergraph_BP_EnclaveWarningRadio::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

