#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExtractionRoyaleHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ExtractionRoyaleHUD.BP_ExtractionRoyaleHUD_C
// 0x0110 (0x05C0 - 0x04B0)
class ABP_ExtractionRoyaleHUD_C final : public AGzHUDBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWBP_LoadoutSelectionScreen_PreMatch_C* Loadout_Selection_Widget;                          // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          BlockCreatepreMatch;                               // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67FB[0x7];                                     // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerController*                    Player_Controller;                                 // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGzNavigationWidget*                    PostMatchWidget;                                   // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_RespawnTimer_Screen_C*             RespawnTimerWidget;                                // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ActiveStageTags;                                   // 0x04E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bEndMatchBannerEnded;                              // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67FC[0x7];                                     // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             MatchResultBannerEndDelegat;                       // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FGzMatchResult                         NewVar;                                            // 0x0520(0x0090)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bResultBannerShown;                                // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67FD[0x7];                                     // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MatchResultBannerContainer_C*      Banner_Container;                                  // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ExtractionRoyaleHUD(int32 EntryPoint);
	void MatchResultBannerEndDelegat__DelegateSignature();
	void OnMatchResultBannerEnd();
	void OnMatchResultSet(const class AGzPlayerController* PlayerController);
	void OnMatchStageChanged();
	void OnPlayerControllerInitialized_BP(class AGzPlayerController* PlayerController, class AGzPlayerState* PlayerState);
	void OnSpectatingKiller(bool bSpectatingKiller);
	void ReceiveBeginPlay();
	void ReceiveOnPawnChanged(class APawn* Pawn);
	void TryCreateLoadoutSelectionMenu();
	void TryCreateMatchResultWidget(const class AGzPlayerController* PlayerController);
	void UpdateCountdownWidgets(const struct FGameplayTagContainer& Param_ActiveStageTags);
	void UpdatePostMatch(const struct FGameplayTagContainer& Param_ActiveStageTags);
	void UpdatePreMatchWidgets(const struct FGameplayTagContainer& Param_ActiveStageTags);
	void UpdateRespawnTimer(double RespawnTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ExtractionRoyaleHUD_C">();
	}
	static class ABP_ExtractionRoyaleHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ExtractionRoyaleHUD_C>();
	}
};
static_assert(alignof(ABP_ExtractionRoyaleHUD_C) == 0x000008, "Wrong alignment on ABP_ExtractionRoyaleHUD_C");
static_assert(sizeof(ABP_ExtractionRoyaleHUD_C) == 0x0005C0, "Wrong size on ABP_ExtractionRoyaleHUD_C");
static_assert(offsetof(ABP_ExtractionRoyaleHUD_C, UberGraphFrame) == 0x0004B0, "Member 'ABP_ExtractionRoyaleHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionRoyaleHUD_C, DefaultSceneRoot) == 0x0004B8, "Member 'ABP_ExtractionRoyaleHUD_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionRoyaleHUD_C, Loadout_Selection_Widget) == 0x0004C0, "Member 'ABP_ExtractionRoyaleHUD_C::Loadout_Selection_Widget' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionRoyaleHUD_C, BlockCreatepreMatch) == 0x0004C8, "Member 'ABP_ExtractionRoyaleHUD_C::BlockCreatepreMatch' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionRoyaleHUD_C, Player_Controller) == 0x0004D0, "Member 'ABP_ExtractionRoyaleHUD_C::Player_Controller' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionRoyaleHUD_C, PostMatchWidget) == 0x0004D8, "Member 'ABP_ExtractionRoyaleHUD_C::PostMatchWidget' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionRoyaleHUD_C, RespawnTimerWidget) == 0x0004E0, "Member 'ABP_ExtractionRoyaleHUD_C::RespawnTimerWidget' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionRoyaleHUD_C, ActiveStageTags) == 0x0004E8, "Member 'ABP_ExtractionRoyaleHUD_C::ActiveStageTags' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionRoyaleHUD_C, bEndMatchBannerEnded) == 0x000508, "Member 'ABP_ExtractionRoyaleHUD_C::bEndMatchBannerEnded' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionRoyaleHUD_C, MatchResultBannerEndDelegat) == 0x000510, "Member 'ABP_ExtractionRoyaleHUD_C::MatchResultBannerEndDelegat' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionRoyaleHUD_C, NewVar) == 0x000520, "Member 'ABP_ExtractionRoyaleHUD_C::NewVar' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionRoyaleHUD_C, bResultBannerShown) == 0x0005B0, "Member 'ABP_ExtractionRoyaleHUD_C::bResultBannerShown' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionRoyaleHUD_C, Banner_Container) == 0x0005B8, "Member 'ABP_ExtractionRoyaleHUD_C::Banner_Container' has a wrong offset!");

}

