#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExtractionRoyaleHUD

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_ExtractionRoyaleHUD.BP_ExtractionRoyaleHUD_C.ExecuteUbergraph_BP_ExtractionRoyaleHUD
// 0x00D8 (0x00D8 - 0x0000)
struct BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67FE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerController*                    K2Node_DynamicCast_AsGz_Player_Controller;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67FF[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Pawn;                                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6800[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzMultiStageGameState*                 K2Node_DynamicCast_AsGz_Multi_Stage_Game_State;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6801[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerController*                    K2Node_Event_PlayerController;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         K2Node_Event_PlayerState;                          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetActiveStageTags_ReturnValue;           // 0x0058(0x0020)(ConstParm)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzMultiStageGameState*                 K2Node_DynamicCast_AsGz_Multi_Stage_Game_State_1;  // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6802[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGzPlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate;              // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6803[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetActiveStageTags_ReturnValue_1;         // 0x00A0(0x0020)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6804[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSpectatingKiller)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD) == 0x000008, "Wrong alignment on BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD");
static_assert(sizeof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD) == 0x0000D8, "Wrong size on BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, EntryPoint) == 0x000000, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000008, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, K2Node_DynamicCast_AsGz_Player_Controller) == 0x000010, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::K2Node_DynamicCast_AsGz_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, K2Node_Event_Pawn) == 0x000020, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::K2Node_Event_Pawn' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, CallFunc_GetGameState_ReturnValue) == 0x000030, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, K2Node_DynamicCast_AsGz_Multi_Stage_Game_State) == 0x000038, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::K2Node_DynamicCast_AsGz_Multi_Stage_Game_State' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, K2Node_Event_PlayerController) == 0x000048, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::K2Node_Event_PlayerController' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, K2Node_Event_PlayerState) == 0x000050, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::K2Node_Event_PlayerState' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, CallFunc_GetActiveStageTags_ReturnValue) == 0x000058, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::CallFunc_GetActiveStageTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, CallFunc_GetGameState_ReturnValue_1) == 0x000078, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, K2Node_DynamicCast_AsGz_Multi_Stage_Game_State_1) == 0x000080, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::K2Node_DynamicCast_AsGz_Multi_Stage_Game_State_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, CallFunc_GetActiveStageTags_ReturnValue_1) == 0x0000A0, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::CallFunc_GetActiveStageTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, CallFunc_HasTag_ReturnValue) == 0x0000C0, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C4, "Member 'BP_ExtractionRoyaleHUD_C_ExecuteUbergraph_BP_ExtractionRoyaleHUD::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BP_ExtractionRoyaleHUD.BP_ExtractionRoyaleHUD_C.OnMatchResultBannerEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_ExtractionRoyaleHUD_C_OnMatchResultBannerEnd final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerController*                    K2Node_DynamicCast_AsGz_Player_Controller;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatchResultSet_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionRoyaleHUD_C_OnMatchResultBannerEnd) == 0x000008, "Wrong alignment on BP_ExtractionRoyaleHUD_C_OnMatchResultBannerEnd");
static_assert(sizeof(BP_ExtractionRoyaleHUD_C_OnMatchResultBannerEnd) == 0x000018, "Wrong size on BP_ExtractionRoyaleHUD_C_OnMatchResultBannerEnd");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnMatchResultBannerEnd, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000000, "Member 'BP_ExtractionRoyaleHUD_C_OnMatchResultBannerEnd::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnMatchResultBannerEnd, K2Node_DynamicCast_AsGz_Player_Controller) == 0x000008, "Member 'BP_ExtractionRoyaleHUD_C_OnMatchResultBannerEnd::K2Node_DynamicCast_AsGz_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnMatchResultBannerEnd, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_ExtractionRoyaleHUD_C_OnMatchResultBannerEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnMatchResultBannerEnd, CallFunc_IsMatchResultSet_ReturnValue) == 0x000011, "Member 'BP_ExtractionRoyaleHUD_C_OnMatchResultBannerEnd::CallFunc_IsMatchResultSet_ReturnValue' has a wrong offset!");

// Function BP_ExtractionRoyaleHUD.BP_ExtractionRoyaleHUD_C.OnMatchResultSet
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ExtractionRoyaleHUD_C_OnMatchResultSet final
{
public:
	const class AGzPlayerController*              PlayerController;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldWaitKillerSpectateEnd_ReturnValue;  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6805[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzMatchResult                         CallFunc_GetMatchResult_ReturnValue;               // 0x0010(0x0090)(ConstParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionRoyaleHUD_C_OnMatchResultSet) == 0x000008, "Wrong alignment on BP_ExtractionRoyaleHUD_C_OnMatchResultSet");
static_assert(sizeof(BP_ExtractionRoyaleHUD_C_OnMatchResultSet) == 0x0000A8, "Wrong size on BP_ExtractionRoyaleHUD_C_OnMatchResultSet");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnMatchResultSet, PlayerController) == 0x000000, "Member 'BP_ExtractionRoyaleHUD_C_OnMatchResultSet::PlayerController' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnMatchResultSet, CallFunc_ShouldWaitKillerSpectateEnd_ReturnValue) == 0x000008, "Member 'BP_ExtractionRoyaleHUD_C_OnMatchResultSet::CallFunc_ShouldWaitKillerSpectateEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnMatchResultSet, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'BP_ExtractionRoyaleHUD_C_OnMatchResultSet::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnMatchResultSet, CallFunc_GetMatchResult_ReturnValue) == 0x000010, "Member 'BP_ExtractionRoyaleHUD_C_OnMatchResultSet::CallFunc_GetMatchResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnMatchResultSet, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_ExtractionRoyaleHUD_C_OnMatchResultSet::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnMatchResultSet, CallFunc_BooleanOR_ReturnValue) == 0x0000A1, "Member 'BP_ExtractionRoyaleHUD_C_OnMatchResultSet::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_ExtractionRoyaleHUD.BP_ExtractionRoyaleHUD_C.OnPlayerControllerInitialized_BP
// 0x0010 (0x0010 - 0x0000)
struct BP_ExtractionRoyaleHUD_C_OnPlayerControllerInitialized_BP final
{
public:
	class AGzPlayerController*                    PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         PlayerState;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionRoyaleHUD_C_OnPlayerControllerInitialized_BP) == 0x000008, "Wrong alignment on BP_ExtractionRoyaleHUD_C_OnPlayerControllerInitialized_BP");
static_assert(sizeof(BP_ExtractionRoyaleHUD_C_OnPlayerControllerInitialized_BP) == 0x000010, "Wrong size on BP_ExtractionRoyaleHUD_C_OnPlayerControllerInitialized_BP");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnPlayerControllerInitialized_BP, PlayerController) == 0x000000, "Member 'BP_ExtractionRoyaleHUD_C_OnPlayerControllerInitialized_BP::PlayerController' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnPlayerControllerInitialized_BP, PlayerState) == 0x000008, "Member 'BP_ExtractionRoyaleHUD_C_OnPlayerControllerInitialized_BP::PlayerState' has a wrong offset!");

// Function BP_ExtractionRoyaleHUD.BP_ExtractionRoyaleHUD_C.OnSpectatingKiller
// 0x0020 (0x0020 - 0x0000)
struct BP_ExtractionRoyaleHUD_C_OnSpectatingKiller final
{
public:
	bool                                          bSpectatingKiller;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6806[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerController*                    K2Node_DynamicCast_AsGz_Player_Controller;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatchResultSet_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionRoyaleHUD_C_OnSpectatingKiller) == 0x000008, "Wrong alignment on BP_ExtractionRoyaleHUD_C_OnSpectatingKiller");
static_assert(sizeof(BP_ExtractionRoyaleHUD_C_OnSpectatingKiller) == 0x000020, "Wrong size on BP_ExtractionRoyaleHUD_C_OnSpectatingKiller");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnSpectatingKiller, bSpectatingKiller) == 0x000000, "Member 'BP_ExtractionRoyaleHUD_C_OnSpectatingKiller::bSpectatingKiller' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnSpectatingKiller, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000008, "Member 'BP_ExtractionRoyaleHUD_C_OnSpectatingKiller::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnSpectatingKiller, K2Node_DynamicCast_AsGz_Player_Controller) == 0x000010, "Member 'BP_ExtractionRoyaleHUD_C_OnSpectatingKiller::K2Node_DynamicCast_AsGz_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnSpectatingKiller, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ExtractionRoyaleHUD_C_OnSpectatingKiller::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_OnSpectatingKiller, CallFunc_IsMatchResultSet_ReturnValue) == 0x000019, "Member 'BP_ExtractionRoyaleHUD_C_OnSpectatingKiller::CallFunc_IsMatchResultSet_ReturnValue' has a wrong offset!");

// Function BP_ExtractionRoyaleHUD.BP_ExtractionRoyaleHUD_C.ReceiveOnPawnChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_ExtractionRoyaleHUD_C_ReceiveOnPawnChanged final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionRoyaleHUD_C_ReceiveOnPawnChanged) == 0x000008, "Wrong alignment on BP_ExtractionRoyaleHUD_C_ReceiveOnPawnChanged");
static_assert(sizeof(BP_ExtractionRoyaleHUD_C_ReceiveOnPawnChanged) == 0x000008, "Wrong size on BP_ExtractionRoyaleHUD_C_ReceiveOnPawnChanged");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_ReceiveOnPawnChanged, Pawn) == 0x000000, "Member 'BP_ExtractionRoyaleHUD_C_ReceiveOnPawnChanged::Pawn' has a wrong offset!");

// Function BP_ExtractionRoyaleHUD.BP_ExtractionRoyaleHUD_C.TryCreateLoadoutSelectionMenu
// 0x0038 (0x0038 - 0x0000)
struct BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu final
{
public:
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0000(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameRuleEnabled_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6807[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzNavigationWidget*                    CallFunc_AddWidgetCached_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_LoadoutSelectionScreen_PreMatch_C* K2Node_DynamicCast_AsWBP_Loadout_Selection_Screen_Pre_Match; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu) == 0x000008, "Wrong alignment on BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu");
static_assert(sizeof(BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu) == 0x000038, "Wrong size on BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu, Temp_struct_Variable) == 0x000000, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000008, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu, CallFunc_IsGameRuleEnabled_ReturnValue) == 0x000011, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu::CallFunc_IsGameRuleEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu, CallFunc_GetNavigationRoot_ReturnValue) == 0x000018, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu::CallFunc_GetNavigationRoot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu, CallFunc_AddWidgetCached_ReturnValue) == 0x000020, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu::CallFunc_AddWidgetCached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu, K2Node_DynamicCast_AsWBP_Loadout_Selection_Screen_Pre_Match) == 0x000028, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu::K2Node_DynamicCast_AsWBP_Loadout_Selection_Screen_Pre_Match' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateLoadoutSelectionMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ExtractionRoyaleHUD.BP_ExtractionRoyaleHUD_C.TryCreateMatchResultWidget
// 0x00D8 (0x00D8 - 0x0000)
struct BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget final
{
public:
	const class AGzPlayerController*              PlayerController;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_MatchResultBannerContainer_C*      CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6808[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MatchResultBanner_C*               CallFunc_GetMatchResultBanner_MatchResultBanner;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGzMatchResult                         CallFunc_GetMatchResult_ReturnValue;               // 0x0020(0x0090)(ConstParm)
	bool                                          CallFunc_IsMatchResultSet_ReturnValue;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6809[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_680A[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue;            // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget) == 0x000008, "Wrong alignment on BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget");
static_assert(sizeof(BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget) == 0x0000D8, "Wrong size on BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget, PlayerController) == 0x000000, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget::PlayerController' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget, CallFunc_GetMatchResultBanner_MatchResultBanner) == 0x000018, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget::CallFunc_GetMatchResultBanner_MatchResultBanner' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget, CallFunc_GetMatchResult_ReturnValue) == 0x000020, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget::CallFunc_GetMatchResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget, CallFunc_IsMatchResultSet_ReturnValue) == 0x0000B0, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget::CallFunc_IsMatchResultSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget, K2Node_CreateDelegate_OutputDelegate) == 0x0000B4, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget, CallFunc_GetNavigationRoot_ReturnValue) == 0x0000C8, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget::CallFunc_GetNavigationRoot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'BP_ExtractionRoyaleHUD_C_TryCreateMatchResultWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_ExtractionRoyaleHUD.BP_ExtractionRoyaleHUD_C.UpdateCountdownWidgets
// 0x0028 (0x0028 - 0x0000)
struct BP_ExtractionRoyaleHUD_C_UpdateCountdownWidgets final
{
public:
	struct FGameplayTagContainer                  Param_ActiveStageTags;                             // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionRoyaleHUD_C_UpdateCountdownWidgets) == 0x000008, "Wrong alignment on BP_ExtractionRoyaleHUD_C_UpdateCountdownWidgets");
static_assert(sizeof(BP_ExtractionRoyaleHUD_C_UpdateCountdownWidgets) == 0x000028, "Wrong size on BP_ExtractionRoyaleHUD_C_UpdateCountdownWidgets");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdateCountdownWidgets, Param_ActiveStageTags) == 0x000000, "Member 'BP_ExtractionRoyaleHUD_C_UpdateCountdownWidgets::Param_ActiveStageTags' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdateCountdownWidgets, CallFunc_HasTag_ReturnValue) == 0x000020, "Member 'BP_ExtractionRoyaleHUD_C_UpdateCountdownWidgets::CallFunc_HasTag_ReturnValue' has a wrong offset!");

// Function BP_ExtractionRoyaleHUD.BP_ExtractionRoyaleHUD_C.UpdatePostMatch
// 0x0060 (0x0060 - 0x0000)
struct BP_ExtractionRoyaleHUD_C_UpdatePostMatch final
{
public:
	struct FGameplayTagContainer                  Param_ActiveStageTags;                             // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue;        // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_680B[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTopWidget_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_680C[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerController*                    K2Node_DynamicCast_AsGz_Player_Controller;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_680D[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue_1;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzNavigationWidget*                    CallFunc_AddWidgetCached_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch) == 0x000008, "Wrong alignment on BP_ExtractionRoyaleHUD_C_UpdatePostMatch");
static_assert(sizeof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch) == 0x000060, "Wrong size on BP_ExtractionRoyaleHUD_C_UpdatePostMatch");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch, Param_ActiveStageTags) == 0x000000, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePostMatch::Param_ActiveStageTags' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch, CallFunc_HasTag_ReturnValue) == 0x000020, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePostMatch::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePostMatch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch, CallFunc_IsValid_ReturnValue_1) == 0x000022, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePostMatch::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch, CallFunc_IsAnyAnimationPlaying_ReturnValue) == 0x000023, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePostMatch::CallFunc_IsAnyAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch, CallFunc_GetNavigationRoot_ReturnValue) == 0x000028, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePostMatch::CallFunc_GetNavigationRoot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000030, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePostMatch::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch, CallFunc_IsTopWidget_ReturnValue) == 0x000038, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePostMatch::CallFunc_IsTopWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch, CallFunc_IsValid_ReturnValue_2) == 0x000039, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePostMatch::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch, CallFunc_BooleanAND_ReturnValue) == 0x00003A, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePostMatch::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch, K2Node_DynamicCast_AsGz_Player_Controller) == 0x000040, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePostMatch::K2Node_DynamicCast_AsGz_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePostMatch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch, CallFunc_GetNavigationRoot_ReturnValue_1) == 0x000050, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePostMatch::CallFunc_GetNavigationRoot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePostMatch, CallFunc_AddWidgetCached_ReturnValue) == 0x000058, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePostMatch::CallFunc_AddWidgetCached_ReturnValue' has a wrong offset!");

// Function BP_ExtractionRoyaleHUD.BP_ExtractionRoyaleHUD_C.UpdatePreMatchWidgets
// 0x0028 (0x0028 - 0x0000)
struct BP_ExtractionRoyaleHUD_C_UpdatePreMatchWidgets final
{
public:
	struct FGameplayTagContainer                  Param_ActiveStageTags;                             // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionRoyaleHUD_C_UpdatePreMatchWidgets) == 0x000008, "Wrong alignment on BP_ExtractionRoyaleHUD_C_UpdatePreMatchWidgets");
static_assert(sizeof(BP_ExtractionRoyaleHUD_C_UpdatePreMatchWidgets) == 0x000028, "Wrong size on BP_ExtractionRoyaleHUD_C_UpdatePreMatchWidgets");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePreMatchWidgets, Param_ActiveStageTags) == 0x000000, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePreMatchWidgets::Param_ActiveStageTags' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePreMatchWidgets, CallFunc_HasTag_ReturnValue) == 0x000020, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePreMatchWidgets::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdatePreMatchWidgets, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_ExtractionRoyaleHUD_C_UpdatePreMatchWidgets::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ExtractionRoyaleHUD.BP_ExtractionRoyaleHUD_C.UpdateRespawnTimer
// 0x0038 (0x0038 - 0x0000)
struct BP_ExtractionRoyaleHUD_C_UpdateRespawnTimer final
{
public:
	double                                        RespawnTime;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_680E[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_680F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_RespawnTimer_Screen_C*             CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionRoyaleHUD_C_UpdateRespawnTimer) == 0x000008, "Wrong alignment on BP_ExtractionRoyaleHUD_C_UpdateRespawnTimer");
static_assert(sizeof(BP_ExtractionRoyaleHUD_C_UpdateRespawnTimer) == 0x000038, "Wrong size on BP_ExtractionRoyaleHUD_C_UpdateRespawnTimer");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdateRespawnTimer, RespawnTime) == 0x000000, "Member 'BP_ExtractionRoyaleHUD_C_UpdateRespawnTimer::RespawnTime' has a wrong offset!");
static_assert(offsetof(BP_ExtractionRoyaleHUD_C_UpdateRespawnTimer, CallFunc_GetNavigationRoot_ReturnValue) == 0x000008, "Member 'BP_ExtractionRoyaleHUD_C_UpdateRespawnTimer::CallFunc_GetNavigationRoot_ReturnValue' has a wrong offset!");
