#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnclaveKillZoneExplosionVFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EnclaveKillZoneExplosionVFX.BP_EnclaveKillZoneExplosionVFX_C
// 0x0018 (0x02B8 - 0x02A0)
class ABP_EnclaveKillZoneExplosionVFX_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_Component_Triggerable_C*            BP_Component_Triggerable;                          // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EnclaveKillZoneExplosionVFX(int32 EntryPoint);
	void BndEvt__BP_EnclaveKillZoneExplosionVFX_BP_Component_Triggerable_K2Node_ComponentBoundEvent_0_Triggered__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EnclaveKillZoneExplosionVFX_C">();
	}
	static class ABP_EnclaveKillZoneExplosionVFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EnclaveKillZoneExplosionVFX_C>();
	}
};
static_assert(alignof(ABP_EnclaveKillZoneExplosionVFX_C) == 0x000008, "Wrong alignment on ABP_EnclaveKillZoneExplosionVFX_C");
static_assert(sizeof(ABP_EnclaveKillZoneExplosionVFX_C) == 0x0002B8, "Wrong size on ABP_EnclaveKillZoneExplosionVFX_C");
static_assert(offsetof(ABP_EnclaveKillZoneExplosionVFX_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_EnclaveKillZoneExplosionVFX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EnclaveKillZoneExplosionVFX_C, BP_Component_Triggerable) == 0x0002A8, "Member 'ABP_EnclaveKillZoneExplosionVFX_C::BP_Component_Triggerable' has a wrong offset!");
static_assert(offsetof(ABP_EnclaveKillZoneExplosionVFX_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_EnclaveKillZoneExplosionVFX_C::DefaultSceneRoot' has a wrong offset!");

}

