#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ForceDeployEventHandler

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ForceDeployEventHandler.BP_ForceDeployEventHandler_C.HandleTrackEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_ForceDeployEventHandler_C_HandleTrackEvent final
{
public:
	class UGzTrackEventBase*                      Event;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TrackPoint;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ForceDeployEventHandler_C_HandleTrackEvent) == 0x000008, "Wrong alignment on BP_ForceDeployEventHandler_C_HandleTrackEvent");
static_assert(sizeof(BP_ForceDeployEventHandler_C_HandleTrackEvent) == 0x000010, "Wrong size on BP_ForceDeployEventHandler_C_HandleTrackEvent");
static_assert(offsetof(BP_ForceDeployEventHandler_C_HandleTrackEvent, Event) == 0x000000, "Member 'BP_ForceDeployEventHandler_C_HandleTrackEvent::Event' has a wrong offset!");
static_assert(offsetof(BP_ForceDeployEventHandler_C_HandleTrackEvent, TrackPoint) == 0x000008, "Member 'BP_ForceDeployEventHandler_C_HandleTrackEvent::TrackPoint' has a wrong offset!");

// Function BP_ForceDeployEventHandler.BP_ForceDeployEventHandler_C.ExecuteUbergraph_BP_ForceDeployEventHandler
// 0x0040 (0x0040 - 0x0000)
struct BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67F6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_XR_DeploymentPlane_C*               K2Node_DynamicCast_AsBP_XR_Deployment_Plane;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67F7[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzDeploymentTransport*                 K2Node_DynamicCast_AsGz_Deployment_Transport;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67F8[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzTrackEventBase*                      K2Node_Event_Event;                                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TrackPoint;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler) == 0x000008, "Wrong alignment on BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler");
static_assert(sizeof(BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler) == 0x000040, "Wrong size on BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler");
static_assert(offsetof(BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler, EntryPoint) == 0x000000, "Member 'BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler, K2Node_DynamicCast_AsBP_XR_Deployment_Plane) == 0x000010, "Member 'BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler::K2Node_DynamicCast_AsBP_XR_Deployment_Plane' has a wrong offset!");
static_assert(offsetof(BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler, K2Node_DynamicCast_AsGz_Deployment_Transport) == 0x000020, "Member 'BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler::K2Node_DynamicCast_AsGz_Deployment_Transport' has a wrong offset!");
static_assert(offsetof(BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler, K2Node_Event_Event) == 0x000030, "Member 'BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler::K2Node_Event_Event' has a wrong offset!");
static_assert(offsetof(BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler, K2Node_Event_TrackPoint) == 0x000038, "Member 'BP_ForceDeployEventHandler_C_ExecuteUbergraph_BP_ForceDeployEventHandler::K2Node_Event_TrackPoint' has a wrong offset!");

}

