#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FireEffectPropagationOverlapComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FireEffectPropagationOverlapComponent.BP_FireEffectPropagationOverlapComponent_C.ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent
// 0x0028 (0x0028 - 0x0000)
struct BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ABC[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent) == 0x000008, "Wrong alignment on BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent");
static_assert(sizeof(BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent) == 0x000028, "Wrong size on BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent");
static_assert(offsetof(BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent, EntryPoint) == 0x000000, "Member 'BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent, CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast) == 0x000020, "Member 'BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent::CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000024, "Member 'BP_FireEffectPropagationOverlapComponent_C_ExecuteUbergraph_BP_FireEffectPropagationOverlapComponent::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

}

