#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FullMapController

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FullMapController.BP_FullMapController_C.ExecuteUbergraph_BP_FullMapController
// 0x0018 (0x0018 - 0x0000)
struct BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTargetZoomLevel_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreZoomLevelsEnabled_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ADB[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetZoomLevelsCount_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController) == 0x000004, "Wrong alignment on BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController");
static_assert(sizeof(BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController) == 0x000018, "Wrong size on BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController");
static_assert(offsetof(BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController, EntryPoint) == 0x000000, "Member 'BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController, CallFunc_GetTargetZoomLevel_ReturnValue) == 0x000004, "Member 'BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController::CallFunc_GetTargetZoomLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController, CallFunc_AreZoomLevelsEnabled_ReturnValue) == 0x000008, "Member 'BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController::CallFunc_AreZoomLevelsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController, CallFunc_GetZoomLevelsCount_ReturnValue) == 0x00000C, "Member 'BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController::CallFunc_GetZoomLevelsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController, CallFunc_Clamp_ReturnValue) == 0x000014, "Member 'BP_FullMapController_C_ExecuteUbergraph_BP_FullMapController::CallFunc_Clamp_ReturnValue' has a wrong offset!");

}

