#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FireEffectPropagationActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FireEffectPropagationActor.BP_FireEffectPropagationActor_C.ExecuteUbergraph_BP_FireEffectPropagationActor
// 0x0078 (0x0078 - 0x0000)
struct BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E7C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PropagationPointID;                   // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E7D[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Location;                             // 0x0010(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Normal;                               // 0x0028(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_PointLifespan;                        // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E7E[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E7F[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SpawnOverlap_PointLifespan_ImplicitCast;  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SpawnFireVFX_PointLifespan_ImplicitCast;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor) == 0x000008, "Wrong alignment on BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor");
static_assert(sizeof(BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor) == 0x000078, "Wrong size on BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor");
static_assert(offsetof(BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor, EntryPoint) == 0x000000, "Member 'BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor, K2Node_Event_PropagationPointID) == 0x000008, "Member 'BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor::K2Node_Event_PropagationPointID' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor, K2Node_Event_Location) == 0x000010, "Member 'BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor, K2Node_Event_Normal) == 0x000028, "Member 'BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor::K2Node_Event_Normal' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor, K2Node_Event_PointLifespan) == 0x000040, "Member 'BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor::K2Node_Event_PointLifespan' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor, CallFunc_MakeRotFromZ_ReturnValue) == 0x000048, "Member 'BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor, CallFunc_IsDedicatedServer_ReturnValue) == 0x000060, "Member 'BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor, CallFunc_SpawnOverlap_PointLifespan_ImplicitCast) == 0x000068, "Member 'BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor::CallFunc_SpawnOverlap_PointLifespan_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor, CallFunc_SpawnFireVFX_PointLifespan_ImplicitCast) == 0x000070, "Member 'BP_FireEffectPropagationActor_C_ExecuteUbergraph_BP_FireEffectPropagationActor::CallFunc_SpawnFireVFX_PointLifespan_ImplicitCast' has a wrong offset!");

// Function BP_FireEffectPropagationActor.BP_FireEffectPropagationActor_C.OnPropagationPointActivated
// 0x0040 (0x0040 - 0x0000)
struct BP_FireEffectPropagationActor_C_OnPropagationPointActivated final
{
public:
	int32                                         PropagationPointID;                                // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E80[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal;                                            // 0x0020(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PointLifespan;                                     // 0x0038(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireEffectPropagationActor_C_OnPropagationPointActivated) == 0x000008, "Wrong alignment on BP_FireEffectPropagationActor_C_OnPropagationPointActivated");
static_assert(sizeof(BP_FireEffectPropagationActor_C_OnPropagationPointActivated) == 0x000040, "Wrong size on BP_FireEffectPropagationActor_C_OnPropagationPointActivated");
static_assert(offsetof(BP_FireEffectPropagationActor_C_OnPropagationPointActivated, PropagationPointID) == 0x000000, "Member 'BP_FireEffectPropagationActor_C_OnPropagationPointActivated::PropagationPointID' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_OnPropagationPointActivated, Location) == 0x000008, "Member 'BP_FireEffectPropagationActor_C_OnPropagationPointActivated::Location' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_OnPropagationPointActivated, Normal) == 0x000020, "Member 'BP_FireEffectPropagationActor_C_OnPropagationPointActivated::Normal' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_OnPropagationPointActivated, PointLifespan) == 0x000038, "Member 'BP_FireEffectPropagationActor_C_OnPropagationPointActivated::PointLifespan' has a wrong offset!");

// Function BP_FireEffectPropagationActor.BP_FireEffectPropagationActor_C.SpawnFireVFX
// 0x0080 (0x0080 - 0x0000)
struct BP_FireEffectPropagationActor_C_SpawnFireVFX final
{
public:
	struct FVector                                RelativeLocation;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        PointLifespan;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireEffectPropagationActor_C_SpawnFireVFX) == 0x000008, "Wrong alignment on BP_FireEffectPropagationActor_C_SpawnFireVFX");
static_assert(sizeof(BP_FireEffectPropagationActor_C_SpawnFireVFX) == 0x000080, "Wrong size on BP_FireEffectPropagationActor_C_SpawnFireVFX");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnFireVFX, RelativeLocation) == 0x000000, "Member 'BP_FireEffectPropagationActor_C_SpawnFireVFX::RelativeLocation' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnFireVFX, Rotation) == 0x000018, "Member 'BP_FireEffectPropagationActor_C_SpawnFireVFX::Rotation' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnFireVFX, PointLifespan) == 0x000030, "Member 'BP_FireEffectPropagationActor_C_SpawnFireVFX::PointLifespan' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnFireVFX, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BP_FireEffectPropagationActor_C_SpawnFireVFX::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnFireVFX, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_FireEffectPropagationActor_C_SpawnFireVFX::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnFireVFX, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'BP_FireEffectPropagationActor_C_SpawnFireVFX::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnFireVFX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000070, "Member 'BP_FireEffectPropagationActor_C_SpawnFireVFX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnFireVFX, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000078, "Member 'BP_FireEffectPropagationActor_C_SpawnFireVFX::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");

// Function BP_FireEffectPropagationActor.BP_FireEffectPropagationActor_C.SpawnOverlap
// 0x01D0 (0x01D0 - 0x0000)
struct BP_FireEffectPropagationActor_C_SpawnOverlap final
{
public:
	int32                                         PropagationPointID;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E81[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Relative_Location;                                 // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PointLifespan;                                     // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E82[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_FireEffectPropagationOverlapComponent_C* CallFunc_AddComponent_ReturnValue;                 // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00C8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireEffectPropagationActor_C_SpawnOverlap) == 0x000010, "Wrong alignment on BP_FireEffectPropagationActor_C_SpawnOverlap");
static_assert(sizeof(BP_FireEffectPropagationActor_C_SpawnOverlap) == 0x0001D0, "Wrong size on BP_FireEffectPropagationActor_C_SpawnOverlap");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnOverlap, PropagationPointID) == 0x000000, "Member 'BP_FireEffectPropagationActor_C_SpawnOverlap::PropagationPointID' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnOverlap, Relative_Location) == 0x000008, "Member 'BP_FireEffectPropagationActor_C_SpawnOverlap::Relative_Location' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnOverlap, PointLifespan) == 0x000020, "Member 'BP_FireEffectPropagationActor_C_SpawnOverlap::PointLifespan' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnOverlap, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'BP_FireEffectPropagationActor_C_SpawnOverlap::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnOverlap, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'BP_FireEffectPropagationActor_C_SpawnOverlap::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnOverlap, CallFunc_AddComponent_ReturnValue) == 0x0000A8, "Member 'BP_FireEffectPropagationActor_C_SpawnOverlap::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnOverlap, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'BP_FireEffectPropagationActor_C_SpawnOverlap::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnOverlap, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000C8, "Member 'BP_FireEffectPropagationActor_C_SpawnOverlap::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FireEffectPropagationActor_C_SpawnOverlap, CallFunc_SetDoublePropertyByName_Value_ImplicitCast) == 0x0001C0, "Member 'BP_FireEffectPropagationActor_C_SpawnOverlap::CallFunc_SetDoublePropertyByName_Value_ImplicitCast' has a wrong offset!");

}

