#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GenericWithDuration_PP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GenericWithDuration_PP.BP_GenericWithDuration_PP_C.TickBP
// 0x0004 (0x0004 - 0x0000)
struct BP_GenericWithDuration_PP_C_TickBP final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GenericWithDuration_PP_C_TickBP) == 0x000004, "Wrong alignment on BP_GenericWithDuration_PP_C_TickBP");
static_assert(sizeof(BP_GenericWithDuration_PP_C_TickBP) == 0x000004, "Wrong size on BP_GenericWithDuration_PP_C_TickBP");
static_assert(offsetof(BP_GenericWithDuration_PP_C_TickBP, DeltaTime) == 0x000000, "Member 'BP_GenericWithDuration_PP_C_TickBP::DeltaTime' has a wrong offset!");

// Function BP_GenericWithDuration_PP.BP_GenericWithDuration_PP_C.ExecuteUbergraph_BP_GenericWithDuration_PP
// 0x0090 (0x0090 - 0x0000)
struct BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2C[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2D[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadingIn_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2E[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFadeInProgress_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadingOut_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2F[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         CallFunc_GetFadeOutProgress_ReturnValue;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E30[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E31[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E32[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP) == 0x000008, "Wrong alignment on BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP");
static_assert(sizeof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP) == 0x000090, "Wrong size on BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, EntryPoint) == 0x000000, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, K2Node_Event_DeltaTime) == 0x000018, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_IsFadingIn_ReturnValue) == 0x000028, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_IsFadingIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_GetFadeInProgress_ReturnValue) == 0x00002C, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_GetFadeInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000038, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_IsFadingOut_ReturnValue) == 0x000048, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_IsFadingOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x000050, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_GetFadeOutProgress_ReturnValue) == 0x000060, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_GetFadeOutProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000068, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_IsValid_ReturnValue_2) == 0x000071, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast) == 0x000074, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000078, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000080, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000088, "Member 'BP_GenericWithDuration_PP_C_ExecuteUbergraph_BP_GenericWithDuration_PP::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

