#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GorillaArm_GroundDecal

#include "Basic.hpp"

#include "G01_structs.hpp"


namespace SDK::Params
{

// Function BP_GorillaArm_GroundDecal.BP_GorillaArm_GroundDecal_C.ExecuteUbergraph_BP_GorillaArm_GroundDecal
// 0x0010 (0x0010 - 0x0000)
struct BP_GorillaArm_GroundDecal_C_ExecuteUbergraph_BP_GorillaArm_GroundDecal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D8B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Min_Decal_Alpha_Value_ImplicitCast; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_GroundDecal_C_ExecuteUbergraph_BP_GorillaArm_GroundDecal) == 0x000008, "Wrong alignment on BP_GorillaArm_GroundDecal_C_ExecuteUbergraph_BP_GorillaArm_GroundDecal");
static_assert(sizeof(BP_GorillaArm_GroundDecal_C_ExecuteUbergraph_BP_GorillaArm_GroundDecal) == 0x000010, "Wrong size on BP_GorillaArm_GroundDecal_C_ExecuteUbergraph_BP_GorillaArm_GroundDecal");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_ExecuteUbergraph_BP_GorillaArm_GroundDecal, EntryPoint) == 0x000000, "Member 'BP_GorillaArm_GroundDecal_C_ExecuteUbergraph_BP_GorillaArm_GroundDecal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_ExecuteUbergraph_BP_GorillaArm_GroundDecal, K2Node_VariableSet_Min_Decal_Alpha_Value_ImplicitCast) == 0x000008, "Member 'BP_GorillaArm_GroundDecal_C_ExecuteUbergraph_BP_GorillaArm_GroundDecal::K2Node_VariableSet_Min_Decal_Alpha_Value_ImplicitCast' has a wrong offset!");

// Function BP_GorillaArm_GroundDecal.BP_GorillaArm_GroundDecal_C.InitializeDecalMaterial
// 0x0030 (0x0030 - 0x0000)
struct BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial final
{
public:
	EGzLimbType                                   Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D8C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial) == 0x000008, "Wrong alignment on BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial");
static_assert(sizeof(BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial) == 0x000030, "Wrong size on BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial, Temp_byte_Variable) == 0x000000, "Member 'BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial, Temp_object_Variable) == 0x000008, "Member 'BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial, Temp_object_Variable_1) == 0x000010, "Member 'BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial, Temp_object_Variable_2) == 0x000018, "Member 'BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial, K2Node_Select_Default) == 0x000028, "Member 'BP_GorillaArm_GroundDecal_C_InitializeDecalMaterial::K2Node_Select_Default' has a wrong offset!");

// Function BP_GorillaArm_GroundDecal.BP_GorillaArm_GroundDecal_C.UpdatePreview
// 0x0048 (0x0048 - 0x0000)
struct BP_GorillaArm_GroundDecal_C_UpdatePreview final
{
public:
	double                                        In_Distance_Coefficient;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D8D[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetDecalMaterial_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D8E[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_A_ImplicitCast;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_GroundDecal_C_UpdatePreview) == 0x000008, "Wrong alignment on BP_GorillaArm_GroundDecal_C_UpdatePreview");
static_assert(sizeof(BP_GorillaArm_GroundDecal_C_UpdatePreview) == 0x000048, "Wrong size on BP_GorillaArm_GroundDecal_C_UpdatePreview");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_UpdatePreview, In_Distance_Coefficient) == 0x000000, "Member 'BP_GorillaArm_GroundDecal_C_UpdatePreview::In_Distance_Coefficient' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_UpdatePreview, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'BP_GorillaArm_GroundDecal_C_UpdatePreview::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_UpdatePreview, CallFunc_GetFloatValue_ReturnValue) == 0x000010, "Member 'BP_GorillaArm_GroundDecal_C_UpdatePreview::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_UpdatePreview, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_GorillaArm_GroundDecal_C_UpdatePreview::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_UpdatePreview, CallFunc_FMin_ReturnValue) == 0x000018, "Member 'BP_GorillaArm_GroundDecal_C_UpdatePreview::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_UpdatePreview, CallFunc_GetDecalMaterial_ReturnValue) == 0x000020, "Member 'BP_GorillaArm_GroundDecal_C_UpdatePreview::CallFunc_GetDecalMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_UpdatePreview, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000028, "Member 'BP_GorillaArm_GroundDecal_C_UpdatePreview::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_UpdatePreview, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_GorillaArm_GroundDecal_C_UpdatePreview::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_UpdatePreview, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x000034, "Member 'BP_GorillaArm_GroundDecal_C_UpdatePreview::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_UpdatePreview, CallFunc_FMin_A_ImplicitCast) == 0x000038, "Member 'BP_GorillaArm_GroundDecal_C_UpdatePreview::CallFunc_FMin_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundDecal_C_UpdatePreview, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000040, "Member 'BP_GorillaArm_GroundDecal_C_UpdatePreview::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

