#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GorillaArm_DashFX

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GorillaArm_DashFX.BP_GorillaArm_DashFX_C.TickBP
// 0x0004 (0x0004 - 0x0000)
struct BP_GorillaArm_DashFX_C_TickBP final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_DashFX_C_TickBP) == 0x000004, "Wrong alignment on BP_GorillaArm_DashFX_C_TickBP");
static_assert(sizeof(BP_GorillaArm_DashFX_C_TickBP) == 0x000004, "Wrong size on BP_GorillaArm_DashFX_C_TickBP");
static_assert(offsetof(BP_GorillaArm_DashFX_C_TickBP, DeltaTime) == 0x000000, "Member 'BP_GorillaArm_DashFX_C_TickBP::DeltaTime' has a wrong offset!");

// Function BP_GorillaArm_DashFX.BP_GorillaArm_DashFX_C.ExecuteUbergraph_BP_GorillaArm_DashFX
// 0x0068 (0x0068 - 0x0000)
struct BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D44[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D45[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFadeInProgress_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadingIn_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadingOut_ReturnValue;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFadeOutProgress_ReturnValue;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D46[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX) == 0x000008, "Wrong alignment on BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX");
static_assert(sizeof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX) == 0x000068, "Wrong size on BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, EntryPoint) == 0x000000, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000008, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x000028, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, K2Node_Event_DeltaTime) == 0x000038, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, CallFunc_GetFadeInProgress_ReturnValue) == 0x00003C, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::CallFunc_GetFadeInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, CallFunc_IsValid_ReturnValue_2) == 0x000041, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, CallFunc_IsFadingIn_ReturnValue) == 0x000042, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::CallFunc_IsFadingIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, CallFunc_IsFadingOut_ReturnValue) == 0x000043, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::CallFunc_IsFadingOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, CallFunc_GetFadeOutProgress_ReturnValue) == 0x000044, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::CallFunc_GetFadeOutProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast) == 0x000050, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000058, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000060, "Member 'BP_GorillaArm_DashFX_C_ExecuteUbergraph_BP_GorillaArm_DashFX::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

