#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameRuleEnabled_IC

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GameRuleEnabled_IC.BP_GameRuleEnabled_IC_C.IsInteractionConditionPassed
// 0x0018 (0x0018 - 0x0000)
struct BP_GameRuleEnabled_IC_C_IsInteractionConditionPassed final
{
public:
	const class AGzCharacter*                     InteractedBy;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           InteractableOwner;                                 // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameRuleEnabled_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameRuleEnabled_IC_C_IsInteractionConditionPassed) == 0x000008, "Wrong alignment on BP_GameRuleEnabled_IC_C_IsInteractionConditionPassed");
static_assert(sizeof(BP_GameRuleEnabled_IC_C_IsInteractionConditionPassed) == 0x000018, "Wrong size on BP_GameRuleEnabled_IC_C_IsInteractionConditionPassed");
static_assert(offsetof(BP_GameRuleEnabled_IC_C_IsInteractionConditionPassed, InteractedBy) == 0x000000, "Member 'BP_GameRuleEnabled_IC_C_IsInteractionConditionPassed::InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_GameRuleEnabled_IC_C_IsInteractionConditionPassed, InteractableOwner) == 0x000008, "Member 'BP_GameRuleEnabled_IC_C_IsInteractionConditionPassed::InteractableOwner' has a wrong offset!");
static_assert(offsetof(BP_GameRuleEnabled_IC_C_IsInteractionConditionPassed, ReturnValue) == 0x000010, "Member 'BP_GameRuleEnabled_IC_C_IsInteractionConditionPassed::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameRuleEnabled_IC_C_IsInteractionConditionPassed, CallFunc_IsGameRuleEnabled_ReturnValue) == 0x000011, "Member 'BP_GameRuleEnabled_IC_C_IsInteractionConditionPassed::CallFunc_IsGameRuleEnabled_ReturnValue' has a wrong offset!");

}

