#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GiveImpulseEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_GiveEffectZone_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GiveImpulseEffect.BP_GiveImpulseEffect_C
// 0x0020 (0x0300 - 0x02E0)
class ABP_GiveImpulseEffect_C : public ABP_GiveEffectZone_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_GiveImpulseEffect_C;             // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Impluse;                                           // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ExecuteUbergraph_BP_GiveImpulseEffect(int32 EntryPoint);
	void ApplyEffect(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GiveImpulseEffect_C">();
	}
	static class ABP_GiveImpulseEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GiveImpulseEffect_C>();
	}
};
static_assert(alignof(ABP_GiveImpulseEffect_C) == 0x000008, "Wrong alignment on ABP_GiveImpulseEffect_C");
static_assert(sizeof(ABP_GiveImpulseEffect_C) == 0x000300, "Wrong size on ABP_GiveImpulseEffect_C");
static_assert(offsetof(ABP_GiveImpulseEffect_C, UberGraphFrame_BP_GiveImpulseEffect_C) == 0x0002E0, "Member 'ABP_GiveImpulseEffect_C::UberGraphFrame_BP_GiveImpulseEffect_C' has a wrong offset!");
static_assert(offsetof(ABP_GiveImpulseEffect_C, TextRender) == 0x0002E8, "Member 'ABP_GiveImpulseEffect_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_GiveImpulseEffect_C, Arrow) == 0x0002F0, "Member 'ABP_GiveImpulseEffect_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_GiveImpulseEffect_C, Impluse) == 0x0002F8, "Member 'ABP_GiveImpulseEffect_C::Impluse' has a wrong offset!");

}

