#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GorillaArm_GroundDecal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "G01_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GorillaArm_GroundDecal.BP_GorillaArm_GroundDecal_C
// 0x0048 (0x02E8 - 0x02A0)
class ABP_GorillaArm_GroundDecal_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        DecalComponent;                                    // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MinDecalAlphaValueTimeline_MinDecalAlphaTrack_F4C389BA4F47C4FE828F70A754FE5955; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MinDecalAlphaValueTimeline__Direction_F4C389BA4F47C4FE828F70A754FE5955; // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D89[0x3];                                     // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MinDecalAlphaValueTimeline;                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   TargetLimbType;                                    // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5D8A[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            DecalAlphaParameterCurve;                          // 0x02D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   DecalAlphaParameterName;                           // 0x02D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Min_Decal_Alpha_Value;                             // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GorillaArm_GroundDecal(int32 EntryPoint);
	void InitializeDecalMaterial();
	void MinDecalAlphaValueTimeline__FinishedFunc();
	void MinDecalAlphaValueTimeline__UpdateFunc();
	void ReceiveBeginPlay();
	void UpdatePreview(double In_Distance_Coefficient);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GorillaArm_GroundDecal_C">();
	}
	static class ABP_GorillaArm_GroundDecal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GorillaArm_GroundDecal_C>();
	}
};
static_assert(alignof(ABP_GorillaArm_GroundDecal_C) == 0x000008, "Wrong alignment on ABP_GorillaArm_GroundDecal_C");
static_assert(sizeof(ABP_GorillaArm_GroundDecal_C) == 0x0002E8, "Wrong size on ABP_GorillaArm_GroundDecal_C");
static_assert(offsetof(ABP_GorillaArm_GroundDecal_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_GorillaArm_GroundDecal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GorillaArm_GroundDecal_C, DecalComponent) == 0x0002A8, "Member 'ABP_GorillaArm_GroundDecal_C::DecalComponent' has a wrong offset!");
static_assert(offsetof(ABP_GorillaArm_GroundDecal_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_GorillaArm_GroundDecal_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_GorillaArm_GroundDecal_C, MinDecalAlphaValueTimeline_MinDecalAlphaTrack_F4C389BA4F47C4FE828F70A754FE5955) == 0x0002B8, "Member 'ABP_GorillaArm_GroundDecal_C::MinDecalAlphaValueTimeline_MinDecalAlphaTrack_F4C389BA4F47C4FE828F70A754FE5955' has a wrong offset!");
static_assert(offsetof(ABP_GorillaArm_GroundDecal_C, MinDecalAlphaValueTimeline__Direction_F4C389BA4F47C4FE828F70A754FE5955) == 0x0002BC, "Member 'ABP_GorillaArm_GroundDecal_C::MinDecalAlphaValueTimeline__Direction_F4C389BA4F47C4FE828F70A754FE5955' has a wrong offset!");
static_assert(offsetof(ABP_GorillaArm_GroundDecal_C, MinDecalAlphaValueTimeline) == 0x0002C0, "Member 'ABP_GorillaArm_GroundDecal_C::MinDecalAlphaValueTimeline' has a wrong offset!");
static_assert(offsetof(ABP_GorillaArm_GroundDecal_C, TargetLimbType) == 0x0002C8, "Member 'ABP_GorillaArm_GroundDecal_C::TargetLimbType' has a wrong offset!");
static_assert(offsetof(ABP_GorillaArm_GroundDecal_C, DecalAlphaParameterCurve) == 0x0002D0, "Member 'ABP_GorillaArm_GroundDecal_C::DecalAlphaParameterCurve' has a wrong offset!");
static_assert(offsetof(ABP_GorillaArm_GroundDecal_C, DecalAlphaParameterName) == 0x0002D8, "Member 'ABP_GorillaArm_GroundDecal_C::DecalAlphaParameterName' has a wrong offset!");
static_assert(offsetof(ABP_GorillaArm_GroundDecal_C, Min_Decal_Alpha_Value) == 0x0002E0, "Member 'ABP_GorillaArm_GroundDecal_C::Min_Decal_Alpha_Value' has a wrong offset!");

}

