#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GorillaArm_BreakingGlassFX

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GorillaArm_BreakingGlassFX.BP_GorillaArm_BreakingGlassFX_C.TickBP
// 0x0004 (0x0004 - 0x0000)
struct BP_GorillaArm_BreakingGlassFX_C_TickBP final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_BreakingGlassFX_C_TickBP) == 0x000004, "Wrong alignment on BP_GorillaArm_BreakingGlassFX_C_TickBP");
static_assert(sizeof(BP_GorillaArm_BreakingGlassFX_C_TickBP) == 0x000004, "Wrong size on BP_GorillaArm_BreakingGlassFX_C_TickBP");
static_assert(offsetof(BP_GorillaArm_BreakingGlassFX_C_TickBP, DeltaTime) == 0x000000, "Member 'BP_GorillaArm_BreakingGlassFX_C_TickBP::DeltaTime' has a wrong offset!");

// Function BP_GorillaArm_BreakingGlassFX.BP_GorillaArm_BreakingGlassFX_C.ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX
// 0x0068 (0x0068 - 0x0000)
struct BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60E5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60E6[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60E7[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_Current_ImplicitCast;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX) == 0x000008, "Wrong alignment on BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX");
static_assert(sizeof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX) == 0x000068, "Wrong size on BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX");
static_assert(offsetof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX, EntryPoint) == 0x000000, "Member 'BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x000018, "Member 'BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX, K2Node_Event_DeltaTime) == 0x000028, "Member 'BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x00002C, "Member 'BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000030, "Member 'BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000040, "Member 'BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX, CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast) == 0x00004C, "Member 'BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX::CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX, CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast) == 0x000050, "Member 'BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX::CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX, CallFunc_FInterpTo_Constant_Current_ImplicitCast) == 0x000058, "Member 'BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX::CallFunc_FInterpTo_Constant_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000060, "Member 'BP_GorillaArm_BreakingGlassFX_C_ExecuteUbergraph_BP_GorillaArm_BreakingGlassFX::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

