#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GorillaArm_Component

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.Cloak RPC
// 0x0001 (0x0001 - 0x0000)
struct BP_GorillaArm_Component_C_Cloak_RPC final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_Component_C_Cloak_RPC) == 0x000001, "Wrong alignment on BP_GorillaArm_Component_C_Cloak_RPC");
static_assert(sizeof(BP_GorillaArm_Component_C_Cloak_RPC) == 0x000001, "Wrong size on BP_GorillaArm_Component_C_Cloak_RPC");
static_assert(offsetof(BP_GorillaArm_Component_C_Cloak_RPC, Enable) == 0x000000, "Member 'BP_GorillaArm_Component_C_Cloak_RPC::Enable' has a wrong offset!");

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.DestroyDecalPreview
// 0x0001 (0x0001 - 0x0000)
struct BP_GorillaArm_Component_C_DestroyDecalPreview final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_Component_C_DestroyDecalPreview) == 0x000001, "Wrong alignment on BP_GorillaArm_Component_C_DestroyDecalPreview");
static_assert(sizeof(BP_GorillaArm_Component_C_DestroyDecalPreview) == 0x000001, "Wrong size on BP_GorillaArm_Component_C_DestroyDecalPreview");
static_assert(offsetof(BP_GorillaArm_Component_C_DestroyDecalPreview, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_GorillaArm_Component_C_DestroyDecalPreview::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.DestroyIndicator
// 0x0001 (0x0001 - 0x0000)
struct BP_GorillaArm_Component_C_DestroyIndicator final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_Component_C_DestroyIndicator) == 0x000001, "Wrong alignment on BP_GorillaArm_Component_C_DestroyIndicator");
static_assert(sizeof(BP_GorillaArm_Component_C_DestroyIndicator) == 0x000001, "Wrong size on BP_GorillaArm_Component_C_DestroyIndicator");
static_assert(offsetof(BP_GorillaArm_Component_C_DestroyIndicator, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_GorillaArm_Component_C_DestroyIndicator::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.DestroyPreview
// 0x0001 (0x0001 - 0x0000)
struct BP_GorillaArm_Component_C_DestroyPreview final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_Component_C_DestroyPreview) == 0x000001, "Wrong alignment on BP_GorillaArm_Component_C_DestroyPreview");
static_assert(sizeof(BP_GorillaArm_Component_C_DestroyPreview) == 0x000001, "Wrong size on BP_GorillaArm_Component_C_DestroyPreview");
static_assert(offsetof(BP_GorillaArm_Component_C_DestroyPreview, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_GorillaArm_Component_C_DestroyPreview::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.ExecuteUbergraph_BP_GorillaArm_Component
// 0x0260 (0x0260 - 0x0000)
struct BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0028(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65CE[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0088(0x0038)(HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65CF[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     Temp_struct_Variable_1;                            // 0x00C8(0x0038)(HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable_2;                            // 0x0100(0x0038)(HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable_3;                            // 0x0138(0x0038)(HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x01A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGzMultiPartCharacter*                  CallFunc_GetOwnerCharacter_ReturnValue;            // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyViewed_ReturnValue;              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65D0[0x1];                                     // 0x01B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65D1[0x3];                                     // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue;               // 0x01C8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue_1;             // 0x01D0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue; // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_Select_Default;                             // 0x01E0(0x0038)(HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           CallFunc_ListenForAttributeChange_ReturnValue;     // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65D2[0x6];                                     // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue_2;             // 0x0228(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0230(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue; // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65D3[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component) == 0x000008, "Wrong alignment on BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component");
static_assert(sizeof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component) == 0x000260, "Wrong size on BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, EntryPoint) == 0x000000, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_CustomEvent_Attribute) == 0x000028, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_CustomEvent_NewValue) == 0x000060, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_CustomEvent_OldValue) == 0x000064, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, Temp_real_Variable) == 0x000078, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, Temp_real_Variable_1) == 0x00007C, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000080, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, Temp_struct_Variable) == 0x000088, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, Temp_byte_Variable) == 0x0000C0, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, Temp_struct_Variable_1) == 0x0000C8, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, Temp_struct_Variable_2) == 0x000100, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, Temp_struct_Variable_3) == 0x000138, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_CreateDelegate_OutputDelegate_3) == 0x000170, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_CustomEvent_Tag_1) == 0x000180, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_CustomEvent_Tag) == 0x000188, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_CreateDelegate_OutputDelegate_4) == 0x000190, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, Temp_struct_Variable_4) == 0x0001A0, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_GetOwnerCharacter_ReturnValue) == 0x0001A8, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_IsValid_ReturnValue) == 0x0001B0, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_IsLocallyViewed_ReturnValue) == 0x0001B1, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_IsLocallyViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_Event_EndPlayReason) == 0x0001B2, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001B4, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_IsValid_ReturnValue_1) == 0x0001C4, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_GetLimbAbility_ReturnValue) == 0x0001C8, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_GetLimbAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_GetLimbAbility_ReturnValue_1) == 0x0001D0, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_GetLimbAbility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0001D8, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_Select_Default) == 0x0001E0, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_ListenForAttributeChange_ReturnValue) == 0x000218, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_ListenForAttributeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_IsValid_ReturnValue_2) == 0x000220, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_CustomEvent_Enable) == 0x000221, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_GetLimbAbility_ReturnValue_2) == 0x000228, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_GetLimbAbility_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, K2Node_CreateDelegate_OutputDelegate_6) == 0x000230, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000240, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue) == 0x000248, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_IsValid_ReturnValue_3) == 0x000250, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000258, "Member 'BP_GorillaArm_Component_C_ExecuteUbergraph_BP_GorillaArm_Component::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.GetPathPredictionLocomotion
// 0x0078 (0x0078 - 0x0000)
struct BP_GorillaArm_Component_C_GetPathPredictionLocomotion final
{
public:
	double                                        Distance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dash_Speed;                                        // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65D4[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DashDuration;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzBodyPartAbilityData*                 CallFunc_BP_GetAbilityData_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChargeProgress_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65D5[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzBodyPartAbilityData_GorillaArm*      K2Node_DynamicCast_AsGz_Body_Part_Ability_Data_Gorilla_Arm; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65D6[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65D7[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_B_ImplicitCast;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion) == 0x000008, "Wrong alignment on BP_GorillaArm_Component_C_GetPathPredictionLocomotion");
static_assert(sizeof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion) == 0x000078, "Wrong size on BP_GorillaArm_Component_C_GetPathPredictionLocomotion");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, Distance) == 0x000000, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::Distance' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, Dash_Speed) == 0x000008, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::Dash_Speed' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, DashDuration) == 0x000010, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::DashDuration' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, CallFunc_BP_GetAbilityData_ReturnValue) == 0x000018, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::CallFunc_BP_GetAbilityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, CallFunc_GetChargeProgress_ReturnValue) == 0x000020, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::CallFunc_GetChargeProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, K2Node_DynamicCast_AsGz_Body_Part_Ability_Data_Gorilla_Arm) == 0x000028, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::K2Node_DynamicCast_AsGz_Body_Part_Ability_Data_Gorilla_Arm' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, CallFunc_Lerp_ReturnValue) == 0x000038, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, CallFunc_SelectFloat_ReturnValue) == 0x000048, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000058, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, CallFunc_Lerp_B_ImplicitCast) == 0x000060, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::CallFunc_Lerp_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, CallFunc_Lerp_A_ImplicitCast) == 0x000068, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::CallFunc_Lerp_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_GetPathPredictionLocomotion, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000070, "Member 'BP_GorillaArm_Component_C_GetPathPredictionLocomotion::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.OnAttributeChanged_AE78796443AD23DE1C4B78B4D5ECE220
// 0x0040 (0x0040 - 0x0000)
struct BP_GorillaArm_Component_C_OnAttributeChanged_AE78796443AD23DE1C4B78B4D5ECE220 final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_Component_C_OnAttributeChanged_AE78796443AD23DE1C4B78B4D5ECE220) == 0x000008, "Wrong alignment on BP_GorillaArm_Component_C_OnAttributeChanged_AE78796443AD23DE1C4B78B4D5ECE220");
static_assert(sizeof(BP_GorillaArm_Component_C_OnAttributeChanged_AE78796443AD23DE1C4B78B4D5ECE220) == 0x000040, "Wrong size on BP_GorillaArm_Component_C_OnAttributeChanged_AE78796443AD23DE1C4B78B4D5ECE220");
static_assert(offsetof(BP_GorillaArm_Component_C_OnAttributeChanged_AE78796443AD23DE1C4B78B4D5ECE220, Attribute) == 0x000000, "Member 'BP_GorillaArm_Component_C_OnAttributeChanged_AE78796443AD23DE1C4B78B4D5ECE220::Attribute' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_OnAttributeChanged_AE78796443AD23DE1C4B78B4D5ECE220, NewValue) == 0x000038, "Member 'BP_GorillaArm_Component_C_OnAttributeChanged_AE78796443AD23DE1C4B78B4D5ECE220::NewValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_OnAttributeChanged_AE78796443AD23DE1C4B78B4D5ECE220, OldValue) == 0x00003C, "Member 'BP_GorillaArm_Component_C_OnAttributeChanged_AE78796443AD23DE1C4B78B4D5ECE220::OldValue' has a wrong offset!");

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.OnTagAdded_5B3E127F4744188661C3379F154C2C63
// 0x0008 (0x0008 - 0x0000)
struct BP_GorillaArm_Component_C_OnTagAdded_5B3E127F4744188661C3379F154C2C63 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_Component_C_OnTagAdded_5B3E127F4744188661C3379F154C2C63) == 0x000004, "Wrong alignment on BP_GorillaArm_Component_C_OnTagAdded_5B3E127F4744188661C3379F154C2C63");
static_assert(sizeof(BP_GorillaArm_Component_C_OnTagAdded_5B3E127F4744188661C3379F154C2C63) == 0x000008, "Wrong size on BP_GorillaArm_Component_C_OnTagAdded_5B3E127F4744188661C3379F154C2C63");
static_assert(offsetof(BP_GorillaArm_Component_C_OnTagAdded_5B3E127F4744188661C3379F154C2C63, Tag) == 0x000000, "Member 'BP_GorillaArm_Component_C_OnTagAdded_5B3E127F4744188661C3379F154C2C63::Tag' has a wrong offset!");

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.OnTagRemoved_5B3E127F4744188661C3379F154C2C63
// 0x0008 (0x0008 - 0x0000)
struct BP_GorillaArm_Component_C_OnTagRemoved_5B3E127F4744188661C3379F154C2C63 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_Component_C_OnTagRemoved_5B3E127F4744188661C3379F154C2C63) == 0x000004, "Wrong alignment on BP_GorillaArm_Component_C_OnTagRemoved_5B3E127F4744188661C3379F154C2C63");
static_assert(sizeof(BP_GorillaArm_Component_C_OnTagRemoved_5B3E127F4744188661C3379F154C2C63) == 0x000008, "Wrong size on BP_GorillaArm_Component_C_OnTagRemoved_5B3E127F4744188661C3379F154C2C63");
static_assert(offsetof(BP_GorillaArm_Component_C_OnTagRemoved_5B3E127F4744188661C3379F154C2C63, Tag) == 0x000000, "Member 'BP_GorillaArm_Component_C_OnTagRemoved_5B3E127F4744188661C3379F154C2C63::Tag' has a wrong offset!");

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.PlayChargingFXCue
// 0x0158 (0x0158 - 0x0000)
struct BP_GorillaArm_Component_C_PlayChargingFXCue final
{
public:
	EGzLimbType                                   Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65D8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65D9[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65DA[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue;               // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue_1;             // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue_2;             // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponentFromActorInfo_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue_3;             // 0x0058(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue_4;             // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65DB[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0078(0x00D8)(ContainsInstancedReference)
	float                                         CallFunc_MakeGameplayCueParameters_RawMagnitude_ImplicitCast; // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_Component_C_PlayChargingFXCue) == 0x000008, "Wrong alignment on BP_GorillaArm_Component_C_PlayChargingFXCue");
static_assert(sizeof(BP_GorillaArm_Component_C_PlayChargingFXCue) == 0x000158, "Wrong size on BP_GorillaArm_Component_C_PlayChargingFXCue");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, Temp_byte_Variable) == 0x000000, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, Temp_struct_Variable) == 0x000004, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, Temp_struct_Variable_1) == 0x00000C, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, Temp_struct_Variable_2) == 0x000014, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, Temp_byte_Variable_1) == 0x00001C, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, Temp_int_Variable) == 0x000020, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, Temp_int_Variable_1) == 0x000024, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, Temp_int_Variable_2) == 0x000028, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, CallFunc_GetLimbAbility_ReturnValue) == 0x000030, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::CallFunc_GetLimbAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, CallFunc_GetLimbAbility_ReturnValue_1) == 0x000038, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::CallFunc_GetLimbAbility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, CallFunc_GetLimbAbility_ReturnValue_2) == 0x000040, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::CallFunc_GetLimbAbility_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, K2Node_Select_Default) == 0x000048, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, CallFunc_GetOwningComponentFromActorInfo_ReturnValue) == 0x000050, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::CallFunc_GetOwningComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, CallFunc_GetLimbAbility_ReturnValue_3) == 0x000058, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::CallFunc_GetLimbAbility_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, CallFunc_GetLimbAbility_ReturnValue_4) == 0x000060, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::CallFunc_GetLimbAbility_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, CallFunc_GetOwningCharacter_ReturnValue) == 0x000068, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, K2Node_Select_Default_1) == 0x000070, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000078, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayChargingFXCue, CallFunc_MakeGameplayCueParameters_RawMagnitude_ImplicitCast) == 0x000150, "Member 'BP_GorillaArm_Component_C_PlayChargingFXCue::CallFunc_MakeGameplayCueParameters_RawMagnitude_ImplicitCast' has a wrong offset!");

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.PlayPassiveFXCue
// 0x0150 (0x0150 - 0x0000)
struct BP_GorillaArm_Component_C_PlayPassiveFXCue final
{
public:
	EGzLimbType                                   Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65DC[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65DD[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65DE[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue;               // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue_1;             // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue_2;             // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponentFromActorInfo_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue_3;             // 0x0058(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue_4;             // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65DF[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0078(0x00D8)(ContainsInstancedReference)
};
static_assert(alignof(BP_GorillaArm_Component_C_PlayPassiveFXCue) == 0x000008, "Wrong alignment on BP_GorillaArm_Component_C_PlayPassiveFXCue");
static_assert(sizeof(BP_GorillaArm_Component_C_PlayPassiveFXCue) == 0x000150, "Wrong size on BP_GorillaArm_Component_C_PlayPassiveFXCue");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, Temp_byte_Variable) == 0x000000, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, Temp_struct_Variable) == 0x000004, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, Temp_struct_Variable_1) == 0x00000C, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, Temp_struct_Variable_2) == 0x000014, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, Temp_byte_Variable_1) == 0x00001C, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, Temp_int_Variable) == 0x000020, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, Temp_int_Variable_1) == 0x000024, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, Temp_int_Variable_2) == 0x000028, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, CallFunc_GetLimbAbility_ReturnValue) == 0x000030, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::CallFunc_GetLimbAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, CallFunc_GetLimbAbility_ReturnValue_1) == 0x000038, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::CallFunc_GetLimbAbility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, CallFunc_GetLimbAbility_ReturnValue_2) == 0x000040, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::CallFunc_GetLimbAbility_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, CallFunc_GetOwningComponentFromActorInfo_ReturnValue) == 0x000048, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::CallFunc_GetOwningComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, K2Node_Select_Default) == 0x000050, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, CallFunc_GetLimbAbility_ReturnValue_3) == 0x000058, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::CallFunc_GetLimbAbility_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, CallFunc_GetLimbAbility_ReturnValue_4) == 0x000060, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::CallFunc_GetLimbAbility_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, CallFunc_GetOwningCharacter_ReturnValue) == 0x000068, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, K2Node_Select_Default_1) == 0x000070, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_PlayPassiveFXCue, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000078, "Member 'BP_GorillaArm_Component_C_PlayPassiveFXCue::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_GorillaArm_Component_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_Component_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_GorillaArm_Component_C_ReceiveEndPlay");
static_assert(sizeof(BP_GorillaArm_Component_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_GorillaArm_Component_C_ReceiveEndPlay");
static_assert(offsetof(BP_GorillaArm_Component_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_GorillaArm_Component_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_GorillaArm_Component_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_Component_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_GorillaArm_Component_C_ReceiveTick");
static_assert(sizeof(BP_GorillaArm_Component_C_ReceiveTick) == 0x000004, "Wrong size on BP_GorillaArm_Component_C_ReceiveTick");
static_assert(offsetof(BP_GorillaArm_Component_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_GorillaArm_Component_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.RemoveChargeFXCue
// 0x0040 (0x0040 - 0x0000)
struct BP_GorillaArm_Component_C_RemoveChargeFXCue final
{
public:
	EGzLimbType                                   Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65E0[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65E1[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue;               // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue_1;             // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentCharges_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65E2[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_Component_C_RemoveChargeFXCue) == 0x000008, "Wrong alignment on BP_GorillaArm_Component_C_RemoveChargeFXCue");
static_assert(sizeof(BP_GorillaArm_Component_C_RemoveChargeFXCue) == 0x000040, "Wrong size on BP_GorillaArm_Component_C_RemoveChargeFXCue");
static_assert(offsetof(BP_GorillaArm_Component_C_RemoveChargeFXCue, Temp_byte_Variable) == 0x000000, "Member 'BP_GorillaArm_Component_C_RemoveChargeFXCue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_RemoveChargeFXCue, Temp_struct_Variable) == 0x000004, "Member 'BP_GorillaArm_Component_C_RemoveChargeFXCue::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_RemoveChargeFXCue, Temp_struct_Variable_1) == 0x00000C, "Member 'BP_GorillaArm_Component_C_RemoveChargeFXCue::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_RemoveChargeFXCue, Temp_struct_Variable_2) == 0x000014, "Member 'BP_GorillaArm_Component_C_RemoveChargeFXCue::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_RemoveChargeFXCue, CallFunc_GetLimbAbility_ReturnValue) == 0x000020, "Member 'BP_GorillaArm_Component_C_RemoveChargeFXCue::CallFunc_GetLimbAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_RemoveChargeFXCue, CallFunc_GetLimbAbility_ReturnValue_1) == 0x000028, "Member 'BP_GorillaArm_Component_C_RemoveChargeFXCue::CallFunc_GetLimbAbility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_RemoveChargeFXCue, CallFunc_GetCurrentCharges_ReturnValue) == 0x000030, "Member 'BP_GorillaArm_Component_C_RemoveChargeFXCue::CallFunc_GetCurrentCharges_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_RemoveChargeFXCue, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'BP_GorillaArm_Component_C_RemoveChargeFXCue::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_Component_C_RemoveChargeFXCue, K2Node_Select_Default) == 0x000038, "Member 'BP_GorillaArm_Component_C_RemoveChargeFXCue::K2Node_Select_Default' has a wrong offset!");

// Function BP_GorillaArm_Component.BP_GorillaArm_Component_C.RemovePassiveFXCue
// 0x0038 (0x0038 - 0x0000)
struct BP_GorillaArm_Component_C_RemovePassiveFXCue final
{
public:
	EGzLimbType                                   Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65E3[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65E4[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue;               // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65E5[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_Component_C_RemovePassiveFXCue) == 0x000008, "Wrong alignment on BP_GorillaArm_Component_C_RemovePassiveFXCue");
static_assert(sizeof(BP_GorillaArm_Component_C_RemovePassiveFXCue) == 0x000038, "Wrong size on BP_GorillaArm_Component_C_RemovePassiveFXCue");
