#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GamepadVerticalAimSens_DS

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GamepadVerticalAimSens_DS.BP_GamepadVerticalAimSens_DS_C.ExecuteUbergraph_BP_GamepadVerticalAimSens_DS
// 0x0020 (0x0020 - 0x0000)
struct BP_GamepadVerticalAimSens_DS_C_ExecuteUbergraph_BP_GamepadVerticalAimSens_DS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5106[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzGameUserSettings*                    CallFunc_GetUserSettings_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_NewValue;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGamepadVerticalAimSensitivityScale_InGamepadVerticalAimSensitivityScaleFactor_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GamepadVerticalAimSens_DS_C_ExecuteUbergraph_BP_GamepadVerticalAimSens_DS) == 0x000008, "Wrong alignment on BP_GamepadVerticalAimSens_DS_C_ExecuteUbergraph_BP_GamepadVerticalAimSens_DS");
static_assert(sizeof(BP_GamepadVerticalAimSens_DS_C_ExecuteUbergraph_BP_GamepadVerticalAimSens_DS) == 0x000020, "Wrong size on BP_GamepadVerticalAimSens_DS_C_ExecuteUbergraph_BP_GamepadVerticalAimSens_DS");
static_assert(offsetof(BP_GamepadVerticalAimSens_DS_C_ExecuteUbergraph_BP_GamepadVerticalAimSens_DS, EntryPoint) == 0x000000, "Member 'BP_GamepadVerticalAimSens_DS_C_ExecuteUbergraph_BP_GamepadVerticalAimSens_DS::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GamepadVerticalAimSens_DS_C_ExecuteUbergraph_BP_GamepadVerticalAimSens_DS, CallFunc_GetUserSettings_ReturnValue) == 0x000008, "Member 'BP_GamepadVerticalAimSens_DS_C_ExecuteUbergraph_BP_GamepadVerticalAimSens_DS::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GamepadVerticalAimSens_DS_C_ExecuteUbergraph_BP_GamepadVerticalAimSens_DS, K2Node_Event_NewValue) == 0x000010, "Member 'BP_GamepadVerticalAimSens_DS_C_ExecuteUbergraph_BP_GamepadVerticalAimSens_DS::K2Node_Event_NewValue' has a wrong offset!");
static_assert(offsetof(BP_GamepadVerticalAimSens_DS_C_ExecuteUbergraph_BP_GamepadVerticalAimSens_DS, CallFunc_SetGamepadVerticalAimSensitivityScale_InGamepadVerticalAimSensitivityScaleFactor_ImplicitCast) == 0x000018, "Member 'BP_GamepadVerticalAimSens_DS_C_ExecuteUbergraph_BP_GamepadVerticalAimSens_DS::CallFunc_SetGamepadVerticalAimSensitivityScale_InGamepadVerticalAimSensitivityScaleFactor_ImplicitCast' has a wrong offset!");

// Function BP_GamepadVerticalAimSens_DS.BP_GamepadVerticalAimSens_DS_C.GetValue
// 0x0020 (0x0020 - 0x0000)
struct BP_GamepadVerticalAimSens_DS_C_GetValue final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzGameUserSettings*                    CallFunc_GetUserSettings_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGamepadVerticalAimSensitivityScale_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5107[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GamepadVerticalAimSens_DS_C_GetValue) == 0x000008, "Wrong alignment on BP_GamepadVerticalAimSens_DS_C_GetValue");
static_assert(sizeof(BP_GamepadVerticalAimSens_DS_C_GetValue) == 0x000020, "Wrong size on BP_GamepadVerticalAimSens_DS_C_GetValue");
static_assert(offsetof(BP_GamepadVerticalAimSens_DS_C_GetValue, ReturnValue) == 0x000000, "Member 'BP_GamepadVerticalAimSens_DS_C_GetValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GamepadVerticalAimSens_DS_C_GetValue, CallFunc_GetUserSettings_ReturnValue) == 0x000008, "Member 'BP_GamepadVerticalAimSens_DS_C_GetValue::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GamepadVerticalAimSens_DS_C_GetValue, CallFunc_GetGamepadVerticalAimSensitivityScale_ReturnValue) == 0x000010, "Member 'BP_GamepadVerticalAimSens_DS_C_GetValue::CallFunc_GetGamepadVerticalAimSensitivityScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GamepadVerticalAimSens_DS_C_GetValue, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000018, "Member 'BP_GamepadVerticalAimSens_DS_C_GetValue::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function BP_GamepadVerticalAimSens_DS.BP_GamepadVerticalAimSens_DS_C.SetValue
// 0x0008 (0x0008 - 0x0000)
struct BP_GamepadVerticalAimSens_DS_C_SetValue final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GamepadVerticalAimSens_DS_C_SetValue) == 0x000008, "Wrong alignment on BP_GamepadVerticalAimSens_DS_C_SetValue");
static_assert(sizeof(BP_GamepadVerticalAimSens_DS_C_SetValue) == 0x000008, "Wrong size on BP_GamepadVerticalAimSens_DS_C_SetValue");
static_assert(offsetof(BP_GamepadVerticalAimSens_DS_C_SetValue, NewValue) == 0x000000, "Member 'BP_GamepadVerticalAimSens_DS_C_SetValue::NewValue' has a wrong offset!");

}

