#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GiveEffectZone

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_GiveEffectZone.BP_GiveEffectZone_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_GiveEffectZone_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GiveEffectZone_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_GiveEffectZone_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_GiveEffectZone_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_GiveEffectZone_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_GiveEffectZone_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_GiveEffectZone_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_GiveEffectZone.BP_GiveEffectZone_C.ExecuteUbergraph_BP_GiveEffectZone
// 0x0068 (0x0068 - 0x0000)
struct BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6673[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6674[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6675[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6676[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0040(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone) == 0x000008, "Wrong alignment on BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone");
static_assert(sizeof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone) == 0x000068, "Wrong size on BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, EntryPoint) == 0x000000, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, K2Node_Event_OtherActor) == 0x000008, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000018, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, CallFunc_IsValid_ReturnValue_2) == 0x000022, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, CallFunc_IsValid_ReturnValue_3) == 0x000023, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000024, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, CallFunc_IsValid_ReturnValue_4) == 0x000025, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, K2Node_CustomEvent_Actor) == 0x000028, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000030, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, CallFunc_IsValid_ReturnValue_5) == 0x000038, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, CallFunc_MakeEffectContext_ReturnValue) == 0x000040, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000058, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone, CallFunc_Delay_Duration_ImplicitCast) == 0x000060, "Member 'BP_GiveEffectZone_C_ExecuteUbergraph_BP_GiveEffectZone::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function BP_GiveEffectZone.BP_GiveEffectZone_C.ApplyEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_GiveEffectZone_C_ApplyEffect final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GiveEffectZone_C_ApplyEffect) == 0x000008, "Wrong alignment on BP_GiveEffectZone_C_ApplyEffect");
static_assert(sizeof(BP_GiveEffectZone_C_ApplyEffect) == 0x000008, "Wrong size on BP_GiveEffectZone_C_ApplyEffect");
static_assert(offsetof(BP_GiveEffectZone_C_ApplyEffect, Actor) == 0x000000, "Member 'BP_GiveEffectZone_C_ApplyEffect::Actor' has a wrong offset!");

}

