#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GridShield_TagHandler

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "G01_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_GridShield_TagHandler.BP_GridShield_TagHandler_C.IsGridshieldBackpackEquipped
// 0x0070 (0x0070 - 0x0000)
struct BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped final
{
public:
	class AActor*                                 InOwner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62AD[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x000C(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62AE[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  K2Node_DynamicCast_AsBP_Player_Character;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62AF[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzInvComponent*                        CallFunc_GetInventoryComponent_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0030(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGzInvPocket                           CallFunc_GetPocketByItemType_ReturnValue;          // 0x0038(0x0028)(ConstParm)
	float                                         CallFunc_GetDefaultAttributeFromItemByTag_ReturnValue; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62B0[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped) == 0x000008, "Wrong alignment on BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped");
static_assert(sizeof(BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped) == 0x000070, "Wrong size on BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped");
static_assert(offsetof(BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped, InOwner) == 0x000000, "Member 'BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped::InOwner' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped, ReturnValue) == 0x000008, "Member 'BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped, Temp_struct_Variable) == 0x00000C, "Member 'BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped, K2Node_DynamicCast_AsBP_Player_Character) == 0x000018, "Member 'BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped::K2Node_DynamicCast_AsBP_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped, CallFunc_GetInventoryComponent_ReturnValue) == 0x000028, "Member 'BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped::CallFunc_GetInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped, Temp_struct_Variable_1) == 0x000030, "Member 'BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped, CallFunc_GetPocketByItemType_ReturnValue) == 0x000038, "Member 'BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped::CallFunc_GetPocketByItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped, CallFunc_GetDefaultAttributeFromItemByTag_ReturnValue) == 0x000060, "Member 'BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped::CallFunc_GetDefaultAttributeFromItemByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000064, "Member 'BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'BP_GridShield_TagHandler_C_IsGridshieldBackpackEquipped::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_GridShield_TagHandler.BP_GridShield_TagHandler_C.OnTagCountChanged
// 0x0078 (0x0078 - 0x0000)
struct BP_GridShield_TagHandler_C_OnTagCountChanged final
{
public:
	class UGzAbilitySystemComponent*              Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62B1[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GridArmorValueCache;                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ActorCache;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0040(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  K2Node_DynamicCast_AsBP_Player_Character;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62B2[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  K2Node_DynamicCast_AsBP_Player_Character_1;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGridshieldBackpackEquipped_ReturnValue; // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62B3[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GridShield_TagHandler_C_OnTagCountChanged) == 0x000008, "Wrong alignment on BP_GridShield_TagHandler_C_OnTagCountChanged");
static_assert(sizeof(BP_GridShield_TagHandler_C_OnTagCountChanged) == 0x000078, "Wrong size on BP_GridShield_TagHandler_C_OnTagCountChanged");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, Target) == 0x000000, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::Target' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, Tag) == 0x000008, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::Tag' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, Count) == 0x000010, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::Count' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, GridArmorValueCache) == 0x000018, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::GridArmorValueCache' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, ActorCache) == 0x000020, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::ActorCache' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, Temp_delegate_Variable) == 0x000028, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, Temp_delegate_Variable_1) == 0x000040, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, K2Node_DynamicCast_AsBP_Player_Character) == 0x000050, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::K2Node_DynamicCast_AsBP_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, K2Node_DynamicCast_AsBP_Player_Character_1) == 0x000060, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::K2Node_DynamicCast_AsBP_Player_Character_1' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, CallFunc_IsGridshieldBackpackEquipped_ReturnValue) == 0x000069, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::CallFunc_IsGridshieldBackpackEquipped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00006A, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, CallFunc_Conv_IntToBool_ReturnValue) == 0x00006B, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, CallFunc_PostEvent_ReturnValue) == 0x00006C, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, CallFunc_BooleanAND_ReturnValue) == 0x000070, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, CallFunc_BooleanAND_ReturnValue_1) == 0x000071, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GridShield_TagHandler_C_OnTagCountChanged, CallFunc_PostEvent_ReturnValue_1) == 0x000074, "Member 'BP_GridShield_TagHandler_C_OnTagCountChanged::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");

}

