#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GiveImpulseEffect

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_GiveImpulseEffect.BP_GiveImpulseEffect_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_GiveImpulseEffect_C_UserConstructionScript final
{
public:
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0010)()
};
static_assert(alignof(BP_GiveImpulseEffect_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_GiveImpulseEffect_C_UserConstructionScript");
static_assert(sizeof(BP_GiveImpulseEffect_C_UserConstructionScript) == 0x000020, "Wrong size on BP_GiveImpulseEffect_C_UserConstructionScript");
static_assert(offsetof(BP_GiveImpulseEffect_C_UserConstructionScript, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000000, "Member 'BP_GiveImpulseEffect_C_UserConstructionScript::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GiveImpulseEffect_C_UserConstructionScript, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'BP_GiveImpulseEffect_C_UserConstructionScript::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function BP_GiveImpulseEffect.BP_GiveImpulseEffect_C.ExecuteUbergraph_BP_GiveImpulseEffect
// 0x00D0 (0x00D0 - 0x0000)
struct BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47CF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAbilitySystemComponent*              K2Node_DynamicCast_AsGz_Ability_System_Component;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47D0[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, float>              K2Node_MakeMap_Map;                                // 0x0040(0x0050)(ConstParm)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue; // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeMap_Value_0_ImplicitCast;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect) == 0x000008, "Wrong alignment on BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect");
static_assert(sizeof(BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect) == 0x0000D0, "Wrong size on BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect");
static_assert(offsetof(BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect, EntryPoint) == 0x000000, "Member 'BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect, K2Node_Event_Actor) == 0x000008, "Member 'BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000028, "Member 'BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect, K2Node_DynamicCast_AsGz_Ability_System_Component) == 0x000030, "Member 'BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect::K2Node_DynamicCast_AsGz_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect, K2Node_MakeMap_Map) == 0x000040, "Member 'BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect, CallFunc_GetForwardVector_ReturnValue) == 0x000090, "Member 'BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect, CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue) == 0x0000C0, "Member 'BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect::CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect, K2Node_MakeMap_Value_0_ImplicitCast) == 0x0000C8, "Member 'BP_GiveImpulseEffect_C_ExecuteUbergraph_BP_GiveImpulseEffect::K2Node_MakeMap_Value_0_ImplicitCast' has a wrong offset!");

// Function BP_GiveImpulseEffect.BP_GiveImpulseEffect_C.ApplyEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_GiveImpulseEffect_C_ApplyEffect final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GiveImpulseEffect_C_ApplyEffect) == 0x000008, "Wrong alignment on BP_GiveImpulseEffect_C_ApplyEffect");
static_assert(sizeof(BP_GiveImpulseEffect_C_ApplyEffect) == 0x000008, "Wrong size on BP_GiveImpulseEffect_C_ApplyEffect");
static_assert(offsetof(BP_GiveImpulseEffect_C_ApplyEffect, Actor) == 0x000000, "Member 'BP_GiveImpulseEffect_C_ApplyEffect::Actor' has a wrong offset!");

}

