#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GorillaArm_GroundPreview

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GorillaArm_GroundPreview.BP_GorillaArm_GroundPreview_C.ExecuteUbergraph_BP_GorillaArm_GroundPreview
// 0x0020 (0x0020 - 0x0000)
struct BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65CB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzChargeableAbilityComponent*          CallFunc_GetAbilityComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_GorillaArm_Component_C*             K2Node_DynamicCast_AsBP_Gorilla_Arm_Component;     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview) == 0x000008, "Wrong alignment on BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview");
static_assert(sizeof(BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview) == 0x000020, "Wrong size on BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview");
static_assert(offsetof(BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview, EntryPoint) == 0x000000, "Member 'BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview, CallFunc_GetAbilityComponent_ReturnValue) == 0x000008, "Member 'BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview, K2Node_DynamicCast_AsBP_Gorilla_Arm_Component) == 0x000010, "Member 'BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview::K2Node_DynamicCast_AsBP_Gorilla_Arm_Component' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_GorillaArm_GroundPreview_C_ExecuteUbergraph_BP_GorillaArm_GroundPreview::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

