#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hideout_lights

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Hideout_lights.BP_Hideout_lights_C
// 0x00B8 (0x0358 - 0x02A0)
class ABP_Hideout_lights_C final : public AActor
{
public:
	class UChildActorComponent*                   SpotLight_16;                                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SpotLight_15;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SpotLight_14;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SpotLight_11;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SpotLight_12;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SpotLight_10;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   RectLight_59;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   RectLight_57;                                      // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   RectLight_52;                                      // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   RectLight_51;                                      // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   RectLight_50;                                      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   RectLight_48;                                      // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   RectLight_47;                                      // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   RectLight_42;                                      // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   RectLight_41;                                      // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SpotLight_4;                                       // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SpotLight_6;                                       // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SpotLight_7;                                       // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SpotLight_1;                                       // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SpotLight_3;                                       // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   RectLight_2;                                       // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   RectLight_1;                                       // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Hideout_lights_C">();
	}
	static class ABP_Hideout_lights_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Hideout_lights_C>();
	}
};
static_assert(alignof(ABP_Hideout_lights_C) == 0x000008, "Wrong alignment on ABP_Hideout_lights_C");
static_assert(sizeof(ABP_Hideout_lights_C) == 0x000358, "Wrong size on ABP_Hideout_lights_C");
static_assert(offsetof(ABP_Hideout_lights_C, SpotLight_16) == 0x0002A0, "Member 'ABP_Hideout_lights_C::SpotLight_16' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, SpotLight_15) == 0x0002A8, "Member 'ABP_Hideout_lights_C::SpotLight_15' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, SpotLight_14) == 0x0002B0, "Member 'ABP_Hideout_lights_C::SpotLight_14' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, SpotLight_11) == 0x0002B8, "Member 'ABP_Hideout_lights_C::SpotLight_11' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, SpotLight_12) == 0x0002C0, "Member 'ABP_Hideout_lights_C::SpotLight_12' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, SpotLight_10) == 0x0002C8, "Member 'ABP_Hideout_lights_C::SpotLight_10' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, RectLight_59) == 0x0002D0, "Member 'ABP_Hideout_lights_C::RectLight_59' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, RectLight_57) == 0x0002D8, "Member 'ABP_Hideout_lights_C::RectLight_57' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, RectLight_52) == 0x0002E0, "Member 'ABP_Hideout_lights_C::RectLight_52' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, RectLight_51) == 0x0002E8, "Member 'ABP_Hideout_lights_C::RectLight_51' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, RectLight_50) == 0x0002F0, "Member 'ABP_Hideout_lights_C::RectLight_50' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, RectLight_48) == 0x0002F8, "Member 'ABP_Hideout_lights_C::RectLight_48' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, RectLight_47) == 0x000300, "Member 'ABP_Hideout_lights_C::RectLight_47' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, RectLight_42) == 0x000308, "Member 'ABP_Hideout_lights_C::RectLight_42' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, RectLight_41) == 0x000310, "Member 'ABP_Hideout_lights_C::RectLight_41' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, SpotLight_4) == 0x000318, "Member 'ABP_Hideout_lights_C::SpotLight_4' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, SpotLight_6) == 0x000320, "Member 'ABP_Hideout_lights_C::SpotLight_6' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, SpotLight_7) == 0x000328, "Member 'ABP_Hideout_lights_C::SpotLight_7' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, SpotLight_1) == 0x000330, "Member 'ABP_Hideout_lights_C::SpotLight_1' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, SpotLight_3) == 0x000338, "Member 'ABP_Hideout_lights_C::SpotLight_3' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, RectLight_2) == 0x000340, "Member 'ABP_Hideout_lights_C::RectLight_2' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, RectLight_1) == 0x000348, "Member 'ABP_Hideout_lights_C::RectLight_1' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_lights_C, SharedRoot) == 0x000350, "Member 'ABP_Hideout_lights_C::SharedRoot' has a wrong offset!");

}

