#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HitFeedbackActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HitFeedbackActor.BP_HitFeedbackActor_C.ExecuteUbergraph_BP_HitFeedbackActor
// 0x0020 (0x0020 - 0x0000)
struct BP_HitFeedbackActor_C_ExecuteUbergraph_BP_HitFeedbackActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6702[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_DisplayDamage_C*                   K2Node_DynamicCast_AsWBP_Display_Damage;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HitFeedbackActor_C_ExecuteUbergraph_BP_HitFeedbackActor) == 0x000008, "Wrong alignment on BP_HitFeedbackActor_C_ExecuteUbergraph_BP_HitFeedbackActor");
static_assert(sizeof(BP_HitFeedbackActor_C_ExecuteUbergraph_BP_HitFeedbackActor) == 0x000020, "Wrong size on BP_HitFeedbackActor_C_ExecuteUbergraph_BP_HitFeedbackActor");
static_assert(offsetof(BP_HitFeedbackActor_C_ExecuteUbergraph_BP_HitFeedbackActor, EntryPoint) == 0x000000, "Member 'BP_HitFeedbackActor_C_ExecuteUbergraph_BP_HitFeedbackActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HitFeedbackActor_C_ExecuteUbergraph_BP_HitFeedbackActor, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000008, "Member 'BP_HitFeedbackActor_C_ExecuteUbergraph_BP_HitFeedbackActor::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HitFeedbackActor_C_ExecuteUbergraph_BP_HitFeedbackActor, K2Node_DynamicCast_AsWBP_Display_Damage) == 0x000010, "Member 'BP_HitFeedbackActor_C_ExecuteUbergraph_BP_HitFeedbackActor::K2Node_DynamicCast_AsWBP_Display_Damage' has a wrong offset!");
static_assert(offsetof(BP_HitFeedbackActor_C_ExecuteUbergraph_BP_HitFeedbackActor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_HitFeedbackActor_C_ExecuteUbergraph_BP_HitFeedbackActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

