#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HideoutPlayerCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PlayerCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HideoutPlayerCharacter.BP_HideoutPlayerCharacter_C
// 0x0020 (0x1C30 - 0x1C10)
class ABP_HideoutPlayerCharacter_C final : public ABP_PlayerCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_HideoutPlayerCharacter_C;        // 0x1C10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Lobby_Username_Component_C*        WBP_Lobby_Username_Component;                      // 0x1C18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInsideSpecificLoadoutCustomization;             // 0x1C20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HideoutPlayerCharacter(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HideoutPlayerCharacter_C">();
	}
	static class ABP_HideoutPlayerCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HideoutPlayerCharacter_C>();
	}
};
static_assert(alignof(ABP_HideoutPlayerCharacter_C) == 0x000010, "Wrong alignment on ABP_HideoutPlayerCharacter_C");
static_assert(sizeof(ABP_HideoutPlayerCharacter_C) == 0x001C30, "Wrong size on ABP_HideoutPlayerCharacter_C");
static_assert(offsetof(ABP_HideoutPlayerCharacter_C, UberGraphFrame_BP_HideoutPlayerCharacter_C) == 0x001C10, "Member 'ABP_HideoutPlayerCharacter_C::UberGraphFrame_BP_HideoutPlayerCharacter_C' has a wrong offset!");
static_assert(offsetof(ABP_HideoutPlayerCharacter_C, WBP_Lobby_Username_Component) == 0x001C18, "Member 'ABP_HideoutPlayerCharacter_C::WBP_Lobby_Username_Component' has a wrong offset!");
static_assert(offsetof(ABP_HideoutPlayerCharacter_C, bIsInsideSpecificLoadoutCustomization) == 0x001C20, "Member 'ABP_HideoutPlayerCharacter_C::bIsInsideSpecificLoadoutCustomization' has a wrong offset!");

}

