#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HEX_Extractor

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateWidgets
// 0x0028 (0x0028 - 0x0000)
struct BP_HEX_Extractor_C_UpdateWidgets final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C85[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HEX_DiegeticWidget_Parent_C*       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C86[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateWidgets) == 0x000008, "Wrong alignment on BP_HEX_Extractor_C_UpdateWidgets");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateWidgets) == 0x000028, "Wrong size on BP_HEX_Extractor_C_UpdateWidgets");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateWidgets, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateWidgets, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_HEX_Extractor_C_UpdateWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_HEX_Extractor_C_UpdateWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateWidgets, CallFunc_IsDedicatedServer_ReturnValue) == 0x00000C, "Member 'BP_HEX_Extractor_C_UpdateWidgets::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateWidgets, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_HEX_Extractor_C_UpdateWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateWidgets, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BP_HEX_Extractor_C_UpdateWidgets::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateWidgets, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_HEX_Extractor_C_UpdateWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_HEX_Extractor_C_UpdateWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdatePauseStateClient
// 0x0002 (0x0002 - 0x0000)
struct BP_HEX_Extractor_C_UpdatePauseStateClient final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdatePauseStateClient) == 0x000001, "Wrong alignment on BP_HEX_Extractor_C_UpdatePauseStateClient");
static_assert(sizeof(BP_HEX_Extractor_C_UpdatePauseStateClient) == 0x000002, "Wrong size on BP_HEX_Extractor_C_UpdatePauseStateClient");
static_assert(offsetof(BP_HEX_Extractor_C_UpdatePauseStateClient, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdatePauseStateClient::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdatePauseStateClient, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_HEX_Extractor_C_UpdatePauseStateClient::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateOpenedState
// 0x0006 (0x0006 - 0x0000)
struct BP_HEX_Extractor_C_UpdateOpenedState final
{
public:
	bool                                          ThereArePlayers;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNoneState_bNoneState;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateOpenedState) == 0x000001, "Wrong alignment on BP_HEX_Extractor_C_UpdateOpenedState");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateOpenedState) == 0x000006, "Wrong size on BP_HEX_Extractor_C_UpdateOpenedState");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateOpenedState, ThereArePlayers) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateOpenedState::ThereArePlayers' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateOpenedState, CallFunc_IsNoneState_bNoneState) == 0x000001, "Member 'BP_HEX_Extractor_C_UpdateOpenedState::CallFunc_IsNoneState_bNoneState' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateOpenedState, CallFunc_HasAuthority_ReturnValue) == 0x000002, "Member 'BP_HEX_Extractor_C_UpdateOpenedState::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateOpenedState, CallFunc_Array_IsEmpty_ReturnValue) == 0x000003, "Member 'BP_HEX_Extractor_C_UpdateOpenedState::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateOpenedState, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'BP_HEX_Extractor_C_UpdateOpenedState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateOpenedState, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000005, "Member 'BP_HEX_Extractor_C_UpdateOpenedState::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateMeshDynamicMaterial
// 0x0018 (0x0018 - 0x0000)
struct BP_HEX_Extractor_C_UpdateMeshDynamicMaterial final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C87[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C88[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateMeshDynamicMaterial) == 0x000008, "Wrong alignment on BP_HEX_Extractor_C_UpdateMeshDynamicMaterial");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateMeshDynamicMaterial) == 0x000018, "Wrong size on BP_HEX_Extractor_C_UpdateMeshDynamicMaterial");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateMeshDynamicMaterial, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateMeshDynamicMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateMeshDynamicMaterial, CallFunc_IsDedicatedServer_ReturnValue) == 0x000001, "Member 'BP_HEX_Extractor_C_UpdateMeshDynamicMaterial::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateMeshDynamicMaterial, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_HEX_Extractor_C_UpdateMeshDynamicMaterial::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateMeshDynamicMaterial, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_HEX_Extractor_C_UpdateMeshDynamicMaterial::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateMeshDynamicMaterial, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000014, "Member 'BP_HEX_Extractor_C_UpdateMeshDynamicMaterial::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateInteractableComponentActiveState
// 0x0004 (0x0004 - 0x0000)
struct BP_HEX_Extractor_C_UpdateInteractableComponentActiveState final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateInteractableComponentActiveState) == 0x000001, "Wrong alignment on BP_HEX_Extractor_C_UpdateInteractableComponentActiveState");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateInteractableComponentActiveState) == 0x000004, "Wrong size on BP_HEX_Extractor_C_UpdateInteractableComponentActiveState");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateInteractableComponentActiveState, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateInteractableComponentActiveState::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateInteractableComponentActiveState, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_HEX_Extractor_C_UpdateInteractableComponentActiveState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateInteractableComponentActiveState, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BP_HEX_Extractor_C_UpdateInteractableComponentActiveState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateInteractableComponentActiveState, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'BP_HEX_Extractor_C_UpdateInteractableComponentActiveState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateHexMeshVisibilityFromCurrentHex
// 0x0020 (0x0020 - 0x0000)
struct BP_HEX_Extractor_C_UpdateHexMeshVisibilityFromCurrentHex final
{
public:
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C89[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateHexMeshVisibilityFromCurrentHex) == 0x000008, "Wrong alignment on BP_HEX_Extractor_C_UpdateHexMeshVisibilityFromCurrentHex");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateHexMeshVisibilityFromCurrentHex) == 0x000020, "Wrong size on BP_HEX_Extractor_C_UpdateHexMeshVisibilityFromCurrentHex");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexMeshVisibilityFromCurrentHex, K2Node_DynamicCast_AsGz_Player_Character) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateHexMeshVisibilityFromCurrentHex::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexMeshVisibilityFromCurrentHex, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'BP_HEX_Extractor_C_UpdateHexMeshVisibilityFromCurrentHex::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexMeshVisibilityFromCurrentHex, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_HEX_Extractor_C_UpdateHexMeshVisibilityFromCurrentHex::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexMeshVisibilityFromCurrentHex, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_HEX_Extractor_C_UpdateHexMeshVisibilityFromCurrentHex::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateHexMeshVisibility
// 0x0018 (0x0018 - 0x0000)
struct BP_HEX_Extractor_C_UpdateHexMeshVisibility final
{
public:
	class UGzItemData*                            CallFunc_GetCurrentHexItemData_CurrentHexItemData; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzItemData*                            CallFunc_GetCurrentHexItemData_CurrentHexItemData_1; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasHexInside_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateHexMeshVisibility) == 0x000008, "Wrong alignment on BP_HEX_Extractor_C_UpdateHexMeshVisibility");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateHexMeshVisibility) == 0x000018, "Wrong size on BP_HEX_Extractor_C_UpdateHexMeshVisibility");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexMeshVisibility, CallFunc_GetCurrentHexItemData_CurrentHexItemData) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateHexMeshVisibility::CallFunc_GetCurrentHexItemData_CurrentHexItemData' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexMeshVisibility, CallFunc_GetCurrentHexItemData_CurrentHexItemData_1) == 0x000008, "Member 'BP_HEX_Extractor_C_UpdateHexMeshVisibility::CallFunc_GetCurrentHexItemData_CurrentHexItemData_1' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexMeshVisibility, CallFunc_HasHexInside_ReturnValue) == 0x000010, "Member 'BP_HEX_Extractor_C_UpdateHexMeshVisibility::CallFunc_HasHexInside_ReturnValue' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateHexInsideWidgetsState
// 0x0028 (0x0028 - 0x0000)
struct BP_HEX_Extractor_C_UpdateHexInsideWidgetsState final
{
public:
	class UGzItemData*                            ItemData;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasHexInside_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C8A[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HEX_DiegeticWidget_Parent_C*       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateHexInsideWidgetsState) == 0x000008, "Wrong alignment on BP_HEX_Extractor_C_UpdateHexInsideWidgetsState");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateHexInsideWidgetsState) == 0x000028, "Wrong size on BP_HEX_Extractor_C_UpdateHexInsideWidgetsState");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexInsideWidgetsState, ItemData) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateHexInsideWidgetsState::ItemData' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexInsideWidgetsState, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_HEX_Extractor_C_UpdateHexInsideWidgetsState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexInsideWidgetsState, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_HEX_Extractor_C_UpdateHexInsideWidgetsState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexInsideWidgetsState, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_HEX_Extractor_C_UpdateHexInsideWidgetsState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexInsideWidgetsState, CallFunc_HasHexInside_ReturnValue) == 0x000014, "Member 'BP_HEX_Extractor_C_UpdateHexInsideWidgetsState::CallFunc_HasHexInside_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexInsideWidgetsState, CallFunc_IsValid_ReturnValue) == 0x000015, "Member 'BP_HEX_Extractor_C_UpdateHexInsideWidgetsState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexInsideWidgetsState, CallFunc_BooleanAND_ReturnValue) == 0x000016, "Member 'BP_HEX_Extractor_C_UpdateHexInsideWidgetsState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexInsideWidgetsState, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_HEX_Extractor_C_UpdateHexInsideWidgetsState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexInsideWidgetsState, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_HEX_Extractor_C_UpdateHexInsideWidgetsState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateHexInsideWidgetsState, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_HEX_Extractor_C_UpdateHexInsideWidgetsState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateExtractionTimerForUnpausedExtraction
// 0x0001 (0x0001 - 0x0000)
struct BP_HEX_Extractor_C_UpdateExtractionTimerForUnpausedExtraction final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateExtractionTimerForUnpausedExtraction) == 0x000001, "Wrong alignment on BP_HEX_Extractor_C_UpdateExtractionTimerForUnpausedExtraction");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateExtractionTimerForUnpausedExtraction) == 0x000001, "Wrong size on BP_HEX_Extractor_C_UpdateExtractionTimerForUnpausedExtraction");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForUnpausedExtraction, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForUnpausedExtraction::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateExtractionTimerForStartedExtraction
// 0x0030 (0x0030 - 0x0000)
struct BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C8B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTotalExtractionTime_NewParam;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction) == 0x000008, "Wrong alignment on BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction) == 0x000030, "Wrong size on BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction, CallFunc_GetTotalExtractionTime_NewParam) == 0x000008, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction::CallFunc_GetTotalExtractionTime_NewParam' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000028, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForStartedExtraction::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateExtractionTimerForRestoredExtraction
// 0x0030 (0x0030 - 0x0000)
struct BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C8C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRemainedTimeForExtraction_RemainedTime; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction) == 0x000008, "Wrong alignment on BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction) == 0x000030, "Wrong size on BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction, CallFunc_GetRemainedTimeForExtraction_RemainedTime) == 0x000008, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction::CallFunc_GetRemainedTimeForExtraction_RemainedTime' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000028, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForRestoredExtraction::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateExtractionTimerForPausedExtraction
// 0x0001 (0x0001 - 0x0000)
struct BP_HEX_Extractor_C_UpdateExtractionTimerForPausedExtraction final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateExtractionTimerForPausedExtraction) == 0x000001, "Wrong alignment on BP_HEX_Extractor_C_UpdateExtractionTimerForPausedExtraction");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateExtractionTimerForPausedExtraction) == 0x000001, "Wrong size on BP_HEX_Extractor_C_UpdateExtractionTimerForPausedExtraction");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForPausedExtraction, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForPausedExtraction::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateExtractionTimerForHackedExtraction
// 0x0030 (0x0030 - 0x0000)
struct BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C8D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRemainedTimeForHackedExtraction_RemainedTime; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction) == 0x000008, "Wrong alignment on BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction) == 0x000030, "Wrong size on BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction, CallFunc_GetRemainedTimeForHackedExtraction_RemainedTime) == 0x000008, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction::CallFunc_GetRemainedTimeForHackedExtraction_RemainedTime' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000028, "Member 'BP_HEX_Extractor_C_UpdateExtractionTimerForHackedExtraction::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateExtractionStateClient
// 0x0018 (0x0018 - 0x0000)
struct BP_HEX_Extractor_C_UpdateExtractionStateClient final
{
public:
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C8E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateExtractionStateClient) == 0x000004, "Wrong alignment on BP_HEX_Extractor_C_UpdateExtractionStateClient");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateExtractionStateClient) == 0x000018, "Wrong size on BP_HEX_Extractor_C_UpdateExtractionStateClient");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionStateClient, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateExtractionStateClient::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionStateClient, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_HEX_Extractor_C_UpdateExtractionStateClient::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionStateClient, CallFunc_IsDedicatedServer_ReturnValue) == 0x000014, "Member 'BP_HEX_Extractor_C_UpdateExtractionStateClient::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionStateClient, CallFunc_Not_PreBool_ReturnValue) == 0x000015, "Member 'BP_HEX_Extractor_C_UpdateExtractionStateClient::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateExtractionProgressTime
// 0x0038 (0x0038 - 0x0000)
struct BP_HEX_Extractor_C_UpdateExtractionProgressTime final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetProgressSpeed_NewParam;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C8F[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C90[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateExtractionProgressTime) == 0x000008, "Wrong alignment on BP_HEX_Extractor_C_UpdateExtractionProgressTime");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateExtractionProgressTime) == 0x000038, "Wrong size on BP_HEX_Extractor_C_UpdateExtractionProgressTime");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionProgressTime, DeltaTime) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateExtractionProgressTime::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionProgressTime, CallFunc_GetProgressSpeed_NewParam) == 0x000008, "Member 'BP_HEX_Extractor_C_UpdateExtractionProgressTime::CallFunc_GetProgressSpeed_NewParam' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionProgressTime, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'BP_HEX_Extractor_C_UpdateExtractionProgressTime::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionProgressTime, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_HEX_Extractor_C_UpdateExtractionProgressTime::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionProgressTime, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_HEX_Extractor_C_UpdateExtractionProgressTime::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionProgressTime, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_HEX_Extractor_C_UpdateExtractionProgressTime::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateExtractionProgressTime, CallFunc_FClamp_ReturnValue) == 0x000030, "Member 'BP_HEX_Extractor_C_UpdateExtractionProgressTime::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateDynamicMaterialColor
// 0x0014 (0x0014 - 0x0000)
struct BP_HEX_Extractor_C_UpdateDynamicMaterialColor final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHackingState_Value;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C91[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateDynamicMaterialColor) == 0x000004, "Wrong alignment on BP_HEX_Extractor_C_UpdateDynamicMaterialColor");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateDynamicMaterialColor) == 0x000014, "Wrong size on BP_HEX_Extractor_C_UpdateDynamicMaterialColor");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDynamicMaterialColor, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateDynamicMaterialColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDynamicMaterialColor, CallFunc_IsHackingState_Value) == 0x000001, "Member 'BP_HEX_Extractor_C_UpdateDynamicMaterialColor::CallFunc_IsHackingState_Value' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDynamicMaterialColor, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'BP_HEX_Extractor_C_UpdateDynamicMaterialColor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UpdateDiegeticWidgetExtractionState
// 0x0048 (0x0048 - 0x0000)
struct BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C92[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetProgressSpeed_NewParam;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C93[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_HEX_DiegeticWidget_Parent_C*       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HEX_DiegeticWidget_Parent_C*       CallFunc_Array_Get_Item_1;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHackingState_Value;                     // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState) == 0x000008, "Wrong alignment on BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState");
static_assert(sizeof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState) == 0x000048, "Wrong size on BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, CallFunc_GetProgressSpeed_NewParam) == 0x000010, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::CallFunc_GetProgressSpeed_NewParam' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, CallFunc_Array_Length_ReturnValue_1) == 0x00003C, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, CallFunc_Less_IntInt_ReturnValue_1) == 0x000041, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState, CallFunc_IsHackingState_Value) == 0x000042, "Member 'BP_HEX_Extractor_C_UpdateDiegeticWidgetExtractionState::CallFunc_IsHackingState_Value' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UnpauseExtraction
// 0x0001 (0x0001 - 0x0000)
struct BP_HEX_Extractor_C_UnpauseExtraction final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UnpauseExtraction) == 0x000001, "Wrong alignment on BP_HEX_Extractor_C_UnpauseExtraction");
static_assert(sizeof(BP_HEX_Extractor_C_UnpauseExtraction) == 0x000001, "Wrong size on BP_HEX_Extractor_C_UnpauseExtraction");
static_assert(offsetof(BP_HEX_Extractor_C_UnpauseExtraction, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_HEX_Extractor_C_UnpauseExtraction::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.UnbindEventsOnExtractionEnded
// 0x0030 (0x0030 - 0x0000)
struct BP_HEX_Extractor_C_UnbindEventsOnExtractionEnded final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_UnbindEventsOnExtractionEnded) == 0x000004, "Wrong alignment on BP_HEX_Extractor_C_UnbindEventsOnExtractionEnded");
static_assert(sizeof(BP_HEX_Extractor_C_UnbindEventsOnExtractionEnded) == 0x000030, "Wrong size on BP_HEX_Extractor_C_UnbindEventsOnExtractionEnded");
static_assert(offsetof(BP_HEX_Extractor_C_UnbindEventsOnExtractionEnded, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_HEX_Extractor_C_UnbindEventsOnExtractionEnded::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UnbindEventsOnExtractionEnded, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'BP_HEX_Extractor_C_UnbindEventsOnExtractionEnded::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_UnbindEventsOnExtractionEnded, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'BP_HEX_Extractor_C_UnbindEventsOnExtractionEnded::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.TrySyncExtractionProgressForHackingState
// 0x0040 (0x0040 - 0x0000)
struct BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState final
{
public:
	double                                        CallFunc_GetProgressSpeed_NewParam;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerTimeWhenStateChanged_ExtractionProgressWhenStateChanged; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetExtractionProgressWhenStateChanged_ExtractionProgressWhenStateChanged; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHackingState_Value;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C94[0x1];                                     // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentTime_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState) == 0x000008, "Wrong alignment on BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState");
static_assert(sizeof(BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState) == 0x000040, "Wrong size on BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState");
static_assert(offsetof(BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState, CallFunc_GetProgressSpeed_NewParam) == 0x000000, "Member 'BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState::CallFunc_GetProgressSpeed_NewParam' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState, CallFunc_GetServerTimeWhenStateChanged_ExtractionProgressWhenStateChanged) == 0x000008, "Member 'BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState::CallFunc_GetServerTimeWhenStateChanged_ExtractionProgressWhenStateChanged' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState, CallFunc_GetExtractionProgressWhenStateChanged_ExtractionProgressWhenStateChanged) == 0x000010, "Member 'BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState::CallFunc_GetExtractionProgressWhenStateChanged_ExtractionProgressWhenStateChanged' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState, CallFunc_IsHackingState_Value) == 0x000019, "Member 'BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState::CallFunc_IsHackingState_Value' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState, CallFunc_GetCurrentTime_ReturnValue) == 0x00001C, "Member 'BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState::CallFunc_GetCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'BP_HEX_Extractor_C_TrySyncExtractionProgressForHackingState::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_HEX_Extractor.BP_HEX_Extractor_C.TrySyncExtractionProgressForExtractingState
// 0x0040 (0x0040 - 0x0000)
struct BP_HEX_Extractor_C_TrySyncExtractionProgressForExtractingState final
{
public:
	double                                        CallFunc_GetProgressSpeed_NewParam;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerTimeWhenStateChanged_ExtractionProgressWhenStateChanged; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetExtractionProgressWhenStateChanged_ExtractionProgressWhenStateChanged; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExtractingState_Value;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C95[0x1];                                     // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentTime_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HEX_Extractor_C_TrySyncExtractionProgressForExtractingState) == 0x000008, "Wrong alignment on BP_HEX_Extractor_C_TrySyncExtractionProgressForExtractingState");
static_assert(sizeof(BP_HEX_Extractor_C_TrySyncExtractionProgressForExtractingState) == 0x000040, "Wrong size on BP_HEX_Extractor_C_TrySyncExtractionProgressForExtractingState");
