#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableObject_PC_Tower

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "G01_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractableObject_PC_Tower.BP_InteractableObject_PC_Tower_C.BndEvt__BP_InteractableObject_PC_Tower_GzInteractable_K2Node_ComponentBoundEvent_1_GzOnInteract__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_InteractableObject_PC_Tower_C_BndEvt__BP_InteractableObject_PC_Tower_GzInteractable_K2Node_ComponentBoundEvent_1_GzOnInteract__DelegateSignature final
{
public:
	class AActor*                                 InteractedBy;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         Interactable;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableObject_PC_Tower_C_BndEvt__BP_InteractableObject_PC_Tower_GzInteractable_K2Node_ComponentBoundEvent_1_GzOnInteract__DelegateSignature) == 0x000008, "Wrong alignment on BP_InteractableObject_PC_Tower_C_BndEvt__BP_InteractableObject_PC_Tower_GzInteractable_K2Node_ComponentBoundEvent_1_GzOnInteract__DelegateSignature");
static_assert(sizeof(BP_InteractableObject_PC_Tower_C_BndEvt__BP_InteractableObject_PC_Tower_GzInteractable_K2Node_ComponentBoundEvent_1_GzOnInteract__DelegateSignature) == 0x000010, "Wrong size on BP_InteractableObject_PC_Tower_C_BndEvt__BP_InteractableObject_PC_Tower_GzInteractable_K2Node_ComponentBoundEvent_1_GzOnInteract__DelegateSignature");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_BndEvt__BP_InteractableObject_PC_Tower_GzInteractable_K2Node_ComponentBoundEvent_1_GzOnInteract__DelegateSignature, InteractedBy) == 0x000000, "Member 'BP_InteractableObject_PC_Tower_C_BndEvt__BP_InteractableObject_PC_Tower_GzInteractable_K2Node_ComponentBoundEvent_1_GzOnInteract__DelegateSignature::InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_BndEvt__BP_InteractableObject_PC_Tower_GzInteractable_K2Node_ComponentBoundEvent_1_GzOnInteract__DelegateSignature, Interactable) == 0x000008, "Member 'BP_InteractableObject_PC_Tower_C_BndEvt__BP_InteractableObject_PC_Tower_GzInteractable_K2Node_ComponentBoundEvent_1_GzOnInteract__DelegateSignature::Interactable' has a wrong offset!");

// Function BP_InteractableObject_PC_Tower.BP_InteractableObject_PC_Tower_C.CanScanOnAnyDistance
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractableObject_PC_Tower_C_CanScanOnAnyDistance final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableObject_PC_Tower_C_CanScanOnAnyDistance) == 0x000001, "Wrong alignment on BP_InteractableObject_PC_Tower_C_CanScanOnAnyDistance");
static_assert(sizeof(BP_InteractableObject_PC_Tower_C_CanScanOnAnyDistance) == 0x000001, "Wrong size on BP_InteractableObject_PC_Tower_C_CanScanOnAnyDistance");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_CanScanOnAnyDistance, ReturnValue) == 0x000000, "Member 'BP_InteractableObject_PC_Tower_C_CanScanOnAnyDistance::ReturnValue' has a wrong offset!");

// Function BP_InteractableObject_PC_Tower.BP_InteractableObject_PC_Tower_C.ExecuteUbergraph_BP_InteractableObject_PC_Tower
// 0x0230 (0x0230 - 0x0000)
struct BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_486A[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_486B[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_486C[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_InteractedBy;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         K2Node_ComponentBoundEvent_Interactable;           // 0x0038(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzMultiPartCharacter*                  K2Node_DynamicCast_AsGz_Multi_Part_Character;      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_486D[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewVisibility;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_486E[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	struct FGzDamageInstigatorData                K2Node_MakeStruct_GzDamageInstigatorData;          // 0x0088(0x0038)(NoDestructor)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x00C0(0x0010)(ReferenceParm)
	struct FGzAreaAttackParams                    K2Node_MakeStruct_GzAreaAttackParams;              // 0x00D0(0x00E0)()
	TArray<class AActor*>                         CallFunc_MakeAreaAttack_ReturnValue;               // 0x01B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_486F[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue_1;      // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4870[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4871[0x3];                                     // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x01F0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0200(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0218(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0228(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower) == 0x000008, "Wrong alignment on BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower");
static_assert(sizeof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower) == 0x000230, "Wrong size on BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, EntryPoint) == 0x000000, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, Temp_delegate_Variable) == 0x000008, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, Temp_bool_Variable) == 0x000018, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, Temp_delegate_Variable_1) == 0x00001C, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, K2Node_ComponentBoundEvent_InteractedBy) == 0x000030, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::K2Node_ComponentBoundEvent_InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, K2Node_ComponentBoundEvent_Interactable) == 0x000038, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, K2Node_DynamicCast_AsGz_Multi_Part_Character) == 0x000040, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::K2Node_DynamicCast_AsGz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000050, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, K2Node_CustomEvent_NewVisibility) == 0x000058, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::K2Node_CustomEvent_NewVisibility' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000060, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, K2Node_MakeStruct_GzDamageInstigatorData) == 0x000088, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::K2Node_MakeStruct_GzDamageInstigatorData' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, K2Node_MakeArray_Array_1) == 0x0000C0, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, K2Node_MakeStruct_GzAreaAttackParams) == 0x0000D0, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::K2Node_MakeStruct_GzAreaAttackParams' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_MakeAreaAttack_ReturnValue) == 0x0001B0, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_MakeAreaAttack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_HasAuthority_ReturnValue_1) == 0x0001C0, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x0001C4, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_PostAssociatedAkEvent_ReturnValue_1) == 0x0001C8, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_PostAssociatedAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, K2Node_CreateDelegate_OutputDelegate) == 0x0001CC, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001E0, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_HasAuthority_ReturnValue_2) == 0x0001E8, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_IsVisible_ReturnValue) == 0x0001E9, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_HasAuthority_ReturnValue_3) == 0x0001EA, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001EB, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_BooleanAND_ReturnValue) == 0x0001EC, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, Temp_delegate_Variable_2) == 0x0001F0, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, Temp_delegate_Variable_3) == 0x000200, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_PostEvent_ReturnValue) == 0x000210, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_PostEvent_ReturnValue_1) == 0x000214, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, K2Node_CreateDelegate_OutputDelegate_1) == 0x000218, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000228, "Member 'BP_InteractableObject_PC_Tower_C_ExecuteUbergraph_BP_InteractableObject_PC_Tower::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");

// Function BP_InteractableObject_PC_Tower.BP_InteractableObject_PC_Tower_C.ExplosivePlaceholderVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractableObject_PC_Tower_C_ExplosivePlaceholderVisibility final
{
public:
	bool                                          NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableObject_PC_Tower_C_ExplosivePlaceholderVisibility) == 0x000001, "Wrong alignment on BP_InteractableObject_PC_Tower_C_ExplosivePlaceholderVisibility");
static_assert(sizeof(BP_InteractableObject_PC_Tower_C_ExplosivePlaceholderVisibility) == 0x000001, "Wrong size on BP_InteractableObject_PC_Tower_C_ExplosivePlaceholderVisibility");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ExplosivePlaceholderVisibility, NewVisibility) == 0x000000, "Member 'BP_InteractableObject_PC_Tower_C_ExplosivePlaceholderVisibility::NewVisibility' has a wrong offset!");

// Function BP_InteractableObject_PC_Tower.BP_InteractableObject_PC_Tower_C.OnRep_TargetState
// 0x0002 (0x0002 - 0x0000)
struct BP_InteractableObject_PC_Tower_C_OnRep_TargetState final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableObject_PC_Tower_C_OnRep_TargetState) == 0x000001, "Wrong alignment on BP_InteractableObject_PC_Tower_C_OnRep_TargetState");
static_assert(sizeof(BP_InteractableObject_PC_Tower_C_OnRep_TargetState) == 0x000002, "Wrong size on BP_InteractableObject_PC_Tower_C_OnRep_TargetState");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_OnRep_TargetState, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_InteractableObject_PC_Tower_C_OnRep_TargetState::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_OnRep_TargetState, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_InteractableObject_PC_Tower_C_OnRep_TargetState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_InteractableObject_PC_Tower.BP_InteractableObject_PC_Tower_C.ResetDiskInsMeshesToDefault
// 0x00C0 (0x00C0 - 0x0000)
struct BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4872[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4873[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4874[0xC];                                     // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault) == 0x000010, "Wrong alignment on BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault");
static_assert(sizeof(BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault) == 0x0000C0, "Wrong size on BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault, Temp_int_Variable) == 0x000000, "Member 'BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault, CallFunc_AddInstance_ReturnValue) == 0x0000B0, "Member 'BP_InteractableObject_PC_Tower_C_ResetDiskInsMeshesToDefault::CallFunc_AddInstance_ReturnValue' has a wrong offset!");

// Function BP_InteractableObject_PC_Tower.BP_InteractableObject_PC_Tower_C.SetRandomDiskInstMeshes
// 0x0120 (0x0120 - 0x0000)
struct BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes final
{
public:
	int32                                         L_SelectedIndex;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4875[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        L_InstOffsetLocX;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      L_OffsetMinMaxValues;                              // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector2D>                      K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4876[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4877[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4878[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4879[0x8];                                     // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_487A[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Random_OutItem;                     // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_487B[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes) == 0x000010, "Wrong alignment on BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes");
static_assert(sizeof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes) == 0x000120, "Wrong size on BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, L_SelectedIndex) == 0x000000, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::L_SelectedIndex' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, L_InstOffsetLocX) == 0x000008, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::L_InstOffsetLocX' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, L_OffsetMinMaxValues) == 0x000010, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::L_OffsetMinMaxValues' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, K2Node_MakeArray_Array) == 0x000020, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, Temp_int_Variable) == 0x000030, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000048, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_AddInstance_ReturnValue) == 0x0000E0, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E4, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_BreakVector2D_X) == 0x0000E8, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_BreakVector2D_Y) == 0x0000F0, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_Array_Random_OutItem) == 0x0000F8, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_Array_Random_OutIndex) == 0x000108, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_RandomFloatInRange_ReturnValue) == 0x000110, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000118, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomDiskInstMeshes::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function BP_InteractableObject_PC_Tower.BP_InteractableObject_PC_Tower_C.SetRandomWireMeshes
// 0x0090 (0x0090 - 0x0000)
struct BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes final
{
public:
	TSoftObjectPtr<class UStaticMesh>             CallFunc_Array_Random_OutItem;                     // 0x0000(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_487C[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_487D[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             CallFunc_Array_Random_OutItem_1;                   // 0x0048(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_1;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_487E[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh_1;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes) == 0x000008, "Wrong alignment on BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes");
static_assert(sizeof(BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes) == 0x000090, "Wrong size on BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes, CallFunc_Array_Random_OutItem) == 0x000000, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes, CallFunc_Array_Random_OutIndex) == 0x000028, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000030, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes, K2Node_DynamicCast_AsStatic_Mesh) == 0x000038, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes, CallFunc_Array_Random_OutItem_1) == 0x000048, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes::CallFunc_Array_Random_OutItem_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes, CallFunc_Array_Random_OutIndex_1) == 0x000070, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes::CallFunc_Array_Random_OutIndex_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes, CallFunc_SetStaticMesh_ReturnValue) == 0x000074, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000078, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes, K2Node_DynamicCast_AsStatic_Mesh_1) == 0x000080, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes::K2Node_DynamicCast_AsStatic_Mesh_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000089, "Member 'BP_InteractableObject_PC_Tower_C_SetRandomWireMeshes::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");

// Function BP_InteractableObject_PC_Tower.BP_InteractableObject_PC_Tower_C.GetDefilerTargetType
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractableObject_PC_Tower_C_GetDefilerTargetType final
{
public:
	EGzDefilerTargetType                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableObject_PC_Tower_C_GetDefilerTargetType) == 0x000001, "Wrong alignment on BP_InteractableObject_PC_Tower_C_GetDefilerTargetType");
static_assert(sizeof(BP_InteractableObject_PC_Tower_C_GetDefilerTargetType) == 0x000001, "Wrong size on BP_InteractableObject_PC_Tower_C_GetDefilerTargetType");
static_assert(offsetof(BP_InteractableObject_PC_Tower_C_GetDefilerTargetType, ReturnValue) == 0x000000, "Member 'BP_InteractableObject_PC_Tower_C_GetDefilerTargetType::ReturnValue' has a wrong offset!");

}

