#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IndirectBounceCard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_IndirectBounceCard.BP_IndirectBounceCard_C
// 0x0028 (0x02C8 - 0x02A0)
class ABP_IndirectBounceCard_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   IndirectBounceCard;                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Card_Colour;                                       // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_IndirectBounceCard(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_IndirectBounceCard_C">();
	}
	static class ABP_IndirectBounceCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_IndirectBounceCard_C>();
	}
};
static_assert(alignof(ABP_IndirectBounceCard_C) == 0x000008, "Wrong alignment on ABP_IndirectBounceCard_C");
static_assert(sizeof(ABP_IndirectBounceCard_C) == 0x0002C8, "Wrong size on ABP_IndirectBounceCard_C");
static_assert(offsetof(ABP_IndirectBounceCard_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_IndirectBounceCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_IndirectBounceCard_C, IndirectBounceCard) == 0x0002A8, "Member 'ABP_IndirectBounceCard_C::IndirectBounceCard' has a wrong offset!");
static_assert(offsetof(ABP_IndirectBounceCard_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_IndirectBounceCard_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_IndirectBounceCard_C, Card_Colour) == 0x0002B8, "Member 'ABP_IndirectBounceCard_C::Card_Colour' has a wrong offset!");

}

