#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IsInteractionCaptured

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_IsInteractionCaptured.BP_IsInteractionCaptured_C.IsInteractionConditionPassed
// 0x0030 (0x0030 - 0x0000)
struct BP_IsInteractionCaptured_C_IsInteractionConditionPassed final
{
public:
	const class AGzCharacter*                     InteractedBy;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           InteractableOwner;                                 // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5705[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InteractionOwnersNum;                              // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzInteractableComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed) == 0x000008, "Wrong alignment on BP_IsInteractionCaptured_C_IsInteractionConditionPassed");
static_assert(sizeof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed) == 0x000030, "Wrong size on BP_IsInteractionCaptured_C_IsInteractionConditionPassed");
static_assert(offsetof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed, InteractedBy) == 0x000000, "Member 'BP_IsInteractionCaptured_C_IsInteractionConditionPassed::InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed, InteractableOwner) == 0x000008, "Member 'BP_IsInteractionCaptured_C_IsInteractionConditionPassed::InteractableOwner' has a wrong offset!");
static_assert(offsetof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed, ReturnValue) == 0x000010, "Member 'BP_IsInteractionCaptured_C_IsInteractionConditionPassed::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed, InteractionOwnersNum) == 0x000014, "Member 'BP_IsInteractionCaptured_C_IsInteractionConditionPassed::InteractionOwnersNum' has a wrong offset!");
static_assert(offsetof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_IsInteractionCaptured_C_IsInteractionConditionPassed::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_IsInteractionCaptured_C_IsInteractionConditionPassed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000021, "Member 'BP_IsInteractionCaptured_C_IsInteractionConditionPassed::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed, CallFunc_Array_IsEmpty_ReturnValue) == 0x000022, "Member 'BP_IsInteractionCaptured_C_IsInteractionConditionPassed::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed, CallFunc_Array_Contains_ReturnValue) == 0x000023, "Member 'BP_IsInteractionCaptured_C_IsInteractionConditionPassed::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_IsInteractionCaptured_C_IsInteractionConditionPassed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'BP_IsInteractionCaptured_C_IsInteractionConditionPassed::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed, CallFunc_BooleanAND_ReturnValue_1) == 0x000029, "Member 'BP_IsInteractionCaptured_C_IsInteractionConditionPassed::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IsInteractionCaptured_C_IsInteractionConditionPassed, CallFunc_BooleanOR_ReturnValue) == 0x00002A, "Member 'BP_IsInteractionCaptured_C_IsInteractionConditionPassed::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

