#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IndirectBounceCard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_IndirectBounceCard.BP_IndirectBounceCard_C.ExecuteUbergraph_BP_IndirectBounceCard
// 0x0020 (0x0020 - 0x0000)
struct BP_IndirectBounceCard_C_ExecuteUbergraph_BP_IndirectBounceCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6961[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IndirectBounceCard_C_ExecuteUbergraph_BP_IndirectBounceCard) == 0x000008, "Wrong alignment on BP_IndirectBounceCard_C_ExecuteUbergraph_BP_IndirectBounceCard");
static_assert(sizeof(BP_IndirectBounceCard_C_ExecuteUbergraph_BP_IndirectBounceCard) == 0x000020, "Wrong size on BP_IndirectBounceCard_C_ExecuteUbergraph_BP_IndirectBounceCard");
static_assert(offsetof(BP_IndirectBounceCard_C_ExecuteUbergraph_BP_IndirectBounceCard, EntryPoint) == 0x000000, "Member 'BP_IndirectBounceCard_C_ExecuteUbergraph_BP_IndirectBounceCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_IndirectBounceCard_C_ExecuteUbergraph_BP_IndirectBounceCard, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000008, "Member 'BP_IndirectBounceCard_C_ExecuteUbergraph_BP_IndirectBounceCard::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");

// Function BP_IndirectBounceCard.BP_IndirectBounceCard_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_IndirectBounceCard_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IndirectBounceCard_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_IndirectBounceCard_C_UserConstructionScript");
static_assert(sizeof(BP_IndirectBounceCard_C_UserConstructionScript) == 0x000018, "Wrong size on BP_IndirectBounceCard_C_UserConstructionScript");
static_assert(offsetof(BP_IndirectBounceCard_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000000, "Member 'BP_IndirectBounceCard_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");

}

