#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractionPoint

#include "Basic.hpp"

#include "G01_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractionPoint.BP_InteractionPoint_C.BndEvt__GzInteractable_K2Node_ComponentBoundEvent_0_OnInteractSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_InteractionPoint_C_BndEvt__GzInteractable_K2Node_ComponentBoundEvent_0_OnInteractSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UDefaultInteractionBehavior*      Interaction;                                       // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionPoint_C_BndEvt__GzInteractable_K2Node_ComponentBoundEvent_0_OnInteractSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_InteractionPoint_C_BndEvt__GzInteractable_K2Node_ComponentBoundEvent_0_OnInteractSignature__DelegateSignature");
static_assert(sizeof(BP_InteractionPoint_C_BndEvt__GzInteractable_K2Node_ComponentBoundEvent_0_OnInteractSignature__DelegateSignature) == 0x000010, "Wrong size on BP_InteractionPoint_C_BndEvt__GzInteractable_K2Node_ComponentBoundEvent_0_OnInteractSignature__DelegateSignature");
static_assert(offsetof(BP_InteractionPoint_C_BndEvt__GzInteractable_K2Node_ComponentBoundEvent_0_OnInteractSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'BP_InteractionPoint_C_BndEvt__GzInteractable_K2Node_ComponentBoundEvent_0_OnInteractSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_InteractionPoint_C_BndEvt__GzInteractable_K2Node_ComponentBoundEvent_0_OnInteractSignature__DelegateSignature, Interaction) == 0x000008, "Member 'BP_InteractionPoint_C_BndEvt__GzInteractable_K2Node_ComponentBoundEvent_0_OnInteractSignature__DelegateSignature::Interaction' has a wrong offset!");

// Function BP_InteractionPoint.BP_InteractionPoint_C.CanScanOnAnyDistance
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractionPoint_C_CanScanOnAnyDistance final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionPoint_C_CanScanOnAnyDistance) == 0x000001, "Wrong alignment on BP_InteractionPoint_C_CanScanOnAnyDistance");
static_assert(sizeof(BP_InteractionPoint_C_CanScanOnAnyDistance) == 0x000001, "Wrong size on BP_InteractionPoint_C_CanScanOnAnyDistance");
static_assert(offsetof(BP_InteractionPoint_C_CanScanOnAnyDistance, ReturnValue) == 0x000000, "Member 'BP_InteractionPoint_C_CanScanOnAnyDistance::ReturnValue' has a wrong offset!");

// Function BP_InteractionPoint.BP_InteractionPoint_C.ExecuteUbergraph_BP_InteractionPoint
// 0x0018 (0x0018 - 0x0000)
struct BP_InteractionPoint_C_ExecuteUbergraph_BP_InteractionPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67CA[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UDefaultInteractionBehavior*      K2Node_ComponentBoundEvent_Interaction;            // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionPoint_C_ExecuteUbergraph_BP_InteractionPoint) == 0x000008, "Wrong alignment on BP_InteractionPoint_C_ExecuteUbergraph_BP_InteractionPoint");
static_assert(sizeof(BP_InteractionPoint_C_ExecuteUbergraph_BP_InteractionPoint) == 0x000018, "Wrong size on BP_InteractionPoint_C_ExecuteUbergraph_BP_InteractionPoint");
static_assert(offsetof(BP_InteractionPoint_C_ExecuteUbergraph_BP_InteractionPoint, EntryPoint) == 0x000000, "Member 'BP_InteractionPoint_C_ExecuteUbergraph_BP_InteractionPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractionPoint_C_ExecuteUbergraph_BP_InteractionPoint, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_InteractionPoint_C_ExecuteUbergraph_BP_InteractionPoint::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionPoint_C_ExecuteUbergraph_BP_InteractionPoint, K2Node_ComponentBoundEvent_OtherActor) == 0x000008, "Member 'BP_InteractionPoint_C_ExecuteUbergraph_BP_InteractionPoint::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_InteractionPoint_C_ExecuteUbergraph_BP_InteractionPoint, K2Node_ComponentBoundEvent_Interaction) == 0x000010, "Member 'BP_InteractionPoint_C_ExecuteUbergraph_BP_InteractionPoint::K2Node_ComponentBoundEvent_Interaction' has a wrong offset!");

// Function BP_InteractionPoint.BP_InteractionPoint_C.OnDefilerEffectApplied
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractionPoint_C_OnDefilerEffectApplied final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionPoint_C_OnDefilerEffectApplied) == 0x000001, "Wrong alignment on BP_InteractionPoint_C_OnDefilerEffectApplied");
static_assert(sizeof(BP_InteractionPoint_C_OnDefilerEffectApplied) == 0x000001, "Wrong size on BP_InteractionPoint_C_OnDefilerEffectApplied");
static_assert(offsetof(BP_InteractionPoint_C_OnDefilerEffectApplied, ReturnValue) == 0x000000, "Member 'BP_InteractionPoint_C_OnDefilerEffectApplied::ReturnValue' has a wrong offset!");

// Function BP_InteractionPoint.BP_InteractionPoint_C.OnDefilerEffectRemoved
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractionPoint_C_OnDefilerEffectRemoved final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionPoint_C_OnDefilerEffectRemoved) == 0x000001, "Wrong alignment on BP_InteractionPoint_C_OnDefilerEffectRemoved");
static_assert(sizeof(BP_InteractionPoint_C_OnDefilerEffectRemoved) == 0x000001, "Wrong size on BP_InteractionPoint_C_OnDefilerEffectRemoved");
static_assert(offsetof(BP_InteractionPoint_C_OnDefilerEffectRemoved, ReturnValue) == 0x000000, "Member 'BP_InteractionPoint_C_OnDefilerEffectRemoved::ReturnValue' has a wrong offset!");

// Function BP_InteractionPoint.BP_InteractionPoint_C.GetDefilerTargetType
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractionPoint_C_GetDefilerTargetType final
{
public:
	EGzDefilerTargetType                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionPoint_C_GetDefilerTargetType) == 0x000001, "Wrong alignment on BP_InteractionPoint_C_GetDefilerTargetType");
static_assert(sizeof(BP_InteractionPoint_C_GetDefilerTargetType) == 0x000001, "Wrong size on BP_InteractionPoint_C_GetDefilerTargetType");
static_assert(offsetof(BP_InteractionPoint_C_GetDefilerTargetType, ReturnValue) == 0x000000, "Member 'BP_InteractionPoint_C_GetDefilerTargetType::ReturnValue' has a wrong offset!");

}

