#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Jetpack

#include "Basic.hpp"

#include "E_JetpackParticleType_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Jetpack.BP_Jetpack_C.Activate Effects
// 0x0040 (0x0040 - 0x0000)
struct BP_Jetpack_C_Activate_Effects final
{
public:
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EA8[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EA9[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMultiPartCharacter*                  CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyViewed_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EAA[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Jetpack_C_Activate_Effects) == 0x000008, "Wrong alignment on BP_Jetpack_C_Activate_Effects");
static_assert(sizeof(BP_Jetpack_C_Activate_Effects) == 0x000040, "Wrong size on BP_Jetpack_C_Activate_Effects");
static_assert(offsetof(BP_Jetpack_C_Activate_Effects, CallFunc_MakeLiteralInt_ReturnValue) == 0x000000, "Member 'BP_Jetpack_C_Activate_Effects::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Effects, Temp_int_Variable) == 0x000004, "Member 'BP_Jetpack_C_Activate_Effects::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Effects, Temp_int_Variable_1) == 0x000008, "Member 'BP_Jetpack_C_Activate_Effects::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Effects, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000C, "Member 'BP_Jetpack_C_Activate_Effects::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Effects, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_Jetpack_C_Activate_Effects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Effects, CallFunc_GetValidValue_ReturnValue) == 0x000014, "Member 'BP_Jetpack_C_Activate_Effects::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Effects, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000015, "Member 'BP_Jetpack_C_Activate_Effects::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Effects, CallFunc_Less_IntInt_ReturnValue) == 0x000016, "Member 'BP_Jetpack_C_Activate_Effects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Effects, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000017, "Member 'BP_Jetpack_C_Activate_Effects::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Effects, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000018, "Member 'BP_Jetpack_C_Activate_Effects::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Effects, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_Jetpack_C_Activate_Effects::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Effects, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000030, "Member 'BP_Jetpack_C_Activate_Effects::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Effects, CallFunc_IsLocallyViewed_ReturnValue) == 0x000038, "Member 'BP_Jetpack_C_Activate_Effects::CallFunc_IsLocallyViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Effects, CallFunc_Conv_BoolToInt_ReturnValue) == 0x00003C, "Member 'BP_Jetpack_C_Activate_Effects::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");

// Function BP_Jetpack.BP_Jetpack_C.Activate Particle by Type
// 0x0040 (0x0040 - 0x0000)
struct BP_Jetpack_C_Activate_Particle_by_Type final
{
public:
	E_JetpackParticleType                         ParticleType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EAB[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMultiPartCharacter*                  CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EAC[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Map_Find_Value_1;                         // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EAD[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_Map_Find_Value_2;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EAE[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Jetpack_C_Activate_Particle_by_Type) == 0x000008, "Wrong alignment on BP_Jetpack_C_Activate_Particle_by_Type");
static_assert(sizeof(BP_Jetpack_C_Activate_Particle_by_Type) == 0x000040, "Wrong size on BP_Jetpack_C_Activate_Particle_by_Type");
static_assert(offsetof(BP_Jetpack_C_Activate_Particle_by_Type, ParticleType) == 0x000000, "Member 'BP_Jetpack_C_Activate_Particle_by_Type::ParticleType' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Particle_by_Type, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000008, "Member 'BP_Jetpack_C_Activate_Particle_by_Type::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Particle_by_Type, CallFunc_Map_Find_Value) == 0x000010, "Member 'BP_Jetpack_C_Activate_Particle_by_Type::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Particle_by_Type, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'BP_Jetpack_C_Activate_Particle_by_Type::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Particle_by_Type, CallFunc_Map_Find_Value_1) == 0x00001C, "Member 'BP_Jetpack_C_Activate_Particle_by_Type::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Particle_by_Type, CallFunc_Map_Find_ReturnValue_1) == 0x000024, "Member 'BP_Jetpack_C_Activate_Particle_by_Type::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Particle_by_Type, CallFunc_IsValid_ReturnValue) == 0x000025, "Member 'BP_Jetpack_C_Activate_Particle_by_Type::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Particle_by_Type, CallFunc_Map_Find_Value_2) == 0x000028, "Member 'BP_Jetpack_C_Activate_Particle_by_Type::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Particle_by_Type, CallFunc_Map_Find_ReturnValue_2) == 0x000030, "Member 'BP_Jetpack_C_Activate_Particle_by_Type::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Activate_Particle_by_Type, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000038, "Member 'BP_Jetpack_C_Activate_Particle_by_Type::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function BP_Jetpack.BP_Jetpack_C.ActivateParticlesBasedOnState
// 0x0020 (0x0020 - 0x0000)
struct BP_Jetpack_C_ActivateParticlesBasedOnState final
{
public:
	class AGzMultiPartCharacter*                  Character;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJetpackBoosterActive_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJetpackDamaged_ReturnValue;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EAF[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMultiPartCharacter*                  CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJetpackDelayed_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Jetpack_C_ActivateParticlesBasedOnState) == 0x000008, "Wrong alignment on BP_Jetpack_C_ActivateParticlesBasedOnState");
static_assert(sizeof(BP_Jetpack_C_ActivateParticlesBasedOnState) == 0x000020, "Wrong size on BP_Jetpack_C_ActivateParticlesBasedOnState");
static_assert(offsetof(BP_Jetpack_C_ActivateParticlesBasedOnState, Character) == 0x000000, "Member 'BP_Jetpack_C_ActivateParticlesBasedOnState::Character' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ActivateParticlesBasedOnState, CallFunc_IsJetpackBoosterActive_ReturnValue) == 0x000008, "Member 'BP_Jetpack_C_ActivateParticlesBasedOnState::CallFunc_IsJetpackBoosterActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ActivateParticlesBasedOnState, CallFunc_IsJetpackDamaged_ReturnValue) == 0x000009, "Member 'BP_Jetpack_C_ActivateParticlesBasedOnState::CallFunc_IsJetpackDamaged_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ActivateParticlesBasedOnState, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000010, "Member 'BP_Jetpack_C_ActivateParticlesBasedOnState::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ActivateParticlesBasedOnState, CallFunc_IsJetpackDelayed_ReturnValue) == 0x000018, "Member 'BP_Jetpack_C_ActivateParticlesBasedOnState::CallFunc_IsJetpackDelayed_ReturnValue' has a wrong offset!");

// Function BP_Jetpack.BP_Jetpack_C.Deactivate Particle by Type
// 0x0018 (0x0018 - 0x0000)
struct BP_Jetpack_C_Deactivate_Particle_by_Type final
{
public:
	E_JetpackParticleType                         ParticleType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB0[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Map_Find_Value;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Jetpack_C_Deactivate_Particle_by_Type) == 0x000008, "Wrong alignment on BP_Jetpack_C_Deactivate_Particle_by_Type");
static_assert(sizeof(BP_Jetpack_C_Deactivate_Particle_by_Type) == 0x000018, "Wrong size on BP_Jetpack_C_Deactivate_Particle_by_Type");
static_assert(offsetof(BP_Jetpack_C_Deactivate_Particle_by_Type, ParticleType) == 0x000000, "Member 'BP_Jetpack_C_Deactivate_Particle_by_Type::ParticleType' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Deactivate_Particle_by_Type, CallFunc_Map_Find_Value) == 0x000008, "Member 'BP_Jetpack_C_Deactivate_Particle_by_Type::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Deactivate_Particle_by_Type, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'BP_Jetpack_C_Deactivate_Particle_by_Type::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Deactivate_Particle_by_Type, CallFunc_Map_Remove_ReturnValue) == 0x000011, "Member 'BP_Jetpack_C_Deactivate_Particle_by_Type::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Deactivate_Particle_by_Type, CallFunc_IsValid_ReturnValue) == 0x000012, "Member 'BP_Jetpack_C_Deactivate_Particle_by_Type::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Jetpack.BP_Jetpack_C.DisableAllParticles
// 0x0020 (0x0020 - 0x0000)
struct BP_Jetpack_C_DisableAllParticles final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB1[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB2[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Jetpack_C_DisableAllParticles) == 0x000004, "Wrong alignment on BP_Jetpack_C_DisableAllParticles");
static_assert(sizeof(BP_Jetpack_C_DisableAllParticles) == 0x000020, "Wrong size on BP_Jetpack_C_DisableAllParticles");
static_assert(offsetof(BP_Jetpack_C_DisableAllParticles, Temp_int_Variable) == 0x000000, "Member 'BP_Jetpack_C_DisableAllParticles::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_DisableAllParticles, Temp_int_Variable_1) == 0x000004, "Member 'BP_Jetpack_C_DisableAllParticles::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_DisableAllParticles, CallFunc_Conv_IntToByte_ReturnValue) == 0x000008, "Member 'BP_Jetpack_C_DisableAllParticles::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_DisableAllParticles, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Jetpack_C_DisableAllParticles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_DisableAllParticles, CallFunc_GetValidValue_ReturnValue) == 0x000010, "Member 'BP_Jetpack_C_DisableAllParticles::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_DisableAllParticles, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000011, "Member 'BP_Jetpack_C_DisableAllParticles::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_DisableAllParticles, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000012, "Member 'BP_Jetpack_C_DisableAllParticles::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_DisableAllParticles, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'BP_Jetpack_C_DisableAllParticles::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_DisableAllParticles, CallFunc_MakeLiteralInt_ReturnValue) == 0x000018, "Member 'BP_Jetpack_C_DisableAllParticles::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_DisableAllParticles, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_Jetpack_C_DisableAllParticles::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Jetpack.BP_Jetpack_C.ExecuteUbergraph_BP_Jetpack
// 0x0090 (0x0090 - 0x0000)
struct BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMultiPartCharacter*                  CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB4[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB5[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_Event_JetpackBoostVisual;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB6[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMultiPartCharacter*                  CallFunc_GetOwnerCharacter_ReturnValue_1;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_Event_InSkeletalMeshAsset;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJetpackDelayed_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB7[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB8[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Map_Find_Value;                           // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB9[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Map_Find_Value_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EBA[0x5];                                     // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack) == 0x000008, "Wrong alignment on BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack");
static_assert(sizeof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack) == 0x000090, "Wrong size on BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, EntryPoint) == 0x000000, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000008, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, Temp_int_Variable) == 0x000010, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_Conv_IntToByte_ReturnValue) == 0x000014, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_GetValidValue_ReturnValue) == 0x000015, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, Temp_int_Variable_1) == 0x000018, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000020, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000021, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000024, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, K2Node_Event_JetpackBoostVisual) == 0x000038, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::K2Node_Event_JetpackBoostVisual' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, K2Node_Event_bShow) == 0x000040, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::K2Node_Event_bShow' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_GetOwnerCharacter_ReturnValue_1) == 0x000048, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_GetOwnerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, K2Node_Event_InSkeletalMeshAsset) == 0x000050, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::K2Node_Event_InSkeletalMeshAsset' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_IsJetpackDelayed_ReturnValue) == 0x000058, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_IsJetpackDelayed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_MakeLiteralInt_ReturnValue) == 0x00005C, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_Map_Find_Value) == 0x000064, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_Map_Find_ReturnValue) == 0x00006C, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_Map_Find_Value_1) == 0x000070, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_Map_Find_ReturnValue_1) == 0x000078, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000079, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_IsValid_ReturnValue) == 0x00007A, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000088, "Member 'BP_Jetpack_C_ExecuteUbergraph_BP_Jetpack::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_Jetpack.BP_Jetpack_C.OnMeshAssetChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_Jetpack_C_OnMeshAssetChanged final
{
public:
	class USkeletalMesh*                          InSkeletalMeshAsset;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Jetpack_C_OnMeshAssetChanged) == 0x000008, "Wrong alignment on BP_Jetpack_C_OnMeshAssetChanged");
static_assert(sizeof(BP_Jetpack_C_OnMeshAssetChanged) == 0x000008, "Wrong size on BP_Jetpack_C_OnMeshAssetChanged");
static_assert(offsetof(BP_Jetpack_C_OnMeshAssetChanged, InSkeletalMeshAsset) == 0x000000, "Member 'BP_Jetpack_C_OnMeshAssetChanged::InSkeletalMeshAsset' has a wrong offset!");

// Function BP_Jetpack.BP_Jetpack_C.Set Int Parameter to Particle by Type
// 0x0020 (0x0020 - 0x0000)
struct BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type final
{
public:
	E_JetpackParticleType                         Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EBB[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ParameterName;                                     // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type) == 0x000008, "Wrong alignment on BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type");
static_assert(sizeof(BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type) == 0x000020, "Wrong size on BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type");
static_assert(offsetof(BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type, Type) == 0x000000, "Member 'BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type::Type' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type, ParameterName) == 0x000004, "Member 'BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type::ParameterName' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type, Param) == 0x00000C, "Member 'BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type::Param' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type, CallFunc_Map_Find_Value) == 0x000010, "Member 'BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_Jetpack_C_Set_Int_Parameter_to_Particle_by_Type::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Jetpack.BP_Jetpack_C.SetJetpackBoostVisual
// 0x0010 (0x0010 - 0x0000)
struct BP_Jetpack_C_SetJetpackBoostVisual final
{
public:
	class UStaticMesh*                            JetpackBoostVisual;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bShow;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Jetpack_C_SetJetpackBoostVisual) == 0x000008, "Wrong alignment on BP_Jetpack_C_SetJetpackBoostVisual");
static_assert(sizeof(BP_Jetpack_C_SetJetpackBoostVisual) == 0x000010, "Wrong size on BP_Jetpack_C_SetJetpackBoostVisual");
static_assert(offsetof(BP_Jetpack_C_SetJetpackBoostVisual, JetpackBoostVisual) == 0x000000, "Member 'BP_Jetpack_C_SetJetpackBoostVisual::JetpackBoostVisual' has a wrong offset!");
static_assert(offsetof(BP_Jetpack_C_SetJetpackBoostVisual, bShow) == 0x000008, "Member 'BP_Jetpack_C_SetJetpackBoostVisual::bShow' has a wrong offset!");

}

