#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KineticShield

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_KineticShield.BP_KineticShield_C.ActivateBlast
// 0x0020 (0x0020 - 0x0000)
struct BP_KineticShield_C_ActivateBlast final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6196[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_KineticShield_C_ActivateBlast) == 0x000008, "Wrong alignment on BP_KineticShield_C_ActivateBlast");
static_assert(sizeof(BP_KineticShield_C_ActivateBlast) == 0x000020, "Wrong size on BP_KineticShield_C_ActivateBlast");
static_assert(offsetof(BP_KineticShield_C_ActivateBlast, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_KineticShield_C_ActivateBlast::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ActivateBlast, CallFunc_GetControlRotation_ReturnValue) == 0x000008, "Member 'BP_KineticShield_C_ActivateBlast::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.ActivateShield
// 0x0002 (0x0002 - 0x0000)
struct BP_KineticShield_C_ActivateShield final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticShield_C_ActivateShield) == 0x000001, "Wrong alignment on BP_KineticShield_C_ActivateShield");
static_assert(sizeof(BP_KineticShield_C_ActivateShield) == 0x000002, "Wrong size on BP_KineticShield_C_ActivateShield");
static_assert(offsetof(BP_KineticShield_C_ActivateShield, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_KineticShield_C_ActivateShield::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ActivateShield, CallFunc_IsStandalone_ReturnValue) == 0x000001, "Member 'BP_KineticShield_C_ActivateShield::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.BP_OnHealthChange
// 0x0004 (0x0004 - 0x0000)
struct BP_KineticShield_C_BP_OnHealthChange final
{
public:
	float                                         Health;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticShield_C_BP_OnHealthChange) == 0x000004, "Wrong alignment on BP_KineticShield_C_BP_OnHealthChange");
static_assert(sizeof(BP_KineticShield_C_BP_OnHealthChange) == 0x000004, "Wrong size on BP_KineticShield_C_BP_OnHealthChange");
static_assert(offsetof(BP_KineticShield_C_BP_OnHealthChange, Health) == 0x000000, "Member 'BP_KineticShield_C_BP_OnHealthChange::Health' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.BreakShield
// 0x0002 (0x0002 - 0x0000)
struct BP_KineticShield_C_BreakShield final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticShield_C_BreakShield) == 0x000001, "Wrong alignment on BP_KineticShield_C_BreakShield");
static_assert(sizeof(BP_KineticShield_C_BreakShield) == 0x000002, "Wrong size on BP_KineticShield_C_BreakShield");
static_assert(offsetof(BP_KineticShield_C_BreakShield, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_KineticShield_C_BreakShield::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_BreakShield, CallFunc_IsStandalone_ReturnValue) == 0x000001, "Member 'BP_KineticShield_C_BreakShield::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.ClearBulletImpacts
// 0x0020 (0x0020 - 0x0000)
struct BP_KineticShield_C_ClearBulletImpacts final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6197[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticShield_C_ClearBulletImpacts) == 0x000008, "Wrong alignment on BP_KineticShield_C_ClearBulletImpacts");
static_assert(sizeof(BP_KineticShield_C_ClearBulletImpacts) == 0x000020, "Wrong size on BP_KineticShield_C_ClearBulletImpacts");
static_assert(offsetof(BP_KineticShield_C_ClearBulletImpacts, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_KineticShield_C_ClearBulletImpacts::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ClearBulletImpacts, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_KineticShield_C_ClearBulletImpacts::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ClearBulletImpacts, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_KineticShield_C_ClearBulletImpacts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ClearBulletImpacts, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_KineticShield_C_ClearBulletImpacts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ClearBulletImpacts, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_KineticShield_C_ClearBulletImpacts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ClearBulletImpacts, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_KineticShield_C_ClearBulletImpacts::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ClearBulletImpacts, CallFunc_IsValid_ReturnValue) == 0x00001D, "Member 'BP_KineticShield_C_ClearBulletImpacts::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.CloseShield
// 0x0004 (0x0004 - 0x0000)
struct BP_KineticShield_C_CloseShield final
{
public:
	bool                                          DidBlast;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticShield_C_CloseShield) == 0x000001, "Wrong alignment on BP_KineticShield_C_CloseShield");
static_assert(sizeof(BP_KineticShield_C_CloseShield) == 0x000004, "Wrong size on BP_KineticShield_C_CloseShield");
static_assert(offsetof(BP_KineticShield_C_CloseShield, DidBlast) == 0x000000, "Member 'BP_KineticShield_C_CloseShield::DidBlast' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_CloseShield, CallFunc_IsStandalone_ReturnValue) == 0x000001, "Member 'BP_KineticShield_C_CloseShield::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_CloseShield, CallFunc_HasAuthority_ReturnValue) == 0x000002, "Member 'BP_KineticShield_C_CloseShield::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_CloseShield, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000003, "Member 'BP_KineticShield_C_CloseShield::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.ExecuteUbergraph_BP_KineticShield
// 0x0140 (0x0140 - 0x0000)
struct BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Health;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6198[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_CustomEvent_BlastRotation;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6199[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619A[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_KineticBlast_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619B[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619C[0x3];                                     // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x00F0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619D[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CallDelegate_NewHealthValue_ImplicitCast;   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CurrentHealth_ImplicitCast;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_B_ImplicitCast;    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield) == 0x000010, "Wrong alignment on BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield");
static_assert(sizeof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield) == 0x000140, "Wrong size on BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, EntryPoint) == 0x000000, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, K2Node_Event_Health) == 0x000010, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::K2Node_Event_Health' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_HasAuthority_ReturnValue) == 0x000014, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, K2Node_CustomEvent_BlastRotation) == 0x000018, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::K2Node_CustomEvent_BlastRotation' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, Temp_delegate_Variable) == 0x000030, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_PostEvent_ReturnValue) == 0x000040, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_Less_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D0, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, Temp_int_Array_Index_Variable) == 0x0000D8, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000E9, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x0000EA, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0000EB, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000EC, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, Temp_delegate_Variable_1) == 0x0000F0, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_PostEvent_ReturnValue_1) == 0x000100, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000104, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, K2Node_CallDelegate_NewHealthValue_ImplicitCast) == 0x000108, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::K2Node_CallDelegate_NewHealthValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, K2Node_VariableSet_CurrentHealth_ImplicitCast) == 0x000110, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::K2Node_VariableSet_CurrentHealth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000118, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000120, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000128, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield, CallFunc_LessEqual_DoubleDouble_B_ImplicitCast) == 0x000130, "Member 'BP_KineticShield_C_ExecuteUbergraph_BP_KineticShield::CallFunc_LessEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.GetHealthPercentage
// 0x0038 (0x0038 - 0x0000)
struct BP_KineticShield_C_GetHealthPercentage final
{
public:
	double                                        HealthPercentage;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentHealth_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619E[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticShield_C_GetHealthPercentage) == 0x000008, "Wrong alignment on BP_KineticShield_C_GetHealthPercentage");
static_assert(sizeof(BP_KineticShield_C_GetHealthPercentage) == 0x000038, "Wrong size on BP_KineticShield_C_GetHealthPercentage");
static_assert(offsetof(BP_KineticShield_C_GetHealthPercentage, HealthPercentage) == 0x000000, "Member 'BP_KineticShield_C_GetHealthPercentage::HealthPercentage' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_GetHealthPercentage, CallFunc_GetCurrentHealth_ReturnValue) == 0x000008, "Member 'BP_KineticShield_C_GetHealthPercentage::CallFunc_GetCurrentHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_GetHealthPercentage, CallFunc_FMax_ReturnValue) == 0x000010, "Member 'BP_KineticShield_C_GetHealthPercentage::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_GetHealthPercentage, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_KineticShield_C_GetHealthPercentage::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_GetHealthPercentage, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'BP_KineticShield_C_GetHealthPercentage::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_GetHealthPercentage, CallFunc_FMax_A_ImplicitCast) == 0x000028, "Member 'BP_KineticShield_C_GetHealthPercentage::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_GetHealthPercentage, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'BP_KineticShield_C_GetHealthPercentage::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.GetImpactColor
// 0x0038 (0x0038 - 0x0000)
struct BP_KineticShield_C_GetImpactColor final
{
public:
	struct FLinearColor                           ImpactColor;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetHealthPercentage_HealthPercentage;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLinearColorValue_InTime_ImplicitCast;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticShield_C_GetImpactColor) == 0x000008, "Wrong alignment on BP_KineticShield_C_GetImpactColor");
static_assert(sizeof(BP_KineticShield_C_GetImpactColor) == 0x000038, "Wrong size on BP_KineticShield_C_GetImpactColor");
static_assert(offsetof(BP_KineticShield_C_GetImpactColor, ImpactColor) == 0x000000, "Member 'BP_KineticShield_C_GetImpactColor::ImpactColor' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_GetImpactColor, CallFunc_GetHealthPercentage_HealthPercentage) == 0x000010, "Member 'BP_KineticShield_C_GetImpactColor::CallFunc_GetHealthPercentage_HealthPercentage' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_GetImpactColor, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_KineticShield_C_GetImpactColor::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_GetImpactColor, CallFunc_GetLinearColorValue_ReturnValue) == 0x000020, "Member 'BP_KineticShield_C_GetImpactColor::CallFunc_GetLinearColorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_GetImpactColor, CallFunc_GetLinearColorValue_InTime_ImplicitCast) == 0x000030, "Member 'BP_KineticShield_C_GetImpactColor::CallFunc_GetLinearColorValue_InTime_ImplicitCast' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.GetShieldColor
// 0x0038 (0x0038 - 0x0000)
struct BP_KineticShield_C_GetShieldColor final
{
public:
	struct FLinearColor                           ShieldColor;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetHealthPercentage_HealthPercentage;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLinearColorValue_InTime_ImplicitCast;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticShield_C_GetShieldColor) == 0x000008, "Wrong alignment on BP_KineticShield_C_GetShieldColor");
static_assert(sizeof(BP_KineticShield_C_GetShieldColor) == 0x000038, "Wrong size on BP_KineticShield_C_GetShieldColor");
static_assert(offsetof(BP_KineticShield_C_GetShieldColor, ShieldColor) == 0x000000, "Member 'BP_KineticShield_C_GetShieldColor::ShieldColor' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_GetShieldColor, CallFunc_GetHealthPercentage_HealthPercentage) == 0x000010, "Member 'BP_KineticShield_C_GetShieldColor::CallFunc_GetHealthPercentage_HealthPercentage' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_GetShieldColor, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_KineticShield_C_GetShieldColor::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_GetShieldColor, CallFunc_GetLinearColorValue_ReturnValue) == 0x000020, "Member 'BP_KineticShield_C_GetShieldColor::CallFunc_GetLinearColorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_GetShieldColor, CallFunc_GetLinearColorValue_InTime_ImplicitCast) == 0x000030, "Member 'BP_KineticShield_C_GetShieldColor::CallFunc_GetLinearColorValue_InTime_ImplicitCast' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.InitializeHealth
// 0x00D0 (0x00D0 - 0x0000)
struct BP_KineticShield_C_InitializeHealth final
{
public:
	double                                        Param_MaxHealth;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_CurrentHealth;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, float>              K2Node_MakeMap_Map;                                // 0x0010(0x0050)(ConstParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619F[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, float>              K2Node_MakeMap_Map_1;                              // 0x0068(0x0050)(ConstParm)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue; // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue_1; // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxHealth_ImplicitCast;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeMap_Value_0_ImplicitCast;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticShield_C_InitializeHealth) == 0x000008, "Wrong alignment on BP_KineticShield_C_InitializeHealth");
static_assert(sizeof(BP_KineticShield_C_InitializeHealth) == 0x0000D0, "Wrong size on BP_KineticShield_C_InitializeHealth");
static_assert(offsetof(BP_KineticShield_C_InitializeHealth, Param_MaxHealth) == 0x000000, "Member 'BP_KineticShield_C_InitializeHealth::Param_MaxHealth' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_InitializeHealth, Param_CurrentHealth) == 0x000008, "Member 'BP_KineticShield_C_InitializeHealth::Param_CurrentHealth' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_InitializeHealth, K2Node_MakeMap_Map) == 0x000010, "Member 'BP_KineticShield_C_InitializeHealth::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_InitializeHealth, CallFunc_HasAuthority_ReturnValue) == 0x000060, "Member 'BP_KineticShield_C_InitializeHealth::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_InitializeHealth, CallFunc_HasAuthority_ReturnValue_1) == 0x000061, "Member 'BP_KineticShield_C_InitializeHealth::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_InitializeHealth, K2Node_MakeMap_Map_1) == 0x000068, "Member 'BP_KineticShield_C_InitializeHealth::K2Node_MakeMap_Map_1' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_InitializeHealth, CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue) == 0x0000B8, "Member 'BP_KineticShield_C_InitializeHealth::CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_InitializeHealth, CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue_1) == 0x0000C0, "Member 'BP_KineticShield_C_InitializeHealth::CallFunc_BP_ApplyGameplayEffectFromActorWithCustomMagnitudes_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_InitializeHealth, K2Node_VariableSet_MaxHealth_ImplicitCast) == 0x0000C8, "Member 'BP_KineticShield_C_InitializeHealth::K2Node_VariableSet_MaxHealth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_InitializeHealth, K2Node_MakeMap_Value_0_ImplicitCast) == 0x0000CC, "Member 'BP_KineticShield_C_InitializeHealth::K2Node_MakeMap_Value_0_ImplicitCast' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.MulticastActivateBlast
// 0x0018 (0x0018 - 0x0000)
struct BP_KineticShield_C_MulticastActivateBlast final
{
public:
	struct FRotator                               BlastRotation;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_KineticShield_C_MulticastActivateBlast) == 0x000008, "Wrong alignment on BP_KineticShield_C_MulticastActivateBlast");
static_assert(sizeof(BP_KineticShield_C_MulticastActivateBlast) == 0x000018, "Wrong size on BP_KineticShield_C_MulticastActivateBlast");
static_assert(offsetof(BP_KineticShield_C_MulticastActivateBlast, BlastRotation) == 0x000000, "Member 'BP_KineticShield_C_MulticastActivateBlast::BlastRotation' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.OnHealthUpdated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_KineticShield_C_OnHealthUpdated__DelegateSignature final
{
public:
	double                                        NewHealthValue;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticShield_C_OnHealthUpdated__DelegateSignature) == 0x000008, "Wrong alignment on BP_KineticShield_C_OnHealthUpdated__DelegateSignature");
static_assert(sizeof(BP_KineticShield_C_OnHealthUpdated__DelegateSignature) == 0x000008, "Wrong size on BP_KineticShield_C_OnHealthUpdated__DelegateSignature");
static_assert(offsetof(BP_KineticShield_C_OnHealthUpdated__DelegateSignature, NewHealthValue) == 0x000000, "Member 'BP_KineticShield_C_OnHealthUpdated__DelegateSignature::NewHealthValue' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.OnStateChanged
// 0x00B0 (0x00B0 - 0x0000)
struct BP_KineticShield_C_OnStateChanged final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61A0[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61A1[0x1];                                     // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x002C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61A2[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61A3[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x004C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61A4[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61A5[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0090(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61A6[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticShield_C_OnStateChanged) == 0x000008, "Wrong alignment on BP_KineticShield_C_OnStateChanged");
static_assert(sizeof(BP_KineticShield_C_OnStateChanged) == 0x0000B0, "Wrong size on BP_KineticShield_C_OnStateChanged");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_KineticShield_C_OnStateChanged::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BP_KineticShield_C_OnStateChanged::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000018, "Member 'BP_KineticShield_C_OnStateChanged::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000019, "Member 'BP_KineticShield_C_OnStateChanged::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, CallFunc_HasAuthority_ReturnValue) == 0x00001A, "Member 'BP_KineticShield_C_OnStateChanged::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, Temp_delegate_Variable) == 0x00001C, "Member 'BP_KineticShield_C_OnStateChanged::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, Temp_delegate_Variable_1) == 0x00002C, "Member 'BP_KineticShield_C_OnStateChanged::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00003C, "Member 'BP_KineticShield_C_OnStateChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, Temp_name_Variable) == 0x000040, "Member 'BP_KineticShield_C_OnStateChanged::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, CallFunc_IsLocallyControlled_ReturnValue) == 0x000048, "Member 'BP_KineticShield_C_OnStateChanged::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, Temp_name_Variable_1) == 0x00004C, "Member 'BP_KineticShield_C_OnStateChanged::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000058, "Member 'BP_KineticShield_C_OnStateChanged::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, Temp_bool_Variable) == 0x000070, "Member 'BP_KineticShield_C_OnStateChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'BP_KineticShield_C_OnStateChanged::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, K2Node_Select_Default) == 0x000090, "Member 'BP_KineticShield_C_OnStateChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000098, "Member 'BP_KineticShield_C_OnStateChanged::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, CallFunc_PostEventAtLocation_ReturnValue) == 0x0000A0, "Member 'BP_KineticShield_C_OnStateChanged::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, CallFunc_PostEvent_ReturnValue) == 0x0000A4, "Member 'BP_KineticShield_C_OnStateChanged::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, K2Node_SwitchEnum_CmpSuccess) == 0x0000A8, "Member 'BP_KineticShield_C_OnStateChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_OnStateChanged, CallFunc_PostEvent_ReturnValue_1) == 0x0000AC, "Member 'BP_KineticShield_C_OnStateChanged::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_KineticShield_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticShield_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_KineticShield_C_ReceiveTick");
static_assert(sizeof(BP_KineticShield_C_ReceiveTick) == 0x000004, "Wrong size on BP_KineticShield_C_ReceiveTick");
static_assert(offsetof(BP_KineticShield_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_KineticShield_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_KineticShield.BP_KineticShield_C.ServerUpdateCollision
// 0x0298 (0x0298 - 0x0000)
struct BP_KineticShield_C_ServerUpdateCollision final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61A7[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61A8[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x01A0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_KineticShield_C_ServerUpdateCollision) == 0x000008, "Wrong alignment on BP_KineticShield_C_ServerUpdateCollision");
static_assert(sizeof(BP_KineticShield_C_ServerUpdateCollision) == 0x000298, "Wrong size on BP_KineticShield_C_ServerUpdateCollision");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, Temp_bool_Variable) == 0x000001, "Member 'BP_KineticShield_C_ServerUpdateCollision::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_GetAttachParentActor_ReturnValue) == 0x000008, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, K2Node_DynamicCast_AsGz_Character) == 0x000010, "Member 'BP_KineticShield_C_ServerUpdateCollision::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_KineticShield_C_ServerUpdateCollision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_GetControlRotation_ReturnValue) == 0x000020, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_GetSocketLocation_ReturnValue) == 0x000038, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_GetForwardVector_ReturnValue) == 0x000050, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_GetActorUpVector_ReturnValue) == 0x000068, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_GetActorRightVector_ReturnValue) == 0x000080, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, K2Node_Select_Default) == 0x000098, "Member 'BP_KineticShield_C_ServerUpdateCollision::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_BreakVector_X) == 0x0000B0, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_BreakVector_Y) == 0x0000B8, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_BreakVector_Z) == 0x0000C0, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000C8, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x0000E0, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000F8, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000110, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_Add_VectorVector_ReturnValue) == 0x000128, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticShield_C_ServerUpdateCollision, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x000140, "Member 'BP_KineticShield_C_ServerUpdateCollision::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
