#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KatanaTrailsFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_KatanaTrailsFX.BP_KatanaTrailsFX_C
// 0x0048 (0x00D8 - 0x0090)
class UBP_KatanaTrailsFX_C final : public UGzPostProcessFX
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0090(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material;                                          // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Weight;                                            // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFX_InterpolationEnd;                             // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        BlurringSpeed;                                     // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxBlurValue;                                      // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlurRadius;                                        // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TickBP(float DeltaTime);
	void StopBP();
	void StartBP();
	void OnFX_InterpolationEnd__DelegateSignature();
	void ExecuteUbergraph_BP_KatanaTrailsFX(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_KatanaTrailsFX_C">();
	}
	static class UBP_KatanaTrailsFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_KatanaTrailsFX_C>();
	}
};
static_assert(alignof(UBP_KatanaTrailsFX_C) == 0x000008, "Wrong alignment on UBP_KatanaTrailsFX_C");
static_assert(sizeof(UBP_KatanaTrailsFX_C) == 0x0000D8, "Wrong size on UBP_KatanaTrailsFX_C");
static_assert(offsetof(UBP_KatanaTrailsFX_C, UberGraphFrame) == 0x000090, "Member 'UBP_KatanaTrailsFX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_KatanaTrailsFX_C, MaterialInstance) == 0x000098, "Member 'UBP_KatanaTrailsFX_C::MaterialInstance' has a wrong offset!");
static_assert(offsetof(UBP_KatanaTrailsFX_C, Material) == 0x0000A0, "Member 'UBP_KatanaTrailsFX_C::Material' has a wrong offset!");
static_assert(offsetof(UBP_KatanaTrailsFX_C, Weight) == 0x0000A8, "Member 'UBP_KatanaTrailsFX_C::Weight' has a wrong offset!");
static_assert(offsetof(UBP_KatanaTrailsFX_C, OnFX_InterpolationEnd) == 0x0000B0, "Member 'UBP_KatanaTrailsFX_C::OnFX_InterpolationEnd' has a wrong offset!");
static_assert(offsetof(UBP_KatanaTrailsFX_C, BlurringSpeed) == 0x0000C0, "Member 'UBP_KatanaTrailsFX_C::BlurringSpeed' has a wrong offset!");
static_assert(offsetof(UBP_KatanaTrailsFX_C, MaxBlurValue) == 0x0000C8, "Member 'UBP_KatanaTrailsFX_C::MaxBlurValue' has a wrong offset!");
static_assert(offsetof(UBP_KatanaTrailsFX_C, BlurRadius) == 0x0000D0, "Member 'UBP_KatanaTrailsFX_C::BlurRadius' has a wrong offset!");

}

