#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KB_Drainage_Block_2

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_KB_Drainage_Block_2.BP_KB_Drainage_Block_2_C
// 0x0018 (0x02B8 - 0x02A0)
class ABP_KB_Drainage_Block_2_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_KB_Drainage_Block_02_Damage_01;                 // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_KB_Drainage_Block_2;                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_KB_Drainage_Block_2_C">();
	}
	static class ABP_KB_Drainage_Block_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_KB_Drainage_Block_2_C>();
	}
};
static_assert(alignof(ABP_KB_Drainage_Block_2_C) == 0x000008, "Wrong alignment on ABP_KB_Drainage_Block_2_C");
static_assert(sizeof(ABP_KB_Drainage_Block_2_C) == 0x0002B8, "Wrong size on ABP_KB_Drainage_Block_2_C");
static_assert(offsetof(ABP_KB_Drainage_Block_2_C, SM_KB_Drainage_Block_02_Damage_01) == 0x0002A0, "Member 'ABP_KB_Drainage_Block_2_C::SM_KB_Drainage_Block_02_Damage_01' has a wrong offset!");
static_assert(offsetof(ABP_KB_Drainage_Block_2_C, SM_KB_Drainage_Block_2) == 0x0002A8, "Member 'ABP_KB_Drainage_Block_2_C::SM_KB_Drainage_Block_2' has a wrong offset!");
static_assert(offsetof(ABP_KB_Drainage_Block_2_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_KB_Drainage_Block_2_C::DefaultSceneRoot' has a wrong offset!");

}

