#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KineticBlast

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_KineticBlast.BP_KineticBlast_C.ExecuteUbergraph_BP_KineticBlast
// 0x0270 (0x0270 - 0x0000)
struct BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6154[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6155[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue;                // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6156[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6157[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6158[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0170(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast) == 0x000008, "Wrong alignment on BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast");
static_assert(sizeof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast) == 0x000270, "Wrong size on BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, EntryPoint) == 0x000000, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000040, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_NegateRotator_ReturnValue) == 0x000058, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_NegateRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000070, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Array_Add_ReturnValue) == 0x00007C, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Add_IntInt_ReturnValue_1) == 0x000084, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000098, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B0, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x0000B8, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000D0, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_GetForwardVector_ReturnValue) == 0x0000D8, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000F0, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000108, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000120, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000128, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000140, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Add_VectorVector_ReturnValue) == 0x000158, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000170, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000268, "Member 'BP_KineticBlast_C_ExecuteUbergraph_BP_KineticBlast::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_KineticBlast.BP_KineticBlast_C.Play Blasting FX
// 0x0018 (0x0018 - 0x0000)
struct BP_KineticBlast_C_Play_Blasting_FX final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KineticBlast_C_Play_Blasting_FX) == 0x000008, "Wrong alignment on BP_KineticBlast_C_Play_Blasting_FX");
static_assert(sizeof(BP_KineticBlast_C_Play_Blasting_FX) == 0x000018, "Wrong size on BP_KineticBlast_C_Play_Blasting_FX");
static_assert(offsetof(BP_KineticBlast_C_Play_Blasting_FX, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_KineticBlast_C_Play_Blasting_FX::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

}

