#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Katana_Slash_PostProcess

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Katana_Slash_PostProcess.BP_Katana_Slash_PostProcess_C.TickBP
// 0x0004 (0x0004 - 0x0000)
struct BP_Katana_Slash_PostProcess_C_TickBP final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Katana_Slash_PostProcess_C_TickBP) == 0x000004, "Wrong alignment on BP_Katana_Slash_PostProcess_C_TickBP");
static_assert(sizeof(BP_Katana_Slash_PostProcess_C_TickBP) == 0x000004, "Wrong size on BP_Katana_Slash_PostProcess_C_TickBP");
static_assert(offsetof(BP_Katana_Slash_PostProcess_C_TickBP, DeltaTime) == 0x000000, "Member 'BP_Katana_Slash_PostProcess_C_TickBP::DeltaTime' has a wrong offset!");

// Function BP_Katana_Slash_PostProcess.BP_Katana_Slash_PostProcess_C.ExecuteUbergraph_BP_Katana_Slash_PostProcess
// 0x0050 (0x0050 - 0x0000)
struct BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFadeOutProgress_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF4[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF5[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadingIn_ReturnValue;                   // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadingOut_ReturnValue;                  // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF6[0x1];                                     // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFadeInProgress_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess) == 0x000008, "Wrong alignment on BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess");
static_assert(sizeof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess) == 0x000050, "Wrong size on BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess");
static_assert(offsetof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess, EntryPoint) == 0x000000, "Member 'BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess, CallFunc_GetFadeOutProgress_ReturnValue) == 0x000004, "Member 'BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess::CallFunc_GetFadeOutProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000008, "Member 'BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x000030, "Member 'BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess, K2Node_Event_DeltaTime) == 0x000040, "Member 'BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess, CallFunc_IsValid_ReturnValue_2) == 0x000044, "Member 'BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess, CallFunc_IsFadingIn_ReturnValue) == 0x000045, "Member 'BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess::CallFunc_IsFadingIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess, CallFunc_IsFadingOut_ReturnValue) == 0x000046, "Member 'BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess::CallFunc_IsFadingOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess, CallFunc_GetFadeInProgress_ReturnValue) == 0x000048, "Member 'BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess::CallFunc_GetFadeInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess, CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast) == 0x00004C, "Member 'BP_Katana_Slash_PostProcess_C_ExecuteUbergraph_BP_Katana_Slash_PostProcess::CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast' has a wrong offset!");

}

