#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LK_Bus_Station_Large_Vents_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_LK_Bus_Station_Large_Vents_01.BP_LK_Bus_Station_Large_Vents_01_C.ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01
// 0x0020 (0x0020 - 0x0000)
struct BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63E8[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01) == 0x000004, "Wrong alignment on BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01");
static_assert(sizeof(BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01) == 0x000020, "Wrong size on BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01");
static_assert(offsetof(BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01, EntryPoint) == 0x000000, "Member 'BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01, Temp_delegate_Variable) == 0x000004, "Member 'BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01, K2Node_Event_EndPlayReason) == 0x000014, "Member 'BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01, CallFunc_PostAkEvent_ReturnValue) == 0x000018, "Member 'BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01, CallFunc_IsDedicatedServer_ReturnValue) == 0x00001C, "Member 'BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00001D, "Member 'BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01, CallFunc_Not_PreBool_ReturnValue) == 0x00001E, "Member 'BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001F, "Member 'BP_LK_Bus_Station_Large_Vents_01_C_ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function BP_LK_Bus_Station_Large_Vents_01.BP_LK_Bus_Station_Large_Vents_01_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_LK_Bus_Station_Large_Vents_01_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LK_Bus_Station_Large_Vents_01_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_LK_Bus_Station_Large_Vents_01_C_ReceiveEndPlay");
static_assert(sizeof(BP_LK_Bus_Station_Large_Vents_01_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_LK_Bus_Station_Large_Vents_01_C_ReceiveEndPlay");
static_assert(offsetof(BP_LK_Bus_Station_Large_Vents_01_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_LK_Bus_Station_Large_Vents_01_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

