#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_L_1Throw_NoBulb

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_Light_Fitting_Mesh_Settings_structs.hpp"
#include "S_Prop_Mesh_01_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_L_1Throw_NoBulb.BP_L_1Throw_NoBulb_C.AddSuspensionCable
// 0x0220 (0x0220 - 0x0000)
struct BP_L_1Throw_NoBulb_C_AddSuspensionCable final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USplineComponent*>               CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USplineComponent*                       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RestVariables_OutLockedProp;              // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RestVariables_OutLockedAnchor;            // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        CallFunc_RestVariables_OutPrevSplinePoint0;        // 0x00E8(0x0010)(ReferenceParm)
	TArray<struct FVector>                        CallFunc_RestVariables_OutPrevSplinePoint1;        // 0x00F8(0x0010)(ReferenceParm)
	TArray<class UInstancedStaticMeshComponent*>  CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0108(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0118(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UInstancedStaticMeshComponent*          CallFunc_Array_Get_Item_1;                         // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_L_1Throw_NoBulb_C_AddSuspensionCable) == 0x000008, "Wrong alignment on BP_L_1Throw_NoBulb_C_AddSuspensionCable");
static_assert(sizeof(BP_L_1Throw_NoBulb_C_AddSuspensionCable) == 0x000220, "Wrong size on BP_L_1Throw_NoBulb_C_AddSuspensionCable");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_BreakTransform_Location) == 0x000028, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_BreakTransform_Rotation) == 0x000040, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_BreakTransform_Scale) == 0x000058, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_BreakTransform_Location_1) == 0x000070, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_BreakTransform_Rotation_1) == 0x000088, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_BreakTransform_Scale_1) == 0x0000A0, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_RestVariables_OutLockedProp) == 0x0000B8, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_RestVariables_OutLockedProp' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_RestVariables_OutLockedAnchor) == 0x0000D0, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_RestVariables_OutLockedAnchor' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_RestVariables_OutPrevSplinePoint0) == 0x0000E8, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_RestVariables_OutPrevSplinePoint0' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_RestVariables_OutPrevSplinePoint1) == 0x0000F8, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_RestVariables_OutPrevSplinePoint1' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000108, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000118, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_Array_Get_Item_1) == 0x000210, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_Array_Length_ReturnValue) == 0x000218, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_AddSuspensionCable, CallFunc_Less_IntInt_ReturnValue) == 0x00021C, "Member 'BP_L_1Throw_NoBulb_C_AddSuspensionCable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_L_1Throw_NoBulb.BP_L_1Throw_NoBulb_C.CalculateSuspensionDefaultPos
// 0x0440 (0x0440 - 0x0000)
struct BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos final
{
public:
	struct FS_Light_Fitting_Mesh_Settings         CallFunc_SetDefaultSuspensionTransform_LightFittingSettingsOut; // 0x0000(0x0120)(NoDestructor, HasGetValueTypeHash)
	struct FS_Prop_Mesh_01                        CallFunc_SetDefaultSuspensionTransform_PropMeshSettingsOut; // 0x0120(0x0120)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetDefaultSuspensionTransform_SplineLocation; // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0348(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos) == 0x000010, "Wrong alignment on BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos");
static_assert(sizeof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos) == 0x000440, "Wrong size on BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_SetDefaultSuspensionTransform_LightFittingSettingsOut) == 0x000000, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_SetDefaultSuspensionTransform_LightFittingSettingsOut' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_SetDefaultSuspensionTransform_PropMeshSettingsOut) == 0x000120, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_SetDefaultSuspensionTransform_PropMeshSettingsOut' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_SetDefaultSuspensionTransform_SplineLocation) == 0x000240, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_SetDefaultSuspensionTransform_SplineLocation' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_BreakTransform_Location) == 0x000258, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_BreakTransform_Rotation) == 0x000270, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_BreakTransform_Scale) == 0x000288, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_BreakVector_X) == 0x0002A0, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_BreakVector_Y) == 0x0002A8, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_BreakVector_Z) == 0x0002B0, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_MakeVector_ReturnValue) == 0x0002B8, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_BreakTransform_Location_1) == 0x0002D0, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_BreakTransform_Rotation_1) == 0x0002E8, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_BreakTransform_Scale_1) == 0x000300, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_BreakVector_X_1) == 0x000318, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_BreakVector_Y_1) == 0x000320, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_BreakVector_Z_1) == 0x000328, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_MakeVector_ReturnValue_1) == 0x000330, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000348, "Member 'BP_L_1Throw_NoBulb_C_CalculateSuspensionDefaultPos::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function BP_L_1Throw_NoBulb.BP_L_1Throw_NoBulb_C.ExecuteUbergraph_BP_L_1Throw_NoBulb
// 0x000C (0x000C - 0x0000)
struct BP_L_1Throw_NoBulb_C_ExecuteUbergraph_BP_L_1Throw_NoBulb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast_1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_L_1Throw_NoBulb_C_ExecuteUbergraph_BP_L_1Throw_NoBulb) == 0x000004, "Wrong alignment on BP_L_1Throw_NoBulb_C_ExecuteUbergraph_BP_L_1Throw_NoBulb");
static_assert(sizeof(BP_L_1Throw_NoBulb_C_ExecuteUbergraph_BP_L_1Throw_NoBulb) == 0x00000C, "Wrong size on BP_L_1Throw_NoBulb_C_ExecuteUbergraph_BP_L_1Throw_NoBulb");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_ExecuteUbergraph_BP_L_1Throw_NoBulb, EntryPoint) == 0x000000, "Member 'BP_L_1Throw_NoBulb_C_ExecuteUbergraph_BP_L_1Throw_NoBulb::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_ExecuteUbergraph_BP_L_1Throw_NoBulb, CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast) == 0x000004, "Member 'BP_L_1Throw_NoBulb_C_ExecuteUbergraph_BP_L_1Throw_NoBulb::CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_ExecuteUbergraph_BP_L_1Throw_NoBulb, CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast_1) == 0x000008, "Member 'BP_L_1Throw_NoBulb_C_ExecuteUbergraph_BP_L_1Throw_NoBulb::CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast_1' has a wrong offset!");

// Function BP_L_1Throw_NoBulb.BP_L_1Throw_NoBulb_C.UserConstructionScript
// 0x0080 (0x0080 - 0x0000)
struct BP_L_1Throw_NoBulb_C_UserConstructionScript final
{
public:
	double                                        CallFunc_Presets_Preset_Intensity;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Presets_Preset_Colour;                    // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Presets_Preset_Kelvin;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Presets_Preset_Attenuation_Radius;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Presets_Turn_Lights_On_;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Presets_Use_Preset_Kelvin;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1B[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USpotLightComponent*                    CallFunc_Create_Light_01_Spot_Lights;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   CallFunc_Create_Light_01_Point_Lights;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    CallFunc_Create_Light_01_Rect_Lights;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Create_Prop_Mesh_Prop_Mesh_Reference;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Light_01_Settings_Final_Lumen_Int_Output; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Light_01_Settings_Final_Emissive_Int_Output; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Light_01_Settings_Final_Colour_Output;    // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Light_01_Settings_Prop_Mesh_Ref_Output;   // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_L_1Throw_NoBulb_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_L_1Throw_NoBulb_C_UserConstructionScript");
static_assert(sizeof(BP_L_1Throw_NoBulb_C_UserConstructionScript) == 0x000080, "Wrong size on BP_L_1Throw_NoBulb_C_UserConstructionScript");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_UserConstructionScript, CallFunc_Presets_Preset_Intensity) == 0x000000, "Member 'BP_L_1Throw_NoBulb_C_UserConstructionScript::CallFunc_Presets_Preset_Intensity' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_UserConstructionScript, CallFunc_Presets_Preset_Colour) == 0x000008, "Member 'BP_L_1Throw_NoBulb_C_UserConstructionScript::CallFunc_Presets_Preset_Colour' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_UserConstructionScript, CallFunc_Presets_Preset_Kelvin) == 0x000018, "Member 'BP_L_1Throw_NoBulb_C_UserConstructionScript::CallFunc_Presets_Preset_Kelvin' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_UserConstructionScript, CallFunc_Presets_Preset_Attenuation_Radius) == 0x000020, "Member 'BP_L_1Throw_NoBulb_C_UserConstructionScript::CallFunc_Presets_Preset_Attenuation_Radius' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_UserConstructionScript, CallFunc_Presets_Turn_Lights_On_) == 0x000028, "Member 'BP_L_1Throw_NoBulb_C_UserConstructionScript::CallFunc_Presets_Turn_Lights_On_' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_UserConstructionScript, CallFunc_Presets_Use_Preset_Kelvin) == 0x000029, "Member 'BP_L_1Throw_NoBulb_C_UserConstructionScript::CallFunc_Presets_Use_Preset_Kelvin' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_UserConstructionScript, CallFunc_Create_Light_01_Spot_Lights) == 0x000030, "Member 'BP_L_1Throw_NoBulb_C_UserConstructionScript::CallFunc_Create_Light_01_Spot_Lights' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_UserConstructionScript, CallFunc_Create_Light_01_Point_Lights) == 0x000038, "Member 'BP_L_1Throw_NoBulb_C_UserConstructionScript::CallFunc_Create_Light_01_Point_Lights' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_UserConstructionScript, CallFunc_Create_Light_01_Rect_Lights) == 0x000040, "Member 'BP_L_1Throw_NoBulb_C_UserConstructionScript::CallFunc_Create_Light_01_Rect_Lights' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_UserConstructionScript, CallFunc_Create_Prop_Mesh_Prop_Mesh_Reference) == 0x000048, "Member 'BP_L_1Throw_NoBulb_C_UserConstructionScript::CallFunc_Create_Prop_Mesh_Prop_Mesh_Reference' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_UserConstructionScript, CallFunc_Light_01_Settings_Final_Lumen_Int_Output) == 0x000050, "Member 'BP_L_1Throw_NoBulb_C_UserConstructionScript::CallFunc_Light_01_Settings_Final_Lumen_Int_Output' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_UserConstructionScript, CallFunc_Light_01_Settings_Final_Emissive_Int_Output) == 0x000058, "Member 'BP_L_1Throw_NoBulb_C_UserConstructionScript::CallFunc_Light_01_Settings_Final_Emissive_Int_Output' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_UserConstructionScript, CallFunc_Light_01_Settings_Final_Colour_Output) == 0x000060, "Member 'BP_L_1Throw_NoBulb_C_UserConstructionScript::CallFunc_Light_01_Settings_Final_Colour_Output' has a wrong offset!");
static_assert(offsetof(BP_L_1Throw_NoBulb_C_UserConstructionScript, CallFunc_Light_01_Settings_Prop_Mesh_Ref_Output) == 0x000078, "Member 'BP_L_1Throw_NoBulb_C_UserConstructionScript::CallFunc_Light_01_Settings_Prop_Mesh_Ref_Output' has a wrong offset!");

}

