#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LoadoutDropRestrictionVolume

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LoadoutDropRestrictionVolume.BP_LoadoutDropRestrictionVolume_C
// 0x0018 (0x02B8 - 0x02A0)
class ABP_LoadoutDropRestrictionVolume_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LoadoutDropRestrictionVolume(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LoadoutDropRestrictionVolume_C">();
	}
	static class ABP_LoadoutDropRestrictionVolume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LoadoutDropRestrictionVolume_C>();
	}
};
static_assert(alignof(ABP_LoadoutDropRestrictionVolume_C) == 0x000008, "Wrong alignment on ABP_LoadoutDropRestrictionVolume_C");
static_assert(sizeof(ABP_LoadoutDropRestrictionVolume_C) == 0x0002B8, "Wrong size on ABP_LoadoutDropRestrictionVolume_C");
static_assert(offsetof(ABP_LoadoutDropRestrictionVolume_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_LoadoutDropRestrictionVolume_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LoadoutDropRestrictionVolume_C, Box) == 0x0002A8, "Member 'ABP_LoadoutDropRestrictionVolume_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_LoadoutDropRestrictionVolume_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_LoadoutDropRestrictionVolume_C::DefaultSceneRoot' has a wrong offset!");

}

