#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_L_1Throw_3Bulb

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "S_Bulb_02_Settings_structs.hpp"
#include "S_LED_Diode_01_structs.hpp"
#include "S_Bulb_Light_01_Settings_structs.hpp"
#include "S_LED_Diode_03_structs.hpp"
#include "S_Light_Fitting_Mesh_Settings_structs.hpp"
#include "S_Bulb_01_Settings_structs.hpp"
#include "S_Bulb_Light_02_Settings_structs.hpp"
#include "S_Bulb_Light_01_Emissive_Settings_structs.hpp"
#include "S_Main_Throw_Light_01_Settings_structs.hpp"
#include "S_LED_Diode_02_structs.hpp"
#include "S_Bulb_Light_02_Emissive_Settings_structs.hpp"
#include "S_Bulb_03_Settings_structs.hpp"
#include "S_Bulb_Light_03_Emissive_Settings_structs.hpp"
#include "S_Bulb_Light_03_Settings_structs.hpp"
#include "S_Light_Presets_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_L_1Throw_3Bulb.BP_L_1Throw_3Bulb_C
// 0x0C90 (0x0F30 - 0x02A0)
class ABP_L_1Throw_3Bulb_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66A8[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Light_Fitting_Mesh_Settings         Light_Fitting_Mesh_Settings;                       // 0x02C0(0x0120)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FS_Bulb_01_Settings                    Bulb_01_Settings;                                  // 0x03E0(0x00F0)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_LED_Diode_01                        LED_Diode_01_Settings;                             // 0x04D0(0x0070)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FS_Bulb_Light_01_Emissive_Settings     Bulb_Light_01_Emissive_Settings;                   // 0x0540(0x0020)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Bulb_Light_01_Settings              Bulb_Light_01_Settings;                            // 0x0560(0x0140)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FS_Main_Throw_Light_01_Settings        Main_Throw_Light_01_Settings;                      // 0x06A0(0x01E0)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FS_Bulb_02_Settings                    Bulb_02_Settings;                                  // 0x0880(0x00F0)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FS_LED_Diode_02                        LED_Diode_02_Settings;                             // 0x0970(0x0070)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FS_Bulb_Light_02_Emissive_Settings     Bulb_Light_02_Emissive_Settings;                   // 0x09E0(0x0020)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Bulb_Light_02_Settings              Bulb_Light_02_Settings;                            // 0x0A00(0x0140)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FS_Bulb_03_Settings                    Bulb_03_Settings;                                  // 0x0B40(0x00F0)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FS_LED_Diode_03                        LED_Diode_03_Settings;                             // 0x0C30(0x0070)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FS_Bulb_Light_03_Emissive_Settings     Bulb_Light_03_Emissive_Settings;                   // 0x0CA0(0x0020)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Bulb_Light_03_Settings              Bulb_Light_03_Settings;                            // 0x0CC0(0x0140)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FS_Light_Presets                       Light_Presets;                                     // 0x0E00(0x0003)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66A9[0x5];                                     // 0x0E03(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Bulb01_Final_Lumen_Int;                            // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Bulb01_Final_Emissive_Int;                         // 0x0E10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Bulb02_Final_Lumen_Int;                            // 0x0E18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Bulb02_Final_Emissive_Int;                         // 0x0E20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Bulb03_Final_Lumen_Int;                            // 0x0E28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Bulb03_Final_Emissive_Int;                         // 0x0E30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Bulb01_Final_Colour;                               // 0x0E38(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Bulb02_Final_Colour;                               // 0x0E50(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Bulb03_Final_Colour;                               // 0x0E68(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Bulb01_Mesh_Ref;                                   // 0x0E80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Bulb02_Mesh_Ref;                                   // 0x0E88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Bulb03_Mesh_Ref;                                   // 0x0E90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LockedProp;                                        // 0x0E98(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LockedAnchor;                                      // 0x0EB0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreProp;                                           // 0x0EC8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreAnchor;                                         // 0x0EE0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        PrevSplinePoint1;                                  // 0x0EF8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector>                        PrevSplinePoint0;                                  // 0x0F08(0x0010)(Edit, BlueprintVisible)
	struct FVector                                SplineLocation;                                    // 0x0F18(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddSuspensionCable();
	void CalculateSuspensionDefaultPos();
	void ExecuteUbergraph_BP_L_1Throw_3Bulb(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_L_1Throw_3Bulb_C">();
	}
	static class ABP_L_1Throw_3Bulb_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_L_1Throw_3Bulb_C>();
	}
};
static_assert(alignof(ABP_L_1Throw_3Bulb_C) == 0x000010, "Wrong alignment on ABP_L_1Throw_3Bulb_C");
static_assert(sizeof(ABP_L_1Throw_3Bulb_C) == 0x000F30, "Wrong size on ABP_L_1Throw_3Bulb_C");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_L_1Throw_3Bulb_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Spline) == 0x0002A8, "Member 'ABP_L_1Throw_3Bulb_C::Spline' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_L_1Throw_3Bulb_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Light_Fitting_Mesh_Settings) == 0x0002C0, "Member 'ABP_L_1Throw_3Bulb_C::Light_Fitting_Mesh_Settings' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb_01_Settings) == 0x0003E0, "Member 'ABP_L_1Throw_3Bulb_C::Bulb_01_Settings' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, LED_Diode_01_Settings) == 0x0004D0, "Member 'ABP_L_1Throw_3Bulb_C::LED_Diode_01_Settings' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb_Light_01_Emissive_Settings) == 0x000540, "Member 'ABP_L_1Throw_3Bulb_C::Bulb_Light_01_Emissive_Settings' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb_Light_01_Settings) == 0x000560, "Member 'ABP_L_1Throw_3Bulb_C::Bulb_Light_01_Settings' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Main_Throw_Light_01_Settings) == 0x0006A0, "Member 'ABP_L_1Throw_3Bulb_C::Main_Throw_Light_01_Settings' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb_02_Settings) == 0x000880, "Member 'ABP_L_1Throw_3Bulb_C::Bulb_02_Settings' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, LED_Diode_02_Settings) == 0x000970, "Member 'ABP_L_1Throw_3Bulb_C::LED_Diode_02_Settings' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb_Light_02_Emissive_Settings) == 0x0009E0, "Member 'ABP_L_1Throw_3Bulb_C::Bulb_Light_02_Emissive_Settings' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb_Light_02_Settings) == 0x000A00, "Member 'ABP_L_1Throw_3Bulb_C::Bulb_Light_02_Settings' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb_03_Settings) == 0x000B40, "Member 'ABP_L_1Throw_3Bulb_C::Bulb_03_Settings' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, LED_Diode_03_Settings) == 0x000C30, "Member 'ABP_L_1Throw_3Bulb_C::LED_Diode_03_Settings' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb_Light_03_Emissive_Settings) == 0x000CA0, "Member 'ABP_L_1Throw_3Bulb_C::Bulb_Light_03_Emissive_Settings' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb_Light_03_Settings) == 0x000CC0, "Member 'ABP_L_1Throw_3Bulb_C::Bulb_Light_03_Settings' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Light_Presets) == 0x000E00, "Member 'ABP_L_1Throw_3Bulb_C::Light_Presets' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb01_Final_Lumen_Int) == 0x000E08, "Member 'ABP_L_1Throw_3Bulb_C::Bulb01_Final_Lumen_Int' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb01_Final_Emissive_Int) == 0x000E10, "Member 'ABP_L_1Throw_3Bulb_C::Bulb01_Final_Emissive_Int' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb02_Final_Lumen_Int) == 0x000E18, "Member 'ABP_L_1Throw_3Bulb_C::Bulb02_Final_Lumen_Int' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb02_Final_Emissive_Int) == 0x000E20, "Member 'ABP_L_1Throw_3Bulb_C::Bulb02_Final_Emissive_Int' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb03_Final_Lumen_Int) == 0x000E28, "Member 'ABP_L_1Throw_3Bulb_C::Bulb03_Final_Lumen_Int' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb03_Final_Emissive_Int) == 0x000E30, "Member 'ABP_L_1Throw_3Bulb_C::Bulb03_Final_Emissive_Int' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb01_Final_Colour) == 0x000E38, "Member 'ABP_L_1Throw_3Bulb_C::Bulb01_Final_Colour' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb02_Final_Colour) == 0x000E50, "Member 'ABP_L_1Throw_3Bulb_C::Bulb02_Final_Colour' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb03_Final_Colour) == 0x000E68, "Member 'ABP_L_1Throw_3Bulb_C::Bulb03_Final_Colour' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb01_Mesh_Ref) == 0x000E80, "Member 'ABP_L_1Throw_3Bulb_C::Bulb01_Mesh_Ref' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb02_Mesh_Ref) == 0x000E88, "Member 'ABP_L_1Throw_3Bulb_C::Bulb02_Mesh_Ref' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, Bulb03_Mesh_Ref) == 0x000E90, "Member 'ABP_L_1Throw_3Bulb_C::Bulb03_Mesh_Ref' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, LockedProp) == 0x000E98, "Member 'ABP_L_1Throw_3Bulb_C::LockedProp' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, LockedAnchor) == 0x000EB0, "Member 'ABP_L_1Throw_3Bulb_C::LockedAnchor' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, PreProp) == 0x000EC8, "Member 'ABP_L_1Throw_3Bulb_C::PreProp' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, PreAnchor) == 0x000EE0, "Member 'ABP_L_1Throw_3Bulb_C::PreAnchor' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, PrevSplinePoint1) == 0x000EF8, "Member 'ABP_L_1Throw_3Bulb_C::PrevSplinePoint1' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, PrevSplinePoint0) == 0x000F08, "Member 'ABP_L_1Throw_3Bulb_C::PrevSplinePoint0' has a wrong offset!");
static_assert(offsetof(ABP_L_1Throw_3Bulb_C, SplineLocation) == 0x000F18, "Member 'ABP_L_1Throw_3Bulb_C::SplineLocation' has a wrong offset!");

}

