#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootContainer_TemplateV2

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.UpdateCollisionResponseForMeshes
// 0x0048 (0x0048 - 0x0000)
struct BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E64[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E65[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E66[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes) == 0x000008, "Wrong alignment on BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes) == 0x000048, "Wrong size on BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes, CallFunc_GetChildrenComponents_Children) == 0x000010, "Member 'BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000038, "Member 'BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_LootContainer_TemplateV2_C_UpdateCollisionResponseForMeshes::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.UpdateAudioHintSound
// 0x0002 (0x0002 - 0x0000)
struct BP_LootContainer_TemplateV2_C_UpdateAudioHintSound final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_UpdateAudioHintSound) == 0x000001, "Wrong alignment on BP_LootContainer_TemplateV2_C_UpdateAudioHintSound");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_UpdateAudioHintSound) == 0x000002, "Wrong size on BP_LootContainer_TemplateV2_C_UpdateAudioHintSound");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_UpdateAudioHintSound, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_UpdateAudioHintSound::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_UpdateAudioHintSound, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'BP_LootContainer_TemplateV2_C_UpdateAudioHintSound::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.SubscribeToStageChanged
// 0x0028 (0x0028 - 0x0000)
struct BP_LootContainer_TemplateV2_C_SubscribeToStageChanged final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzMultiStageGameState*                 K2Node_DynamicCast_AsGz_Multi_Stage_Game_State;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E67[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_SubscribeToStageChanged) == 0x000008, "Wrong alignment on BP_LootContainer_TemplateV2_C_SubscribeToStageChanged");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_SubscribeToStageChanged) == 0x000028, "Wrong size on BP_LootContainer_TemplateV2_C_SubscribeToStageChanged");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_SubscribeToStageChanged, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_SubscribeToStageChanged::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_SubscribeToStageChanged, K2Node_DynamicCast_AsGz_Multi_Stage_Game_State) == 0x000008, "Member 'BP_LootContainer_TemplateV2_C_SubscribeToStageChanged::K2Node_DynamicCast_AsGz_Multi_Stage_Game_State' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_SubscribeToStageChanged, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_LootContainer_TemplateV2_C_SubscribeToStageChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_SubscribeToStageChanged, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_LootContainer_TemplateV2_C_SubscribeToStageChanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_LootContainer_TemplateV2_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_LootContainer_TemplateV2_C_ReceiveEndPlay");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_LootContainer_TemplateV2_C_ReceiveEndPlay");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.OnStageChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_LootContainer_TemplateV2_C_OnStageChanged final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E68[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameRuleEnabled_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_OnStageChanged) == 0x000004, "Wrong alignment on BP_LootContainer_TemplateV2_C_OnStageChanged");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_OnStageChanged) == 0x000010, "Wrong size on BP_LootContainer_TemplateV2_C_OnStageChanged");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_OnStageChanged, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_OnStageChanged::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_OnStageChanged, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_LootContainer_TemplateV2_C_OnStageChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_OnStageChanged, CallFunc_Not_PreBool_ReturnValue_1) == 0x000002, "Member 'BP_LootContainer_TemplateV2_C_OnStageChanged::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_OnStageChanged, Temp_struct_Variable) == 0x000004, "Member 'BP_LootContainer_TemplateV2_C_OnStageChanged::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_OnStageChanged, CallFunc_IsGameRuleEnabled_ReturnValue) == 0x00000C, "Member 'BP_LootContainer_TemplateV2_C_OnStageChanged::CallFunc_IsGameRuleEnabled_ReturnValue' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.OnNotifyEnd_3AEEEBC7460A1A911574C3ABB98CD8FB
// 0x0008 (0x0008 - 0x0000)
struct BP_LootContainer_TemplateV2_C_OnNotifyEnd_3AEEEBC7460A1A911574C3ABB98CD8FB final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_OnNotifyEnd_3AEEEBC7460A1A911574C3ABB98CD8FB) == 0x000004, "Wrong alignment on BP_LootContainer_TemplateV2_C_OnNotifyEnd_3AEEEBC7460A1A911574C3ABB98CD8FB");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_OnNotifyEnd_3AEEEBC7460A1A911574C3ABB98CD8FB) == 0x000008, "Wrong size on BP_LootContainer_TemplateV2_C_OnNotifyEnd_3AEEEBC7460A1A911574C3ABB98CD8FB");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_OnNotifyEnd_3AEEEBC7460A1A911574C3ABB98CD8FB, NotifyName) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_OnNotifyEnd_3AEEEBC7460A1A911574C3ABB98CD8FB::NotifyName' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.OnNotifyBegin_3AEEEBC7460A1A911574C3ABB98CD8FB
// 0x0008 (0x0008 - 0x0000)
struct BP_LootContainer_TemplateV2_C_OnNotifyBegin_3AEEEBC7460A1A911574C3ABB98CD8FB final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_OnNotifyBegin_3AEEEBC7460A1A911574C3ABB98CD8FB) == 0x000004, "Wrong alignment on BP_LootContainer_TemplateV2_C_OnNotifyBegin_3AEEEBC7460A1A911574C3ABB98CD8FB");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_OnNotifyBegin_3AEEEBC7460A1A911574C3ABB98CD8FB) == 0x000008, "Wrong size on BP_LootContainer_TemplateV2_C_OnNotifyBegin_3AEEEBC7460A1A911574C3ABB98CD8FB");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_OnNotifyBegin_3AEEEBC7460A1A911574C3ABB98CD8FB, NotifyName) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_OnNotifyBegin_3AEEEBC7460A1A911574C3ABB98CD8FB::NotifyName' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.OnInterrupted_3AEEEBC7460A1A911574C3ABB98CD8FB
// 0x0008 (0x0008 - 0x0000)
struct BP_LootContainer_TemplateV2_C_OnInterrupted_3AEEEBC7460A1A911574C3ABB98CD8FB final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_OnInterrupted_3AEEEBC7460A1A911574C3ABB98CD8FB) == 0x000004, "Wrong alignment on BP_LootContainer_TemplateV2_C_OnInterrupted_3AEEEBC7460A1A911574C3ABB98CD8FB");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_OnInterrupted_3AEEEBC7460A1A911574C3ABB98CD8FB) == 0x000008, "Wrong size on BP_LootContainer_TemplateV2_C_OnInterrupted_3AEEEBC7460A1A911574C3ABB98CD8FB");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_OnInterrupted_3AEEEBC7460A1A911574C3ABB98CD8FB, NotifyName) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_OnInterrupted_3AEEEBC7460A1A911574C3ABB98CD8FB::NotifyName' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.OnCompleted_3AEEEBC7460A1A911574C3ABB98CD8FB
// 0x0008 (0x0008 - 0x0000)
struct BP_LootContainer_TemplateV2_C_OnCompleted_3AEEEBC7460A1A911574C3ABB98CD8FB final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_OnCompleted_3AEEEBC7460A1A911574C3ABB98CD8FB) == 0x000004, "Wrong alignment on BP_LootContainer_TemplateV2_C_OnCompleted_3AEEEBC7460A1A911574C3ABB98CD8FB");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_OnCompleted_3AEEEBC7460A1A911574C3ABB98CD8FB) == 0x000008, "Wrong size on BP_LootContainer_TemplateV2_C_OnCompleted_3AEEEBC7460A1A911574C3ABB98CD8FB");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_OnCompleted_3AEEEBC7460A1A911574C3ABB98CD8FB, NotifyName) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_OnCompleted_3AEEEBC7460A1A911574C3ABB98CD8FB::NotifyName' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.OnBlendOut_3AEEEBC7460A1A911574C3ABB98CD8FB
// 0x0008 (0x0008 - 0x0000)
struct BP_LootContainer_TemplateV2_C_OnBlendOut_3AEEEBC7460A1A911574C3ABB98CD8FB final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_OnBlendOut_3AEEEBC7460A1A911574C3ABB98CD8FB) == 0x000004, "Wrong alignment on BP_LootContainer_TemplateV2_C_OnBlendOut_3AEEEBC7460A1A911574C3ABB98CD8FB");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_OnBlendOut_3AEEEBC7460A1A911574C3ABB98CD8FB) == 0x000008, "Wrong size on BP_LootContainer_TemplateV2_C_OnBlendOut_3AEEEBC7460A1A911574C3ABB98CD8FB");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_OnBlendOut_3AEEEBC7460A1A911574C3ABB98CD8FB, NotifyName) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_OnBlendOut_3AEEEBC7460A1A911574C3ABB98CD8FB::NotifyName' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.GetOpenChestAnimMontage
// 0x0008 (0x0008 - 0x0000)
struct BP_LootContainer_TemplateV2_C_GetOpenChestAnimMontage final
{
public:
	class UAnimMontage*                           OpenMontage;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_GetOpenChestAnimMontage) == 0x000008, "Wrong alignment on BP_LootContainer_TemplateV2_C_GetOpenChestAnimMontage");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_GetOpenChestAnimMontage) == 0x000008, "Wrong size on BP_LootContainer_TemplateV2_C_GetOpenChestAnimMontage");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetOpenChestAnimMontage, OpenMontage) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_GetOpenChestAnimMontage::OpenMontage' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.ExecuteUbergraph_BP_LootContainer_TemplateV2
// 0x00D0 (0x00D0 - 0x0000)
struct BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E69[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetOpenChestAnimMontage_OpenMontage;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E6A[0x2];                                     // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_ComponentBoundEvent_Component;              // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bReset;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E6B[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2) == 0x000008, "Wrong alignment on BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2) == 0x0000D0, "Wrong size on BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, EntryPoint) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, CallFunc_GetOpenChestAnimMontage_OpenMontage) == 0x000008, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::CallFunc_GetOpenChestAnimMontage_OpenMontage' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, K2Node_CustomEvent_NotifyName_4) == 0x000010, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, K2Node_CustomEvent_NotifyName_3) == 0x000018, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, K2Node_CustomEvent_NotifyName_2) == 0x000030, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, K2Node_CustomEvent_NotifyName_1) == 0x000048, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, K2Node_CreateDelegate_OutputDelegate_2) == 0x000050, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, K2Node_CustomEvent_NotifyName) == 0x000060, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, K2Node_CreateDelegate_OutputDelegate_3) == 0x000068, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, Temp_name_Variable) == 0x000078, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, CallFunc_PostEventAtLocation_ReturnValue) == 0x000098, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, CallFunc_IsDedicatedServer_ReturnValue) == 0x00009C, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, CallFunc_Not_PreBool_ReturnValue) == 0x00009D, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, K2Node_ComponentBoundEvent_Component) == 0x0000A0, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::K2Node_ComponentBoundEvent_Component' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, K2Node_ComponentBoundEvent_bReset) == 0x0000A8, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::K2Node_ComponentBoundEvent_bReset' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, CallFunc_IsPlaying_ReturnValue) == 0x0000A9, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000AA, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, K2Node_Event_EndPlayReason) == 0x0000AB, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000AC, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0000C0, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BP_LootContainer_TemplateV2_C_ExecuteUbergraph_BP_LootContainer_TemplateV2::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.ChangeMaterial
// 0x0001 (0x0001 - 0x0000)
struct BP_LootContainer_TemplateV2_C_ChangeMaterial final
{
public:
	bool                                          IsInteractable;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_ChangeMaterial) == 0x000001, "Wrong alignment on BP_LootContainer_TemplateV2_C_ChangeMaterial");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_ChangeMaterial) == 0x000001, "Wrong size on BP_LootContainer_TemplateV2_C_ChangeMaterial");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_ChangeMaterial, IsInteractable) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_ChangeMaterial::IsInteractable' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.BndEvt__BP_LootContainer_TemplateV2_SkeletalMesh_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_LootContainer_TemplateV2_C_BndEvt__BP_LootContainer_TemplateV2_SkeletalMesh_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_BndEvt__BP_LootContainer_TemplateV2_SkeletalMesh_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_LootContainer_TemplateV2_C_BndEvt__BP_LootContainer_TemplateV2_SkeletalMesh_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_BndEvt__BP_LootContainer_TemplateV2_SkeletalMesh_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature) == 0x000010, "Wrong size on BP_LootContainer_TemplateV2_C_BndEvt__BP_LootContainer_TemplateV2_SkeletalMesh_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_BndEvt__BP_LootContainer_TemplateV2_SkeletalMesh_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature, Component) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_BndEvt__BP_LootContainer_TemplateV2_SkeletalMesh_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature::Component' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_BndEvt__BP_LootContainer_TemplateV2_SkeletalMesh_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature, bReset) == 0x000008, "Member 'BP_LootContainer_TemplateV2_C_BndEvt__BP_LootContainer_TemplateV2_SkeletalMesh_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature::bReset' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.GetPingVoiceLineData
// 0x0010 (0x0010 - 0x0000)
struct BP_LootContainer_TemplateV2_C_GetPingVoiceLineData final
{
public:
	struct FGzPingVoiceLineData                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_GetPingVoiceLineData) == 0x000008, "Wrong alignment on BP_LootContainer_TemplateV2_C_GetPingVoiceLineData");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_GetPingVoiceLineData) == 0x000010, "Wrong size on BP_LootContainer_TemplateV2_C_GetPingVoiceLineData");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetPingVoiceLineData, ReturnValue) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_GetPingVoiceLineData::ReturnValue' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.GetLocalSocketTransforms
// 0x00F0 (0x00F0 - 0x0000)
struct BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms final
{
public:
	TArray<struct FTransform>                     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FTransform>                     SocketTransforms;                                  // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E6C[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetAllSocketNames_ReturnValue;            // 0x0030(0x0010)(ReferenceParm)
	class USkinnedAsset*                          CallFunc_GetSkinnedAsset_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E6D[0xC];                                     // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E6E[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshSocket*                    CallFunc_FindSocket_ReturnValue;                   // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E6F[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms) == 0x000010, "Wrong alignment on BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms) == 0x0000F0, "Wrong size on BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, ReturnValue) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, SocketTransforms) == 0x000010, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::SocketTransforms' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, CallFunc_GetAllSocketNames_ReturnValue) == 0x000030, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::CallFunc_GetAllSocketNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, CallFunc_GetSkinnedAsset_ReturnValue) == 0x000040, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::CallFunc_GetSkinnedAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, CallFunc_GetSocketTransform_ReturnValue) == 0x000060, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, CallFunc_Array_Add_ReturnValue) == 0x0000C4, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, CallFunc_FindSocket_ReturnValue) == 0x0000C8, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::CallFunc_FindSocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, CallFunc_Conv_NameToString_ReturnValue) == 0x0000D0, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, CallFunc_FindSubstring_ReturnValue) == 0x0000E4, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000E8, "Member 'BP_LootContainer_TemplateV2_C_GetLocalSocketTransforms::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.GetDefilerTargetType
// 0x0002 (0x0002 - 0x0000)
struct BP_LootContainer_TemplateV2_C_GetDefilerTargetType final
{
public:
	EGzDefilerTargetType                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzDefilerTargetType                          CallFunc_DetermineDefilerType_Type;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_GetDefilerTargetType) == 0x000001, "Wrong alignment on BP_LootContainer_TemplateV2_C_GetDefilerTargetType");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_GetDefilerTargetType) == 0x000002, "Wrong size on BP_LootContainer_TemplateV2_C_GetDefilerTargetType");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetDefilerTargetType, ReturnValue) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_GetDefilerTargetType::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_GetDefilerTargetType, CallFunc_DetermineDefilerType_Type) == 0x000001, "Member 'BP_LootContainer_TemplateV2_C_GetDefilerTargetType::CallFunc_DetermineDefilerType_Type' has a wrong offset!");

// Function BP_LootContainer_TemplateV2.BP_LootContainer_TemplateV2_C.DetermineDefilerType
// 0x0002 (0x0002 - 0x0000)
struct BP_LootContainer_TemplateV2_C_DetermineDefilerType final
{
public:
	EGzDefilerTargetType                          TypeIfNotOpen;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzDefilerTargetType                          Type;                                              // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_TemplateV2_C_DetermineDefilerType) == 0x000001, "Wrong alignment on BP_LootContainer_TemplateV2_C_DetermineDefilerType");
static_assert(sizeof(BP_LootContainer_TemplateV2_C_DetermineDefilerType) == 0x000002, "Wrong size on BP_LootContainer_TemplateV2_C_DetermineDefilerType");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_DetermineDefilerType, TypeIfNotOpen) == 0x000000, "Member 'BP_LootContainer_TemplateV2_C_DetermineDefilerType::TypeIfNotOpen' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_TemplateV2_C_DetermineDefilerType, Type) == 0x000001, "Member 'BP_LootContainer_TemplateV2_C_DetermineDefilerType::Type' has a wrong offset!");

}

