#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LK_Bus_Station_Large_Vents_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LK_Bus_Station_Large_Vents_01.BP_LK_Bus_Station_Large_Vents_01_C
// 0x0030 (0x02D0 - 0x02A0)
class ABP_LK_Bus_Station_Large_Vents_01_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzStaticAkComponent*                   GzStaticAk;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LK_BusStation_Large_Vents_fan;                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LK_BusStation_Large_Vents;                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          VentsAudioEvent;                                   // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LK_Bus_Station_Large_Vents_01(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LK_Bus_Station_Large_Vents_01_C">();
	}
	static class ABP_LK_Bus_Station_Large_Vents_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LK_Bus_Station_Large_Vents_01_C>();
	}
};
static_assert(alignof(ABP_LK_Bus_Station_Large_Vents_01_C) == 0x000008, "Wrong alignment on ABP_LK_Bus_Station_Large_Vents_01_C");
static_assert(sizeof(ABP_LK_Bus_Station_Large_Vents_01_C) == 0x0002D0, "Wrong size on ABP_LK_Bus_Station_Large_Vents_01_C");
static_assert(offsetof(ABP_LK_Bus_Station_Large_Vents_01_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_LK_Bus_Station_Large_Vents_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LK_Bus_Station_Large_Vents_01_C, GzStaticAk) == 0x0002A8, "Member 'ABP_LK_Bus_Station_Large_Vents_01_C::GzStaticAk' has a wrong offset!");
static_assert(offsetof(ABP_LK_Bus_Station_Large_Vents_01_C, SM_LK_BusStation_Large_Vents_fan) == 0x0002B0, "Member 'ABP_LK_Bus_Station_Large_Vents_01_C::SM_LK_BusStation_Large_Vents_fan' has a wrong offset!");
static_assert(offsetof(ABP_LK_Bus_Station_Large_Vents_01_C, SM_LK_BusStation_Large_Vents) == 0x0002B8, "Member 'ABP_LK_Bus_Station_Large_Vents_01_C::SM_LK_BusStation_Large_Vents' has a wrong offset!");
static_assert(offsetof(ABP_LK_Bus_Station_Large_Vents_01_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_LK_Bus_Station_Large_Vents_01_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_LK_Bus_Station_Large_Vents_01_C, VentsAudioEvent) == 0x0002C8, "Member 'ABP_LK_Bus_Station_Large_Vents_01_C::VentsAudioEvent' has a wrong offset!");

}

