#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootContainer_Crate_Hextractor

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_LootContainer_Crate_Hextractor.BP_LootContainer_Crate_Hextractor_C.BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature final
{
public:
	class AActor*                                 InteractedBy;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         Interactable;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature) == 0x000008, "Wrong alignment on BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature");
static_assert(sizeof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature) == 0x000010, "Wrong size on BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature, InteractedBy) == 0x000000, "Member 'BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature::InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature, Interactable) == 0x000008, "Member 'BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature::Interactable' has a wrong offset!");

// Function BP_LootContainer_Crate_Hextractor.BP_LootContainer_Crate_Hextractor_C.BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature final
{
public:
	class AActor*                                 InteractedBy;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         Interactable;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature) == 0x000008, "Wrong alignment on BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature");
static_assert(sizeof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature) == 0x000010, "Wrong size on BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature, InteractedBy) == 0x000000, "Member 'BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature::InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature, Interactable) == 0x000008, "Member 'BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature::Interactable' has a wrong offset!");

// Function BP_LootContainer_Crate_Hextractor.BP_LootContainer_Crate_Hextractor_C.BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature final
{
public:
	class AActor*                                 InteractedBy;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         Interactable;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature) == 0x000008, "Wrong alignment on BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature");
static_assert(sizeof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature) == 0x000010, "Wrong size on BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature, InteractedBy) == 0x000000, "Member 'BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature::InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature, Interactable) == 0x000008, "Member 'BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature::Interactable' has a wrong offset!");

// Function BP_LootContainer_Crate_Hextractor.BP_LootContainer_Crate_Hextractor_C.BndEvt__BP_LootContainer_Crate_Hextractor_MissionResource_K2Node_ComponentBoundEvent_0_OnResourcePendingDestroyFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_MissionResource_K2Node_ComponentBoundEvent_0_OnResourcePendingDestroyFinished__DelegateSignature final
{
public:
	class UMissionResourceComponent*              Resource;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_MissionResource_K2Node_ComponentBoundEvent_0_OnResourcePendingDestroyFinished__DelegateSignature) == 0x000008, "Wrong alignment on BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_MissionResource_K2Node_ComponentBoundEvent_0_OnResourcePendingDestroyFinished__DelegateSignature");
static_assert(sizeof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_MissionResource_K2Node_ComponentBoundEvent_0_OnResourcePendingDestroyFinished__DelegateSignature) == 0x000008, "Wrong size on BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_MissionResource_K2Node_ComponentBoundEvent_0_OnResourcePendingDestroyFinished__DelegateSignature");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_MissionResource_K2Node_ComponentBoundEvent_0_OnResourcePendingDestroyFinished__DelegateSignature, Resource) == 0x000000, "Member 'BP_LootContainer_Crate_Hextractor_C_BndEvt__BP_LootContainer_Crate_Hextractor_MissionResource_K2Node_ComponentBoundEvent_0_OnResourcePendingDestroyFinished__DelegateSignature::Resource' has a wrong offset!");

// Function BP_LootContainer_Crate_Hextractor.BP_LootContainer_Crate_Hextractor_C.CanScanOnAnyDistance
// 0x0001 (0x0001 - 0x0000)
struct BP_LootContainer_Crate_Hextractor_C_CanScanOnAnyDistance final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_Crate_Hextractor_C_CanScanOnAnyDistance) == 0x000001, "Wrong alignment on BP_LootContainer_Crate_Hextractor_C_CanScanOnAnyDistance");
static_assert(sizeof(BP_LootContainer_Crate_Hextractor_C_CanScanOnAnyDistance) == 0x000001, "Wrong size on BP_LootContainer_Crate_Hextractor_C_CanScanOnAnyDistance");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_CanScanOnAnyDistance, ReturnValue) == 0x000000, "Member 'BP_LootContainer_Crate_Hextractor_C_CanScanOnAnyDistance::ReturnValue' has a wrong offset!");

// Function BP_LootContainer_Crate_Hextractor.BP_LootContainer_Crate_Hextractor_C.ExecuteUbergraph_BP_LootContainer_Crate_Hextractor
// 0x00E0 (0x00E0 - 0x0000)
struct BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6120[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0008(0x0020)()
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6121[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x002C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6122[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1; // 0x0040(0x0020)()
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6123[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6124[0x2];                                     // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_InteractedBy_2;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         K2Node_ComponentBoundEvent_Interactable_2;         // 0x0080(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_InteractedBy_1;         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         K2Node_ComponentBoundEvent_Interactable_1;         // 0x0090(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_InteractedBy;           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         K2Node_ComponentBoundEvent_Interactable;           // 0x00A0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_2; // 0x00A8(0x0020)()
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_5;               // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue_1;    // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6125[0x1];                                     // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_6;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6126[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionResourceComponent*              K2Node_ComponentBoundEvent_Resource;               // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor) == 0x000008, "Wrong alignment on BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor");
static_assert(sizeof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor) == 0x0000E0, "Wrong size on BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, EntryPoint) == 0x000000, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000008, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_HasAuthority_ReturnValue) == 0x000028, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, Temp_delegate_Variable) == 0x00002C, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_HasAuthority_ReturnValue_1) == 0x00003C, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x00003D, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1) == 0x000040, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_HasAuthority_ReturnValue_2) == 0x000060, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000061, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_HasAuthority_ReturnValue_3) == 0x000074, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_HasAuthority_ReturnValue_4) == 0x000075, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, K2Node_ComponentBoundEvent_InteractedBy_2) == 0x000078, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::K2Node_ComponentBoundEvent_InteractedBy_2' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, K2Node_ComponentBoundEvent_Interactable_2) == 0x000080, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::K2Node_ComponentBoundEvent_Interactable_2' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, K2Node_ComponentBoundEvent_InteractedBy_1) == 0x000088, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::K2Node_ComponentBoundEvent_InteractedBy_1' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, K2Node_ComponentBoundEvent_Interactable_1) == 0x000090, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::K2Node_ComponentBoundEvent_Interactable_1' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, K2Node_ComponentBoundEvent_InteractedBy) == 0x000098, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::K2Node_ComponentBoundEvent_InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, K2Node_ComponentBoundEvent_Interactable) == 0x0000A0, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_2) == 0x0000A8, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x0000C8, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_HasAuthority_ReturnValue_5) == 0x0000C9, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_HasAuthority_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_RemoveLooseGameplayTags_ReturnValue_1) == 0x0000CA, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_RemoveLooseGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x0000CC, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, CallFunc_HasAuthority_ReturnValue_6) == 0x0000D0, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::CallFunc_HasAuthority_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor, K2Node_ComponentBoundEvent_Resource) == 0x0000D8, "Member 'BP_LootContainer_Crate_Hextractor_C_ExecuteUbergraph_BP_LootContainer_Crate_Hextractor::K2Node_ComponentBoundEvent_Resource' has a wrong offset!");

// Function BP_LootContainer_Crate_Hextractor.BP_LootContainer_Crate_Hextractor_C.OnDefilerEffectApplied
// 0x0001 (0x0001 - 0x0000)
struct BP_LootContainer_Crate_Hextractor_C_OnDefilerEffectApplied final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_Crate_Hextractor_C_OnDefilerEffectApplied) == 0x000001, "Wrong alignment on BP_LootContainer_Crate_Hextractor_C_OnDefilerEffectApplied");
static_assert(sizeof(BP_LootContainer_Crate_Hextractor_C_OnDefilerEffectApplied) == 0x000001, "Wrong size on BP_LootContainer_Crate_Hextractor_C_OnDefilerEffectApplied");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_OnDefilerEffectApplied, ReturnValue) == 0x000000, "Member 'BP_LootContainer_Crate_Hextractor_C_OnDefilerEffectApplied::ReturnValue' has a wrong offset!");

// Function BP_LootContainer_Crate_Hextractor.BP_LootContainer_Crate_Hextractor_C.OnDefilerEffectRemoved
// 0x0001 (0x0001 - 0x0000)
struct BP_LootContainer_Crate_Hextractor_C_OnDefilerEffectRemoved final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_Crate_Hextractor_C_OnDefilerEffectRemoved) == 0x000001, "Wrong alignment on BP_LootContainer_Crate_Hextractor_C_OnDefilerEffectRemoved");
static_assert(sizeof(BP_LootContainer_Crate_Hextractor_C_OnDefilerEffectRemoved) == 0x000001, "Wrong size on BP_LootContainer_Crate_Hextractor_C_OnDefilerEffectRemoved");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_OnDefilerEffectRemoved, ReturnValue) == 0x000000, "Member 'BP_LootContainer_Crate_Hextractor_C_OnDefilerEffectRemoved::ReturnValue' has a wrong offset!");

// Function BP_LootContainer_Crate_Hextractor.BP_LootContainer_Crate_Hextractor_C.OnRep_SpawnedHex
// 0x0002 (0x0002 - 0x0000)
struct BP_LootContainer_Crate_Hextractor_C_OnRep_SpawnedHex final
{
public:
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_Crate_Hextractor_C_OnRep_SpawnedHex) == 0x000001, "Wrong alignment on BP_LootContainer_Crate_Hextractor_C_OnRep_SpawnedHex");
static_assert(sizeof(BP_LootContainer_Crate_Hextractor_C_OnRep_SpawnedHex) == 0x000002, "Wrong size on BP_LootContainer_Crate_Hextractor_C_OnRep_SpawnedHex");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_OnRep_SpawnedHex, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000000, "Member 'BP_LootContainer_Crate_Hextractor_C_OnRep_SpawnedHex::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_OnRep_SpawnedHex, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_LootContainer_Crate_Hextractor_C_OnRep_SpawnedHex::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_LootContainer_Crate_Hextractor.BP_LootContainer_Crate_Hextractor_C.OnSuccess_Server
// 0x0190 (0x0190 - 0x0000)
struct BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGzPickableSpawnInfo                   K2Node_MakeStruct_GzPickableSpawnInfo;             // 0x0060(0x00D0)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FGzInvItem>                     CallFunc_GetInvItems_ReturnValue;                  // 0x0140(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGzInvItem                             CallFunc_Array_Get_Item;                           // 0x0160(0x0010)()
	class UGzItemData*                            CallFunc_GetItemData_ReturnValue;                  // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPickableBase*                        CallFunc_CreatePickable_ReturnValue;               // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzItemRarity                                 CallFunc_GetRarity_ReturnValue;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server) == 0x000010, "Wrong alignment on BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server");
static_assert(sizeof(BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server) == 0x000190, "Wrong size on BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server, K2Node_MakeStruct_GzPickableSpawnInfo) == 0x000060, "Member 'BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server::K2Node_MakeStruct_GzPickableSpawnInfo' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server, CallFunc_GetDisplayName_ReturnValue) == 0x000130, "Member 'BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server, CallFunc_GetInvItems_ReturnValue) == 0x000140, "Member 'BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server::CallFunc_GetInvItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server, CallFunc_Concat_StrStr_ReturnValue) == 0x000150, "Member 'BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server, CallFunc_Array_Get_Item) == 0x000160, "Member 'BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server, CallFunc_GetItemData_ReturnValue) == 0x000170, "Member 'BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server, CallFunc_CreatePickable_ReturnValue) == 0x000178, "Member 'BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server::CallFunc_CreatePickable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server, CallFunc_GetRarity_ReturnValue) == 0x000180, "Member 'BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server, CallFunc_IsValid_ReturnValue) == 0x000181, "Member 'BP_LootContainer_Crate_Hextractor_C_OnSuccess_Server::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_LootContainer_Crate_Hextractor.BP_LootContainer_Crate_Hextractor_C.GetDefilerTargetType
// 0x0001 (0x0001 - 0x0000)
struct BP_LootContainer_Crate_Hextractor_C_GetDefilerTargetType final
{
public:
	EGzDefilerTargetType                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootContainer_Crate_Hextractor_C_GetDefilerTargetType) == 0x000001, "Wrong alignment on BP_LootContainer_Crate_Hextractor_C_GetDefilerTargetType");
static_assert(sizeof(BP_LootContainer_Crate_Hextractor_C_GetDefilerTargetType) == 0x000001, "Wrong size on BP_LootContainer_Crate_Hextractor_C_GetDefilerTargetType");
static_assert(offsetof(BP_LootContainer_Crate_Hextractor_C_GetDefilerTargetType, ReturnValue) == 0x000000, "Member 'BP_LootContainer_Crate_Hextractor_C_GetDefilerTargetType::ReturnValue' has a wrong offset!");

}

