#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootSpawner_OpenLootV2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LootSpawner_OpenLootV2.BP_LootSpawner_OpenLootV2_C.ExecuteUbergraph_BP_LootSpawner_OpenLootV2
// 0x0004 (0x0004 - 0x0000)
struct BP_LootSpawner_OpenLootV2_C_ExecuteUbergraph_BP_LootSpawner_OpenLootV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootSpawner_OpenLootV2_C_ExecuteUbergraph_BP_LootSpawner_OpenLootV2) == 0x000004, "Wrong alignment on BP_LootSpawner_OpenLootV2_C_ExecuteUbergraph_BP_LootSpawner_OpenLootV2");
static_assert(sizeof(BP_LootSpawner_OpenLootV2_C_ExecuteUbergraph_BP_LootSpawner_OpenLootV2) == 0x000004, "Wrong size on BP_LootSpawner_OpenLootV2_C_ExecuteUbergraph_BP_LootSpawner_OpenLootV2");
static_assert(offsetof(BP_LootSpawner_OpenLootV2_C_ExecuteUbergraph_BP_LootSpawner_OpenLootV2, EntryPoint) == 0x000000, "Member 'BP_LootSpawner_OpenLootV2_C_ExecuteUbergraph_BP_LootSpawner_OpenLootV2::EntryPoint' has a wrong offset!");

// Function BP_LootSpawner_OpenLootV2.BP_LootSpawner_OpenLootV2_C.GetLocalSocketTransforms
// 0x0080 (0x0080 - 0x0000)
struct BP_LootSpawner_OpenLootV2_C_GetLocalSocketTransforms final
{
public:
	TArray<struct FTransform>                     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_LootSpawner_OpenLootV2_C_GetLocalSocketTransforms) == 0x000010, "Wrong alignment on BP_LootSpawner_OpenLootV2_C_GetLocalSocketTransforms");
static_assert(sizeof(BP_LootSpawner_OpenLootV2_C_GetLocalSocketTransforms) == 0x000080, "Wrong size on BP_LootSpawner_OpenLootV2_C_GetLocalSocketTransforms");
static_assert(offsetof(BP_LootSpawner_OpenLootV2_C_GetLocalSocketTransforms, ReturnValue) == 0x000000, "Member 'BP_LootSpawner_OpenLootV2_C_GetLocalSocketTransforms::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootSpawner_OpenLootV2_C_GetLocalSocketTransforms, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_LootSpawner_OpenLootV2_C_GetLocalSocketTransforms::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootSpawner_OpenLootV2_C_GetLocalSocketTransforms, K2Node_MakeArray_Array) == 0x000070, "Member 'BP_LootSpawner_OpenLootV2_C_GetLocalSocketTransforms::K2Node_MakeArray_Array' has a wrong offset!");

}

