#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MissionExt_TimerSound

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MissionGraphRuntime_structs.hpp"
#include "MissionGraphRuntime_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MissionExt_TimerSound.BP_MissionExt_TimerSound_C
// 0x0030 (0x0078 - 0x0048)
class UBP_MissionExt_TimerSound_C final : public UMissionExtension
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           CountdownSoundTimer;                               // 0x0050(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSecondsCountdown;                              // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_6108[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          TimerSound;                                        // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayMinutesSignal;                                 // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_6109[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ObjectiveExpiryTime;                               // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlayCountdownSound();
	void OnObjectiveStateChanged(class UMissionObjective* Objective, EMissionObjectiveState OldState, EMissionObjectiveState NewState);
	void ObjectiveTerminalStateCheck(EMissionObjectiveState ObjectiveState, bool* Return);
	void MinuteSignal();
	void ExecuteUbergraph_BP_MissionExt_TimerSound(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MissionExt_TimerSound_C">();
	}
	static class UBP_MissionExt_TimerSound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MissionExt_TimerSound_C>();
	}
};
static_assert(alignof(UBP_MissionExt_TimerSound_C) == 0x000008, "Wrong alignment on UBP_MissionExt_TimerSound_C");
static_assert(sizeof(UBP_MissionExt_TimerSound_C) == 0x000078, "Wrong size on UBP_MissionExt_TimerSound_C");
static_assert(offsetof(UBP_MissionExt_TimerSound_C, UberGraphFrame) == 0x000048, "Member 'UBP_MissionExt_TimerSound_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MissionExt_TimerSound_C, CountdownSoundTimer) == 0x000050, "Member 'UBP_MissionExt_TimerSound_C::CountdownSoundTimer' has a wrong offset!");
static_assert(offsetof(UBP_MissionExt_TimerSound_C, LastSecondsCountdown) == 0x000058, "Member 'UBP_MissionExt_TimerSound_C::LastSecondsCountdown' has a wrong offset!");
static_assert(offsetof(UBP_MissionExt_TimerSound_C, TimerSound) == 0x000060, "Member 'UBP_MissionExt_TimerSound_C::TimerSound' has a wrong offset!");
static_assert(offsetof(UBP_MissionExt_TimerSound_C, PlayMinutesSignal) == 0x000068, "Member 'UBP_MissionExt_TimerSound_C::PlayMinutesSignal' has a wrong offset!");
static_assert(offsetof(UBP_MissionExt_TimerSound_C, ObjectiveExpiryTime) == 0x000070, "Member 'UBP_MissionExt_TimerSound_C::ObjectiveExpiryTime' has a wrong offset!");

}

