#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MissionObj_BountyTarget

#include "Basic.hpp"

#include "MissionGraphRuntime_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function BP_MissionObj_BountyTarget.BP_MissionObj_BountyTarget_C.TrySetStateSafely
// 0x0001 (0x0001 - 0x0000)
struct BP_MissionObj_BountyTarget_C_TrySetStateSafely final
{
public:
	bool                                          bSuccessful;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionObj_BountyTarget_C_TrySetStateSafely) == 0x000001, "Wrong alignment on BP_MissionObj_BountyTarget_C_TrySetStateSafely");
static_assert(sizeof(BP_MissionObj_BountyTarget_C_TrySetStateSafely) == 0x000001, "Wrong size on BP_MissionObj_BountyTarget_C_TrySetStateSafely");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_TrySetStateSafely, bSuccessful) == 0x000000, "Member 'BP_MissionObj_BountyTarget_C_TrySetStateSafely::bSuccessful' has a wrong offset!");

// Function BP_MissionObj_BountyTarget.BP_MissionObj_BountyTarget_C.OnPlayerAliveStateChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_MissionObj_BountyTarget_C_OnPlayerAliveStateChanged final
{
public:
	class AGzPlayerState*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionObj_BountyTarget_C_OnPlayerAliveStateChanged) == 0x000008, "Wrong alignment on BP_MissionObj_BountyTarget_C_OnPlayerAliveStateChanged");
static_assert(sizeof(BP_MissionObj_BountyTarget_C_OnPlayerAliveStateChanged) == 0x000008, "Wrong size on BP_MissionObj_BountyTarget_C_OnPlayerAliveStateChanged");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_OnPlayerAliveStateChanged, PlayerState) == 0x000000, "Member 'BP_MissionObj_BountyTarget_C_OnPlayerAliveStateChanged::PlayerState' has a wrong offset!");

// Function BP_MissionObj_BountyTarget.BP_MissionObj_BountyTarget_C.ObjectiveStateCanBeChanged
// 0x0007 (0x0007 - 0x0000)
struct BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        CallFunc_GetState_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged) == 0x000001, "Wrong alignment on BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged");
static_assert(sizeof(BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged) == 0x000007, "Wrong size on BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged, Return) == 0x000000, "Member 'BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged::Return' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged, CallFunc_GetState_ReturnValue) == 0x000001, "Member 'BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000003, "Member 'BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000004, "Member 'BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged, CallFunc_BooleanOR_ReturnValue_1) == 0x000006, "Member 'BP_MissionObj_BountyTarget_C_ObjectiveStateCanBeChanged::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function BP_MissionObj_BountyTarget.BP_MissionObj_BountyTarget_C.ManualObjectiveStart
// 0x0001 (0x0001 - 0x0000)
struct BP_MissionObj_BountyTarget_C_ManualObjectiveStart final
{
public:
	bool                                          InstantSuccess;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionObj_BountyTarget_C_ManualObjectiveStart) == 0x000001, "Wrong alignment on BP_MissionObj_BountyTarget_C_ManualObjectiveStart");
static_assert(sizeof(BP_MissionObj_BountyTarget_C_ManualObjectiveStart) == 0x000001, "Wrong size on BP_MissionObj_BountyTarget_C_ManualObjectiveStart");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ManualObjectiveStart, InstantSuccess) == 0x000000, "Member 'BP_MissionObj_BountyTarget_C_ManualObjectiveStart::InstantSuccess' has a wrong offset!");

// Function BP_MissionObj_BountyTarget.BP_MissionObj_BountyTarget_C.HunterSquad_OnPlayerAliveStateChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_MissionObj_BountyTarget_C_HunterSquad_OnPlayerAliveStateChanged final
{
public:
	class AGzPlayerState*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionObj_BountyTarget_C_HunterSquad_OnPlayerAliveStateChanged) == 0x000008, "Wrong alignment on BP_MissionObj_BountyTarget_C_HunterSquad_OnPlayerAliveStateChanged");
static_assert(sizeof(BP_MissionObj_BountyTarget_C_HunterSquad_OnPlayerAliveStateChanged) == 0x000008, "Wrong size on BP_MissionObj_BountyTarget_C_HunterSquad_OnPlayerAliveStateChanged");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_HunterSquad_OnPlayerAliveStateChanged, PlayerState) == 0x000000, "Member 'BP_MissionObj_BountyTarget_C_HunterSquad_OnPlayerAliveStateChanged::PlayerState' has a wrong offset!");

// Function BP_MissionObj_BountyTarget.BP_MissionObj_BountyTarget_C.ExecuteUbergraph_BP_MissionObj_BountyTarget
// 0x00C8 (0x00C8 - 0x0000)
struct BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectiveStateCanBeChanged_Return;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_596D[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_596E[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         K2Node_CustomEvent_PlayerState_1;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzAliveState                                 CallFunc_GetPlayerAliveState_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzAliveState                                 CallFunc_GetPlayerAliveState_ReturnValue_1;        // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_596F[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         K2Node_CustomEvent_PlayerState;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzTeam*                                CallFunc_GetTeamFromPlayer_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyoneAlive_ReturnValue;                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5970[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGzPlayerState*>                 CallFunc_FindTeammates_ReturnValue;                // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5971[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGzPlayerState*>                 CallFunc_FindTeammates_ReturnValue_1;              // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5972[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InstantSuccess;                 // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectiveStateCanBeChanged_Return_1;      // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectiveStateCanBeChanged_Return_2;      // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectiveStateCanBeChanged_Return_3;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectiveStateCanBeChanged_Return_4;      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5973[0x2];                                     // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5974[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5975[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccessful;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5976[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget) == 0x000008, "Wrong alignment on BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget");
static_assert(sizeof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget) == 0x0000C8, "Wrong size on BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, EntryPoint) == 0x000000, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_ObjectiveStateCanBeChanged_Return) == 0x000004, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_ObjectiveStateCanBeChanged_Return' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, K2Node_CustomEvent_PlayerState_1) == 0x000020, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::K2Node_CustomEvent_PlayerState_1' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_GetPlayerAliveState_ReturnValue) == 0x000028, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_GetPlayerAliveState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, K2Node_SwitchEnum_CmpSuccess) == 0x00002A, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_GetPlayerAliveState_ReturnValue_1) == 0x00002B, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_GetPlayerAliveState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, K2Node_SwitchEnum_CmpSuccess_1) == 0x00002C, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, K2Node_CustomEvent_PlayerState) == 0x000030, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_GetTeamFromPlayer_ReturnValue) == 0x000038, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_GetTeamFromPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_IsValid_ReturnValue_2) == 0x000041, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_IsAnyoneAlive_ReturnValue) == 0x000042, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_IsAnyoneAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_IsValid_ReturnValue_3) == 0x000043, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_FindTeammates_ReturnValue) == 0x000048, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_FindTeammates_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_IsValid_ReturnValue_4) == 0x000061, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_FindTeammates_ReturnValue_1) == 0x000068, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_FindTeammates_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_Array_Get_Item) == 0x000080, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_HasAuthority_ReturnValue) == 0x00008C, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, K2Node_CustomEvent_InstantSuccess) == 0x00008D, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::K2Node_CustomEvent_InstantSuccess' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_ObjectiveStateCanBeChanged_Return_1) == 0x00008E, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_ObjectiveStateCanBeChanged_Return_1' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_ObjectiveStateCanBeChanged_Return_2) == 0x00008F, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_ObjectiveStateCanBeChanged_Return_2' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_ObjectiveStateCanBeChanged_Return_3) == 0x000090, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_ObjectiveStateCanBeChanged_Return_3' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_ObjectiveStateCanBeChanged_Return_4) == 0x000091, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_ObjectiveStateCanBeChanged_Return_4' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, Temp_int_Loop_Counter_Variable_1) == 0x000094, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, Temp_int_Array_Index_Variable_1) == 0x000098, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A8, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000AC, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, K2Node_CustomEvent_bSuccessful) == 0x0000B0, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::K2Node_CustomEvent_bSuccessful' has a wrong offset!");
static_assert(offsetof(BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B4, "Member 'BP_MissionObj_BountyTarget_C_ExecuteUbergraph_BP_MissionObj_BountyTarget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

}

