#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MissionFailedReasonDataAsset

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_MissionFailedReasonDataAsset.BP_MissionFailedReasonDataAsset_C.GetFailReason
// 0x0088 (0x0088 - 0x0000)
struct BP_MissionFailedReasonDataAsset_C_GetFailReason final
{
public:
	struct FGameplayTag                           FailReasonTag;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class FText                                   FailReasonText;                                    // 0x0008(0x0010)(Parm, OutParm)
	class FText                                   FoundText;                                         // 0x0018(0x0010)(Edit, BlueprintVisible)
	bool                                          IsFound;                                           // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C4E[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue; // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0010)()
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0070(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionFailedReasonDataAsset_C_GetFailReason) == 0x000008, "Wrong alignment on BP_MissionFailedReasonDataAsset_C_GetFailReason");
static_assert(sizeof(BP_MissionFailedReasonDataAsset_C_GetFailReason) == 0x000088, "Wrong size on BP_MissionFailedReasonDataAsset_C_GetFailReason");
static_assert(offsetof(BP_MissionFailedReasonDataAsset_C_GetFailReason, FailReasonTag) == 0x000000, "Member 'BP_MissionFailedReasonDataAsset_C_GetFailReason::FailReasonTag' has a wrong offset!");
static_assert(offsetof(BP_MissionFailedReasonDataAsset_C_GetFailReason, FailReasonText) == 0x000008, "Member 'BP_MissionFailedReasonDataAsset_C_GetFailReason::FailReasonText' has a wrong offset!");
static_assert(offsetof(BP_MissionFailedReasonDataAsset_C_GetFailReason, FoundText) == 0x000018, "Member 'BP_MissionFailedReasonDataAsset_C_GetFailReason::FoundText' has a wrong offset!");
static_assert(offsetof(BP_MissionFailedReasonDataAsset_C_GetFailReason, IsFound) == 0x000028, "Member 'BP_MissionFailedReasonDataAsset_C_GetFailReason::IsFound' has a wrong offset!");
static_assert(offsetof(BP_MissionFailedReasonDataAsset_C_GetFailReason, CallFunc_GetDebugStringFromGameplayTag_ReturnValue) == 0x000030, "Member 'BP_MissionFailedReasonDataAsset_C_GetFailReason::CallFunc_GetDebugStringFromGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionFailedReasonDataAsset_C_GetFailReason, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'BP_MissionFailedReasonDataAsset_C_GetFailReason::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionFailedReasonDataAsset_C_GetFailReason, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'BP_MissionFailedReasonDataAsset_C_GetFailReason::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MissionFailedReasonDataAsset_C_GetFailReason, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'BP_MissionFailedReasonDataAsset_C_GetFailReason::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionFailedReasonDataAsset_C_GetFailReason, CallFunc_Map_Find_Value) == 0x000070, "Member 'BP_MissionFailedReasonDataAsset_C_GetFailReason::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_MissionFailedReasonDataAsset_C_GetFailReason, CallFunc_Map_Find_ReturnValue) == 0x000080, "Member 'BP_MissionFailedReasonDataAsset_C_GetFailReason::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

}

