#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mobile_Toilet_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Mobile_Toilet_01.BP_Mobile_Toilet_01_C.UserConstructionScript
// 0x0258 (0x0258 - 0x0000)
struct BP_Mobile_Toilet_01_C_UserConstructionScript final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69F5[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69F6[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0038(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69F7[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0158(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mobile_Toilet_01_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Mobile_Toilet_01_C_UserConstructionScript");
static_assert(sizeof(BP_Mobile_Toilet_01_C_UserConstructionScript) == 0x000258, "Wrong size on BP_Mobile_Toilet_01_C_UserConstructionScript");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess_1) == 0x000001, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, CallFunc_BreakRotator_Roll) == 0x000010, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, CallFunc_BreakRotator_Pitch) == 0x000014, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, CallFunc_BreakRotator_Yaw) == 0x000018, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000020, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000038, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, CallFunc_BreakRotator_Roll_1) == 0x000130, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, CallFunc_BreakRotator_Pitch_1) == 0x000134, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, CallFunc_BreakRotator_Yaw_1) == 0x000138, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_1) == 0x000140, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x000158, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x000250, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Mobile_Toilet_01_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000254, "Member 'BP_Mobile_Toilet_01_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

}

