#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MissionStarter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_MissionStarter.BP_MissionStarter_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_MissionStarter_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionStarter_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_MissionStarter_C_ReceiveEndPlay");
static_assert(sizeof(BP_MissionStarter_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_MissionStarter_C_ReceiveEndPlay");
static_assert(offsetof(BP_MissionStarter_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_MissionStarter_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_MissionStarter.BP_MissionStarter_C.HandleInteraction
// 0x0008 (0x0008 - 0x0000)
struct BP_MissionStarter_C_HandleInteraction final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionStarter_C_HandleInteraction) == 0x000008, "Wrong alignment on BP_MissionStarter_C_HandleInteraction");
static_assert(sizeof(BP_MissionStarter_C_HandleInteraction) == 0x000008, "Wrong size on BP_MissionStarter_C_HandleInteraction");
static_assert(offsetof(BP_MissionStarter_C_HandleInteraction, Actor) == 0x000000, "Member 'BP_MissionStarter_C_HandleInteraction::Actor' has a wrong offset!");

// Function BP_MissionStarter.BP_MissionStarter_C.ExecuteUbergraph_BP_MissionStarter
// 0x0058 (0x0058 - 0x0000)
struct BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6624[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzMissionSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6625[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_InteractedBy;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         K2Node_ComponentBoundEvent_Interactable;           // 0x0020(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6626[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         K2Node_DynamicCast_AsGz_Player_State;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryStartMission_ReturnValue;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6627[0x1];                                     // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter) == 0x000008, "Wrong alignment on BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter");
static_assert(sizeof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter) == 0x000058, "Wrong size on BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter");
static_assert(offsetof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter, EntryPoint) == 0x000000, "Member 'BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter, K2Node_Event_EndPlayReason) == 0x000010, "Member 'BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter, K2Node_ComponentBoundEvent_InteractedBy) == 0x000018, "Member 'BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter::K2Node_ComponentBoundEvent_InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter, K2Node_ComponentBoundEvent_Interactable) == 0x000020, "Member 'BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter, K2Node_CustomEvent_Actor) == 0x000028, "Member 'BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter, K2Node_DynamicCast_AsGz_Player_Character) == 0x000030, "Member 'BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter, K2Node_DynamicCast_AsGz_Player_State) == 0x000040, "Member 'BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter::K2Node_DynamicCast_AsGz_Player_State' has a wrong offset!");
static_assert(offsetof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter, CallFunc_TryStartMission_ReturnValue) == 0x000049, "Member 'BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter::CallFunc_TryStartMission_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter, CallFunc_HasAuthority_ReturnValue) == 0x00004A, "Member 'BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x00004C, "Member 'BP_MissionStarter_C_ExecuteUbergraph_BP_MissionStarter::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");

// Function BP_MissionStarter.BP_MissionStarter_C.CanScanOnAnyDistance
// 0x0001 (0x0001 - 0x0000)
struct BP_MissionStarter_C_CanScanOnAnyDistance final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionStarter_C_CanScanOnAnyDistance) == 0x000001, "Wrong alignment on BP_MissionStarter_C_CanScanOnAnyDistance");
static_assert(sizeof(BP_MissionStarter_C_CanScanOnAnyDistance) == 0x000001, "Wrong size on BP_MissionStarter_C_CanScanOnAnyDistance");
static_assert(offsetof(BP_MissionStarter_C_CanScanOnAnyDistance, ReturnValue) == 0x000000, "Member 'BP_MissionStarter_C_CanScanOnAnyDistance::ReturnValue' has a wrong offset!");

// Function BP_MissionStarter.BP_MissionStarter_C.BndEvt__BP_MissionStarter_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_MissionStarter_C_BndEvt__BP_MissionStarter_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature final
{
public:
	class AActor*                                 InteractedBy;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         Interactable;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionStarter_C_BndEvt__BP_MissionStarter_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature) == 0x000008, "Wrong alignment on BP_MissionStarter_C_BndEvt__BP_MissionStarter_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature");
static_assert(sizeof(BP_MissionStarter_C_BndEvt__BP_MissionStarter_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature) == 0x000010, "Wrong size on BP_MissionStarter_C_BndEvt__BP_MissionStarter_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature");
static_assert(offsetof(BP_MissionStarter_C_BndEvt__BP_MissionStarter_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature, InteractedBy) == 0x000000, "Member 'BP_MissionStarter_C_BndEvt__BP_MissionStarter_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature::InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_MissionStarter_C_BndEvt__BP_MissionStarter_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature, Interactable) == 0x000008, "Member 'BP_MissionStarter_C_BndEvt__BP_MissionStarter_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature::Interactable' has a wrong offset!");

}

