#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MortarGroundTargetPreview

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S_MortarWarningFlareData_structs.hpp"


namespace SDK::Params
{

// Function BP_MortarGroundTargetPreview.BP_MortarGroundTargetPreview_C.AddWarningFlare
// 0x00D8 (0x00D8 - 0x0000)
struct BP_MortarGroundTargetPreview_C_AddWarningFlare final
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TraceFlareTargetGroundLocation_HasHit;    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69D8[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_TraceFlareTargetGroundLocation_DropDistance; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TraceFlareTargetGroundLocation_SpawnLocation; // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnWarningFlareTrail_NiagaraComponent;  // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_MortarWarningFlareData              K2Node_MakeStruct_S_MortarWarningFlareData;        // 0x00A8(0x0028)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MortarGroundTargetPreview_C_AddWarningFlare) == 0x000008, "Wrong alignment on BP_MortarGroundTargetPreview_C_AddWarningFlare");
static_assert(sizeof(BP_MortarGroundTargetPreview_C_AddWarningFlare) == 0x0000D8, "Wrong size on BP_MortarGroundTargetPreview_C_AddWarningFlare");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_AddWarningFlare, Offset) == 0x000000, "Member 'BP_MortarGroundTargetPreview_C_AddWarningFlare::Offset' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_AddWarningFlare, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_MortarGroundTargetPreview_C_AddWarningFlare::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_AddWarningFlare, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'BP_MortarGroundTargetPreview_C_AddWarningFlare::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_AddWarningFlare, CallFunc_Add_VectorVector_ReturnValue) == 0x000048, "Member 'BP_MortarGroundTargetPreview_C_AddWarningFlare::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_AddWarningFlare, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000060, "Member 'BP_MortarGroundTargetPreview_C_AddWarningFlare::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_AddWarningFlare, CallFunc_TraceFlareTargetGroundLocation_HasHit) == 0x000078, "Member 'BP_MortarGroundTargetPreview_C_AddWarningFlare::CallFunc_TraceFlareTargetGroundLocation_HasHit' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_AddWarningFlare, CallFunc_TraceFlareTargetGroundLocation_DropDistance) == 0x000080, "Member 'BP_MortarGroundTargetPreview_C_AddWarningFlare::CallFunc_TraceFlareTargetGroundLocation_DropDistance' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_AddWarningFlare, CallFunc_TraceFlareTargetGroundLocation_SpawnLocation) == 0x000088, "Member 'BP_MortarGroundTargetPreview_C_AddWarningFlare::CallFunc_TraceFlareTargetGroundLocation_SpawnLocation' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_AddWarningFlare, CallFunc_SpawnWarningFlareTrail_NiagaraComponent) == 0x0000A0, "Member 'BP_MortarGroundTargetPreview_C_AddWarningFlare::CallFunc_SpawnWarningFlareTrail_NiagaraComponent' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_AddWarningFlare, K2Node_MakeStruct_S_MortarWarningFlareData) == 0x0000A8, "Member 'BP_MortarGroundTargetPreview_C_AddWarningFlare::K2Node_MakeStruct_S_MortarWarningFlareData' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_AddWarningFlare, CallFunc_Array_Add_ReturnValue) == 0x0000D0, "Member 'BP_MortarGroundTargetPreview_C_AddWarningFlare::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_MortarGroundTargetPreview.BP_MortarGroundTargetPreview_C.BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69D9[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_MortarGroundTargetPreview.BP_MortarGroundTargetPreview_C.BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_MortarGroundTargetPreview_C_BndEvt__BP_MortarGroundTargetPreview_WarningCapsule_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_MortarGroundTargetPreview.BP_MortarGroundTargetPreview_C.EnableWarningVisualsAndOverlap
// 0x0018 (0x0018 - 0x0000)
struct BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69DA[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap) == 0x000008, "Wrong alignment on BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap");
static_assert(sizeof(BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap) == 0x000018, "Wrong size on BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap, Progress) == 0x000000, "Member 'BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap::Progress' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap, CallFunc_IsDedicatedServer_ReturnValue) == 0x000009, "Member 'BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap, CallFunc_IsValid_ReturnValue_1) == 0x00000A, "Member 'BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000010, "Member 'BP_MortarGroundTargetPreview_C_EnableWarningVisualsAndOverlap::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function BP_MortarGroundTargetPreview.BP_MortarGroundTargetPreview_C.ExecuteUbergraph_BP_MortarGroundTargetPreview
// 0x02D8 (0x02D8 - 0x0000)
struct BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69DB[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69DC[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0028(0x0020)()
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69DD[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0068(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69DE[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69DF[0x3];                                     // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character_1;        // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69E0[0x5];                                     // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Normal2D_ReturnValue;              // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_MortarWarningFlareData              CallFunc_Array_Get_Item;                           // 0x0210(0x0028)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69E1[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MortarWarningFlareData              CallFunc_Array_Get_Item_1;                         // 0x0240(0x0028)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69E2[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_FallingProgress;                // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69E3[0x3];                                     // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69E4[0x3];                                     // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MortarWarningFlareData              CallFunc_Array_Get_Item_2;                         // 0x0288(0x0028)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x02B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x02B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_FlareFallingProgress_ImplicitCast; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateWarningFlareTrailLocation_Progress_ImplicitCast; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNewTime_NewTime_ImplicitCast;          // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview) == 0x000008, "Wrong alignment on BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview");
static_assert(sizeof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview) == 0x0002D8, "Wrong size on BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, EntryPoint) == 0x000000, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_HasAuthority_ReturnValue) == 0x00000C, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, Temp_int_Array_Index_Variable_2) == 0x000020, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000028, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000048, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000050, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000058, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000060, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_ComponentBoundEvent_bFromSweep) == 0x000064, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_ComponentBoundEvent_SweepResult) == 0x000068, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_DynamicCast_AsGz_Player_Character) == 0x000160, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000170, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_ComponentBoundEvent_OtherActor) == 0x000178, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_ComponentBoundEvent_OtherComp) == 0x000180, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000188, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x00018C, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_DynamicCast_AsGz_Player_Character_1) == 0x000190, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_DynamicCast_AsGz_Player_Character_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_DynamicCast_bSuccess_1) == 0x000198, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x000199, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_Event_EndPlayReason) == 0x00019A, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_RandomUnitVector_ReturnValue) == 0x0001A0, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001B8, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Vector_Normal2D_ReturnValue) == 0x0001C0, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Vector_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0001D8, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0001F0, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000208, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Array_Get_Item) == 0x000210, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Array_Length_ReturnValue) == 0x000238, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Array_Get_Item_1) == 0x000240, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Array_Length_ReturnValue_1) == 0x000268, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Less_IntInt_ReturnValue) == 0x00026C, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_CustomEvent_FallingProgress) == 0x000270, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_CustomEvent_FallingProgress' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, Temp_int_Loop_Counter_Variable_2) == 0x000278, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Less_IntInt_ReturnValue_1) == 0x00027C, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Add_IntInt_ReturnValue_2) == 0x000280, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_IsDedicatedServer_ReturnValue) == 0x000284, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Array_Get_Item_2) == 0x000288, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Array_Length_ReturnValue_2) == 0x0002B0, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_IsValid_ReturnValue) == 0x0002B4, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002B5, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0002B6, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0002B7, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, K2Node_VariableSet_FlareFallingProgress_ImplicitCast) == 0x0002B8, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::K2Node_VariableSet_FlareFallingProgress_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_UpdateWarningFlareTrailLocation_Progress_ImplicitCast) == 0x0002C0, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_UpdateWarningFlareTrailLocation_Progress_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_Delay_Duration_ImplicitCast) == 0x0002C8, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x0002CC, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview, CallFunc_SetNewTime_NewTime_ImplicitCast) == 0x0002D0, "Member 'BP_MortarGroundTargetPreview_C_ExecuteUbergraph_BP_MortarGroundTargetPreview::CallFunc_SetNewTime_NewTime_ImplicitCast' has a wrong offset!");

// Function BP_MortarGroundTargetPreview.BP_MortarGroundTargetPreview_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_MortarGroundTargetPreview_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MortarGroundTargetPreview_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_MortarGroundTargetPreview_C_ReceiveEndPlay");
static_assert(sizeof(BP_MortarGroundTargetPreview_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_MortarGroundTargetPreview_C_ReceiveEndPlay");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_MortarGroundTargetPreview_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_MortarGroundTargetPreview.BP_MortarGroundTargetPreview_C.SpawnFlaresWithProgress
// 0x0008 (0x0008 - 0x0000)
struct BP_MortarGroundTargetPreview_C_SpawnFlaresWithProgress final
{
public:
	double                                        FallingProgress;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MortarGroundTargetPreview_C_SpawnFlaresWithProgress) == 0x000008, "Wrong alignment on BP_MortarGroundTargetPreview_C_SpawnFlaresWithProgress");
static_assert(sizeof(BP_MortarGroundTargetPreview_C_SpawnFlaresWithProgress) == 0x000008, "Wrong size on BP_MortarGroundTargetPreview_C_SpawnFlaresWithProgress");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_SpawnFlaresWithProgress, FallingProgress) == 0x000000, "Member 'BP_MortarGroundTargetPreview_C_SpawnFlaresWithProgress::FallingProgress' has a wrong offset!");

// Function BP_MortarGroundTargetPreview.BP_MortarGroundTargetPreview_C.SpawnWarningFlareTrail
// 0x0030 (0x0030 - 0x0000)
struct BP_MortarGroundTargetPreview_C_SpawnWarningFlareTrail final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MortarGroundTargetPreview_C_SpawnWarningFlareTrail) == 0x000008, "Wrong alignment on BP_MortarGroundTargetPreview_C_SpawnWarningFlareTrail");
static_assert(sizeof(BP_MortarGroundTargetPreview_C_SpawnWarningFlareTrail) == 0x000030, "Wrong size on BP_MortarGroundTargetPreview_C_SpawnWarningFlareTrail");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_SpawnWarningFlareTrail, SpawnLocation) == 0x000000, "Member 'BP_MortarGroundTargetPreview_C_SpawnWarningFlareTrail::SpawnLocation' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_SpawnWarningFlareTrail, NiagaraComponent) == 0x000018, "Member 'BP_MortarGroundTargetPreview_C_SpawnWarningFlareTrail::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_SpawnWarningFlareTrail, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000020, "Member 'BP_MortarGroundTargetPreview_C_SpawnWarningFlareTrail::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_SpawnWarningFlareTrail, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000028, "Member 'BP_MortarGroundTargetPreview_C_SpawnWarningFlareTrail::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");

// Function BP_MortarGroundTargetPreview.BP_MortarGroundTargetPreview_C.SpawnWarningGroundFlare
// 0x0030 (0x0030 - 0x0000)
struct BP_MortarGroundTargetPreview_C_SpawnWarningGroundFlare final
{
public:
	class UNiagaraComponent*                      TrailParticleSystem;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69E5[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MortarGroundTargetPreview_C_SpawnWarningGroundFlare) == 0x000008, "Wrong alignment on BP_MortarGroundTargetPreview_C_SpawnWarningGroundFlare");
static_assert(sizeof(BP_MortarGroundTargetPreview_C_SpawnWarningGroundFlare) == 0x000030, "Wrong size on BP_MortarGroundTargetPreview_C_SpawnWarningGroundFlare");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_SpawnWarningGroundFlare, TrailParticleSystem) == 0x000000, "Member 'BP_MortarGroundTargetPreview_C_SpawnWarningGroundFlare::TrailParticleSystem' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_SpawnWarningGroundFlare, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_MortarGroundTargetPreview_C_SpawnWarningGroundFlare::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_SpawnWarningGroundFlare, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'BP_MortarGroundTargetPreview_C_SpawnWarningGroundFlare::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_SpawnWarningGroundFlare, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000028, "Member 'BP_MortarGroundTargetPreview_C_SpawnWarningGroundFlare::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function BP_MortarGroundTargetPreview.BP_MortarGroundTargetPreview_C.TraceFlareTargetGroundLocation
// 0x0258 (0x0258 - 0x0000)
struct BP_MortarGroundTargetPreview_C_TraceFlareTargetGroundLocation final
{
public:
	struct FVector                                StartingLocation;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasHit;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69E6[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DropDistance;                                      // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnLocation;                                     // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0040(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0080(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69E7[0x1];                                     // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69E8[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69E9[0x4];                                     // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_DropDistance_ImplicitCast;   // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MortarGroundTargetPreview_C_TraceFlareTargetGroundLocation) == 0x000008, "Wrong alignment on BP_MortarGroundTargetPreview_C_TraceFlareTargetGroundLocation");
static_assert(sizeof(BP_MortarGroundTargetPreview_C_TraceFlareTargetGroundLocation) == 0x000258, "Wrong size on BP_MortarGroundTargetPreview_C_TraceFlareTargetGroundLocation");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_TraceFlareTargetGroundLocation, StartingLocation) == 0x000000, "Member 'BP_MortarGroundTargetPreview_C_TraceFlareTargetGroundLocation::StartingLocation' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_TraceFlareTargetGroundLocation, HasHit) == 0x000018, "Member 'BP_MortarGroundTargetPreview_C_TraceFlareTargetGroundLocation::HasHit' has a wrong offset!");
static_assert(offsetof(BP_MortarGroundTargetPreview_C_TraceFlareTargetGroundLocation, DropDistance) == 0x000020, "Member 'BP_MortarGroundTargetPreview_C_TraceFlareTargetGroundLocation::DropDistance' has a wrong offset!");
