#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mission_Bounty_Target

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "G01_structs.hpp"
#include "MissionGraphRuntime_structs.hpp"


namespace SDK::Params
{

// Function BP_Mission_Bounty_Target.BP_Mission_Bounty_Target_C.OnRep_TargetPlayerState
// 0x00F8 (0x00F8 - 0x0000)
struct BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F3E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F3F[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0010)()
};
static_assert(alignof(BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState) == 0x000008, "Wrong alignment on BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState");
static_assert(sizeof(BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState) == 0x0000F8, "Wrong size on BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000060, "Member 'BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState, CallFunc_GetPlayerName_ReturnValue) == 0x000070, "Member 'BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState, K2Node_MakeArray_Array) == 0x0000D8, "Member 'BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'BP_Mission_Bounty_Target_C_OnRep_TargetPlayerState::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_Mission_Bounty_Target.BP_Mission_Bounty_Target_C.OnObjectiveStateChanged_BonusTargetA
// 0x0010 (0x0010 - 0x0000)
struct BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetA final
{
public:
	class UMissionObjective*                      Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        OldState;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        NewState;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetA) == 0x000008, "Wrong alignment on BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetA");
static_assert(sizeof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetA) == 0x000010, "Wrong size on BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetA");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetA, Objective) == 0x000000, "Member 'BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetA::Objective' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetA, OldState) == 0x000008, "Member 'BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetA::OldState' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetA, NewState) == 0x000009, "Member 'BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetA::NewState' has a wrong offset!");

// Function BP_Mission_Bounty_Target.BP_Mission_Bounty_Target_C.FindDistanceToClosestHunter
// 0x0090 (0x0090 - 0x0000)
struct BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter final
{
public:
	class AActor*                                 ActorToTrack;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        DistSquared;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 L_PlayerPawnRef;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           L_Target;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	float                                         L_CurrentDistance;                                 // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F40[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        L_ClosestDistance;                                 // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F41[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F42[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGzPlayerState*>                 CallFunc_FindTeammates_ReturnValue;                // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F43[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzAliveState                                 CallFunc_GetPlayerAliveState_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F44[0x1];                                     // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSquaredDistanceTo_ReturnValue;         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F45[0x2];                                     // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_L_ClosestDistance_ImplicitCast; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter) == 0x000008, "Wrong alignment on BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter");
static_assert(sizeof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter) == 0x000090, "Wrong size on BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, ActorToTrack) == 0x000000, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::ActorToTrack' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, DistSquared) == 0x000008, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::DistSquared' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, L_PlayerPawnRef) == 0x000010, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::L_PlayerPawnRef' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, L_Target) == 0x000018, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::L_Target' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, L_CurrentDistance) == 0x000020, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::L_CurrentDistance' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, L_ClosestDistance) == 0x000028, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::L_ClosestDistance' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, Temp_bool_True_if_break_was_hit_Variable) == 0x000040, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000042, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000043, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_FindTeammates_ReturnValue) == 0x000048, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_FindTeammates_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_GetPawn_ReturnValue) == 0x000068, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_GetPlayerAliveState_ReturnValue) == 0x000070, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_GetPlayerAliveState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_IsValid_ReturnValue_2) == 0x000071, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000072, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_GetSquaredDistanceTo_ReturnValue) == 0x000074, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_GetSquaredDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_BooleanAND_ReturnValue) == 0x00007D, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, K2Node_VariableSet_L_ClosestDistance_ImplicitCast) == 0x000080, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::K2Node_VariableSet_L_ClosestDistance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000088, "Member 'BP_Mission_Bounty_Target_C_FindDistanceToClosestHunter::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_Mission_Bounty_Target.BP_Mission_Bounty_Target_C.OnObjectiveStateChanged_Delegate_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_Delegate_Event final
{
public:
	class UMissionObjective*                      Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        OldState;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        NewState;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_Delegate_Event) == 0x000008, "Wrong alignment on BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_Delegate_Event");
static_assert(sizeof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_Delegate_Event) == 0x000010, "Wrong size on BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_Delegate_Event");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_Delegate_Event, Objective) == 0x000000, "Member 'BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_Delegate_Event::Objective' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_Delegate_Event, OldState) == 0x000008, "Member 'BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_Delegate_Event::OldState' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_Delegate_Event, NewState) == 0x000009, "Member 'BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_Delegate_Event::NewState' has a wrong offset!");

// Function BP_Mission_Bounty_Target.BP_Mission_Bounty_Target_C.OnObjectiveStateChanged_BonusTargetB
// 0x0010 (0x0010 - 0x0000)
struct BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetB final
{
public:
	class UMissionObjective*                      Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        OldState;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        NewState;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetB) == 0x000008, "Wrong alignment on BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetB");
static_assert(sizeof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetB) == 0x000010, "Wrong size on BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetB");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetB, Objective) == 0x000000, "Member 'BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetB::Objective' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetB, OldState) == 0x000008, "Member 'BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetB::OldState' has a wrong offset!");
static_assert(offsetof(BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetB, NewState) == 0x000009, "Member 'BP_Mission_Bounty_Target_C_OnObjectiveStateChanged_BonusTargetB::NewState' has a wrong offset!");

// Function BP_Mission_Bounty_Target.BP_Mission_Bounty_Target_C.ExecuteUbergraph_BP_Mission_Bounty_Target
// 0x01B0 (0x01B0 - 0x0000)
struct BP_Mission_Bounty_Target_C_ExecuteUbergraph_BP_Mission_Bounty_Target final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F46[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      CallFunc_GetObjectiveWithName_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMissionObjective* Objective, EMissionObjectiveState OldState, EMissionObjectiveState NewState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F47[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionRuntimeContext*                 CallFunc_GetRuntimeContext_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      CallFunc_GetObjectiveWithName_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F48[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MissionObj_BountyTarget_C*          K2Node_DynamicCast_AsBP_Mission_Obj_Bounty_Target; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F49[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MRC_BountyTarget_C*                 K2Node_DynamicCast_AsBP_MRC_Bounty_Target;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4A[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetMissionInstigator_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4B[0x5];                                     // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      K2Node_CustomEvent_Objective_2;                    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        K2Node_CustomEvent_OldState_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        K2Node_CustomEvent_NewState_2;                     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4C[0x5];                                     // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      CallFunc_GetObjectiveWithName_ReturnValue_2;       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      CallFunc_GetObjectiveWithName_ReturnValue_3;       // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_MissionObj_BountyTarget_C*          K2Node_DynamicCast_AsBP_Mission_Obj_Bounty_Target_1; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4D[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MissionObj_BountyTarget_C*          K2Node_DynamicCast_AsBP_Mission_Obj_Bounty_Target_2; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4E[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      CallFunc_GetObjectiveWithName_ReturnValue_4;       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_MissionObj_BountyTarget_C*          K2Node_DynamicCast_AsBP_Mission_Obj_Bounty_Target_3; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4F[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      CallFunc_GetObjectiveWithName_ReturnValue_5;       // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      CallFunc_GetObjectiveWithName_ReturnValue_6;       // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_MissionObj_BountyTarget_C*          K2Node_DynamicCast_AsBP_Mission_Obj_Bounty_Target_4; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F50[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MissionObj_BountyTarget_C*          K2Node_DynamicCast_AsBP_Mission_Obj_Bounty_Target_5; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F51[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F52[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      CallFunc_GetObjectiveWithName_ReturnValue_7;       // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      CallFunc_GetObjectiveWithName_ReturnValue_8;       // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_Objective_BH_KillTarget_C*          K2Node_DynamicCast_AsBP_Objective_BH_Kill_Target;  // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F53[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Objective_BH_KillTarget_C*          K2Node_DynamicCast_AsBP_Objective_BH_Kill_Target_1; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F54[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGzPlayerState*>                 CallFunc_FindTeammates_ReturnValue;                // 0x0130(0x0010)(ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F55[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_Array_Get_Item;                           // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzConnectionState                            CallFunc_GetConnectionState_ReturnValue;           // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F56[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F57[0x5];                                     // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      K2Node_CustomEvent_Objective_1;                    // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        K2Node_CustomEvent_OldState_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        K2Node_CustomEvent_NewState_1;                     // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMissionObjective* Objective, EMissionObjectiveState OldState, EMissionObjectiveState NewState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x016C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F58[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      K2Node_CustomEvent_Objective;                      // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        K2Node_CustomEvent_OldState;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        K2Node_CustomEvent_NewState;                       // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F59[0x1];                                     // 0x018B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UMissionObjective* Objective, EMissionObjectiveState OldState, EMissionObjectiveState NewState)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x018C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzAliveState                                 CallFunc_GetPlayerAliveState_ReturnValue;          // 0x019E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x019F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzAliveState                                 CallFunc_GetPlayerAliveState_ReturnValue_1;        // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F5A[0x3];                                     // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_MissionTimeLimit_ImplicitCast;  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mission_Bounty_Target_C_ExecuteUbergraph_BP_Mission_Bounty_Target) == 0x000008, "Wrong alignment on BP_Mission_Bounty_Target_C_ExecuteUbergraph_BP_Mission_Bounty_Target");
static_assert(sizeof(BP_Mission_Bounty_Target_C_ExecuteUbergraph_BP_Mission_Bounty_Target) == 0x0001B0, "Wrong size on BP_Mission_Bounty_Target_C_ExecuteUbergraph_BP_Mission_Bounty_Target");
static_assert(offsetof(BP_Mission_Bounty_Target_C_ExecuteUbergraph_BP_Mission_Bounty_Target, EntryPoint) == 0x000000, "Member 'BP_Mission_Bounty_Target_C_ExecuteUbergraph_BP_Mission_Bounty_Target::EntryPoint' has a wrong offset!");
