#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mobile_Toilet_01

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "BP_Mobile_Toilet_Materials_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mobile_Toilet_01.BP_Mobile_Toilet_01_C
// 0x0048 (0x02E8 - 0x02A0)
class ABP_Mobile_Toilet_01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Mobile_Toilet_01_Cap_01;                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Mobile_Toilet_01_Door_01;                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Mobile_Toilet_01;                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Toilet_Door;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Toilet_Cap;                                        // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Graffity_Dirt;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Graffity_Clean;                                    // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EBP_Mobile_Toilet_Materials                   Surface_Material;                                  // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mobile_Toilet_01_C">();
	}
	static class ABP_Mobile_Toilet_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mobile_Toilet_01_C>();
	}
};
static_assert(alignof(ABP_Mobile_Toilet_01_C) == 0x000008, "Wrong alignment on ABP_Mobile_Toilet_01_C");
static_assert(sizeof(ABP_Mobile_Toilet_01_C) == 0x0002E8, "Wrong size on ABP_Mobile_Toilet_01_C");
static_assert(offsetof(ABP_Mobile_Toilet_01_C, SM_Mobile_Toilet_01_Cap_01) == 0x0002A0, "Member 'ABP_Mobile_Toilet_01_C::SM_Mobile_Toilet_01_Cap_01' has a wrong offset!");
static_assert(offsetof(ABP_Mobile_Toilet_01_C, SM_Mobile_Toilet_01_Door_01) == 0x0002A8, "Member 'ABP_Mobile_Toilet_01_C::SM_Mobile_Toilet_01_Door_01' has a wrong offset!");
static_assert(offsetof(ABP_Mobile_Toilet_01_C, SM_Mobile_Toilet_01) == 0x0002B0, "Member 'ABP_Mobile_Toilet_01_C::SM_Mobile_Toilet_01' has a wrong offset!");
static_assert(offsetof(ABP_Mobile_Toilet_01_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_Mobile_Toilet_01_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Mobile_Toilet_01_C, Toilet_Door) == 0x0002C0, "Member 'ABP_Mobile_Toilet_01_C::Toilet_Door' has a wrong offset!");
static_assert(offsetof(ABP_Mobile_Toilet_01_C, Toilet_Cap) == 0x0002C8, "Member 'ABP_Mobile_Toilet_01_C::Toilet_Cap' has a wrong offset!");
static_assert(offsetof(ABP_Mobile_Toilet_01_C, Graffity_Dirt) == 0x0002D0, "Member 'ABP_Mobile_Toilet_01_C::Graffity_Dirt' has a wrong offset!");
static_assert(offsetof(ABP_Mobile_Toilet_01_C, Graffity_Clean) == 0x0002D8, "Member 'ABP_Mobile_Toilet_01_C::Graffity_Clean' has a wrong offset!");
static_assert(offsetof(ABP_Mobile_Toilet_01_C, Surface_Material) == 0x0002E0, "Member 'ABP_Mobile_Toilet_01_C::Surface_Material' has a wrong offset!");

}

