#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MH_Container_Cylinder_02

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MH_Container_Cylinder_02.BP_MH_Container_Cylinder_02_C
// 0x0018 (0x02B8 - 0x02A0)
class ABP_MH_Container_Cylinder_02_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_MH_Container_Cylinder_02_Decals;                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MH_Container_Cylinder_02;                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MH_Container_Cylinder_02_C">();
	}
	static class ABP_MH_Container_Cylinder_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MH_Container_Cylinder_02_C>();
	}
};
static_assert(alignof(ABP_MH_Container_Cylinder_02_C) == 0x000008, "Wrong alignment on ABP_MH_Container_Cylinder_02_C");
static_assert(sizeof(ABP_MH_Container_Cylinder_02_C) == 0x0002B8, "Wrong size on ABP_MH_Container_Cylinder_02_C");
static_assert(offsetof(ABP_MH_Container_Cylinder_02_C, SM_MH_Container_Cylinder_02_Decals) == 0x0002A0, "Member 'ABP_MH_Container_Cylinder_02_C::SM_MH_Container_Cylinder_02_Decals' has a wrong offset!");
static_assert(offsetof(ABP_MH_Container_Cylinder_02_C, SM_MH_Container_Cylinder_02) == 0x0002A8, "Member 'ABP_MH_Container_Cylinder_02_C::SM_MH_Container_Cylinder_02' has a wrong offset!");
static_assert(offsetof(ABP_MH_Container_Cylinder_02_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_MH_Container_Cylinder_02_C::DefaultSceneRoot' has a wrong offset!");

}

