#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MinigunComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MinigunComponent.BP_MinigunComponent_C.ExecuteUbergraph_BP_MinigunComponent
// 0x0028 (0x0028 - 0x0000)
struct BP_MinigunComponent_C_ExecuteUbergraph_BP_MinigunComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bOverheated;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E65[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Bool_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(bool bOverheated)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MinigunComponent_C_ExecuteUbergraph_BP_MinigunComponent) == 0x000008, "Wrong alignment on BP_MinigunComponent_C_ExecuteUbergraph_BP_MinigunComponent");
static_assert(sizeof(BP_MinigunComponent_C_ExecuteUbergraph_BP_MinigunComponent) == 0x000028, "Wrong size on BP_MinigunComponent_C_ExecuteUbergraph_BP_MinigunComponent");
static_assert(offsetof(BP_MinigunComponent_C_ExecuteUbergraph_BP_MinigunComponent, EntryPoint) == 0x000000, "Member 'BP_MinigunComponent_C_ExecuteUbergraph_BP_MinigunComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MinigunComponent_C_ExecuteUbergraph_BP_MinigunComponent, K2Node_CustomEvent_bOverheated) == 0x000004, "Member 'BP_MinigunComponent_C_ExecuteUbergraph_BP_MinigunComponent::K2Node_CustomEvent_bOverheated' has a wrong offset!");
static_assert(offsetof(BP_MinigunComponent_C_ExecuteUbergraph_BP_MinigunComponent, CallFunc_BuildString_Bool_ReturnValue) == 0x000008, "Member 'BP_MinigunComponent_C_ExecuteUbergraph_BP_MinigunComponent::CallFunc_BuildString_Bool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MinigunComponent_C_ExecuteUbergraph_BP_MinigunComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_MinigunComponent_C_ExecuteUbergraph_BP_MinigunComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_MinigunComponent.BP_MinigunComponent_C.OnEndShooting_Event
// 0x0001 (0x0001 - 0x0000)
struct BP_MinigunComponent_C_OnEndShooting_Event final
{
public:
	bool                                          bOverheated;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MinigunComponent_C_OnEndShooting_Event) == 0x000001, "Wrong alignment on BP_MinigunComponent_C_OnEndShooting_Event");
static_assert(sizeof(BP_MinigunComponent_C_OnEndShooting_Event) == 0x000001, "Wrong size on BP_MinigunComponent_C_OnEndShooting_Event");
static_assert(offsetof(BP_MinigunComponent_C_OnEndShooting_Event, bOverheated) == 0x000000, "Member 'BP_MinigunComponent_C_OnEndShooting_Event::bOverheated' has a wrong offset!");

}

