#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MissionExt_TimerSound

#include "Basic.hpp"

#include "MissionGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_MissionExt_TimerSound.BP_MissionExt_TimerSound_C.OnObjectiveStateChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_MissionExt_TimerSound_C_OnObjectiveStateChanged final
{
public:
	class UMissionObjective*                      Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        OldState;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        NewState;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionExt_TimerSound_C_OnObjectiveStateChanged) == 0x000008, "Wrong alignment on BP_MissionExt_TimerSound_C_OnObjectiveStateChanged");
static_assert(sizeof(BP_MissionExt_TimerSound_C_OnObjectiveStateChanged) == 0x000010, "Wrong size on BP_MissionExt_TimerSound_C_OnObjectiveStateChanged");
static_assert(offsetof(BP_MissionExt_TimerSound_C_OnObjectiveStateChanged, Objective) == 0x000000, "Member 'BP_MissionExt_TimerSound_C_OnObjectiveStateChanged::Objective' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_OnObjectiveStateChanged, OldState) == 0x000008, "Member 'BP_MissionExt_TimerSound_C_OnObjectiveStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_OnObjectiveStateChanged, NewState) == 0x000009, "Member 'BP_MissionExt_TimerSound_C_OnObjectiveStateChanged::NewState' has a wrong offset!");

// Function BP_MissionExt_TimerSound.BP_MissionExt_TimerSound_C.ObjectiveTerminalStateCheck
// 0x0007 (0x0007 - 0x0000)
struct BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck final
{
public:
	EMissionObjectiveState                        ObjectiveState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck) == 0x000001, "Wrong alignment on BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck");
static_assert(sizeof(BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck) == 0x000007, "Wrong size on BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck, ObjectiveState) == 0x000000, "Member 'BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck::ObjectiveState' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck, Return) == 0x000001, "Member 'BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck::Return' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000003, "Member 'BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000004, "Member 'BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck, CallFunc_BooleanOR_ReturnValue_1) == 0x000006, "Member 'BP_MissionExt_TimerSound_C_ObjectiveTerminalStateCheck::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function BP_MissionExt_TimerSound.BP_MissionExt_TimerSound_C.ExecuteUbergraph_BP_MissionExt_TimerSound
// 0x00D8 (0x00D8 - 0x0000)
struct BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_610A[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_610B[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      K2Node_Event_Objective;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        K2Node_Event_OldState;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        K2Node_Event_NewState;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectiveTerminalStateCheck_Return;       // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_610C[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_610D[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0064(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0074(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_610E[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_610F[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6110[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6111[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound) == 0x000008, "Wrong alignment on BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound");
static_assert(sizeof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound) == 0x0000D8, "Wrong size on BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, EntryPoint) == 0x000000, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, Temp_delegate_Variable) == 0x000004, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, Temp_int_Variable) == 0x000014, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, Temp_bool_IsClosed_Variable) == 0x000038, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, Temp_bool_Has_Been_Initd_Variable) == 0x000039, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, K2Node_Event_Objective) == 0x000040, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::K2Node_Event_Objective' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, K2Node_Event_OldState) == 0x000048, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::K2Node_Event_OldState' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, K2Node_Event_NewState) == 0x000049, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004A, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_ObjectiveTerminalStateCheck_Return) == 0x00004B, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_ObjectiveTerminalStateCheck_Return' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, Temp_bool_Has_Been_Initd_Variable_1) == 0x00004C, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_GetGameState_ReturnValue) == 0x000050, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000058, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, Temp_bool_IsClosed_Variable_1) == 0x000060, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, Temp_delegate_Variable_1) == 0x000064, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, Temp_delegate_Variable_2) == 0x000074, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, Temp_bool_Has_Been_Initd_Variable_2) == 0x000084, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_MakeLiteralInt_ReturnValue) == 0x000088, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, K2Node_CreateDelegate_OutputDelegate_1) == 0x000090, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0000A0, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A8, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_PostEvent_ReturnValue) == 0x0000AC, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_PostEvent_ReturnValue_1) == 0x0000B0, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_PostEvent_ReturnValue_2) == 0x0000B4, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, Temp_bool_IsClosed_Variable_2) == 0x0000B8, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_Round_ReturnValue) == 0x0000C8, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_Percent_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000D1, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D2, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound, CallFunc_BooleanAND_ReturnValue) == 0x0000D3, "Member 'BP_MissionExt_TimerSound_C_ExecuteUbergraph_BP_MissionExt_TimerSound::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

