#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MissionStart_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EPlacementDebugShapes_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MissionStart_Base.BP_MissionStart_Base_C
// 0x0030 (0x0348 - 0x0318)
class ABP_MissionStart_Base_C : public AGzMissionStarterSpawner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   PlacementDebug;                                    // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGzWorldZoneTrackingComponent*          GzWorldZoneTracking;                               // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EPlacementDebugShapes                         PlacementDebuggingShape;                           // 0x0340(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void SpawnMissionStarter(class UGzMissionData* MissionData);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_MissionStart_Base(int32 EntryPoint);
	void DestroyWithTime(double TimeToDestroy);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MissionStart_Base_C">();
	}
	static class ABP_MissionStart_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MissionStart_Base_C>();
	}
};
static_assert(alignof(ABP_MissionStart_Base_C) == 0x000008, "Wrong alignment on ABP_MissionStart_Base_C");
static_assert(sizeof(ABP_MissionStart_Base_C) == 0x000348, "Wrong size on ABP_MissionStart_Base_C");
static_assert(offsetof(ABP_MissionStart_Base_C, UberGraphFrame) == 0x000318, "Member 'ABP_MissionStart_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MissionStart_Base_C, PlacementDebug) == 0x000320, "Member 'ABP_MissionStart_Base_C::PlacementDebug' has a wrong offset!");
static_assert(offsetof(ABP_MissionStart_Base_C, StaticMesh) == 0x000328, "Member 'ABP_MissionStart_Base_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_MissionStart_Base_C, Scene) == 0x000330, "Member 'ABP_MissionStart_Base_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_MissionStart_Base_C, GzWorldZoneTracking) == 0x000338, "Member 'ABP_MissionStart_Base_C::GzWorldZoneTracking' has a wrong offset!");
static_assert(offsetof(ABP_MissionStart_Base_C, PlacementDebuggingShape) == 0x000340, "Member 'ABP_MissionStart_Base_C::PlacementDebuggingShape' has a wrong offset!");

}

