#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MarkerComponent_Opportunity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MarkerComponent_Opportunity.BP_MarkerComponent_Opportunity_C
// 0x0020 (0x04A0 - 0x0480)
class UBP_MarkerComponent_Opportunity_C final : public UGzMarkerComponent
{
public:
	uint8                                         Pad_5930[0x8];                                     // 0x0478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzMissionData*                         MissionData;                                       // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMissionDataUpdated;                              // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UpdateMissionData(class UGzMissionData* Param_MissionData);
	void OnMissionDataUpdated__DelegateSignature();
	void ExecuteUbergraph_BP_MarkerComponent_Opportunity(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MarkerComponent_Opportunity_C">();
	}
	static class UBP_MarkerComponent_Opportunity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MarkerComponent_Opportunity_C>();
	}
};
static_assert(alignof(UBP_MarkerComponent_Opportunity_C) == 0x000010, "Wrong alignment on UBP_MarkerComponent_Opportunity_C");
static_assert(sizeof(UBP_MarkerComponent_Opportunity_C) == 0x0004A0, "Wrong size on UBP_MarkerComponent_Opportunity_C");
static_assert(offsetof(UBP_MarkerComponent_Opportunity_C, UberGraphFrame) == 0x000480, "Member 'UBP_MarkerComponent_Opportunity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MarkerComponent_Opportunity_C, MissionData) == 0x000488, "Member 'UBP_MarkerComponent_Opportunity_C::MissionData' has a wrong offset!");
static_assert(offsetof(UBP_MarkerComponent_Opportunity_C, OnMissionDataUpdated) == 0x000490, "Member 'UBP_MarkerComponent_Opportunity_C::OnMissionDataUpdated' has a wrong offset!");

}

