#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MarkerComponent_Opportunity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MarkerComponent_Opportunity.BP_MarkerComponent_Opportunity_C.UpdateMissionData
// 0x0008 (0x0008 - 0x0000)
struct BP_MarkerComponent_Opportunity_C_UpdateMissionData final
{
public:
	class UGzMissionData*                         Param_MissionData;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MarkerComponent_Opportunity_C_UpdateMissionData) == 0x000008, "Wrong alignment on BP_MarkerComponent_Opportunity_C_UpdateMissionData");
static_assert(sizeof(BP_MarkerComponent_Opportunity_C_UpdateMissionData) == 0x000008, "Wrong size on BP_MarkerComponent_Opportunity_C_UpdateMissionData");
static_assert(offsetof(BP_MarkerComponent_Opportunity_C_UpdateMissionData, Param_MissionData) == 0x000000, "Member 'BP_MarkerComponent_Opportunity_C_UpdateMissionData::Param_MissionData' has a wrong offset!");

// Function BP_MarkerComponent_Opportunity.BP_MarkerComponent_Opportunity_C.ExecuteUbergraph_BP_MarkerComponent_Opportunity
// 0x0010 (0x0010 - 0x0000)
struct BP_MarkerComponent_Opportunity_C_ExecuteUbergraph_BP_MarkerComponent_Opportunity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5931[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzMissionData*                         K2Node_CustomEvent_MissionData;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MarkerComponent_Opportunity_C_ExecuteUbergraph_BP_MarkerComponent_Opportunity) == 0x000008, "Wrong alignment on BP_MarkerComponent_Opportunity_C_ExecuteUbergraph_BP_MarkerComponent_Opportunity");
static_assert(sizeof(BP_MarkerComponent_Opportunity_C_ExecuteUbergraph_BP_MarkerComponent_Opportunity) == 0x000010, "Wrong size on BP_MarkerComponent_Opportunity_C_ExecuteUbergraph_BP_MarkerComponent_Opportunity");
static_assert(offsetof(BP_MarkerComponent_Opportunity_C_ExecuteUbergraph_BP_MarkerComponent_Opportunity, EntryPoint) == 0x000000, "Member 'BP_MarkerComponent_Opportunity_C_ExecuteUbergraph_BP_MarkerComponent_Opportunity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MarkerComponent_Opportunity_C_ExecuteUbergraph_BP_MarkerComponent_Opportunity, K2Node_CustomEvent_MissionData) == 0x000008, "Member 'BP_MarkerComponent_Opportunity_C_ExecuteUbergraph_BP_MarkerComponent_Opportunity::K2Node_CustomEvent_MissionData' has a wrong offset!");

}

