#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MissionCrate_Spawner

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MissionCrate_Spawner.BP_MissionCrate_Spawner_C.BndEvt__BP_MissionCrate_Spawner_MissionResource_K2Node_ComponentBoundEvent_0_OnResourceUnreserved__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_MissionCrate_Spawner_C_BndEvt__BP_MissionCrate_Spawner_MissionResource_K2Node_ComponentBoundEvent_0_OnResourceUnreserved__DelegateSignature final
{
public:
	class UMissionResourceComponent*              Resource;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionCrate_Spawner_C_BndEvt__BP_MissionCrate_Spawner_MissionResource_K2Node_ComponentBoundEvent_0_OnResourceUnreserved__DelegateSignature) == 0x000008, "Wrong alignment on BP_MissionCrate_Spawner_C_BndEvt__BP_MissionCrate_Spawner_MissionResource_K2Node_ComponentBoundEvent_0_OnResourceUnreserved__DelegateSignature");
static_assert(sizeof(BP_MissionCrate_Spawner_C_BndEvt__BP_MissionCrate_Spawner_MissionResource_K2Node_ComponentBoundEvent_0_OnResourceUnreserved__DelegateSignature) == 0x000008, "Wrong size on BP_MissionCrate_Spawner_C_BndEvt__BP_MissionCrate_Spawner_MissionResource_K2Node_ComponentBoundEvent_0_OnResourceUnreserved__DelegateSignature");
static_assert(offsetof(BP_MissionCrate_Spawner_C_BndEvt__BP_MissionCrate_Spawner_MissionResource_K2Node_ComponentBoundEvent_0_OnResourceUnreserved__DelegateSignature, Resource) == 0x000000, "Member 'BP_MissionCrate_Spawner_C_BndEvt__BP_MissionCrate_Spawner_MissionResource_K2Node_ComponentBoundEvent_0_OnResourceUnreserved__DelegateSignature::Resource' has a wrong offset!");

// Function BP_MissionCrate_Spawner.BP_MissionCrate_Spawner_C.CanScanOnAnyDistance
// 0x0001 (0x0001 - 0x0000)
struct BP_MissionCrate_Spawner_C_CanScanOnAnyDistance final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionCrate_Spawner_C_CanScanOnAnyDistance) == 0x000001, "Wrong alignment on BP_MissionCrate_Spawner_C_CanScanOnAnyDistance");
static_assert(sizeof(BP_MissionCrate_Spawner_C_CanScanOnAnyDistance) == 0x000001, "Wrong size on BP_MissionCrate_Spawner_C_CanScanOnAnyDistance");
static_assert(offsetof(BP_MissionCrate_Spawner_C_CanScanOnAnyDistance, ReturnValue) == 0x000000, "Member 'BP_MissionCrate_Spawner_C_CanScanOnAnyDistance::ReturnValue' has a wrong offset!");

// Function BP_MissionCrate_Spawner.BP_MissionCrate_Spawner_C.ExecuteUbergraph_BP_MissionCrate_Spawner
// 0x0018 (0x0018 - 0x0000)
struct BP_MissionCrate_Spawner_C_ExecuteUbergraph_BP_MissionCrate_Spawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DCC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionResourceComponent*              K2Node_ComponentBoundEvent_Resource;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionCrate_Spawner_C_ExecuteUbergraph_BP_MissionCrate_Spawner) == 0x000008, "Wrong alignment on BP_MissionCrate_Spawner_C_ExecuteUbergraph_BP_MissionCrate_Spawner");
static_assert(sizeof(BP_MissionCrate_Spawner_C_ExecuteUbergraph_BP_MissionCrate_Spawner) == 0x000018, "Wrong size on BP_MissionCrate_Spawner_C_ExecuteUbergraph_BP_MissionCrate_Spawner");
static_assert(offsetof(BP_MissionCrate_Spawner_C_ExecuteUbergraph_BP_MissionCrate_Spawner, EntryPoint) == 0x000000, "Member 'BP_MissionCrate_Spawner_C_ExecuteUbergraph_BP_MissionCrate_Spawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MissionCrate_Spawner_C_ExecuteUbergraph_BP_MissionCrate_Spawner, K2Node_ComponentBoundEvent_Resource) == 0x000008, "Member 'BP_MissionCrate_Spawner_C_ExecuteUbergraph_BP_MissionCrate_Spawner::K2Node_ComponentBoundEvent_Resource' has a wrong offset!");
static_assert(offsetof(BP_MissionCrate_Spawner_C_ExecuteUbergraph_BP_MissionCrate_Spawner, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_MissionCrate_Spawner_C_ExecuteUbergraph_BP_MissionCrate_Spawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_MissionCrate_Spawner.BP_MissionCrate_Spawner_C.OnDefilerEffectApplied
// 0x0001 (0x0001 - 0x0000)
struct BP_MissionCrate_Spawner_C_OnDefilerEffectApplied final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionCrate_Spawner_C_OnDefilerEffectApplied) == 0x000001, "Wrong alignment on BP_MissionCrate_Spawner_C_OnDefilerEffectApplied");
static_assert(sizeof(BP_MissionCrate_Spawner_C_OnDefilerEffectApplied) == 0x000001, "Wrong size on BP_MissionCrate_Spawner_C_OnDefilerEffectApplied");
static_assert(offsetof(BP_MissionCrate_Spawner_C_OnDefilerEffectApplied, ReturnValue) == 0x000000, "Member 'BP_MissionCrate_Spawner_C_OnDefilerEffectApplied::ReturnValue' has a wrong offset!");

// Function BP_MissionCrate_Spawner.BP_MissionCrate_Spawner_C.OnDefilerEffectRemoved
// 0x0001 (0x0001 - 0x0000)
struct BP_MissionCrate_Spawner_C_OnDefilerEffectRemoved final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionCrate_Spawner_C_OnDefilerEffectRemoved) == 0x000001, "Wrong alignment on BP_MissionCrate_Spawner_C_OnDefilerEffectRemoved");
static_assert(sizeof(BP_MissionCrate_Spawner_C_OnDefilerEffectRemoved) == 0x000001, "Wrong size on BP_MissionCrate_Spawner_C_OnDefilerEffectRemoved");
static_assert(offsetof(BP_MissionCrate_Spawner_C_OnDefilerEffectRemoved, ReturnValue) == 0x000000, "Member 'BP_MissionCrate_Spawner_C_OnDefilerEffectRemoved::ReturnValue' has a wrong offset!");

// Function BP_MissionCrate_Spawner.BP_MissionCrate_Spawner_C.SpawnLootBox
// 0x0170 (0x0170 - 0x0000)
struct BP_MissionCrate_Spawner_C_SpawnLootBox final
{
public:
	class UGzLootRarityTableData*                 Rarity;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ChestClass;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Cyberlimb_Spawner_Base_C*           CyberlimbBox;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0100(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Cyberlimb_Spawner_Base_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionCrate_Spawner_C_SpawnLootBox) == 0x000010, "Wrong alignment on BP_MissionCrate_Spawner_C_SpawnLootBox");
static_assert(sizeof(BP_MissionCrate_Spawner_C_SpawnLootBox) == 0x000170, "Wrong size on BP_MissionCrate_Spawner_C_SpawnLootBox");
static_assert(offsetof(BP_MissionCrate_Spawner_C_SpawnLootBox, Rarity) == 0x000000, "Member 'BP_MissionCrate_Spawner_C_SpawnLootBox::Rarity' has a wrong offset!");
static_assert(offsetof(BP_MissionCrate_Spawner_C_SpawnLootBox, ChestClass) == 0x000008, "Member 'BP_MissionCrate_Spawner_C_SpawnLootBox::ChestClass' has a wrong offset!");
static_assert(offsetof(BP_MissionCrate_Spawner_C_SpawnLootBox, CyberlimbBox) == 0x000010, "Member 'BP_MissionCrate_Spawner_C_SpawnLootBox::CyberlimbBox' has a wrong offset!");
static_assert(offsetof(BP_MissionCrate_Spawner_C_SpawnLootBox, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_MissionCrate_Spawner_C_SpawnLootBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MissionCrate_Spawner_C_SpawnLootBox, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'BP_MissionCrate_Spawner_C_SpawnLootBox::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionCrate_Spawner_C_SpawnLootBox, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'BP_MissionCrate_Spawner_C_SpawnLootBox::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionCrate_Spawner_C_SpawnLootBox, CallFunc_BreakTransform_Location) == 0x0000A0, "Member 'BP_MissionCrate_Spawner_C_SpawnLootBox::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_MissionCrate_Spawner_C_SpawnLootBox, CallFunc_BreakTransform_Rotation) == 0x0000B8, "Member 'BP_MissionCrate_Spawner_C_SpawnLootBox::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_MissionCrate_Spawner_C_SpawnLootBox, CallFunc_BreakTransform_Scale) == 0x0000D0, "Member 'BP_MissionCrate_Spawner_C_SpawnLootBox::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_MissionCrate_Spawner_C_SpawnLootBox, CallFunc_ComposeRotators_ReturnValue) == 0x0000E8, "Member 'BP_MissionCrate_Spawner_C_SpawnLootBox::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionCrate_Spawner_C_SpawnLootBox, CallFunc_MakeTransform_ReturnValue) == 0x000100, "Member 'BP_MissionCrate_Spawner_C_SpawnLootBox::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionCrate_Spawner_C_SpawnLootBox, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000160, "Member 'BP_MissionCrate_Spawner_C_SpawnLootBox::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionCrate_Spawner_C_SpawnLootBox, CallFunc_FinishSpawningActor_ReturnValue) == 0x000168, "Member 'BP_MissionCrate_Spawner_C_SpawnLootBox::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_MissionCrate_Spawner.BP_MissionCrate_Spawner_C.GetDefilerTargetType
// 0x0001 (0x0001 - 0x0000)
struct BP_MissionCrate_Spawner_C_GetDefilerTargetType final
{
public:
	EGzDefilerTargetType                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionCrate_Spawner_C_GetDefilerTargetType) == 0x000001, "Wrong alignment on BP_MissionCrate_Spawner_C_GetDefilerTargetType");
static_assert(sizeof(BP_MissionCrate_Spawner_C_GetDefilerTargetType) == 0x000001, "Wrong size on BP_MissionCrate_Spawner_C_GetDefilerTargetType");
static_assert(offsetof(BP_MissionCrate_Spawner_C_GetDefilerTargetType, ReturnValue) == 0x000000, "Member 'BP_MissionCrate_Spawner_C_GetDefilerTargetType::ReturnValue' has a wrong offset!");

}

