#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_MarkerComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_NPC_MarkerComponent.BP_NPC_MarkerComponent_C.GetMarkerRotation
// 0x0038 (0x0038 - 0x0000)
struct BP_NPC_MarkerComponent_C_GetMarkerRotation final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4D[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_MarkerComponent_C_GetMarkerRotation) == 0x000008, "Wrong alignment on BP_NPC_MarkerComponent_C_GetMarkerRotation");
static_assert(sizeof(BP_NPC_MarkerComponent_C_GetMarkerRotation) == 0x000038, "Wrong size on BP_NPC_MarkerComponent_C_GetMarkerRotation");
static_assert(offsetof(BP_NPC_MarkerComponent_C_GetMarkerRotation, ReturnValue) == 0x000000, "Member 'BP_NPC_MarkerComponent_C_GetMarkerRotation::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_MarkerComponent_C_GetMarkerRotation, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_NPC_MarkerComponent_C_GetMarkerRotation::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_MarkerComponent_C_GetMarkerRotation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000010, "Member 'BP_NPC_MarkerComponent_C_GetMarkerRotation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_MarkerComponent_C_GetMarkerRotation, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_NPC_MarkerComponent_C_GetMarkerRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_MarkerComponent_C_GetMarkerRotation, CallFunc_BreakRotator_Roll) == 0x00002C, "Member 'BP_NPC_MarkerComponent_C_GetMarkerRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_NPC_MarkerComponent_C_GetMarkerRotation, CallFunc_BreakRotator_Pitch) == 0x000030, "Member 'BP_NPC_MarkerComponent_C_GetMarkerRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_NPC_MarkerComponent_C_GetMarkerRotation, CallFunc_BreakRotator_Yaw) == 0x000034, "Member 'BP_NPC_MarkerComponent_C_GetMarkerRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");

}

