#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPCNameWidgetComponent

#include "Basic.hpp"

#include "G01_structs.hpp"


namespace SDK::Params
{

// Function BP_NPCNameWidgetComponent.BP_NPCNameWidgetComponent_C.UpdateNameVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_NPCNameWidgetComponent_C_UpdateNameVisibility final
{
public:
	EGzWorldVisibilityState                       NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPCNameWidgetComponent_C_UpdateNameVisibility) == 0x000001, "Wrong alignment on BP_NPCNameWidgetComponent_C_UpdateNameVisibility");
static_assert(sizeof(BP_NPCNameWidgetComponent_C_UpdateNameVisibility) == 0x000001, "Wrong size on BP_NPCNameWidgetComponent_C_UpdateNameVisibility");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_UpdateNameVisibility, NewState) == 0x000000, "Member 'BP_NPCNameWidgetComponent_C_UpdateNameVisibility::NewState' has a wrong offset!");

// Function BP_NPCNameWidgetComponent.BP_NPCNameWidgetComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_NPCNameWidgetComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPCNameWidgetComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_NPCNameWidgetComponent_C_ReceiveTick");
static_assert(sizeof(BP_NPCNameWidgetComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_NPCNameWidgetComponent_C_ReceiveTick");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_NPCNameWidgetComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_NPCNameWidgetComponent.BP_NPCNameWidgetComponent_C.ExecuteUbergraph_BP_NPCNameWidgetComponent
// 0x0078 (0x0078 - 0x0000)
struct BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EGzWorldVisibilityState NewState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DA1[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DA2[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_NPCName_C*                         K2Node_DynamicCast_AsWBP_NPCName;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DA3[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGzAIPawnInterface>    K2Node_DynamicCast_AsGz_AIPawn_Interface;          // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DA4[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAiId_ReturnValue;                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_Base_C*                         K2Node_DynamicCast_AsBP_NPC_Base;                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzWorldVisibilityState                       K2Node_CustomEvent_NewState;                       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DA5[0x5];                                     // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_1;                  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent) == 0x000008, "Wrong alignment on BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent");
static_assert(sizeof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent) == 0x000078, "Wrong size on BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, EntryPoint) == 0x000000, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, CallFunc_GetWidget_ReturnValue) == 0x000018, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, K2Node_DynamicCast_AsWBP_NPCName) == 0x000028, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::K2Node_DynamicCast_AsWBP_NPCName' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, Temp_int_Variable) == 0x000034, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, K2Node_DynamicCast_AsGz_AIPawn_Interface) == 0x000038, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::K2Node_DynamicCast_AsGz_AIPawn_Interface' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, CallFunc_GetAiId_ReturnValue) == 0x00004C, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::CallFunc_GetAiId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, K2Node_DynamicCast_AsBP_NPC_Base) == 0x000058, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::K2Node_DynamicCast_AsBP_NPC_Base' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, K2Node_CustomEvent_NewState) == 0x000061, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, K2Node_SwitchEnum_CmpSuccess) == 0x000062, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, CallFunc_GetWidget_ReturnValue_1) == 0x000068, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::CallFunc_GetWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_NPCNameWidgetComponent_C_ExecuteUbergraph_BP_NPCNameWidgetComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

