#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Netrunner_Terminal_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Minigame_Arrows_classes.hpp"
#include "G01_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Netrunner_Terminal_V2.BP_Netrunner_Terminal_V2_C
// 0x0058 (0x04D8 - 0x0480)
class ABP_Netrunner_Terminal_V2_C final : public ABP_Minigame_Arrows_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Netrunner_Terminal_V2_C;         // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzStaticAkComponent*                   StaticAudioServerNoise;                            // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGzStaticAkComponent*                   StaticAudioServerInteraction;                      // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlacementDebug_0_0;                                // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGzCameraComponent*                     GzCamera;                                          // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Display;                                           // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Keyboard;                                          // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Antenna;                                           // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   base;                                              // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Body;                                              // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMissionResourceComponent*              MissionResource;                                   // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature(class AActor* InteractedBy, const class UGzInteractableComponent* Interactable);
	void BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature(class AActor* InteractedBy, const class UGzInteractableComponent* Interactable);
	void BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature(class AActor* InteractedBy, const class UGzInteractableComponent* Interactable);
	void BndEvt__BP_Netrunner_Terminal_V2_MissionResource_K2Node_ComponentBoundEvent_1_OnResourcePendingDestroyFinished__DelegateSignature(class UMissionResourceComponent* Resource);
	bool CanScanOnAnyDistance();
	void ExecuteUbergraph_BP_Netrunner_Terminal_V2(int32 EntryPoint);
	void HandleClose();
	void HandleOpen();
	void NetrunnerMinigameStart();
	bool OnDefilerEffectApplied();
	bool OnDefilerEffectRemoved();
	void OnPlayersAssigned();
	void ReceiveBeginPlay();

	EGzDefilerTargetType GetDefilerTargetType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Netrunner_Terminal_V2_C">();
	}
	static class ABP_Netrunner_Terminal_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Netrunner_Terminal_V2_C>();
	}
};
static_assert(alignof(ABP_Netrunner_Terminal_V2_C) == 0x000008, "Wrong alignment on ABP_Netrunner_Terminal_V2_C");
static_assert(sizeof(ABP_Netrunner_Terminal_V2_C) == 0x0004D8, "Wrong size on ABP_Netrunner_Terminal_V2_C");
static_assert(offsetof(ABP_Netrunner_Terminal_V2_C, UberGraphFrame_BP_Netrunner_Terminal_V2_C) == 0x000480, "Member 'ABP_Netrunner_Terminal_V2_C::UberGraphFrame_BP_Netrunner_Terminal_V2_C' has a wrong offset!");
static_assert(offsetof(ABP_Netrunner_Terminal_V2_C, StaticAudioServerNoise) == 0x000488, "Member 'ABP_Netrunner_Terminal_V2_C::StaticAudioServerNoise' has a wrong offset!");
static_assert(offsetof(ABP_Netrunner_Terminal_V2_C, StaticAudioServerInteraction) == 0x000490, "Member 'ABP_Netrunner_Terminal_V2_C::StaticAudioServerInteraction' has a wrong offset!");
static_assert(offsetof(ABP_Netrunner_Terminal_V2_C, PlacementDebug_0_0) == 0x000498, "Member 'ABP_Netrunner_Terminal_V2_C::PlacementDebug_0_0' has a wrong offset!");
static_assert(offsetof(ABP_Netrunner_Terminal_V2_C, GzCamera) == 0x0004A0, "Member 'ABP_Netrunner_Terminal_V2_C::GzCamera' has a wrong offset!");
static_assert(offsetof(ABP_Netrunner_Terminal_V2_C, Display) == 0x0004A8, "Member 'ABP_Netrunner_Terminal_V2_C::Display' has a wrong offset!");
static_assert(offsetof(ABP_Netrunner_Terminal_V2_C, Keyboard) == 0x0004B0, "Member 'ABP_Netrunner_Terminal_V2_C::Keyboard' has a wrong offset!");
static_assert(offsetof(ABP_Netrunner_Terminal_V2_C, Antenna) == 0x0004B8, "Member 'ABP_Netrunner_Terminal_V2_C::Antenna' has a wrong offset!");
static_assert(offsetof(ABP_Netrunner_Terminal_V2_C, base) == 0x0004C0, "Member 'ABP_Netrunner_Terminal_V2_C::base' has a wrong offset!");
static_assert(offsetof(ABP_Netrunner_Terminal_V2_C, Body) == 0x0004C8, "Member 'ABP_Netrunner_Terminal_V2_C::Body' has a wrong offset!");
static_assert(offsetof(ABP_Netrunner_Terminal_V2_C, MissionResource) == 0x0004D0, "Member 'ABP_Netrunner_Terminal_V2_C::MissionResource' has a wrong offset!");

}

