#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Netrunner_Terminal_V2

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Netrunner_Terminal_V2.BP_Netrunner_Terminal_V2_C.BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature final
{
public:
	class AActor*                                 InteractedBy;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         Interactable;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature) == 0x000008, "Wrong alignment on BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature");
static_assert(sizeof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature) == 0x000010, "Wrong size on BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature, InteractedBy) == 0x000000, "Member 'BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature::InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature, Interactable) == 0x000008, "Member 'BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_3_GzOnInteract__DelegateSignature::Interactable' has a wrong offset!");

// Function BP_Netrunner_Terminal_V2.BP_Netrunner_Terminal_V2_C.BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature final
{
public:
	class AActor*                                 InteractedBy;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         Interactable;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature) == 0x000008, "Wrong alignment on BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature");
static_assert(sizeof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature) == 0x000010, "Wrong size on BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature, InteractedBy) == 0x000000, "Member 'BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature::InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature, Interactable) == 0x000008, "Member 'BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_4_GzOnInteract__DelegateSignature::Interactable' has a wrong offset!");

// Function BP_Netrunner_Terminal_V2.BP_Netrunner_Terminal_V2_C.BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature final
{
public:
	class AActor*                                 InteractedBy;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         Interactable;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature) == 0x000008, "Wrong alignment on BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature");
static_assert(sizeof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature) == 0x000010, "Wrong size on BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature, InteractedBy) == 0x000000, "Member 'BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature::InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature, Interactable) == 0x000008, "Member 'BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_InteractableComponent_K2Node_ComponentBoundEvent_5_GzOnInteract__DelegateSignature::Interactable' has a wrong offset!");

// Function BP_Netrunner_Terminal_V2.BP_Netrunner_Terminal_V2_C.BndEvt__BP_Netrunner_Terminal_V2_MissionResource_K2Node_ComponentBoundEvent_1_OnResourcePendingDestroyFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_MissionResource_K2Node_ComponentBoundEvent_1_OnResourcePendingDestroyFinished__DelegateSignature final
{
public:
	class UMissionResourceComponent*              Resource;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_MissionResource_K2Node_ComponentBoundEvent_1_OnResourcePendingDestroyFinished__DelegateSignature) == 0x000008, "Wrong alignment on BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_MissionResource_K2Node_ComponentBoundEvent_1_OnResourcePendingDestroyFinished__DelegateSignature");
static_assert(sizeof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_MissionResource_K2Node_ComponentBoundEvent_1_OnResourcePendingDestroyFinished__DelegateSignature) == 0x000008, "Wrong size on BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_MissionResource_K2Node_ComponentBoundEvent_1_OnResourcePendingDestroyFinished__DelegateSignature");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_MissionResource_K2Node_ComponentBoundEvent_1_OnResourcePendingDestroyFinished__DelegateSignature, Resource) == 0x000000, "Member 'BP_Netrunner_Terminal_V2_C_BndEvt__BP_Netrunner_Terminal_V2_MissionResource_K2Node_ComponentBoundEvent_1_OnResourcePendingDestroyFinished__DelegateSignature::Resource' has a wrong offset!");

// Function BP_Netrunner_Terminal_V2.BP_Netrunner_Terminal_V2_C.CanScanOnAnyDistance
// 0x0001 (0x0001 - 0x0000)
struct BP_Netrunner_Terminal_V2_C_CanScanOnAnyDistance final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Netrunner_Terminal_V2_C_CanScanOnAnyDistance) == 0x000001, "Wrong alignment on BP_Netrunner_Terminal_V2_C_CanScanOnAnyDistance");
static_assert(sizeof(BP_Netrunner_Terminal_V2_C_CanScanOnAnyDistance) == 0x000001, "Wrong size on BP_Netrunner_Terminal_V2_C_CanScanOnAnyDistance");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_CanScanOnAnyDistance, ReturnValue) == 0x000000, "Member 'BP_Netrunner_Terminal_V2_C_CanScanOnAnyDistance::ReturnValue' has a wrong offset!");

// Function BP_Netrunner_Terminal_V2.BP_Netrunner_Terminal_V2_C.ExecuteUbergraph_BP_Netrunner_Terminal_V2
// 0x00E0 (0x00E0 - 0x0000)
struct BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6991[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0018(0x0020)()
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6992[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6993[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1; // 0x0050(0x0020)()
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6994[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_InteractedBy_2;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         K2Node_ComponentBoundEvent_Interactable_2;         // 0x0080(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_InteractedBy_1;         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         K2Node_ComponentBoundEvent_Interactable_1;         // 0x0090(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_InteractedBy;           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzInteractableComponent*         K2Node_ComponentBoundEvent_Interactable;           // 0x00A0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_5;               // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6995[0x5];                                     // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6996[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x00BC(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue_1;      // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6997[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionResourceComponent*              K2Node_ComponentBoundEvent_Resource;               // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2) == 0x000008, "Wrong alignment on BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2");
static_assert(sizeof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2) == 0x0000E0, "Wrong size on BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, EntryPoint) == 0x000000, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, Temp_delegate_Variable) == 0x000004, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, CallFunc_HasAuthority_ReturnValue) == 0x000014, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000018, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, CallFunc_HasAuthority_ReturnValue_1) == 0x000038, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x00004C, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, CallFunc_HasAuthority_ReturnValue_2) == 0x00004D, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1) == 0x000050, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, CallFunc_HasAuthority_ReturnValue_3) == 0x000070, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x000074, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, K2Node_ComponentBoundEvent_InteractedBy_2) == 0x000078, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::K2Node_ComponentBoundEvent_InteractedBy_2' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, K2Node_ComponentBoundEvent_Interactable_2) == 0x000080, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::K2Node_ComponentBoundEvent_Interactable_2' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, K2Node_ComponentBoundEvent_InteractedBy_1) == 0x000088, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::K2Node_ComponentBoundEvent_InteractedBy_1' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, K2Node_ComponentBoundEvent_Interactable_1) == 0x000090, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::K2Node_ComponentBoundEvent_Interactable_1' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, K2Node_ComponentBoundEvent_InteractedBy) == 0x000098, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::K2Node_ComponentBoundEvent_InteractedBy' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, K2Node_ComponentBoundEvent_Interactable) == 0x0000A0, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, CallFunc_HasAuthority_ReturnValue_4) == 0x0000A8, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x0000A9, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, CallFunc_HasAuthority_ReturnValue_5) == 0x0000AA, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::CallFunc_HasAuthority_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, CallFunc_GetPlayerController_ReturnValue) == 0x0000B0, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, CallFunc_Array_Contains_ReturnValue) == 0x0000B8, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, Temp_delegate_Variable_1) == 0x0000BC, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, CallFunc_PostAssociatedAkEvent_ReturnValue_1) == 0x0000CC, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::CallFunc_PostAssociatedAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, K2Node_SwitchEnum_CmpSuccess) == 0x0000D0, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2, K2Node_ComponentBoundEvent_Resource) == 0x0000D8, "Member 'BP_Netrunner_Terminal_V2_C_ExecuteUbergraph_BP_Netrunner_Terminal_V2::K2Node_ComponentBoundEvent_Resource' has a wrong offset!");

// Function BP_Netrunner_Terminal_V2.BP_Netrunner_Terminal_V2_C.OnDefilerEffectApplied
// 0x0001 (0x0001 - 0x0000)
struct BP_Netrunner_Terminal_V2_C_OnDefilerEffectApplied final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Netrunner_Terminal_V2_C_OnDefilerEffectApplied) == 0x000001, "Wrong alignment on BP_Netrunner_Terminal_V2_C_OnDefilerEffectApplied");
static_assert(sizeof(BP_Netrunner_Terminal_V2_C_OnDefilerEffectApplied) == 0x000001, "Wrong size on BP_Netrunner_Terminal_V2_C_OnDefilerEffectApplied");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_OnDefilerEffectApplied, ReturnValue) == 0x000000, "Member 'BP_Netrunner_Terminal_V2_C_OnDefilerEffectApplied::ReturnValue' has a wrong offset!");

// Function BP_Netrunner_Terminal_V2.BP_Netrunner_Terminal_V2_C.OnDefilerEffectRemoved
// 0x0001 (0x0001 - 0x0000)
struct BP_Netrunner_Terminal_V2_C_OnDefilerEffectRemoved final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Netrunner_Terminal_V2_C_OnDefilerEffectRemoved) == 0x000001, "Wrong alignment on BP_Netrunner_Terminal_V2_C_OnDefilerEffectRemoved");
static_assert(sizeof(BP_Netrunner_Terminal_V2_C_OnDefilerEffectRemoved) == 0x000001, "Wrong size on BP_Netrunner_Terminal_V2_C_OnDefilerEffectRemoved");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_OnDefilerEffectRemoved, ReturnValue) == 0x000000, "Member 'BP_Netrunner_Terminal_V2_C_OnDefilerEffectRemoved::ReturnValue' has a wrong offset!");

// Function BP_Netrunner_Terminal_V2.BP_Netrunner_Terminal_V2_C.GetDefilerTargetType
// 0x0001 (0x0001 - 0x0000)
struct BP_Netrunner_Terminal_V2_C_GetDefilerTargetType final
{
public:
	EGzDefilerTargetType                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Netrunner_Terminal_V2_C_GetDefilerTargetType) == 0x000001, "Wrong alignment on BP_Netrunner_Terminal_V2_C_GetDefilerTargetType");
static_assert(sizeof(BP_Netrunner_Terminal_V2_C_GetDefilerTargetType) == 0x000001, "Wrong size on BP_Netrunner_Terminal_V2_C_GetDefilerTargetType");
static_assert(offsetof(BP_Netrunner_Terminal_V2_C_GetDefilerTargetType, ReturnValue) == 0x000000, "Member 'BP_Netrunner_Terminal_V2_C_GetDefilerTargetType::ReturnValue' has a wrong offset!");

}

