#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_NPC_Base.BP_NPC_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_NPC_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_NPC_Base_C_ReceiveTick");
static_assert(sizeof(BP_NPC_Base_C_ReceiveTick) == 0x000004, "Wrong size on BP_NPC_Base_C_ReceiveTick");
static_assert(offsetof(BP_NPC_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_NPC_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_NPC_Base.BP_NPC_Base_C.AddInterestPoint
// 0x0028 (0x0028 - 0x0000)
struct BP_NPC_Base_C_AddInterestPoint final
{
public:
	class ABP_AI_InterestPoint_C*                 InterestPoint;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF1[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF2[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Base_C_AddInterestPoint) == 0x000008, "Wrong alignment on BP_NPC_Base_C_AddInterestPoint");
static_assert(sizeof(BP_NPC_Base_C_AddInterestPoint) == 0x000028, "Wrong size on BP_NPC_Base_C_AddInterestPoint");
static_assert(offsetof(BP_NPC_Base_C_AddInterestPoint, InterestPoint) == 0x000000, "Member 'BP_NPC_Base_C_AddInterestPoint::InterestPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_Base_C_AddInterestPoint, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'BP_NPC_Base_C_AddInterestPoint::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Base_C_AddInterestPoint, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_NPC_Base_C_AddInterestPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Base_C_AddInterestPoint, CallFunc_MakeLiteralName_ReturnValue) == 0x00000C, "Member 'BP_NPC_Base_C_AddInterestPoint::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Base_C_AddInterestPoint, CallFunc_GetAIController_ReturnValue) == 0x000018, "Member 'BP_NPC_Base_C_AddInterestPoint::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Base_C_AddInterestPoint, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BP_NPC_Base_C_AddInterestPoint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_NPC_Base.BP_NPC_Base_C.ExecuteUbergraph_BP_NPC_Base
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_Base_C_ExecuteUbergraph_BP_NPC_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Base_C_ExecuteUbergraph_BP_NPC_Base) == 0x000004, "Wrong alignment on BP_NPC_Base_C_ExecuteUbergraph_BP_NPC_Base");
static_assert(sizeof(BP_NPC_Base_C_ExecuteUbergraph_BP_NPC_Base) == 0x000008, "Wrong size on BP_NPC_Base_C_ExecuteUbergraph_BP_NPC_Base");
static_assert(offsetof(BP_NPC_Base_C_ExecuteUbergraph_BP_NPC_Base, EntryPoint) == 0x000000, "Member 'BP_NPC_Base_C_ExecuteUbergraph_BP_NPC_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_Base_C_ExecuteUbergraph_BP_NPC_Base, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_NPC_Base_C_ExecuteUbergraph_BP_NPC_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

