#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_AssaultDrone

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_NPC_AssaultDrone.BP_NPC_AssaultDrone_C.BndEvt__BP_NPC_AssaultDrone_CombatComponent_K2Node_ComponentBoundEvent_0_GzOnWeaponEquipedDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_NPC_AssaultDrone_C_BndEvt__BP_NPC_AssaultDrone_CombatComponent_K2Node_ComponentBoundEvent_0_GzOnWeaponEquipedDelegate__DelegateSignature final
{
public:
	struct FGzInvPocketId                         InvPocketId;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	const class AGzWeaponActor*                   WeaponActor;                                       // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bEquipped;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_AssaultDrone_C_BndEvt__BP_NPC_AssaultDrone_CombatComponent_K2Node_ComponentBoundEvent_0_GzOnWeaponEquipedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_NPC_AssaultDrone_C_BndEvt__BP_NPC_AssaultDrone_CombatComponent_K2Node_ComponentBoundEvent_0_GzOnWeaponEquipedDelegate__DelegateSignature");
static_assert(sizeof(BP_NPC_AssaultDrone_C_BndEvt__BP_NPC_AssaultDrone_CombatComponent_K2Node_ComponentBoundEvent_0_GzOnWeaponEquipedDelegate__DelegateSignature) == 0x000018, "Wrong size on BP_NPC_AssaultDrone_C_BndEvt__BP_NPC_AssaultDrone_CombatComponent_K2Node_ComponentBoundEvent_0_GzOnWeaponEquipedDelegate__DelegateSignature");
static_assert(offsetof(BP_NPC_AssaultDrone_C_BndEvt__BP_NPC_AssaultDrone_CombatComponent_K2Node_ComponentBoundEvent_0_GzOnWeaponEquipedDelegate__DelegateSignature, InvPocketId) == 0x000000, "Member 'BP_NPC_AssaultDrone_C_BndEvt__BP_NPC_AssaultDrone_CombatComponent_K2Node_ComponentBoundEvent_0_GzOnWeaponEquipedDelegate__DelegateSignature::InvPocketId' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_BndEvt__BP_NPC_AssaultDrone_CombatComponent_K2Node_ComponentBoundEvent_0_GzOnWeaponEquipedDelegate__DelegateSignature, WeaponActor) == 0x000008, "Member 'BP_NPC_AssaultDrone_C_BndEvt__BP_NPC_AssaultDrone_CombatComponent_K2Node_ComponentBoundEvent_0_GzOnWeaponEquipedDelegate__DelegateSignature::WeaponActor' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_BndEvt__BP_NPC_AssaultDrone_CombatComponent_K2Node_ComponentBoundEvent_0_GzOnWeaponEquipedDelegate__DelegateSignature, bEquipped) == 0x000010, "Member 'BP_NPC_AssaultDrone_C_BndEvt__BP_NPC_AssaultDrone_CombatComponent_K2Node_ComponentBoundEvent_0_GzOnWeaponEquipedDelegate__DelegateSignature::bEquipped' has a wrong offset!");

// Function BP_NPC_AssaultDrone.BP_NPC_AssaultDrone_C.ExecuteUbergraph_BP_NPC_AssaultDrone
// 0x0E18 (0x0E18 - 0x0000)
struct BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_647B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_647C[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_647D[0x1];                                     // 0x012F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_647E[0x2];                                     // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x013C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x014C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_647F[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6480[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6481[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue_1;               // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_TargetPoint;                    // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6482[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6483[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGzInvPocketId                         K2Node_ComponentBoundEvent_InvPocketId;            // 0x0290(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	const class AGzWeaponActor*                   K2Node_ComponentBoundEvent_WeaponActor;            // 0x0298(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bEquipped;              // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6484[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x02A8(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6485[0x2];                                     // 0x03AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6486[0x4];                                     // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0428(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6487[0x4];                                     // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzDamageableComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0480(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6488[0x7];                                     // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_Hit_Result;                     // 0x0490(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0589(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6489[0x2];                                     // 0x058A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_648A[0x4];                                     // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0598(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x05B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x05C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x05E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0600(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0608(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_648B[0x4];                                     // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0630(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0648(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_648C[0x3];                                     // 0x0661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x0668(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_648D[0x7];                                     // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGzDamageInstigatorData                K2Node_MakeStruct_GzDamageInstigatorData;          // 0x0688(0x0038)(NoDestructor)
	TMap<struct FGameplayTag, float>              K2Node_MakeMap_Map;                                // 0x06C0(0x0050)()
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_648E[0x7];                                     // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzDamageHit                           K2Node_MakeStruct_GzDamageHit;                     // 0x0718(0x01B8)(ContainsInstancedReference)
	struct FGzSingleHitDamage                     K2Node_MakeStruct_GzSingleHitDamage;               // 0x08D0(0x01F0)(ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0AC0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0AD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_648F[0x4];                                     // 0x0ADC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x0AE0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0AE8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0B00(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_HitComponent;                         // 0x0B18(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_BoneName;                             // 0x0B20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ShotFromDirection;                    // 0x0B28(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0B40(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0B48(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0B50(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_1;        // 0x0C48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0C4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x0C4D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6490[0x2];                                     // 0x0C4E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x0C50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0C54(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0C58(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0C70(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x0C88(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0CA0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0CB8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0CC0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0CC8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0CD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_2;                // 0x0CD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0CE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x0CE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0CE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6491[0x4];                                     // 0x0CEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x0CF0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0D08(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0D20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0D28(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0D40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0D58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6492[0x4];                                     // 0x0D5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0D60(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0D68(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0D80(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0D98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6493[0x7];                                     // 0x0D99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzCombatComponent*                     CallFunc_GetCombatComponent_ReturnValue;           // 0x0DA0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0DA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6494[0x7];                                     // 0x0DA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0DB0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0DC8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_3;      // 0x0DE0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_2;        // 0x0DE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6495[0x4];                                     // 0x0DEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0DF0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0DF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6496[0x7];                                     // 0x0DF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x0E00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeMap_Value_0_ImplicitCast;               // 0x0E08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6497[0x4];                                     // 0x0E0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast_1; // 0x0E10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone) == 0x000008, "Wrong alignment on BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone");
static_assert(sizeof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone) == 0x000E18, "Wrong size on BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, EntryPoint) == 0x000000, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CustomEvent_NotifyName_7) == 0x000020, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CustomEvent_NotifyName_6) == 0x000038, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CustomEvent_NotifyName_5) == 0x000050, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, Temp_name_Variable) == 0x000068, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CreateDelegate_OutputDelegate_3) == 0x000070, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000080, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CreateDelegate_OutputDelegate_4) == 0x000098, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CustomEvent_NotifyName_4) == 0x0000A8, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CustomEvent_NotifyName_3) == 0x0000B0, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000B8, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CustomEvent_NotifyName_2) == 0x0000C8, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000D0, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CustomEvent_NotifyName_1) == 0x0000E0, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000E8, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CustomEvent_NotifyName) == 0x0000F8, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CreateDelegate_OutputDelegate_8) == 0x000100, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, Temp_name_Variable_1) == 0x000110, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_IsDedicatedServer_ReturnValue) == 0x000118, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CreateDelegate_OutputDelegate_9) == 0x00011C, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00012C, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_HasAuthority_ReturnValue) == 0x00012D, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x00012E, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CustomEvent_NotifyName_9) == 0x000130, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_HasAuthority_ReturnValue_1) == 0x000138, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000139, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, Temp_delegate_Variable) == 0x00013C, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CreateDelegate_OutputDelegate_10) == 0x00014C, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_MakeVector_ReturnValue) == 0x000160, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x000178, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_MakeRotFromZ_ReturnValue) == 0x000180, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_MakeVector_ReturnValue_1) == 0x000198, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_HasAuthority_ReturnValue_2) == 0x0001B0, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_MakeRotFromZ_ReturnValue_1) == 0x0001B8, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_MakeRotFromZ_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CustomEvent_TargetPoint) == 0x0001D0, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CustomEvent_TargetPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001E8, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_FindLookAtRotation_ReturnValue) == 0x000200, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakRotator_Roll) == 0x000218, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakRotator_Pitch) == 0x00021C, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakRotator_Yaw) == 0x000220, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000228, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_MakeRotator_ReturnValue) == 0x000240, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000258, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000260, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000268, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000280, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_PostEvent_ReturnValue) == 0x000288, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_Event_DeltaSeconds) == 0x00028C, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_ComponentBoundEvent_InvPocketId) == 0x000290, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_ComponentBoundEvent_InvPocketId' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_ComponentBoundEvent_WeaponActor) == 0x000298, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_ComponentBoundEvent_WeaponActor' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_ComponentBoundEvent_bEquipped) == 0x0002A0, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_ComponentBoundEvent_bEquipped' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_Event_HitResult) == 0x0002A8, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0003A0, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_bBlockingHit) == 0x0003A8, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_bInitialOverlap) == 0x0003A9, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_Time) == 0x0003AC, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_Distance) == 0x0003B0, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_Location) == 0x0003B8, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_ImpactPoint) == 0x0003D0, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_Normal) == 0x0003E8, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_ImpactNormal) == 0x000400, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_PhysMat) == 0x000418, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_HitActor) == 0x000420, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_HitComponent) == 0x000428, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_HitBoneName) == 0x000430, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_BoneName) == 0x000438, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_HitItem) == 0x000440, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_ElementIndex) == 0x000444, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_FaceIndex) == 0x000448, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_TraceStart) == 0x000450, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_TraceEnd) == 0x000468, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_GetComponentByClass_ReturnValue) == 0x000480, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_IsValid_ReturnValue) == 0x000488, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, K2Node_CustomEvent_Hit_Result) == 0x000490, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::K2Node_CustomEvent_Hit_Result' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000588, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000589, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_Time_1) == 0x00058C, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_Distance_1) == 0x000590, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_Location_1) == 0x000598, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0005B0, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_Normal_1) == 0x0005C8, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0005E0, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_PhysMat_1) == 0x0005F8, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_HitActor_1) == 0x000600, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_HitComponent_1) == 0x000608, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone, CallFunc_BreakHitResult_HitBoneName_1) == 0x000610, "Member 'BP_NPC_AssaultDrone_C_ExecuteUbergraph_BP_NPC_AssaultDrone::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
