#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_StandTurret

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_NPC_StandTurret.BP_NPC_StandTurret_C.ExecuteUbergraph_BP_NPC_StandTurret
// 0x0028 (0x0028 - 0x0000)
struct BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5988[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABPC_NPC_NewStandTurret_C*              K2Node_DynamicCast_AsBPC_NPC_New_Stand_Turret;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret) == 0x000008, "Wrong alignment on BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret");
static_assert(sizeof(BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret) == 0x000028, "Wrong size on BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret");
static_assert(offsetof(BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret, EntryPoint) == 0x000000, "Member 'BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret, CallFunc_GetController_ReturnValue) == 0x000010, "Member 'BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret, K2Node_DynamicCast_AsBPC_NPC_New_Stand_Turret) == 0x000018, "Member 'BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret::K2Node_DynamicCast_AsBPC_NPC_New_Stand_Turret' has a wrong offset!");
static_assert(offsetof(BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_NPC_StandTurret_C_ExecuteUbergraph_BP_NPC_StandTurret::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_NPC_StandTurret.BP_NPC_StandTurret_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_NPC_StandTurret_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_StandTurret_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_NPC_StandTurret_C_ReceiveTick");
static_assert(sizeof(BP_NPC_StandTurret_C_ReceiveTick) == 0x000004, "Wrong size on BP_NPC_StandTurret_C_ReceiveTick");
static_assert(offsetof(BP_NPC_StandTurret_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_NPC_StandTurret_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_NPC_StandTurret.BP_NPC_StandTurret_C.GetAIController
// 0x0020 (0x0020 - 0x0000)
struct BP_NPC_StandTurret_C_GetAIController final
{
public:
	class ABPC_NPC_NewStandTurret_C*              AsBPC_NPC_New_Stand_Turret;                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABPC_NPC_NewStandTurret_C*              K2Node_DynamicCast_AsBPC_NPC_New_Stand_Turret;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_StandTurret_C_GetAIController) == 0x000008, "Wrong alignment on BP_NPC_StandTurret_C_GetAIController");
static_assert(sizeof(BP_NPC_StandTurret_C_GetAIController) == 0x000020, "Wrong size on BP_NPC_StandTurret_C_GetAIController");
static_assert(offsetof(BP_NPC_StandTurret_C_GetAIController, AsBPC_NPC_New_Stand_Turret) == 0x000000, "Member 'BP_NPC_StandTurret_C_GetAIController::AsBPC_NPC_New_Stand_Turret' has a wrong offset!");
static_assert(offsetof(BP_NPC_StandTurret_C_GetAIController, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'BP_NPC_StandTurret_C_GetAIController::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_StandTurret_C_GetAIController, K2Node_DynamicCast_AsBPC_NPC_New_Stand_Turret) == 0x000010, "Member 'BP_NPC_StandTurret_C_GetAIController::K2Node_DynamicCast_AsBPC_NPC_New_Stand_Turret' has a wrong offset!");
static_assert(offsetof(BP_NPC_StandTurret_C_GetAIController, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_NPC_StandTurret_C_GetAIController::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

