#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Spawner

#include "Basic.hpp"

#include "E_NPC_MissionStates_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_NPC_Spawner.BP_NPC_Spawner_C.SpawnReinforcementNPC
// 0x0048 (0x0048 - 0x0000)
struct BP_NPC_Spawner_C_SpawnReinforcementNPC final
{
public:
	int32                                         Counter;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C64[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SpawnPoint_NPC_C*                   RandomSpawnPoint;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C65[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanReinforcenent_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C66[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_SpawnNPC_SpawnedNPC;                      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABPC_NPC_Enemy_C*                       CallFunc_SpawnNPC_Controller;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C67[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SpawnPoint_NPC_C*                   CallFunc_Array_Random_OutItem;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Spawner_C_SpawnReinforcementNPC) == 0x000008, "Wrong alignment on BP_NPC_Spawner_C_SpawnReinforcementNPC");
static_assert(sizeof(BP_NPC_Spawner_C_SpawnReinforcementNPC) == 0x000048, "Wrong size on BP_NPC_Spawner_C_SpawnReinforcementNPC");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnReinforcementNPC, Counter) == 0x000000, "Member 'BP_NPC_Spawner_C_SpawnReinforcementNPC::Counter' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnReinforcementNPC, RandomSpawnPoint) == 0x000008, "Member 'BP_NPC_Spawner_C_SpawnReinforcementNPC::RandomSpawnPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnReinforcementNPC, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_NPC_Spawner_C_SpawnReinforcementNPC::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnReinforcementNPC, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_NPC_Spawner_C_SpawnReinforcementNPC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnReinforcementNPC, Temp_int_Variable) == 0x000018, "Member 'BP_NPC_Spawner_C_SpawnReinforcementNPC::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnReinforcementNPC, CallFunc_CanReinforcenent_ReturnValue) == 0x00001C, "Member 'BP_NPC_Spawner_C_SpawnReinforcementNPC::CallFunc_CanReinforcenent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnReinforcementNPC, CallFunc_SpawnNPC_SpawnedNPC) == 0x000020, "Member 'BP_NPC_Spawner_C_SpawnReinforcementNPC::CallFunc_SpawnNPC_SpawnedNPC' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnReinforcementNPC, CallFunc_SpawnNPC_Controller) == 0x000028, "Member 'BP_NPC_Spawner_C_SpawnReinforcementNPC::CallFunc_SpawnNPC_Controller' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnReinforcementNPC, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_NPC_Spawner_C_SpawnReinforcementNPC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnReinforcementNPC, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_NPC_Spawner_C_SpawnReinforcementNPC::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnReinforcementNPC, CallFunc_Array_Random_OutItem) == 0x000038, "Member 'BP_NPC_Spawner_C_SpawnReinforcementNPC::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnReinforcementNPC, CallFunc_Array_Random_OutIndex) == 0x000040, "Member 'BP_NPC_Spawner_C_SpawnReinforcementNPC::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnReinforcementNPC, CallFunc_BooleanAND_ReturnValue) == 0x000044, "Member 'BP_NPC_Spawner_C_SpawnReinforcementNPC::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_NPC_Spawner.BP_NPC_Spawner_C.UserConstructionScript
// 0x0048 (0x0048 - 0x0000)
struct BP_NPC_Spawner_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C68[0x1];                                     // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SpawnPoint_NPC_C*                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C69[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6A[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6B[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SpawnPoint_NPC_C*                   CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Spawner_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_NPC_Spawner_C_UserConstructionScript");
static_assert(sizeof(BP_NPC_Spawner_C_UserConstructionScript) == 0x000048, "Wrong size on BP_NPC_Spawner_C_UserConstructionScript");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_NPC_Spawner_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_NPC_Spawner_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_NPC_Spawner_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00000C, "Member 'BP_NPC_Spawner_C_UserConstructionScript::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x00000D, "Member 'BP_NPC_Spawner_C_UserConstructionScript::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'BP_NPC_Spawner_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_NPC_Spawner_C_UserConstructionScript::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_NPC_Spawner_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_NPC_Spawner_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_NPC_Spawner_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_NPC_Spawner_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, CallFunc_Array_Contains_ReturnValue) == 0x000025, "Member 'BP_NPC_Spawner_C_UserConstructionScript::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_NPC_Spawner_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x00002C, "Member 'BP_NPC_Spawner_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'BP_NPC_Spawner_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'BP_NPC_Spawner_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_NPC_Spawner_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_NPC_Spawner.BP_NPC_Spawner_C.SpawnNPCs
// 0x0030 (0x0030 - 0x0000)
struct BP_NPC_Spawner_C_SpawnNPCs final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SpawnPoint_NPC_C*                   CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6C[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_SpawnNPC_SpawnedNPC;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABPC_NPC_Enemy_C*                       CallFunc_SpawnNPC_Controller;                      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Spawner_C_SpawnNPCs) == 0x000008, "Wrong alignment on BP_NPC_Spawner_C_SpawnNPCs");
static_assert(sizeof(BP_NPC_Spawner_C_SpawnNPCs) == 0x000030, "Wrong size on BP_NPC_Spawner_C_SpawnNPCs");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnNPCs, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_NPC_Spawner_C_SpawnNPCs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnNPCs, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_NPC_Spawner_C_SpawnNPCs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnNPCs, CallFunc_Array_Get_Item) == 0x000008, "Member 'BP_NPC_Spawner_C_SpawnNPCs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnNPCs, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_NPC_Spawner_C_SpawnNPCs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnNPCs, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'BP_NPC_Spawner_C_SpawnNPCs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnNPCs, CallFunc_Not_PreBool_ReturnValue) == 0x000015, "Member 'BP_NPC_Spawner_C_SpawnNPCs::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnNPCs, CallFunc_IsValid_ReturnValue) == 0x000016, "Member 'BP_NPC_Spawner_C_SpawnNPCs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnNPCs, CallFunc_SpawnNPC_SpawnedNPC) == 0x000018, "Member 'BP_NPC_Spawner_C_SpawnNPCs::CallFunc_SpawnNPC_SpawnedNPC' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnNPCs, CallFunc_SpawnNPC_Controller) == 0x000020, "Member 'BP_NPC_Spawner_C_SpawnNPCs::CallFunc_SpawnNPC_Controller' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_SpawnNPCs, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_NPC_Spawner_C_SpawnNPCs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_NPC_Spawner.BP_NPC_Spawner_C.SetNPCsMissionState
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_Spawner_C_SetNPCsMissionState final
{
public:
	E_NPC_MissionStates                           NewMissionState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Spawner_C_SetNPCsMissionState) == 0x000001, "Wrong alignment on BP_NPC_Spawner_C_SetNPCsMissionState");
static_assert(sizeof(BP_NPC_Spawner_C_SetNPCsMissionState) == 0x000001, "Wrong size on BP_NPC_Spawner_C_SetNPCsMissionState");
static_assert(offsetof(BP_NPC_Spawner_C_SetNPCsMissionState, NewMissionState) == 0x000000, "Member 'BP_NPC_Spawner_C_SetNPCsMissionState::NewMissionState' has a wrong offset!");

// Function BP_NPC_Spawner.BP_NPC_Spawner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_NPC_Spawner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Spawner_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_NPC_Spawner_C_ReceiveTick");
static_assert(sizeof(BP_NPC_Spawner_C_ReceiveTick) == 0x000004, "Wrong size on BP_NPC_Spawner_C_ReceiveTick");
static_assert(offsetof(BP_NPC_Spawner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_NPC_Spawner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_NPC_Spawner.BP_NPC_Spawner_C.ExecuteUbergraph_BP_NPC_Spawner
// 0x0028 (0x0028 - 0x0000)
struct BP_NPC_Spawner_C_ExecuteUbergraph_BP_NPC_Spawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_ComponentBoundEvent_LastPlayerPosition;     // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrySpawn_ReturnValue;                     // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Spawner_C_ExecuteUbergraph_BP_NPC_Spawner) == 0x000008, "Wrong alignment on BP_NPC_Spawner_C_ExecuteUbergraph_BP_NPC_Spawner");
static_assert(sizeof(BP_NPC_Spawner_C_ExecuteUbergraph_BP_NPC_Spawner) == 0x000028, "Wrong size on BP_NPC_Spawner_C_ExecuteUbergraph_BP_NPC_Spawner");
static_assert(offsetof(BP_NPC_Spawner_C_ExecuteUbergraph_BP_NPC_Spawner, EntryPoint) == 0x000000, "Member 'BP_NPC_Spawner_C_ExecuteUbergraph_BP_NPC_Spawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_ExecuteUbergraph_BP_NPC_Spawner, K2Node_ComponentBoundEvent_LastPlayerPosition) == 0x000008, "Member 'BP_NPC_Spawner_C_ExecuteUbergraph_BP_NPC_Spawner::K2Node_ComponentBoundEvent_LastPlayerPosition' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_ExecuteUbergraph_BP_NPC_Spawner, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'BP_NPC_Spawner_C_ExecuteUbergraph_BP_NPC_Spawner::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_NPC_Spawner_C_ExecuteUbergraph_BP_NPC_Spawner, CallFunc_TrySpawn_ReturnValue) == 0x000024, "Member 'BP_NPC_Spawner_C_ExecuteUbergraph_BP_NPC_Spawner::CallFunc_TrySpawn_ReturnValue' has a wrong offset!");

// Function BP_NPC_Spawner.BP_NPC_Spawner_C.BndEvt__BP_NPC_Spawner_BP_AlarmReceiverComponent_K2Node_ComponentBoundEvent_1_Triggered__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_NPC_Spawner_C_BndEvt__BP_NPC_Spawner_BP_AlarmReceiverComponent_K2Node_ComponentBoundEvent_1_Triggered__DelegateSignature final
{
public:
	struct FVector                                LastPlayerPosition;                                // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Spawner_C_BndEvt__BP_NPC_Spawner_BP_AlarmReceiverComponent_K2Node_ComponentBoundEvent_1_Triggered__DelegateSignature) == 0x000008, "Wrong alignment on BP_NPC_Spawner_C_BndEvt__BP_NPC_Spawner_BP_AlarmReceiverComponent_K2Node_ComponentBoundEvent_1_Triggered__DelegateSignature");
static_assert(sizeof(BP_NPC_Spawner_C_BndEvt__BP_NPC_Spawner_BP_AlarmReceiverComponent_K2Node_ComponentBoundEvent_1_Triggered__DelegateSignature) == 0x000018, "Wrong size on BP_NPC_Spawner_C_BndEvt__BP_NPC_Spawner_BP_AlarmReceiverComponent_K2Node_ComponentBoundEvent_1_Triggered__DelegateSignature");
static_assert(offsetof(BP_NPC_Spawner_C_BndEvt__BP_NPC_Spawner_BP_AlarmReceiverComponent_K2Node_ComponentBoundEvent_1_Triggered__DelegateSignature, LastPlayerPosition) == 0x000000, "Member 'BP_NPC_Spawner_C_BndEvt__BP_NPC_Spawner_BP_AlarmReceiverComponent_K2Node_ComponentBoundEvent_1_Triggered__DelegateSignature::LastPlayerPosition' has a wrong offset!");

}

