#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Follow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_NPC_Male_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_Follow.BP_NPC_Follow_C
// 0x0020 (0x1680 - 0x1660)
class ABP_NPC_Follow_C final : public ABP_NPC_Male_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NPC_Follow_C;                    // 0x1660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   InteractionProxy_L;                                // 0x1668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   InteractionProxy_R;                                // 0x1670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NPC_Follow(int32 EntryPoint);
	void BndEvt__BP_NPC_Follow_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractSignature__DelegateSignature(class AActor* OtherActor, const class UDefaultInteractionBehavior* Interaction);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPC_Follow_C">();
	}
	static class ABP_NPC_Follow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_Follow_C>();
	}
};
static_assert(alignof(ABP_NPC_Follow_C) == 0x000010, "Wrong alignment on ABP_NPC_Follow_C");
static_assert(sizeof(ABP_NPC_Follow_C) == 0x001680, "Wrong size on ABP_NPC_Follow_C");
static_assert(offsetof(ABP_NPC_Follow_C, UberGraphFrame_BP_NPC_Follow_C) == 0x001660, "Member 'ABP_NPC_Follow_C::UberGraphFrame_BP_NPC_Follow_C' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Follow_C, InteractionProxy_L) == 0x001668, "Member 'ABP_NPC_Follow_C::InteractionProxy_L' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Follow_C, InteractionProxy_R) == 0x001670, "Member 'ABP_NPC_Follow_C::InteractionProxy_R' has a wrong offset!");

}

