#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_AssaultCondor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_NPC_Male_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_AssaultCondor.BP_NPC_AssaultCondor_C
// 0x0020 (0x1680 - 0x1660)
class ABP_NPC_AssaultCondor_C final : public ABP_NPC_Male_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NPC_AssaultCondor_C;             // 0x1660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           Event_Tag;                                         // 0x1668(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Event_Tag_0;                                       // 0x1670(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_NPC_AssaultCondor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPC_AssaultCondor_C">();
	}
	static class ABP_NPC_AssaultCondor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_AssaultCondor_C>();
	}
};
static_assert(alignof(ABP_NPC_AssaultCondor_C) == 0x000010, "Wrong alignment on ABP_NPC_AssaultCondor_C");
static_assert(sizeof(ABP_NPC_AssaultCondor_C) == 0x001680, "Wrong size on ABP_NPC_AssaultCondor_C");
static_assert(offsetof(ABP_NPC_AssaultCondor_C, UberGraphFrame_BP_NPC_AssaultCondor_C) == 0x001660, "Member 'ABP_NPC_AssaultCondor_C::UberGraphFrame_BP_NPC_AssaultCondor_C' has a wrong offset!");
static_assert(offsetof(ABP_NPC_AssaultCondor_C, Event_Tag) == 0x001668, "Member 'ABP_NPC_AssaultCondor_C::Event_Tag' has a wrong offset!");
static_assert(offsetof(ABP_NPC_AssaultCondor_C, Event_Tag_0) == 0x001670, "Member 'ABP_NPC_AssaultCondor_C::Event_Tag_0' has a wrong offset!");

}

