#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_QuickMeleeStates_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_Base.BP_NPC_Base_C
// 0x0040 (0x1660 - 0x1620)
class ABP_NPC_Base_C : public AGzNonPlayerCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1620(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzTableLootChooserComponent*           GzTableLootChooser;                                // 0x1628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGzCharacterWorldVisibilityComponent*   GzCharacterWorldVisibility;                        // 0x1630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGzRadialLootSpawnerComponent*          GzRadialLootSpawner;                               // 0x1638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCVoiceComponent_C*                BP_NPCVoiceComponent;                              // 0x1640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterCustomization_C*           BP_CharacterCustomization;                         // 0x1648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGzCombatComponent*                     GzCombatComponent;                                 // 0x1650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	E_QuickMeleeStates                            QuickMeleeStates;                                  // 0x1658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveTick(float DeltaSeconds);
	void AddInterestPoint(class ABP_AI_InterestPoint_C* InterestPoint);
	void ExecuteUbergraph_BP_NPC_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPC_Base_C">();
	}
	static class ABP_NPC_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_Base_C>();
	}
};
static_assert(alignof(ABP_NPC_Base_C) == 0x000010, "Wrong alignment on ABP_NPC_Base_C");
static_assert(sizeof(ABP_NPC_Base_C) == 0x001660, "Wrong size on ABP_NPC_Base_C");
static_assert(offsetof(ABP_NPC_Base_C, UberGraphFrame) == 0x001620, "Member 'ABP_NPC_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Base_C, GzTableLootChooser) == 0x001628, "Member 'ABP_NPC_Base_C::GzTableLootChooser' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Base_C, GzCharacterWorldVisibility) == 0x001630, "Member 'ABP_NPC_Base_C::GzCharacterWorldVisibility' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Base_C, GzRadialLootSpawner) == 0x001638, "Member 'ABP_NPC_Base_C::GzRadialLootSpawner' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Base_C, BP_NPCVoiceComponent) == 0x001640, "Member 'ABP_NPC_Base_C::BP_NPCVoiceComponent' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Base_C, BP_CharacterCustomization) == 0x001648, "Member 'ABP_NPC_Base_C::BP_CharacterCustomization' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Base_C, GzCombatComponent) == 0x001650, "Member 'ABP_NPC_Base_C::GzCombatComponent' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Base_C, QuickMeleeStates) == 0x001658, "Member 'ABP_NPC_Base_C::QuickMeleeStates' has a wrong offset!");

}

