#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Objective_BH_KillTarget

#include "Basic.hpp"

#include "MissionGraphRuntime_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function BP_Objective_BH_KillTarget.BP_Objective_BH_KillTarget_C.TrySetStateSafely
// 0x0001 (0x0001 - 0x0000)
struct BP_Objective_BH_KillTarget_C_TrySetStateSafely final
{
public:
	bool                                          bSuccessful;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Objective_BH_KillTarget_C_TrySetStateSafely) == 0x000001, "Wrong alignment on BP_Objective_BH_KillTarget_C_TrySetStateSafely");
static_assert(sizeof(BP_Objective_BH_KillTarget_C_TrySetStateSafely) == 0x000001, "Wrong size on BP_Objective_BH_KillTarget_C_TrySetStateSafely");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_TrySetStateSafely, bSuccessful) == 0x000000, "Member 'BP_Objective_BH_KillTarget_C_TrySetStateSafely::bSuccessful' has a wrong offset!");

// Function BP_Objective_BH_KillTarget.BP_Objective_BH_KillTarget_C.OnPlayerKilledMessage
// 0x0008 (0x0008 - 0x0000)
struct BP_Objective_BH_KillTarget_C_OnPlayerKilledMessage final
{
public:
	const class UGzGameMessage*                   Message;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Objective_BH_KillTarget_C_OnPlayerKilledMessage) == 0x000008, "Wrong alignment on BP_Objective_BH_KillTarget_C_OnPlayerKilledMessage");
static_assert(sizeof(BP_Objective_BH_KillTarget_C_OnPlayerKilledMessage) == 0x000008, "Wrong size on BP_Objective_BH_KillTarget_C_OnPlayerKilledMessage");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_OnPlayerKilledMessage, Message) == 0x000000, "Member 'BP_Objective_BH_KillTarget_C_OnPlayerKilledMessage::Message' has a wrong offset!");

// Function BP_Objective_BH_KillTarget.BP_Objective_BH_KillTarget_C.OnPlayerAliveStateChanged_Target
// 0x0008 (0x0008 - 0x0000)
struct BP_Objective_BH_KillTarget_C_OnPlayerAliveStateChanged_Target final
{
public:
	class AGzPlayerState*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Objective_BH_KillTarget_C_OnPlayerAliveStateChanged_Target) == 0x000008, "Wrong alignment on BP_Objective_BH_KillTarget_C_OnPlayerAliveStateChanged_Target");
static_assert(sizeof(BP_Objective_BH_KillTarget_C_OnPlayerAliveStateChanged_Target) == 0x000008, "Wrong size on BP_Objective_BH_KillTarget_C_OnPlayerAliveStateChanged_Target");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_OnPlayerAliveStateChanged_Target, PlayerState) == 0x000000, "Member 'BP_Objective_BH_KillTarget_C_OnPlayerAliveStateChanged_Target::PlayerState' has a wrong offset!");

// Function BP_Objective_BH_KillTarget.BP_Objective_BH_KillTarget_C.ObjectiveStateCanBeChanged
// 0x0007 (0x0007 - 0x0000)
struct BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        CallFunc_GetState_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged) == 0x000001, "Wrong alignment on BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged");
static_assert(sizeof(BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged) == 0x000007, "Wrong size on BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged, Return) == 0x000000, "Member 'BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged::Return' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged, CallFunc_GetState_ReturnValue) == 0x000001, "Member 'BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000003, "Member 'BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000004, "Member 'BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged, CallFunc_BooleanOR_ReturnValue_1) == 0x000006, "Member 'BP_Objective_BH_KillTarget_C_ObjectiveStateCanBeChanged::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function BP_Objective_BH_KillTarget.BP_Objective_BH_KillTarget_C.GetExtensionContext
// 0x0030 (0x0030 - 0x0000)
struct BP_Objective_BH_KillTarget_C_GetExtensionContext final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60F7[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_Objective_BH_KillTarget_C_GetExtensionContext) == 0x000008, "Wrong alignment on BP_Objective_BH_KillTarget_C_GetExtensionContext");
static_assert(sizeof(BP_Objective_BH_KillTarget_C_GetExtensionContext) == 0x000030, "Wrong size on BP_Objective_BH_KillTarget_C_GetExtensionContext");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_GetExtensionContext, ReturnValue) == 0x000000, "Member 'BP_Objective_BH_KillTarget_C_GetExtensionContext::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_GetExtensionContext, CallFunc_GetPawn_ReturnValue) == 0x000010, "Member 'BP_Objective_BH_KillTarget_C_GetExtensionContext::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_GetExtensionContext, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_Objective_BH_KillTarget_C_GetExtensionContext::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_GetExtensionContext, K2Node_MakeArray_Array) == 0x000020, "Member 'BP_Objective_BH_KillTarget_C_GetExtensionContext::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_Objective_BH_KillTarget.BP_Objective_BH_KillTarget_C.ExecuteUbergraph_BP_Objective_BH_KillTarget
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60F8[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UGzGameMessage* Message)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60F9[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         K2Node_CustomEvent_PlayerState;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzAliveState                                 CallFunc_GetPlayerAliveState_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectiveStateCanBeChanged_Return;        // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectiveStateCanBeChanged_Return_1;      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60FA[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccessful;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectiveStateCanBeChanged_Return_2;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60FB[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzGameMessageSubsystem*                CallFunc_GetInstance_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzGameMessage*                   K2Node_CustomEvent_Message;                        // 0x0050(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzPlayerKilledMessage*                 K2Node_DynamicCast_AsGz_Player_Killed_Message;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60FC[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetInstigatorPlayerState_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60FD[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetVictimPlayerState_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMission*                               CallFunc_GetMissionChecked_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60FE[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerState*>                   CallFunc_GetParticipants_ReturnValue;              // 0x0090(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60FF[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzGameMessageSubsystem*                CallFunc_GetInstance_ReturnValue_1;                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget) == 0x000008, "Wrong alignment on BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget");
static_assert(sizeof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget) == 0x0000B0, "Wrong size on BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, EntryPoint) == 0x000000, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, Temp_bool_Has_Been_Initd_Variable) == 0x000018, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, K2Node_CustomEvent_PlayerState) == 0x000020, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_HasAuthority_ReturnValue) == 0x000028, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_GetPlayerAliveState_ReturnValue) == 0x000029, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_GetPlayerAliveState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, K2Node_SwitchEnum_CmpSuccess) == 0x00002A, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_ObjectiveStateCanBeChanged_Return) == 0x00002B, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_ObjectiveStateCanBeChanged_Return' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, Temp_bool_IsClosed_Variable) == 0x00002C, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_ObjectiveStateCanBeChanged_Return_1) == 0x00002D, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_ObjectiveStateCanBeChanged_Return_1' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, K2Node_CustomEvent_bSuccessful) == 0x000040, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::K2Node_CustomEvent_bSuccessful' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_ObjectiveStateCanBeChanged_Return_2) == 0x000041, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_ObjectiveStateCanBeChanged_Return_2' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_GetInstance_ReturnValue) == 0x000048, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_GetInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, K2Node_CustomEvent_Message) == 0x000050, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, K2Node_DynamicCast_AsGz_Player_Killed_Message) == 0x000058, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::K2Node_DynamicCast_AsGz_Player_Killed_Message' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_GetInstigatorPlayerState_ReturnValue) == 0x000068, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_GetInstigatorPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_GetVictimPlayerState_ReturnValue) == 0x000078, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_GetVictimPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_GetMissionChecked_ReturnValue) == 0x000080, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_GetMissionChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000088, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_GetParticipants_ReturnValue) == 0x000090, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_GetParticipants_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_Array_Contains_ReturnValue) == 0x0000A0, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_SelectInt_ReturnValue) == 0x0000A4, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget, CallFunc_GetInstance_ReturnValue_1) == 0x0000A8, "Member 'BP_Objective_BH_KillTarget_C_ExecuteUbergraph_BP_Objective_BH_KillTarget::CallFunc_GetInstance_ReturnValue_1' has a wrong offset!");

}

