#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_FunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PostProcess_FunctionLibrary.BP_PostProcess_FunctionLibrary_C.AddGenericMaterialPostProcess
// 0x0058 (0x0058 - 0x0000)
struct BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess final
{
public:
	class UMaterialInstance*                      Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Weight;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          StartSound;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          EndSound;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzPostProcessFX*                       Return_Value;                                      // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzPostProcessControllerComponent*      CallFunc_GetPlayerPostProcessControllerComponent_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_Generic_Material_PP_C*              CallFunc_SpawnObject_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzPostProcessFX*                       CallFunc_AddPostProcessInstance_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzPostProcessControllerComponent*      CallFunc_GetPlayerPostProcessControllerComponent_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess) == 0x000008, "Wrong alignment on BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess");
static_assert(sizeof(BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess) == 0x000058, "Wrong size on BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess, Material) == 0x000000, "Member 'BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess::Material' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess, Weight) == 0x000008, "Member 'BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess::Weight' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess, StartSound) == 0x000010, "Member 'BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess::StartSound' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess, EndSound) == 0x000018, "Member 'BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess::EndSound' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess, __WorldContext) == 0x000020, "Member 'BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess, Return_Value) == 0x000028, "Member 'BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess::Return_Value' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess, CallFunc_GetPlayerPostProcessControllerComponent_ReturnValue) == 0x000030, "Member 'BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess::CallFunc_GetPlayerPostProcessControllerComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess, CallFunc_SpawnObject_ReturnValue) == 0x000038, "Member 'BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess, CallFunc_AddPostProcessInstance_ReturnValue) == 0x000040, "Member 'BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess::CallFunc_AddPostProcessInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess, CallFunc_GetPlayerPostProcessControllerComponent_ReturnValue_1) == 0x000048, "Member 'BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess::CallFunc_GetPlayerPostProcessControllerComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_PostProcess_FunctionLibrary_C_AddGenericMaterialPostProcess::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PostProcess_FunctionLibrary.BP_PostProcess_FunctionLibrary_C.RemovePostProcess
// 0x0028 (0x0028 - 0x0000)
struct BP_PostProcess_FunctionLibrary_C_RemovePostProcess final
{
public:
	class UGzPostProcessFX*                       PostProcessFX;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5761[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzPostProcessControllerComponent*      CallFunc_GetPlayerPostProcessControllerComponent_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_FunctionLibrary_C_RemovePostProcess) == 0x000008, "Wrong alignment on BP_PostProcess_FunctionLibrary_C_RemovePostProcess");
static_assert(sizeof(BP_PostProcess_FunctionLibrary_C_RemovePostProcess) == 0x000028, "Wrong size on BP_PostProcess_FunctionLibrary_C_RemovePostProcess");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_RemovePostProcess, PostProcessFX) == 0x000000, "Member 'BP_PostProcess_FunctionLibrary_C_RemovePostProcess::PostProcessFX' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_RemovePostProcess, __WorldContext) == 0x000008, "Member 'BP_PostProcess_FunctionLibrary_C_RemovePostProcess::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_RemovePostProcess, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_PostProcess_FunctionLibrary_C_RemovePostProcess::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_RemovePostProcess, CallFunc_GetPlayerPostProcessControllerComponent_ReturnValue) == 0x000018, "Member 'BP_PostProcess_FunctionLibrary_C_RemovePostProcess::CallFunc_GetPlayerPostProcessControllerComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_FunctionLibrary_C_RemovePostProcess, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BP_PostProcess_FunctionLibrary_C_RemovePostProcess::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

