#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Phosphorous_Dart_Projectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Phosphorous_Dart_Projectile.BP_Phosphorous_Dart_Projectile_C
// 0x02D8 (0x0620 - 0x0348)
class ABP_Phosphorous_Dart_Projectile_C final : public AGzProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzAbilitySystemComponent*              ASC;                                               // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGzExplosionComponent*                  GzExplosion;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Dart;                                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           BlinkTimer;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         TimeToExplode;                                     // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlinkTime;                                         // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimeToExplodeTimer;                                // 0x0378(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0388(0x00F8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AGzMultiPartCharacter*                  As_Gz_Multi_Part_Character;                        // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CharSkelMesh;                                      // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AGzVehicle*                             As_Gz_Vehicle;                                     // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 VehicleSkelMesh;                                   // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                Scale;                                             // 0x04A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Remaining_Time_to_Explode;                         // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnDetonateDart;                                    // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FVector>                        ProjectileScaleArray;                              // 0x04D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        ProjectileDestinationArray;                        // 0x04E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        ProjectileLaunchVelocityArray;                     // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         First_Index;                                       // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3867[0x4];                                     // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Phosphorous_Dart_Phosporus_Projectile_C*> BlobReferences;                                    // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         Ground_Decal_Life_Span;                            // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Arc_Param;                                         // 0x051C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInstantDetonateDebug;                             // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3868[0x7];                                     // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      StuckVFX;                                          // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzMultiPartCharacter*                  Owning_Character;                                  // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UGameplayAbility*                       Gameplay_Ability;                                  // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bWithDebugPrint;                                   // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3869[0x3];                                     // 0x0541(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DartLifespan;                                      // 0x0544(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ECollisionChannel>                     VehicleOrPawn;                                     // 0x0548(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPrimitiveComponent*                    Hit_Component;                                     // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFired;                                          // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_386A[0x3];                                     // 0x0561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GroundDecalLifeSpan;                               // 0x0564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      GroundVFX;                                         // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GroundDecalScale;                                  // 0x0570(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      TrailVFX;                                          // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Relative_Transform;                                // 0x0590(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWithDebug;                                        // 0x05F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValidHit;                                       // 0x05F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_386B[0x6];                                     // 0x05F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         IgnoreActorsForGround;                             // 0x05F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FVector                                GroundDecalLocation;                               // 0x0608(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_ExplosiveDart_SphereComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void CalculateArcingParameters(const struct FVector& ProjectileLocalDestination, const struct FVector& HeightOffset, const struct FVector& SpawnOffset, struct FVector* OutLaunchVelocity, struct FVector* LaunchPosition);
	void CalculateBlobVelocities(TArray<struct FVector>* Param_ProjectileLaunchVelocityArray);
	void CalculateHeightOffset(struct FVector* HeightOffset, struct FVector* SpawnOffset);
	double ConvertScaleToRadius(int32 Param_Index);
	void Detonate();
	void DetonateTimer();
	void DrawDebugForBlobEndLocation(const struct FVector& Location, int32 IndexForScaling);
	void ExecuteGC(class AActor* Target, class USceneComponent* TargetAttachComponent);
	void ExecuteUbergraph_BP_Phosphorous_Dart_Projectile(int32 EntryPoint);
	void GetBoneNearHitResult(class USkeletalMeshComponent* Target, class FName* BoneName);
	double GetRemainingExplosionTime();
	void LaunchDart(const struct FVector& LaunchPosition, const struct FVector& Direction, const float Speed, double GravityScale);
	void LaunchDartVisuals();
	struct FTransform MakeSpawnTransform();
	void OnDetonateDart__DelegateSignature(const struct FHitResult& Param_HitResult);
	void PlayHitEffects();
	void PostExplosionFX();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void SpawnBlob(int32 Param_Index, const struct FVector& LaunchVelocity, const struct FVector& Launch_Position, class ABP_Phosphorous_Dart_Phosporus_Projectile_C** BlobRef);
	void SpawnBlobs();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Phosphorous_Dart_Projectile_C">();
	}
	static class ABP_Phosphorous_Dart_Projectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Phosphorous_Dart_Projectile_C>();
	}
};
static_assert(alignof(ABP_Phosphorous_Dart_Projectile_C) == 0x000010, "Wrong alignment on ABP_Phosphorous_Dart_Projectile_C");
static_assert(sizeof(ABP_Phosphorous_Dart_Projectile_C) == 0x000620, "Wrong size on ABP_Phosphorous_Dart_Projectile_C");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, UberGraphFrame) == 0x000348, "Member 'ABP_Phosphorous_Dart_Projectile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, ASC) == 0x000350, "Member 'ABP_Phosphorous_Dart_Projectile_C::ASC' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, GzExplosion) == 0x000358, "Member 'ABP_Phosphorous_Dart_Projectile_C::GzExplosion' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, DMI_Dart) == 0x000360, "Member 'ABP_Phosphorous_Dart_Projectile_C::DMI_Dart' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, BlinkTimer) == 0x000368, "Member 'ABP_Phosphorous_Dart_Projectile_C::BlinkTimer' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, TimeToExplode) == 0x000370, "Member 'ABP_Phosphorous_Dart_Projectile_C::TimeToExplode' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, BlinkTime) == 0x000374, "Member 'ABP_Phosphorous_Dart_Projectile_C::BlinkTime' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, TimeToExplodeTimer) == 0x000378, "Member 'ABP_Phosphorous_Dart_Projectile_C::TimeToExplodeTimer' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, HitActor) == 0x000380, "Member 'ABP_Phosphorous_Dart_Projectile_C::HitActor' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, HitResult) == 0x000388, "Member 'ABP_Phosphorous_Dart_Projectile_C::HitResult' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, As_Gz_Multi_Part_Character) == 0x000480, "Member 'ABP_Phosphorous_Dart_Projectile_C::As_Gz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, CharSkelMesh) == 0x000488, "Member 'ABP_Phosphorous_Dart_Projectile_C::CharSkelMesh' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, As_Gz_Vehicle) == 0x000490, "Member 'ABP_Phosphorous_Dart_Projectile_C::As_Gz_Vehicle' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, VehicleSkelMesh) == 0x000498, "Member 'ABP_Phosphorous_Dart_Projectile_C::VehicleSkelMesh' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, Scale) == 0x0004A0, "Member 'ABP_Phosphorous_Dart_Projectile_C::Scale' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, Remaining_Time_to_Explode) == 0x0004B8, "Member 'ABP_Phosphorous_Dart_Projectile_C::Remaining_Time_to_Explode' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, OnDetonateDart) == 0x0004C0, "Member 'ABP_Phosphorous_Dart_Projectile_C::OnDetonateDart' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, ProjectileScaleArray) == 0x0004D0, "Member 'ABP_Phosphorous_Dart_Projectile_C::ProjectileScaleArray' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, ProjectileDestinationArray) == 0x0004E0, "Member 'ABP_Phosphorous_Dart_Projectile_C::ProjectileDestinationArray' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, ProjectileLaunchVelocityArray) == 0x0004F0, "Member 'ABP_Phosphorous_Dart_Projectile_C::ProjectileLaunchVelocityArray' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, First_Index) == 0x000500, "Member 'ABP_Phosphorous_Dart_Projectile_C::First_Index' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, BlobReferences) == 0x000508, "Member 'ABP_Phosphorous_Dart_Projectile_C::BlobReferences' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, Ground_Decal_Life_Span) == 0x000518, "Member 'ABP_Phosphorous_Dart_Projectile_C::Ground_Decal_Life_Span' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, Arc_Param) == 0x00051C, "Member 'ABP_Phosphorous_Dart_Projectile_C::Arc_Param' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, bInstantDetonateDebug) == 0x000520, "Member 'ABP_Phosphorous_Dart_Projectile_C::bInstantDetonateDebug' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, StuckVFX) == 0x000528, "Member 'ABP_Phosphorous_Dart_Projectile_C::StuckVFX' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, Owning_Character) == 0x000530, "Member 'ABP_Phosphorous_Dart_Projectile_C::Owning_Character' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, Gameplay_Ability) == 0x000538, "Member 'ABP_Phosphorous_Dart_Projectile_C::Gameplay_Ability' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, bWithDebugPrint) == 0x000540, "Member 'ABP_Phosphorous_Dart_Projectile_C::bWithDebugPrint' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, DartLifespan) == 0x000544, "Member 'ABP_Phosphorous_Dart_Projectile_C::DartLifespan' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, VehicleOrPawn) == 0x000548, "Member 'ABP_Phosphorous_Dart_Projectile_C::VehicleOrPawn' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, Hit_Component) == 0x000558, "Member 'ABP_Phosphorous_Dart_Projectile_C::Hit_Component' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, bIsFired) == 0x000560, "Member 'ABP_Phosphorous_Dart_Projectile_C::bIsFired' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, GroundDecalLifeSpan) == 0x000564, "Member 'ABP_Phosphorous_Dart_Projectile_C::GroundDecalLifeSpan' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, GroundVFX) == 0x000568, "Member 'ABP_Phosphorous_Dart_Projectile_C::GroundVFX' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, GroundDecalScale) == 0x000570, "Member 'ABP_Phosphorous_Dart_Projectile_C::GroundDecalScale' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, TrailVFX) == 0x000588, "Member 'ABP_Phosphorous_Dart_Projectile_C::TrailVFX' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, Relative_Transform) == 0x000590, "Member 'ABP_Phosphorous_Dart_Projectile_C::Relative_Transform' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, bWithDebug) == 0x0005F0, "Member 'ABP_Phosphorous_Dart_Projectile_C::bWithDebug' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, bIsValidHit) == 0x0005F1, "Member 'ABP_Phosphorous_Dart_Projectile_C::bIsValidHit' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, IgnoreActorsForGround) == 0x0005F8, "Member 'ABP_Phosphorous_Dart_Projectile_C::IgnoreActorsForGround' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Projectile_C, GroundDecalLocation) == 0x000608, "Member 'ABP_Phosphorous_Dart_Projectile_C::GroundDecalLocation' has a wrong offset!");

}

