#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Phosphorous_Dart_HitPreview

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Phosphorous_Dart_HitPreview.BP_Phosphorous_Dart_HitPreview_C
// 0x0060 (0x0300 - 0x02A0)
class ABP_Phosphorous_Dart_HitPreview_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               B;                                                 // 0x02C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         RemainingHoldTime;                                 // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AD9[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxHoldTime;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Distance;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ElementSize;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReferenceDistance;                                 // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SetCharHitMaterial();
	void SetNoHitMaterial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Phosphorous_Dart_HitPreview_C">();
	}
	static class ABP_Phosphorous_Dart_HitPreview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Phosphorous_Dart_HitPreview_C>();
	}
};
static_assert(alignof(ABP_Phosphorous_Dart_HitPreview_C) == 0x000008, "Wrong alignment on ABP_Phosphorous_Dart_HitPreview_C");
static_assert(sizeof(ABP_Phosphorous_Dart_HitPreview_C) == 0x000300, "Wrong size on ABP_Phosphorous_Dart_HitPreview_C");
static_assert(offsetof(ABP_Phosphorous_Dart_HitPreview_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_Phosphorous_Dart_HitPreview_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_HitPreview_C, Niagara) == 0x0002A8, "Member 'ABP_Phosphorous_Dart_HitPreview_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_HitPreview_C, Sphere) == 0x0002B0, "Member 'ABP_Phosphorous_Dart_HitPreview_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_HitPreview_C, Scene) == 0x0002B8, "Member 'ABP_Phosphorous_Dart_HitPreview_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_HitPreview_C, B) == 0x0002C0, "Member 'ABP_Phosphorous_Dart_HitPreview_C::B' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_HitPreview_C, RemainingHoldTime) == 0x0002D8, "Member 'ABP_Phosphorous_Dart_HitPreview_C::RemainingHoldTime' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_HitPreview_C, MaxHoldTime) == 0x0002E0, "Member 'ABP_Phosphorous_Dart_HitPreview_C::MaxHoldTime' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_HitPreview_C, Distance) == 0x0002E8, "Member 'ABP_Phosphorous_Dart_HitPreview_C::Distance' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_HitPreview_C, ElementSize) == 0x0002F0, "Member 'ABP_Phosphorous_Dart_HitPreview_C::ElementSize' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_HitPreview_C, ReferenceDistance) == 0x0002F8, "Member 'ABP_Phosphorous_Dart_HitPreview_C::ReferenceDistance' has a wrong offset!");

}

