#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Phosphorous_Dart_HitPreview

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Phosphorous_Dart_HitPreview.BP_Phosphorous_Dart_HitPreview_C.ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview
// 0x0058 (0x0058 - 0x0000)
struct BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_RemainingHoldTime_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ADA[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_RemainingHoldTime_ImplicitCast_1; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_1;   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview");
static_assert(sizeof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview) == 0x000058, "Wrong size on BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview");
static_assert(offsetof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview, EntryPoint) == 0x000000, "Member 'BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview, K2Node_VariableSet_RemainingHoldTime_ImplicitCast) == 0x000030, "Member 'BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview::K2Node_VariableSet_RemainingHoldTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000040, "Member 'BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview, K2Node_VariableSet_RemainingHoldTime_ImplicitCast_1) == 0x000048, "Member 'BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview::K2Node_VariableSet_RemainingHoldTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x00004C, "Member 'BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview, CallFunc_SetFloatParameter_Param_ImplicitCast_1) == 0x000050, "Member 'BP_Phosphorous_Dart_HitPreview_C_ExecuteUbergraph_BP_Phosphorous_Dart_HitPreview::CallFunc_SetFloatParameter_Param_ImplicitCast_1' has a wrong offset!");

// Function BP_Phosphorous_Dart_HitPreview.BP_Phosphorous_Dart_HitPreview_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Phosphorous_Dart_HitPreview_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_HitPreview_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Phosphorous_Dart_HitPreview_C_ReceiveTick");
static_assert(sizeof(BP_Phosphorous_Dart_HitPreview_C_ReceiveTick) == 0x000004, "Wrong size on BP_Phosphorous_Dart_HitPreview_C_ReceiveTick");
static_assert(offsetof(BP_Phosphorous_Dart_HitPreview_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Phosphorous_Dart_HitPreview_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

