#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PathfinderGrenadeVacuum

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PathfinderGrenadeVacuum.BP_PathfinderGrenadeVacuum_C.BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature
// 0x0110 (0x0110 - 0x0000)
struct BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                ImpactVelocity;                                    // 0x00F8(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature");
static_assert(sizeof(BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature) == 0x000110, "Wrong size on BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature::ImpactResult' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature, ImpactVelocity) == 0x0000F8, "Member 'BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature::ImpactVelocity' has a wrong offset!");

// Function BP_PathfinderGrenadeVacuum.BP_PathfinderGrenadeVacuum_C.BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature
// 0x00F8 (0x00F8 - 0x0000)
struct BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature");
static_assert(sizeof(BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature) == 0x0000F8, "Wrong size on BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'BP_PathfinderGrenadeVacuum_C_BndEvt__BP_Grenade01Projectile_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature::ImpactResult' has a wrong offset!");

// Function BP_PathfinderGrenadeVacuum.BP_PathfinderGrenadeVacuum_C.DisablePhysicsAndExplode
// 0x0010 (0x0010 - 0x0000)
struct BP_PathfinderGrenadeVacuum_C_DisablePhysicsAndExplode final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6517[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PathfinderGrenadeVacuum_C_DisablePhysicsAndExplode) == 0x000008, "Wrong alignment on BP_PathfinderGrenadeVacuum_C_DisablePhysicsAndExplode");
static_assert(sizeof(BP_PathfinderGrenadeVacuum_C_DisablePhysicsAndExplode) == 0x000010, "Wrong size on BP_PathfinderGrenadeVacuum_C_DisablePhysicsAndExplode");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_DisablePhysicsAndExplode, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_PathfinderGrenadeVacuum_C_DisablePhysicsAndExplode::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_DisablePhysicsAndExplode, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'BP_PathfinderGrenadeVacuum_C_DisablePhysicsAndExplode::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");

// Function BP_PathfinderGrenadeVacuum.BP_PathfinderGrenadeVacuum_C.ExecuteUbergraph_BP_PathfinderGrenadeVacuum
// 0x0378 (0x0378 - 0x0000)
struct BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6518[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6519[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651A[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651B[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651C[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651D[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OverlappedActor_1;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult_1;         // 0x00A0(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_OverlapConditionCheck_AllowDetonation;    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651E[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_SpawnProxyTrigger_Output_Get;             // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651F[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6520[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzAbilitySystemComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6521[0x3];                                     // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Spawn_Pull_Proxy_PullProxy;               // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OverlappedActor;                // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OverlapConditionCheck_AllowDetonation_1;  // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6522[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x01F8(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_ComponentBoundEvent_ImpactVelocity;         // 0x02F0(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_5;               // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6523[0x2];                                     // 0x030A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x030C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6524[0x4];                                     // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VelocityThreshold_VelocityThreshold;      // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorTickEnabled_ReturnValue;           // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6525[0x6];                                     // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0338(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0348(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum) == 0x000008, "Wrong alignment on BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum");
static_assert(sizeof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum) == 0x000378, "Wrong size on BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, EntryPoint) == 0x000000, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_HasAuthority_ReturnValue_1) == 0x00002C, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, Temp_bool_Has_Been_Initd_Variable) == 0x00002D, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, Temp_delegate_Variable) == 0x000034, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, Temp_delegate_Variable_1) == 0x000048, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, Temp_bool_IsClosed_Variable_1) == 0x000058, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, K2Node_CreateDelegate_OutputDelegate_2) == 0x00005C, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, Temp_bool_Has_Been_Initd_Variable_1) == 0x00006C, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, K2Node_CreateDelegate_OutputDelegate_3) == 0x000070, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_HasAuthority_ReturnValue_2) == 0x000080, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, K2Node_CustomEvent_OverlappedActor_1) == 0x000090, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::K2Node_CustomEvent_OverlappedActor_1' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, K2Node_CustomEvent_OtherActor_1) == 0x000098, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::K2Node_CustomEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, K2Node_ComponentBoundEvent_ImpactResult_1) == 0x0000A0, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::K2Node_ComponentBoundEvent_ImpactResult_1' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_OverlapConditionCheck_AllowDetonation) == 0x000198, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_OverlapConditionCheck_AllowDetonation' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_SpawnProxyTrigger_Output_Get) == 0x0001A0, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_SpawnProxyTrigger_Output_Get' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, Temp_int_Array_Index_Variable) == 0x0001A8, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_HasAuthority_ReturnValue_3) == 0x0001AC, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_PostEvent_ReturnValue) == 0x0001B0, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_PostEvent_ReturnValue_1) == 0x0001B4, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_HasAuthority_ReturnValue_4) == 0x0001B8, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_Array_Get_Item) == 0x0001C0, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_GetComponentByClass_ReturnValue) == 0x0001C8, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_Array_Length_ReturnValue) == 0x0001D0, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_Less_IntInt_ReturnValue) == 0x0001D4, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_Spawn_Pull_Proxy_PullProxy) == 0x0001D8, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_Spawn_Pull_Proxy_PullProxy' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, K2Node_CustomEvent_OverlappedActor) == 0x0001E0, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::K2Node_CustomEvent_OverlappedActor' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, K2Node_CustomEvent_OtherActor) == 0x0001E8, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_OverlapConditionCheck_AllowDetonation_1) == 0x0001F0, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_OverlapConditionCheck_AllowDetonation_1' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, K2Node_ComponentBoundEvent_ImpactResult) == 0x0001F8, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, K2Node_ComponentBoundEvent_ImpactVelocity) == 0x0002F0, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::K2Node_ComponentBoundEvent_ImpactVelocity' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000308, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_HasAuthority_ReturnValue_5) == 0x000309, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_HasAuthority_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, Temp_delegate_Variable_2) == 0x00030C, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_PostEvent_ReturnValue_2) == 0x00031C, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, K2Node_Event_DeltaSeconds) == 0x000320, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_VelocityThreshold_VelocityThreshold) == 0x000328, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_VelocityThreshold_VelocityThreshold' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_IsActorTickEnabled_ReturnValue) == 0x000330, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_IsActorTickEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000331, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000338, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000340, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000348, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000350, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_PostEventAtLocation_ReturnValue) == 0x000368, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_Delay_Duration_ImplicitCast) == 0x00036C, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000370, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x000374, "Member 'BP_PathfinderGrenadeVacuum_C_ExecuteUbergraph_BP_PathfinderGrenadeVacuum::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");

// Function BP_PathfinderGrenadeVacuum.BP_PathfinderGrenadeVacuum_C.OnActorBeginOverlap_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_PathfinderGrenadeVacuum_C_OnActorBeginOverlap_Event final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PathfinderGrenadeVacuum_C_OnActorBeginOverlap_Event) == 0x000008, "Wrong alignment on BP_PathfinderGrenadeVacuum_C_OnActorBeginOverlap_Event");
static_assert(sizeof(BP_PathfinderGrenadeVacuum_C_OnActorBeginOverlap_Event) == 0x000010, "Wrong size on BP_PathfinderGrenadeVacuum_C_OnActorBeginOverlap_Event");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_OnActorBeginOverlap_Event, OverlappedActor) == 0x000000, "Member 'BP_PathfinderGrenadeVacuum_C_OnActorBeginOverlap_Event::OverlappedActor' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_OnActorBeginOverlap_Event, OtherActor) == 0x000008, "Member 'BP_PathfinderGrenadeVacuum_C_OnActorBeginOverlap_Event::OtherActor' has a wrong offset!");

// Function BP_PathfinderGrenadeVacuum.BP_PathfinderGrenadeVacuum_C.OnPullProxyBeginOverlap_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_PathfinderGrenadeVacuum_C_OnPullProxyBeginOverlap_Event final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PathfinderGrenadeVacuum_C_OnPullProxyBeginOverlap_Event) == 0x000008, "Wrong alignment on BP_PathfinderGrenadeVacuum_C_OnPullProxyBeginOverlap_Event");
static_assert(sizeof(BP_PathfinderGrenadeVacuum_C_OnPullProxyBeginOverlap_Event) == 0x000010, "Wrong size on BP_PathfinderGrenadeVacuum_C_OnPullProxyBeginOverlap_Event");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_OnPullProxyBeginOverlap_Event, OverlappedActor) == 0x000000, "Member 'BP_PathfinderGrenadeVacuum_C_OnPullProxyBeginOverlap_Event::OverlappedActor' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_OnPullProxyBeginOverlap_Event, OtherActor) == 0x000008, "Member 'BP_PathfinderGrenadeVacuum_C_OnPullProxyBeginOverlap_Event::OtherActor' has a wrong offset!");

// Function BP_PathfinderGrenadeVacuum.BP_PathfinderGrenadeVacuum_C.OverlapConditionCheck
// 0x0038 (0x0038 - 0x0000)
struct BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck final
{
public:
	const class AActor*                           Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_AllowDetonation;                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6526[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzTeam*                                CallFunc_GetTeamFromPlayer_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6527[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzTeam*                                CallFunc_GetTeamFromPlayer_ReturnValue_1;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck) == 0x000008, "Wrong alignment on BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck");
static_assert(sizeof(BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck) == 0x000038, "Wrong size on BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck, Player) == 0x000000, "Member 'BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck::Player' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck, Param_AllowDetonation) == 0x000008, "Member 'BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck::Param_AllowDetonation' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck, CallFunc_GetInstigator_ReturnValue) == 0x000010, "Member 'BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck, CallFunc_GetTeamFromPlayer_ReturnValue) == 0x000018, "Member 'BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck::CallFunc_GetTeamFromPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000020, "Member 'BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck, CallFunc_GetTeamFromPlayer_ReturnValue_1) == 0x000028, "Member 'BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck::CallFunc_GetTeamFromPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000030, "Member 'BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck, CallFunc_Array_Contains_ReturnValue) == 0x000031, "Member 'BP_PathfinderGrenadeVacuum_C_OverlapConditionCheck::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_PathfinderGrenadeVacuum.BP_PathfinderGrenadeVacuum_C.Pull
// 0x0128 (0x0128 - 0x0000)
struct BP_PathfinderGrenadeVacuum_C_Pull final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6528[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0020(0x00B0)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x00E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6529[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_652A[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SendGameplayEventToActor_ReturnValue;     // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_652B[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OverlapConditionCheck_AllowDetonation;    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_652C[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast; // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PathfinderGrenadeVacuum_C_Pull) == 0x000008, "Wrong alignment on BP_PathfinderGrenadeVacuum_C_Pull");
static_assert(sizeof(BP_PathfinderGrenadeVacuum_C_Pull) == 0x000128, "Wrong size on BP_PathfinderGrenadeVacuum_C_Pull");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, Temp_object_Variable) == 0x000010, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, K2Node_MakeStruct_GameplayEventData) == 0x000020, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D0, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, CallFunc_SphereOverlapActors_OutActors) == 0x0000E8, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, CallFunc_SphereOverlapActors_ReturnValue) == 0x0000F8, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, CallFunc_Array_Length_ReturnValue) == 0x0000FC, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, CallFunc_Array_Get_Item) == 0x000100, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, CallFunc_Array_Add_ReturnValue) == 0x00010C, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, CallFunc_SendGameplayEventToActor_ReturnValue) == 0x000110, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::CallFunc_SendGameplayEventToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, CallFunc_GetComponentByClass_ReturnValue) == 0x000118, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, CallFunc_OverlapConditionCheck_AllowDetonation) == 0x000120, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::CallFunc_OverlapConditionCheck_AllowDetonation' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Pull, CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast) == 0x000124, "Member 'BP_PathfinderGrenadeVacuum_C_Pull::CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast' has a wrong offset!");

// Function BP_PathfinderGrenadeVacuum.BP_PathfinderGrenadeVacuum_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PathfinderGrenadeVacuum_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PathfinderGrenadeVacuum_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PathfinderGrenadeVacuum_C_ReceiveTick");
static_assert(sizeof(BP_PathfinderGrenadeVacuum_C_ReceiveTick) == 0x000004, "Wrong size on BP_PathfinderGrenadeVacuum_C_ReceiveTick");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PathfinderGrenadeVacuum_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PathfinderGrenadeVacuum.BP_PathfinderGrenadeVacuum_C.Shooting Sound
// 0x0018 (0x0018 - 0x0000)
struct BP_PathfinderGrenadeVacuum_C_Shooting_Sound final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_652D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PathfinderGrenadeVacuum_C_Shooting_Sound) == 0x000004, "Wrong alignment on BP_PathfinderGrenadeVacuum_C_Shooting_Sound");
static_assert(sizeof(BP_PathfinderGrenadeVacuum_C_Shooting_Sound) == 0x000018, "Wrong size on BP_PathfinderGrenadeVacuum_C_Shooting_Sound");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Shooting_Sound, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_PathfinderGrenadeVacuum_C_Shooting_Sound::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Shooting_Sound, Temp_delegate_Variable) == 0x000004, "Member 'BP_PathfinderGrenadeVacuum_C_Shooting_Sound::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Shooting_Sound, CallFunc_PostEvent_ReturnValue) == 0x000014, "Member 'BP_PathfinderGrenadeVacuum_C_Shooting_Sound::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function BP_PathfinderGrenadeVacuum.BP_PathfinderGrenadeVacuum_C.Spawn Pull Proxy
// 0x00E0 (0x00E0 - 0x0000)
struct BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy final
{
public:
	class AActor*                                 Param_PullProxy;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_652E[0x8];                                     // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PathfinderProximityTrigger_C*       CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy) == 0x000010, "Wrong alignment on BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy");
static_assert(sizeof(BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy) == 0x0000E0, "Wrong size on BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy, Param_PullProxy) == 0x000000, "Member 'BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy::Param_PullProxy' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000028, "Member 'BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000040, "Member 'BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C8, "Member 'BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000D0, "Member 'BP_PathfinderGrenadeVacuum_C_Spawn_Pull_Proxy::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_PathfinderGrenadeVacuum.BP_PathfinderGrenadeVacuum_C.SpawnProxyTrigger
// 0x00D0 (0x00D0 - 0x0000)
struct BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger final
{
public:
	class AActor*                                 Output_Get;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PathfinderProximityTrigger_C*       CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_652F[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger) == 0x000010, "Wrong alignment on BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger");
static_assert(sizeof(BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger) == 0x0000D0, "Wrong size on BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger, Output_Get) == 0x000000, "Member 'BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger::Output_Get' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000038, "Member 'BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B0, "Member 'BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000B8, "Member 'BP_PathfinderGrenadeVacuum_C_SpawnProxyTrigger::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
