#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PartyMemberDisplaySlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PartyMemberDisplaySlot.BP_PartyMemberDisplaySlot_C.ExecuteUbergraph_BP_PartyMemberDisplaySlot
// 0x00A0 (0x00A0 - 0x0000)
struct BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6849[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HideoutPlayerCharacter_C*           K2Node_DynamicCast_AsBP_Hideout_Player_Character;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_684A[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_684B[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Hideout_Player_C*                  K2Node_DynamicCast_AsABP_Hideout_Player;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_684C[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot) == 0x000008, "Wrong alignment on BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot");
static_assert(sizeof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot) == 0x0000A0, "Wrong size on BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, EntryPoint) == 0x000000, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, K2Node_DynamicCast_AsBP_Hideout_Player_Character) == 0x000008, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::K2Node_DynamicCast_AsBP_Hideout_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000018, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, CallFunc_GetAnimInstance_ReturnValue) == 0x000050, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, K2Node_DynamicCast_AsABP_Hideout_Player) == 0x000058, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::K2Node_DynamicCast_AsABP_Hideout_Player' has a wrong offset!");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000068, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000078, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000088, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, K2Node_SwitchEnum_CmpSuccess) == 0x000098, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot, K2Node_SwitchEnum_CmpSuccess_1) == 0x000099, "Member 'BP_PartyMemberDisplaySlot_C_ExecuteUbergraph_BP_PartyMemberDisplaySlot::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

}

