#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Phosphorous_Dart_Component

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function BP_Phosphorous_Dart_Component.BP_Phosphorous_Dart_Component_C.BP_Phosphorous_Dart_Component_AutoGenFunc
// 0x0008 (0x0008 - 0x0000)
struct BP_Phosphorous_Dart_Component_C_BP_Phosphorous_Dart_Component_AutoGenFunc final
{
public:
	class AGzCharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Component_C_BP_Phosphorous_Dart_Component_AutoGenFunc) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Component_C_BP_Phosphorous_Dart_Component_AutoGenFunc");
static_assert(sizeof(BP_Phosphorous_Dart_Component_C_BP_Phosphorous_Dart_Component_AutoGenFunc) == 0x000008, "Wrong size on BP_Phosphorous_Dart_Component_C_BP_Phosphorous_Dart_Component_AutoGenFunc");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_BP_Phosphorous_Dart_Component_AutoGenFunc, Character) == 0x000000, "Member 'BP_Phosphorous_Dart_Component_C_BP_Phosphorous_Dart_Component_AutoGenFunc::Character' has a wrong offset!");

// Function BP_Phosphorous_Dart_Component.BP_Phosphorous_Dart_Component_C.CalculateLaunchAndUpdatePreview
// 0x02D0 (0x02D0 - 0x0000)
struct BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview final
{
public:
	struct FPredictProjectilePathParams           CallFunc_GetPathParams_PredictProjectilePathParams; // 0x0000(0x0078)()
	struct FPredictProjectilePathResult           CallFunc_Blueprint_PredictProjectilePath_Advanced_PredictResult; // 0x0078(0x0140)(ContainsInstancedReference)
	bool                                          CallFunc_Blueprint_PredictProjectilePath_Advanced_ReturnValue; // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_620D[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeHitResult_Location;                   // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x01D8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview");
static_assert(sizeof(BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview) == 0x0002D0, "Wrong size on BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview, CallFunc_GetPathParams_PredictProjectilePathParams) == 0x000000, "Member 'BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview::CallFunc_GetPathParams_PredictProjectilePathParams' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview, CallFunc_Blueprint_PredictProjectilePath_Advanced_PredictResult) == 0x000078, "Member 'BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview::CallFunc_Blueprint_PredictProjectilePath_Advanced_PredictResult' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview, CallFunc_Blueprint_PredictProjectilePath_Advanced_ReturnValue) == 0x0001B8, "Member 'BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview::CallFunc_Blueprint_PredictProjectilePath_Advanced_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview, CallFunc_MakeHitResult_Location) == 0x0001C0, "Member 'BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview::CallFunc_MakeHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview, CallFunc_MakeHitResult_ReturnValue) == 0x0001D8, "Member 'BP_Phosphorous_Dart_Component_C_CalculateLaunchAndUpdatePreview::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");

// Function BP_Phosphorous_Dart_Component.BP_Phosphorous_Dart_Component_C.CharacterHitTimer
// 0x0028 (0x0028 - 0x0000)
struct BP_Phosphorous_Dart_Component_C_CharacterHitTimer final
{
public:
	bool                                          IsCharacter;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __SplineColorChangeTime;                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_620E[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CharacterHitTime;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Component_C_CharacterHitTimer) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Component_C_CharacterHitTimer");
static_assert(sizeof(BP_Phosphorous_Dart_Component_C_CharacterHitTimer) == 0x000028, "Wrong size on BP_Phosphorous_Dart_Component_C_CharacterHitTimer");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_CharacterHitTimer, IsCharacter) == 0x000000, "Member 'BP_Phosphorous_Dart_Component_C_CharacterHitTimer::IsCharacter' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_CharacterHitTimer, __SplineColorChangeTime) == 0x000001, "Member 'BP_Phosphorous_Dart_Component_C_CharacterHitTimer::__SplineColorChangeTime' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_CharacterHitTimer, CharacterHitTime) == 0x000008, "Member 'BP_Phosphorous_Dart_Component_C_CharacterHitTimer::CharacterHitTime' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_CharacterHitTimer, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000010, "Member 'BP_Phosphorous_Dart_Component_C_CharacterHitTimer::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_CharacterHitTimer, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_Phosphorous_Dart_Component_C_CharacterHitTimer::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_CharacterHitTimer, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_Phosphorous_Dart_Component_C_CharacterHitTimer::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_Phosphorous_Dart_Component.BP_Phosphorous_Dart_Component_C.DestroyPreviewActor
// 0x0003 (0x0003 - 0x0000)
struct BP_Phosphorous_Dart_Component_C_DestroyPreviewActor final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Component_C_DestroyPreviewActor) == 0x000001, "Wrong alignment on BP_Phosphorous_Dart_Component_C_DestroyPreviewActor");
static_assert(sizeof(BP_Phosphorous_Dart_Component_C_DestroyPreviewActor) == 0x000003, "Wrong size on BP_Phosphorous_Dart_Component_C_DestroyPreviewActor");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_DestroyPreviewActor, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Phosphorous_Dart_Component_C_DestroyPreviewActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_DestroyPreviewActor, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_Phosphorous_Dart_Component_C_DestroyPreviewActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_DestroyPreviewActor, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'BP_Phosphorous_Dart_Component_C_DestroyPreviewActor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_Phosphorous_Dart_Component.BP_Phosphorous_Dart_Component_C.ExecuteUbergraph_BP_Phosphorous_Dart_Component
// 0x00C8 (0x00C8 - 0x0000)
struct BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_620F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6210[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6211[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6212[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateChargingProgress_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6213[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0044(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6214[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzMultiPartCharacter*                  K2Node_DynamicCast_AsGz_Multi_Part_Character;      // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6215[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6216[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x007C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6217[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_6;                   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_5;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6218[0x2];                                     // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x00A4(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6219[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateChargingProgress_DeltaTime_ImplicitCast; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component");
static_assert(sizeof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component) == 0x0000C8, "Wrong size on BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, EntryPoint) == 0x000000, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_GetOwner_ReturnValue_1) == 0x000018, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_GetOwner_ReturnValue_2) == 0x000020, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_HasAuthority_ReturnValue_1) == 0x000028, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_HasAuthority_ReturnValue_2) == 0x000029, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_GetOwner_ReturnValue_3) == 0x000030, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_HasAuthority_ReturnValue_3) == 0x000038, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, K2Node_Event_DeltaSeconds) == 0x00003C, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_UpdateChargingProgress_ReturnValue) == 0x000040, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_UpdateChargingProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, K2Node_Event_EndPlayReason) == 0x000041, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, Temp_delegate_Variable) == 0x000044, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_GetOwner_ReturnValue_4) == 0x000058, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, K2Node_DynamicCast_AsGz_Multi_Part_Character) == 0x000060, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::K2Node_DynamicCast_AsGz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_GetOwner_ReturnValue_5) == 0x000070, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_GetOwner_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_HasAuthority_ReturnValue_4) == 0x000078, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, Temp_delegate_Variable_1) == 0x00007C, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, Temp_bool_Has_Been_Initd_Variable) == 0x00008C, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_GetOwner_ReturnValue_6) == 0x000090, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_GetOwner_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_HasAuthority_ReturnValue_5) == 0x000098, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_HasAuthority_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_IsValid_ReturnValue) == 0x000099, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_PostEvent_ReturnValue) == 0x00009C, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_PostEvent_ReturnValue_1) == 0x0000A0, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, Temp_delegate_Variable_2) == 0x0000A4, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_PostEvent_ReturnValue_2) == 0x0000B4, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, Temp_bool_IsClosed_Variable) == 0x0000B8, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component, CallFunc_UpdateChargingProgress_DeltaTime_ImplicitCast) == 0x0000C0, "Member 'BP_Phosphorous_Dart_Component_C_ExecuteUbergraph_BP_Phosphorous_Dart_Component::CallFunc_UpdateChargingProgress_DeltaTime_ImplicitCast' has a wrong offset!");

// Function BP_Phosphorous_Dart_Component.BP_Phosphorous_Dart_Component_C.GetDartVelocityGravity
// 0x0020 (0x0020 - 0x0000)
struct BP_Phosphorous_Dart_Component_C_GetDartVelocityGravity final
{
public:
	double                                        MinProjectileSpeed;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_MaxProjectileSpeed;                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinGravityZ;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxGravityZ;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Component_C_GetDartVelocityGravity) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Component_C_GetDartVelocityGravity");
static_assert(sizeof(BP_Phosphorous_Dart_Component_C_GetDartVelocityGravity) == 0x000020, "Wrong size on BP_Phosphorous_Dart_Component_C_GetDartVelocityGravity");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetDartVelocityGravity, MinProjectileSpeed) == 0x000000, "Member 'BP_Phosphorous_Dart_Component_C_GetDartVelocityGravity::MinProjectileSpeed' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetDartVelocityGravity, Param_MaxProjectileSpeed) == 0x000008, "Member 'BP_Phosphorous_Dart_Component_C_GetDartVelocityGravity::Param_MaxProjectileSpeed' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetDartVelocityGravity, MinGravityZ) == 0x000010, "Member 'BP_Phosphorous_Dart_Component_C_GetDartVelocityGravity::MinGravityZ' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetDartVelocityGravity, MaxGravityZ) == 0x000018, "Member 'BP_Phosphorous_Dart_Component_C_GetDartVelocityGravity::MaxGravityZ' has a wrong offset!");

// Function BP_Phosphorous_Dart_Component.BP_Phosphorous_Dart_Component_C.GetGravityZ
// 0x0018 (0x0018 - 0x0000)
struct BP_Phosphorous_Dart_Component_C_GetGravityZ final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Component_C_GetGravityZ) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Component_C_GetGravityZ");
static_assert(sizeof(BP_Phosphorous_Dart_Component_C_GetGravityZ) == 0x000018, "Wrong size on BP_Phosphorous_Dart_Component_C_GetGravityZ");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetGravityZ, ReturnValue) == 0x000000, "Member 'BP_Phosphorous_Dart_Component_C_GetGravityZ::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetGravityZ, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_Phosphorous_Dart_Component_C_GetGravityZ::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetGravityZ, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Phosphorous_Dart_Component_C_GetGravityZ::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_Phosphorous_Dart_Component.BP_Phosphorous_Dart_Component_C.GetLaunchDirection
// 0x0298 (0x0298 - 0x0000)
struct BP_Phosphorous_Dart_Component_C_GetLaunchDirection final
{
public:
	struct FVector                                LaunchLocation;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                NewLocalVar;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        NonHitMaxDistance;                                 // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621A[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzCombatComponent*                     CallFunc_GetCombatComponent_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_GetViewHitResult_ReturnValue;             // 0x0050(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621B[0x2];                                     // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621C[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621D[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Component_C_GetLaunchDirection");
static_assert(sizeof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection) == 0x000298, "Wrong size on BP_Phosphorous_Dart_Component_C_GetLaunchDirection");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, LaunchLocation) == 0x000000, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::LaunchLocation' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, ReturnValue) == 0x000018, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, NewLocalVar) == 0x000030, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, NonHitMaxDistance) == 0x000038, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::NonHitMaxDistance' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, Temp_bool_Variable) == 0x000040, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_GetCombatComponent_ReturnValue) == 0x000048, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_GetCombatComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_GetViewHitResult_ReturnValue) == 0x000050, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_GetViewHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_bBlockingHit) == 0x000148, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_bInitialOverlap) == 0x000149, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_Time) == 0x00014C, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_Distance) == 0x000150, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_Location) == 0x000158, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_ImpactPoint) == 0x000170, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_Normal) == 0x000188, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A0, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_PhysMat) == 0x0001B8, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_HitActor) == 0x0001C0, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_HitComponent) == 0x0001C8, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_HitBoneName) == 0x0001D0, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_BoneName) == 0x0001D8, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_HitItem) == 0x0001E0, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_ElementIndex) == 0x0001E4, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_FaceIndex) == 0x0001E8, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_TraceStart) == 0x0001F0, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_BreakHitResult_TraceEnd) == 0x000208, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000220, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000238, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_Normal_ReturnValue) == 0x000250, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, CallFunc_Normal_ReturnValue_1) == 0x000268, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchDirection, K2Node_Select_Default) == 0x000280, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchDirection::K2Node_Select_Default' has a wrong offset!");

// Function BP_Phosphorous_Dart_Component.BP_Phosphorous_Dart_Component_C.GetLaunchLocation
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Phosphorous_Dart_Component_C_GetLaunchLocation final
{
public:
	struct FVector                                LaunchLocation;                                    // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnRightOffset;                                  // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621E[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable_1;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   CallFunc_GetLimbType_ReturnValue;                  // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621F[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLimbSocketWorldLocation_ReturnValue;   // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Component_C_GetLaunchLocation");
static_assert(sizeof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation) == 0x0000D0, "Wrong size on BP_Phosphorous_Dart_Component_C_GetLaunchLocation");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation, LaunchLocation) == 0x000000, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchLocation::LaunchLocation' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation, SpawnRightOffset) == 0x000018, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchLocation::SpawnRightOffset' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation, Temp_struct_Variable) == 0x000030, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchLocation::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation, Temp_byte_Variable) == 0x000048, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchLocation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation, Temp_name_Variable) == 0x00004C, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchLocation::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation, Temp_name_Variable_1) == 0x000054, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchLocation::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation, Temp_name_Variable_2) == 0x00005C, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchLocation::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation, Temp_byte_Variable_1) == 0x000064, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchLocation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation, CallFunc_GetLimbType_ReturnValue) == 0x000065, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchLocation::CallFunc_GetLimbType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation, K2Node_Select_Default) == 0x000068, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchLocation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation, CallFunc_GetLimbSocketWorldLocation_ReturnValue) == 0x000070, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchLocation::CallFunc_GetLimbSocketWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000088, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchLocation, K2Node_Select_Default_1) == 0x0000B8, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchLocation::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_Phosphorous_Dart_Component.BP_Phosphorous_Dart_Component_C.GetLaunchParams
// 0x0070 (0x0070 - 0x0000)
struct BP_Phosphorous_Dart_Component_C_GetLaunchParams final
{
public:
	struct FVector                                LaunchLocation;                                    // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LaunchDirection;                                   // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ProjectileVelocity;                                // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetLaunchSpeed_ProjectileVelocity;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLaunchDirection_ReturnValue;           // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLaunchLocation_LaunchLocation;         // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Component_C_GetLaunchParams) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Component_C_GetLaunchParams");
static_assert(sizeof(BP_Phosphorous_Dart_Component_C_GetLaunchParams) == 0x000070, "Wrong size on BP_Phosphorous_Dart_Component_C_GetLaunchParams");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchParams, LaunchLocation) == 0x000000, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchParams::LaunchLocation' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchParams, LaunchDirection) == 0x000018, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchParams::LaunchDirection' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchParams, ProjectileVelocity) == 0x000030, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchParams::ProjectileVelocity' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchParams, CallFunc_GetLaunchSpeed_ProjectileVelocity) == 0x000038, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchParams::CallFunc_GetLaunchSpeed_ProjectileVelocity' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchParams, CallFunc_GetLaunchDirection_ReturnValue) == 0x000040, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchParams::CallFunc_GetLaunchDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchParams, CallFunc_GetLaunchLocation_LaunchLocation) == 0x000058, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchParams::CallFunc_GetLaunchLocation_LaunchLocation' has a wrong offset!");

// Function BP_Phosphorous_Dart_Component.BP_Phosphorous_Dart_Component_C.GetLaunchSpeed
// 0x0018 (0x0018 - 0x0000)
struct BP_Phosphorous_Dart_Component_C_GetLaunchSpeed final
{
public:
	double                                        ProjectileVelocity;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Component_C_GetLaunchSpeed) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Component_C_GetLaunchSpeed");
static_assert(sizeof(BP_Phosphorous_Dart_Component_C_GetLaunchSpeed) == 0x000018, "Wrong size on BP_Phosphorous_Dart_Component_C_GetLaunchSpeed");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchSpeed, ProjectileVelocity) == 0x000000, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchSpeed::ProjectileVelocity' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchSpeed, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchSpeed::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchSpeed, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchSpeed::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_Phosphorous_Dart_Component.BP_Phosphorous_Dart_Component_C.GetLaunchVelo
// 0x0098 (0x0098 - 0x0000)
struct BP_Phosphorous_Dart_Component_C_GetLaunchVelo final
{
public:
	struct FVector                                LaunchVelocity;                                    // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LaunchLocation;                                    // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLaunchLocation_LaunchLocation;         // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLaunchDirection_ReturnValue;           // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Component_C_GetLaunchVelo) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Component_C_GetLaunchVelo");
static_assert(sizeof(BP_Phosphorous_Dart_Component_C_GetLaunchVelo) == 0x000098, "Wrong size on BP_Phosphorous_Dart_Component_C_GetLaunchVelo");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchVelo, LaunchVelocity) == 0x000000, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchVelo::LaunchVelocity' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchVelo, LaunchLocation) == 0x000018, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchVelo::LaunchLocation' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchVelo, CallFunc_GetLaunchLocation_LaunchLocation) == 0x000030, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchVelo::CallFunc_GetLaunchLocation_LaunchLocation' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchVelo, CallFunc_GetLaunchDirection_ReturnValue) == 0x000048, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchVelo::CallFunc_GetLaunchDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchVelo, CallFunc_Lerp_ReturnValue) == 0x000060, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchVelo::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchVelo, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000068, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchVelo::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Component_C_GetLaunchVelo, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000080, "Member 'BP_Phosphorous_Dart_Component_C_GetLaunchVelo::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_Phosphorous_Dart_Component.BP_Phosphorous_Dart_Component_C.GetPathParams
// 0x0140 (0x0140 - 0x0000)
struct BP_Phosphorous_Dart_Component_C_GetPathParams final
{
public:
	struct FPredictProjectilePathParams           PredictProjectilePathParams;                       // 0x0000(0x0078)(Parm, OutParm)
	struct FVector                                CallFunc_GetLaunchVelo_LaunchVelocity;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLaunchVelo_LaunchLocation;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	double                                        CallFunc_GetGravityZ_ReturnValue;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPredictProjectilePathParams           K2Node_MakeStruct_PredictProjectilePathParams;     // 0x00C0(0x0078)()
	float                                         K2Node_MakeStruct_OverrideGravityZ_ImplicitCast;   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Component_C_GetPathParams) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Component_C_GetPathParams");
static_assert(sizeof(BP_Phosphorous_Dart_Component_C_GetPathParams) == 0x000140, "Wrong size on BP_Phosphorous_Dart_Component_C_GetPathParams");
