#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhosphorousDart_PreviewActor_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PhosphorousDart_PreviewActor_New.BP_PhosphorousDart_PreviewActor_New_C
// 0x0018 (0x04C8 - 0x04B0)
class ABP_PhosphorousDart_PreviewActor_New_C final : public AGzChargePreviewPathActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        MaterialProgress;                                  // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaterialSpeed;                                     // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PhosphorousDart_PreviewActor_New(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void UpdatePathMaterial(double DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PhosphorousDart_PreviewActor_New_C">();
	}
	static class ABP_PhosphorousDart_PreviewActor_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PhosphorousDart_PreviewActor_New_C>();
	}
};
static_assert(alignof(ABP_PhosphorousDart_PreviewActor_New_C) == 0x000008, "Wrong alignment on ABP_PhosphorousDart_PreviewActor_New_C");
static_assert(sizeof(ABP_PhosphorousDart_PreviewActor_New_C) == 0x0004C8, "Wrong size on ABP_PhosphorousDart_PreviewActor_New_C");
static_assert(offsetof(ABP_PhosphorousDart_PreviewActor_New_C, UberGraphFrame) == 0x0004B0, "Member 'ABP_PhosphorousDart_PreviewActor_New_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PhosphorousDart_PreviewActor_New_C, MaterialProgress) == 0x0004B8, "Member 'ABP_PhosphorousDart_PreviewActor_New_C::MaterialProgress' has a wrong offset!");
static_assert(offsetof(ABP_PhosphorousDart_PreviewActor_New_C, MaterialSpeed) == 0x0004C0, "Member 'ABP_PhosphorousDart_PreviewActor_New_C::MaterialSpeed' has a wrong offset!");

}

