#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhosphourousDart_Projectile_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"
#include "AkAudio_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PhosphourousDart_Projectile_New.BP_PhosphourousDart_Projectile_New_C
// 0x0050 (0x04F0 - 0x04A0)
class ABP_PhosphourousDart_Projectile_New_C final : public AGzPhosphorousDartProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       MarkerDistanceVisibility;                          // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGzMarkerComponent*                     GzMarker;                                          // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      StuckVFX;                                          // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      TrailVFX;                                          // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnHit;                                             // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnSpawnEffects;                                    // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          EffectsDeployed;                                   // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DidHItObject;                                      // 0x04E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_PhosphourousDart_Projectile_New_MarkerDistanceVisibility_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_PhosphourousDart_Projectile_New_MarkerDistanceVisibility_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BP_OnHit(const struct FHitResult& Hit);
	void BP_OnLaunched();
	void BP_OnSpawnOverlap();
	void ExecuteUbergraph_BP_PhosphourousDart_Projectile_New(int32 EntryPoint);
	void OnHit__DelegateSignature();
	void OnSpawnEffects__DelegateSignature();
	void OverlapEffects(const struct FVector& ServerLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PhosphourousDart_Projectile_New_C">();
	}
	static class ABP_PhosphourousDart_Projectile_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PhosphourousDart_Projectile_New_C>();
	}
};
static_assert(alignof(ABP_PhosphourousDart_Projectile_New_C) == 0x000008, "Wrong alignment on ABP_PhosphourousDart_Projectile_New_C");
static_assert(sizeof(ABP_PhosphourousDart_Projectile_New_C) == 0x0004F0, "Wrong size on ABP_PhosphourousDart_Projectile_New_C");
static_assert(offsetof(ABP_PhosphourousDart_Projectile_New_C, UberGraphFrame) == 0x0004A0, "Member 'ABP_PhosphourousDart_Projectile_New_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PhosphourousDart_Projectile_New_C, MarkerDistanceVisibility) == 0x0004A8, "Member 'ABP_PhosphourousDart_Projectile_New_C::MarkerDistanceVisibility' has a wrong offset!");
static_assert(offsetof(ABP_PhosphourousDart_Projectile_New_C, GzMarker) == 0x0004B0, "Member 'ABP_PhosphourousDart_Projectile_New_C::GzMarker' has a wrong offset!");
static_assert(offsetof(ABP_PhosphourousDart_Projectile_New_C, StuckVFX) == 0x0004B8, "Member 'ABP_PhosphourousDart_Projectile_New_C::StuckVFX' has a wrong offset!");
static_assert(offsetof(ABP_PhosphourousDart_Projectile_New_C, TrailVFX) == 0x0004C0, "Member 'ABP_PhosphourousDart_Projectile_New_C::TrailVFX' has a wrong offset!");
static_assert(offsetof(ABP_PhosphourousDart_Projectile_New_C, OnHit) == 0x0004C8, "Member 'ABP_PhosphourousDart_Projectile_New_C::OnHit' has a wrong offset!");
static_assert(offsetof(ABP_PhosphourousDart_Projectile_New_C, OnSpawnEffects) == 0x0004D8, "Member 'ABP_PhosphourousDart_Projectile_New_C::OnSpawnEffects' has a wrong offset!");
static_assert(offsetof(ABP_PhosphourousDart_Projectile_New_C, EffectsDeployed) == 0x0004E8, "Member 'ABP_PhosphourousDart_Projectile_New_C::EffectsDeployed' has a wrong offset!");
static_assert(offsetof(ABP_PhosphourousDart_Projectile_New_C, DidHItObject) == 0x0004E9, "Member 'ABP_PhosphourousDart_Projectile_New_C::DidHItObject' has a wrong offset!");

}

