#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Phosphorous_Dart_PreviewActor_Arc

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Phosphorous_Dart_PreviewActor_Arc.BP_Phosphorous_Dart_PreviewActor_Arc_C
// 0x0020 (0x04B0 - 0x0490)
class ABP_Phosphorous_Dart_PreviewActor_Arc_C final : public AGzPreviewPathActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AGzMultiPartCharacter*                  As_Gz_Multi_Part_Character;                        // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBP_Phosphorous_Dart_Component_C*       ExplosiveDartComponent;                            // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class USplineMeshComponent*                   SplineComp;                                        // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Phosphorous_Dart_PreviewActor_Arc(int32 EntryPoint);
	void UpdatePredictedProjectilePath();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Phosphorous_Dart_PreviewActor_Arc_C">();
	}
	static class ABP_Phosphorous_Dart_PreviewActor_Arc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Phosphorous_Dart_PreviewActor_Arc_C>();
	}
};
static_assert(alignof(ABP_Phosphorous_Dart_PreviewActor_Arc_C) == 0x000008, "Wrong alignment on ABP_Phosphorous_Dart_PreviewActor_Arc_C");
static_assert(sizeof(ABP_Phosphorous_Dart_PreviewActor_Arc_C) == 0x0004B0, "Wrong size on ABP_Phosphorous_Dart_PreviewActor_Arc_C");
static_assert(offsetof(ABP_Phosphorous_Dart_PreviewActor_Arc_C, UberGraphFrame) == 0x000490, "Member 'ABP_Phosphorous_Dart_PreviewActor_Arc_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_PreviewActor_Arc_C, As_Gz_Multi_Part_Character) == 0x000498, "Member 'ABP_Phosphorous_Dart_PreviewActor_Arc_C::As_Gz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_PreviewActor_Arc_C, ExplosiveDartComponent) == 0x0004A0, "Member 'ABP_Phosphorous_Dart_PreviewActor_Arc_C::ExplosiveDartComponent' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_PreviewActor_Arc_C, SplineComp) == 0x0004A8, "Member 'ABP_Phosphorous_Dart_PreviewActor_Arc_C::SplineComp' has a wrong offset!");

}

