#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PickableEffectsComponent

#include "Basic.hpp"

#include "PickableEffectsStruct_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.CreateLootBeam_BP
// 0x0018 (0x0018 - 0x0000)
struct BP_PickableEffectsComponent_C_CreateLootBeam_BP final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_CreateLootBeam_BP) == 0x000008, "Wrong alignment on BP_PickableEffectsComponent_C_CreateLootBeam_BP");
static_assert(sizeof(BP_PickableEffectsComponent_C_CreateLootBeam_BP) == 0x000018, "Wrong size on BP_PickableEffectsComponent_C_CreateLootBeam_BP");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateLootBeam_BP, Location) == 0x000000, "Member 'BP_PickableEffectsComponent_C_CreateLootBeam_BP::Location' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.CreateLootBeamEffect
// 0x00E0 (0x00E0 - 0x0000)
struct BP_PickableEffectsComponent_C_CreateLootBeamEffect final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzPickableBase*                        K2Node_DynamicCast_AsGz_Pickable_Base;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6938[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzItemData*                            CallFunc_GetItemData_ReturnValue;                  // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzItemRarity                                 CallFunc_GetRarity_ReturnValue;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6939[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPickableScaleForRarity_Scale;          // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetBeamMeshClassForItemType_BeamMeshClass; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BeamMeshVFX_Template_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_CreateLootBeamEffect) == 0x000010, "Wrong alignment on BP_PickableEffectsComponent_C_CreateLootBeamEffect");
static_assert(sizeof(BP_PickableEffectsComponent_C_CreateLootBeamEffect) == 0x0000E0, "Wrong size on BP_PickableEffectsComponent_C_CreateLootBeamEffect");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateLootBeamEffect, Location) == 0x000000, "Member 'BP_PickableEffectsComponent_C_CreateLootBeamEffect::Location' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateLootBeamEffect, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_PickableEffectsComponent_C_CreateLootBeamEffect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateLootBeamEffect, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_PickableEffectsComponent_C_CreateLootBeamEffect::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateLootBeamEffect, K2Node_DynamicCast_AsGz_Pickable_Base) == 0x000080, "Member 'BP_PickableEffectsComponent_C_CreateLootBeamEffect::K2Node_DynamicCast_AsGz_Pickable_Base' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateLootBeamEffect, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_PickableEffectsComponent_C_CreateLootBeamEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateLootBeamEffect, CallFunc_GetItemData_ReturnValue) == 0x000090, "Member 'BP_PickableEffectsComponent_C_CreateLootBeamEffect::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateLootBeamEffect, CallFunc_GetRarity_ReturnValue) == 0x000098, "Member 'BP_PickableEffectsComponent_C_CreateLootBeamEffect::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateLootBeamEffect, CallFunc_GetPickableScaleForRarity_Scale) == 0x0000A0, "Member 'BP_PickableEffectsComponent_C_CreateLootBeamEffect::CallFunc_GetPickableScaleForRarity_Scale' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateLootBeamEffect, CallFunc_GetBeamMeshClassForItemType_BeamMeshClass) == 0x0000B8, "Member 'BP_PickableEffectsComponent_C_CreateLootBeamEffect::CallFunc_GetBeamMeshClassForItemType_BeamMeshClass' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateLootBeamEffect, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'BP_PickableEffectsComponent_C_CreateLootBeamEffect::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateLootBeamEffect, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C8, "Member 'BP_PickableEffectsComponent_C_CreateLootBeamEffect::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateLootBeamEffect, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'BP_PickableEffectsComponent_C_CreateLootBeamEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.CreateNiagara_BP
// 0x0018 (0x0018 - 0x0000)
struct BP_PickableEffectsComponent_C_CreateNiagara_BP final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_CreateNiagara_BP) == 0x000008, "Wrong alignment on BP_PickableEffectsComponent_C_CreateNiagara_BP");
static_assert(sizeof(BP_PickableEffectsComponent_C_CreateNiagara_BP) == 0x000018, "Wrong size on BP_PickableEffectsComponent_C_CreateNiagara_BP");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateNiagara_BP, Location) == 0x000000, "Member 'BP_PickableEffectsComponent_C_CreateNiagara_BP::Location' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.CreateNiagaraSystem
// 0x0058 (0x0058 - 0x0000)
struct BP_PickableEffectsComponent_C_CreateNiagaraSystem final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPickableBase*                        K2Node_DynamicCast_AsGz_Pickable_Base;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_693A[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzItemData*                            CallFunc_GetItemData_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CallFunc_GetNiagaraSystemForItemType_NiagaraSystem; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_CreateNiagaraSystem) == 0x000008, "Wrong alignment on BP_PickableEffectsComponent_C_CreateNiagaraSystem");
static_assert(sizeof(BP_PickableEffectsComponent_C_CreateNiagaraSystem) == 0x000058, "Wrong size on BP_PickableEffectsComponent_C_CreateNiagaraSystem");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateNiagaraSystem, Location) == 0x000000, "Member 'BP_PickableEffectsComponent_C_CreateNiagaraSystem::Location' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateNiagaraSystem, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_PickableEffectsComponent_C_CreateNiagaraSystem::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateNiagaraSystem, K2Node_DynamicCast_AsGz_Pickable_Base) == 0x000020, "Member 'BP_PickableEffectsComponent_C_CreateNiagaraSystem::K2Node_DynamicCast_AsGz_Pickable_Base' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateNiagaraSystem, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_PickableEffectsComponent_C_CreateNiagaraSystem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateNiagaraSystem, CallFunc_GetItemData_ReturnValue) == 0x000030, "Member 'BP_PickableEffectsComponent_C_CreateNiagaraSystem::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateNiagaraSystem, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000038, "Member 'BP_PickableEffectsComponent_C_CreateNiagaraSystem::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateNiagaraSystem, CallFunc_GetNiagaraSystemForItemType_NiagaraSystem) == 0x000040, "Member 'BP_PickableEffectsComponent_C_CreateNiagaraSystem::CallFunc_GetNiagaraSystemForItemType_NiagaraSystem' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateNiagaraSystem, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000048, "Member 'BP_PickableEffectsComponent_C_CreateNiagaraSystem::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateNiagaraSystem, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_PickableEffectsComponent_C_CreateNiagaraSystem::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.CreateSFX_BP
// 0x0018 (0x0018 - 0x0000)
struct BP_PickableEffectsComponent_C_CreateSFX_BP final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_CreateSFX_BP) == 0x000008, "Wrong alignment on BP_PickableEffectsComponent_C_CreateSFX_BP");
static_assert(sizeof(BP_PickableEffectsComponent_C_CreateSFX_BP) == 0x000018, "Wrong size on BP_PickableEffectsComponent_C_CreateSFX_BP");
static_assert(offsetof(BP_PickableEffectsComponent_C_CreateSFX_BP, Location) == 0x000000, "Member 'BP_PickableEffectsComponent_C_CreateSFX_BP::Location' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.DestroyLootBeamEffect
// 0x0001 (0x0001 - 0x0000)
struct BP_PickableEffectsComponent_C_DestroyLootBeamEffect final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_DestroyLootBeamEffect) == 0x000001, "Wrong alignment on BP_PickableEffectsComponent_C_DestroyLootBeamEffect");
static_assert(sizeof(BP_PickableEffectsComponent_C_DestroyLootBeamEffect) == 0x000001, "Wrong size on BP_PickableEffectsComponent_C_DestroyLootBeamEffect");
static_assert(offsetof(BP_PickableEffectsComponent_C_DestroyLootBeamEffect, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_PickableEffectsComponent_C_DestroyLootBeamEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.DestroyNiagaraComponent
// 0x0001 (0x0001 - 0x0000)
struct BP_PickableEffectsComponent_C_DestroyNiagaraComponent final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_DestroyNiagaraComponent) == 0x000001, "Wrong alignment on BP_PickableEffectsComponent_C_DestroyNiagaraComponent");
static_assert(sizeof(BP_PickableEffectsComponent_C_DestroyNiagaraComponent) == 0x000001, "Wrong size on BP_PickableEffectsComponent_C_DestroyNiagaraComponent");
static_assert(offsetof(BP_PickableEffectsComponent_C_DestroyNiagaraComponent, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_PickableEffectsComponent_C_DestroyNiagaraComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.DestroySFX
// 0x0008 (0x0008 - 0x0000)
struct BP_PickableEffectsComponent_C_DestroySFX final
{
public:
	int32                                         CallFunc_ExecuteAction_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_DestroySFX) == 0x000004, "Wrong alignment on BP_PickableEffectsComponent_C_DestroySFX");
static_assert(sizeof(BP_PickableEffectsComponent_C_DestroySFX) == 0x000008, "Wrong size on BP_PickableEffectsComponent_C_DestroySFX");
static_assert(offsetof(BP_PickableEffectsComponent_C_DestroySFX, CallFunc_ExecuteAction_ReturnValue) == 0x000000, "Member 'BP_PickableEffectsComponent_C_DestroySFX::CallFunc_ExecuteAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_DestroySFX, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_PickableEffectsComponent_C_DestroySFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.ExecuteUbergraph_BP_PickableEffectsComponent
// 0x0078 (0x0078 - 0x0000)
struct BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_693B[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Location_2;                           // 0x0008(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_693C[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Location_1;                           // 0x0028(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNiagaraCreated_ReturnValue;             // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLootBeamCreated_ReturnValue;            // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSFXCreated_ReturnValue;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNiagaraCreated_ReturnValue_1;           // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLootBeamCreated_ReturnValue_1;          // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_5;          // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSFXCreated_ReturnValue_1;               // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_693D[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Location;                             // 0x0060(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent) == 0x000008, "Wrong alignment on BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent");
static_assert(sizeof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent) == 0x000078, "Wrong size on BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, EntryPoint) == 0x000000, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, K2Node_Event_Location_2) == 0x000008, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::K2Node_Event_Location_2' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, K2Node_Event_Location_1) == 0x000028, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::K2Node_Event_Location_1' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000040, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_Not_PreBool_ReturnValue_1) == 0x000041, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000042, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_IsNiagaraCreated_ReturnValue) == 0x000043, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_IsNiagaraCreated_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_Not_PreBool_ReturnValue_2) == 0x000044, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_Not_PreBool_ReturnValue_3) == 0x000045, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_IsLootBeamCreated_ReturnValue) == 0x000046, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_IsLootBeamCreated_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_BooleanAND_ReturnValue) == 0x000047, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_Not_PreBool_ReturnValue_4) == 0x000048, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_BooleanAND_ReturnValue_1) == 0x000049, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_IsSFXCreated_ReturnValue) == 0x00004A, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_IsSFXCreated_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_Not_PreBool_ReturnValue_5) == 0x00004B, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_BooleanAND_ReturnValue_2) == 0x00004C, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x00004D, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_IsNiagaraCreated_ReturnValue_1) == 0x00004E, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_IsNiagaraCreated_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_Not_PreBool_ReturnValue_6) == 0x00004F, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_BooleanAND_ReturnValue_3) == 0x000050, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x000051, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_Not_PreBool_ReturnValue_7) == 0x000052, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_IsLootBeamCreated_ReturnValue_1) == 0x000053, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_IsLootBeamCreated_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_BooleanAND_ReturnValue_4) == 0x000054, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_IsDedicatedServer_ReturnValue_5) == 0x000055, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_IsDedicatedServer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_Not_PreBool_ReturnValue_8) == 0x000056, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_IsSFXCreated_ReturnValue_1) == 0x000057, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_IsSFXCreated_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, CallFunc_BooleanAND_ReturnValue_5) == 0x000058, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent, K2Node_Event_Location) == 0x000060, "Member 'BP_PickableEffectsComponent_C_ExecuteUbergraph_BP_PickableEffectsComponent::K2Node_Event_Location' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.GetNiagaraSystemForItemType
// 0x0030 (0x0030 - 0x0000)
struct BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType final
{
public:
	struct FGameplayTag                           ItemType;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Param_NiagaraSystem;                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPickableEffectsStruct                 CallFunc_Map_Find_Value;                           // 0x0010(0x0018)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType) == 0x000008, "Wrong alignment on BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType");
static_assert(sizeof(BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType) == 0x000030, "Wrong size on BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType, ItemType) == 0x000000, "Member 'BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType::ItemType' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType, Param_NiagaraSystem) == 0x000008, "Member 'BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType::Param_NiagaraSystem' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType, CallFunc_Map_Find_Value) == 0x000010, "Member 'BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType, CallFunc_Map_Find_ReturnValue) == 0x000028, "Member 'BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'BP_PickableEffectsComponent_C_GetNiagaraSystemForItemType::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.GetPickableScaleForRarity
// 0x0040 (0x0040 - 0x0000)
struct BP_PickableEffectsComponent_C_GetPickableScaleForRarity final
{
public:
	EGzItemRarity                                 Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_693E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Scale;                                             // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Map_Find_Value;                           // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_GetPickableScaleForRarity) == 0x000008, "Wrong alignment on BP_PickableEffectsComponent_C_GetPickableScaleForRarity");
static_assert(sizeof(BP_PickableEffectsComponent_C_GetPickableScaleForRarity) == 0x000040, "Wrong size on BP_PickableEffectsComponent_C_GetPickableScaleForRarity");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetPickableScaleForRarity, Rarity) == 0x000000, "Member 'BP_PickableEffectsComponent_C_GetPickableScaleForRarity::Rarity' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetPickableScaleForRarity, Scale) == 0x000008, "Member 'BP_PickableEffectsComponent_C_GetPickableScaleForRarity::Scale' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetPickableScaleForRarity, CallFunc_Map_Find_Value) == 0x000020, "Member 'BP_PickableEffectsComponent_C_GetPickableScaleForRarity::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetPickableScaleForRarity, CallFunc_Map_Find_ReturnValue) == 0x000038, "Member 'BP_PickableEffectsComponent_C_GetPickableScaleForRarity::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.PlaySFX
// 0x0060 (0x0060 - 0x0000)
struct BP_PickableEffectsComponent_C_PlaySFX final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPickableBase*                        K2Node_DynamicCast_AsGz_Pickable_Base;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_693F[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzItemData*                            CallFunc_GetItemData_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostOnActor_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6940[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          CallFunc_GetSFXForItemType_AudioEvent;             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSFXForItemType_bSuccess;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_PlaySFX) == 0x000008, "Wrong alignment on BP_PickableEffectsComponent_C_PlaySFX");
static_assert(sizeof(BP_PickableEffectsComponent_C_PlaySFX) == 0x000060, "Wrong size on BP_PickableEffectsComponent_C_PlaySFX");
static_assert(offsetof(BP_PickableEffectsComponent_C_PlaySFX, Location) == 0x000000, "Member 'BP_PickableEffectsComponent_C_PlaySFX::Location' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_PlaySFX, Temp_delegate_Variable) == 0x000018, "Member 'BP_PickableEffectsComponent_C_PlaySFX::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_PlaySFX, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_PickableEffectsComponent_C_PlaySFX::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_PlaySFX, K2Node_DynamicCast_AsGz_Pickable_Base) == 0x000030, "Member 'BP_PickableEffectsComponent_C_PlaySFX::K2Node_DynamicCast_AsGz_Pickable_Base' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_PlaySFX, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_PickableEffectsComponent_C_PlaySFX::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_PlaySFX, CallFunc_GetItemData_ReturnValue) == 0x000040, "Member 'BP_PickableEffectsComponent_C_PlaySFX::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_PlaySFX, CallFunc_PostOnActor_ReturnValue) == 0x000048, "Member 'BP_PickableEffectsComponent_C_PlaySFX::CallFunc_PostOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_PlaySFX, CallFunc_GetSFXForItemType_AudioEvent) == 0x000050, "Member 'BP_PickableEffectsComponent_C_PlaySFX::CallFunc_GetSFXForItemType_AudioEvent' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_PlaySFX, CallFunc_GetSFXForItemType_bSuccess) == 0x000058, "Member 'BP_PickableEffectsComponent_C_PlaySFX::CallFunc_GetSFXForItemType_bSuccess' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.GetBeamMeshClassForItemType
// 0x0030 (0x0030 - 0x0000)
struct BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType final
{
public:
	struct FGameplayTag                           ItemType;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BeamMeshClass;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPickableEffectsStruct                 CallFunc_Map_Find_Value;                           // 0x0010(0x0018)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType) == 0x000008, "Wrong alignment on BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType");
static_assert(sizeof(BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType) == 0x000030, "Wrong size on BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType, ItemType) == 0x000000, "Member 'BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType::ItemType' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType, BeamMeshClass) == 0x000008, "Member 'BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType::BeamMeshClass' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType, CallFunc_Map_Find_Value) == 0x000010, "Member 'BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType, CallFunc_Map_Find_ReturnValue) == 0x000028, "Member 'BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType, CallFunc_IsValidClass_ReturnValue) == 0x000029, "Member 'BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'BP_PickableEffectsComponent_C_GetBeamMeshClassForItemType::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.GetSFXForItemType
// 0x0038 (0x0038 - 0x0000)
struct BP_PickableEffectsComponent_C_GetSFXForItemType final
{
public:
	struct FGameplayTag                           ItemType;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AudioEvent;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6941[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPickableEffectsStruct                 CallFunc_Map_Find_Value;                           // 0x0018(0x0018)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_GetSFXForItemType) == 0x000008, "Wrong alignment on BP_PickableEffectsComponent_C_GetSFXForItemType");
static_assert(sizeof(BP_PickableEffectsComponent_C_GetSFXForItemType) == 0x000038, "Wrong size on BP_PickableEffectsComponent_C_GetSFXForItemType");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetSFXForItemType, ItemType) == 0x000000, "Member 'BP_PickableEffectsComponent_C_GetSFXForItemType::ItemType' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetSFXForItemType, AudioEvent) == 0x000008, "Member 'BP_PickableEffectsComponent_C_GetSFXForItemType::AudioEvent' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetSFXForItemType, bSuccess) == 0x000010, "Member 'BP_PickableEffectsComponent_C_GetSFXForItemType::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetSFXForItemType, CallFunc_Map_Find_Value) == 0x000018, "Member 'BP_PickableEffectsComponent_C_GetSFXForItemType::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetSFXForItemType, CallFunc_Map_Find_ReturnValue) == 0x000030, "Member 'BP_PickableEffectsComponent_C_GetSFXForItemType::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetSFXForItemType, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_PickableEffectsComponent_C_GetSFXForItemType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_GetSFXForItemType, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'BP_PickableEffectsComponent_C_GetSFXForItemType::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.IsLootBeamCreated
// 0x0002 (0x0002 - 0x0000)
struct BP_PickableEffectsComponent_C_IsLootBeamCreated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_IsLootBeamCreated) == 0x000001, "Wrong alignment on BP_PickableEffectsComponent_C_IsLootBeamCreated");
static_assert(sizeof(BP_PickableEffectsComponent_C_IsLootBeamCreated) == 0x000002, "Wrong size on BP_PickableEffectsComponent_C_IsLootBeamCreated");
static_assert(offsetof(BP_PickableEffectsComponent_C_IsLootBeamCreated, ReturnValue) == 0x000000, "Member 'BP_PickableEffectsComponent_C_IsLootBeamCreated::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_IsLootBeamCreated, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_PickableEffectsComponent_C_IsLootBeamCreated::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.IsNiagaraCreated
// 0x0002 (0x0002 - 0x0000)
struct BP_PickableEffectsComponent_C_IsNiagaraCreated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_IsNiagaraCreated) == 0x000001, "Wrong alignment on BP_PickableEffectsComponent_C_IsNiagaraCreated");
static_assert(sizeof(BP_PickableEffectsComponent_C_IsNiagaraCreated) == 0x000002, "Wrong size on BP_PickableEffectsComponent_C_IsNiagaraCreated");
static_assert(offsetof(BP_PickableEffectsComponent_C_IsNiagaraCreated, ReturnValue) == 0x000000, "Member 'BP_PickableEffectsComponent_C_IsNiagaraCreated::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_IsNiagaraCreated, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_PickableEffectsComponent_C_IsNiagaraCreated::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PickableEffectsComponent.BP_PickableEffectsComponent_C.IsSFXCreated
// 0x0002 (0x0002 - 0x0000)
struct BP_PickableEffectsComponent_C_IsSFXCreated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableEffectsComponent_C_IsSFXCreated) == 0x000001, "Wrong alignment on BP_PickableEffectsComponent_C_IsSFXCreated");
static_assert(sizeof(BP_PickableEffectsComponent_C_IsSFXCreated) == 0x000002, "Wrong size on BP_PickableEffectsComponent_C_IsSFXCreated");
static_assert(offsetof(BP_PickableEffectsComponent_C_IsSFXCreated, ReturnValue) == 0x000000, "Member 'BP_PickableEffectsComponent_C_IsSFXCreated::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableEffectsComponent_C_IsSFXCreated, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_PickableEffectsComponent_C_IsSFXCreated::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

