#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PickableSpawner

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PickableSpawner.BP_PickableSpawner_C.SpawnItems
// 0x0210 (0x0210 - 0x0000)
struct BP_PickableSpawner_C_SpawnItems final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67EE[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzInventoryItemContent                CallFunc_Array_Get_Item;                           // 0x0010(0x0048)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67EF[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67F0[0x8];                                     // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x00D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGzPickableSpawnInfo                   K2Node_MakeStruct_GzPickableSpawnInfo;             // 0x0130(0x00D0)()
	class AGzPickableBase*                        CallFunc_CreatePickableOld_ReturnValue;            // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableSpawner_C_SpawnItems) == 0x000010, "Wrong alignment on BP_PickableSpawner_C_SpawnItems");
static_assert(sizeof(BP_PickableSpawner_C_SpawnItems) == 0x000210, "Wrong size on BP_PickableSpawner_C_SpawnItems");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_PickableSpawner_C_SpawnItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_PickableSpawner_C_SpawnItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_PickableSpawner_C_SpawnItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_PickableSpawner_C_SpawnItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_PickableSpawner_C_SpawnItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BP_PickableSpawner_C_SpawnItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, CallFunc_Greater_IntInt_ReturnValue) == 0x00005D, "Member 'BP_PickableSpawner_C_SpawnItems::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_PickableSpawner_C_SpawnItems::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, CallFunc_GetActorForwardVector_ReturnValue) == 0x000078, "Member 'BP_PickableSpawner_C_SpawnItems::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000090, "Member 'BP_PickableSpawner_C_SpawnItems::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000098, "Member 'BP_PickableSpawner_C_SpawnItems::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'BP_PickableSpawner_C_SpawnItems::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x0000D0, "Member 'BP_PickableSpawner_C_SpawnItems::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, K2Node_MakeStruct_GzPickableSpawnInfo) == 0x000130, "Member 'BP_PickableSpawner_C_SpawnItems::K2Node_MakeStruct_GzPickableSpawnInfo' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_SpawnItems, CallFunc_CreatePickableOld_ReturnValue) == 0x000200, "Member 'BP_PickableSpawner_C_SpawnItems::CallFunc_CreatePickableOld_ReturnValue' has a wrong offset!");

// Function BP_PickableSpawner.BP_PickableSpawner_C.OnPickableSpawned__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_PickableSpawner_C_OnPickableSpawned__DelegateSignature final
{
public:
	class UObject*                                Spawned;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableSpawner_C_OnPickableSpawned__DelegateSignature) == 0x000008, "Wrong alignment on BP_PickableSpawner_C_OnPickableSpawned__DelegateSignature");
static_assert(sizeof(BP_PickableSpawner_C_OnPickableSpawned__DelegateSignature) == 0x000008, "Wrong size on BP_PickableSpawner_C_OnPickableSpawned__DelegateSignature");
static_assert(offsetof(BP_PickableSpawner_C_OnPickableSpawned__DelegateSignature, Spawned) == 0x000000, "Member 'BP_PickableSpawner_C_OnPickableSpawned__DelegateSignature::Spawned' has a wrong offset!");

// Function BP_PickableSpawner.BP_PickableSpawner_C.ExecuteUbergraph_BP_PickableSpawner
// 0x0008 (0x0008 - 0x0000)
struct BP_PickableSpawner_C_ExecuteUbergraph_BP_PickableSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickableSpawner_C_ExecuteUbergraph_BP_PickableSpawner) == 0x000004, "Wrong alignment on BP_PickableSpawner_C_ExecuteUbergraph_BP_PickableSpawner");
static_assert(sizeof(BP_PickableSpawner_C_ExecuteUbergraph_BP_PickableSpawner) == 0x000008, "Wrong size on BP_PickableSpawner_C_ExecuteUbergraph_BP_PickableSpawner");
static_assert(offsetof(BP_PickableSpawner_C_ExecuteUbergraph_BP_PickableSpawner, EntryPoint) == 0x000000, "Member 'BP_PickableSpawner_C_ExecuteUbergraph_BP_PickableSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_ExecuteUbergraph_BP_PickableSpawner, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_PickableSpawner_C_ExecuteUbergraph_BP_PickableSpawner::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickableSpawner_C_ExecuteUbergraph_BP_PickableSpawner, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'BP_PickableSpawner_C_ExecuteUbergraph_BP_PickableSpawner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

