#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Phosphorous_Dart_Phosporus_Projectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "G01_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Phosphorous_Dart_Phosporus_Projectile.BP_Phosphorous_Dart_Phosporus_Projectile_C
// 0x0138 (0x0480 - 0x0348)
class ABP_Phosphorous_Dart_Phosporus_Projectile_C final : public AGzProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzAbilitySystemComponent*              ASC;                                               // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<ECollisionChannel>                     VehicleOrPawn;                                     // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AGzMultiPartCharacter*                  Owning_Character;                                  // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         GroundDecalLifeSpan;                               // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_61DF[0x4];                                     // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Launch_Position;                                   // 0x0378(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x0390(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         In_Sphere_Radius;                                  // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                GroundDecalScale;                                  // 0x03B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ABP_Phosphorous_Dart_Projectile_C*      ExplosiveDart;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UGameplayAbility*                       Gameplay_Ability;                                  // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AGzPlayerState*                         PlayerState;                                       // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraEffect;                                     // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bWithDebug;                                        // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61E0[0x7];                                     // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 HitActor;                                          // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UNiagaraComponent*                      GroundVFX;                                         // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OwnerTeamID;                                       // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowFriendlyFire;                                 // 0x0414(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61E1[0x3];                                     // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UAbilitySystemComponent*, struct FActiveGameplayEffectHandle> ActiveEffectHandles;                               // 0x0418(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0468(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ApplyDoTEffect(class UAbilitySystemComponent* TargetASC, struct FActiveGameplayEffectHandle* EffectHandle);
	void ApplyGameplayEffect(class AGzBaseCharacter* Self2);
	void ApplyGroundGameplayEffect(class AGzBaseCharacter* Self2, const struct FHitResult& HitResult, class AActor* Param_HitActor, class UPrimitiveComponent* Param_HitComponent);
	void BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* Param_HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void DrawDebugSpheres(bool Param_bWithDebug);
	void EnableCollision();
	void ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile(int32 EntryPoint);
	bool HitActorIsPawnOrVehicle();
	void Initialize();
	bool IsPlayerInteractable(const struct FHitResult& Hit);
	struct FTransform MakeSpawnTransform(const struct FHitResult& Hit);
	void OnPawnBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnPawnEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void RemoveDoTEffect(class AActor* TargetActor);
	void RemoveRemainingEffects();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Phosphorous_Dart_Phosporus_Projectile_C">();
	}
	static class ABP_Phosphorous_Dart_Phosporus_Projectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Phosphorous_Dart_Phosporus_Projectile_C>();
	}
};
static_assert(alignof(ABP_Phosphorous_Dart_Phosporus_Projectile_C) == 0x000008, "Wrong alignment on ABP_Phosphorous_Dart_Phosporus_Projectile_C");
static_assert(sizeof(ABP_Phosphorous_Dart_Phosporus_Projectile_C) == 0x000480, "Wrong size on ABP_Phosphorous_Dart_Phosporus_Projectile_C");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, UberGraphFrame) == 0x000348, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, ASC) == 0x000350, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::ASC' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, VehicleOrPawn) == 0x000358, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::VehicleOrPawn' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, Owning_Character) == 0x000368, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::Owning_Character' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, GroundDecalLifeSpan) == 0x000370, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::GroundDecalLifeSpan' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, Launch_Position) == 0x000378, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::Launch_Position' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, Direction) == 0x000390, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::Direction' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, Speed) == 0x0003A8, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::Speed' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, In_Sphere_Radius) == 0x0003AC, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::In_Sphere_Radius' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, GroundDecalScale) == 0x0003B0, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::GroundDecalScale' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, ExplosiveDart) == 0x0003C8, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::ExplosiveDart' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, Actor) == 0x0003D0, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::Actor' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, Gameplay_Ability) == 0x0003D8, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::Gameplay_Ability' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, PlayerState) == 0x0003E0, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::PlayerState' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, NiagaraEffect) == 0x0003E8, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::NiagaraEffect' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, bWithDebug) == 0x0003F0, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::bWithDebug' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, HitActor) == 0x0003F8, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::HitActor' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, HitComponent) == 0x000400, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::HitComponent' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, GroundVFX) == 0x000408, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::GroundVFX' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, OwnerTeamID) == 0x000410, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::OwnerTeamID' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, AllowFriendlyFire) == 0x000414, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::AllowFriendlyFire' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, ActiveEffectHandles) == 0x000418, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::ActiveEffectHandles' has a wrong offset!");
static_assert(offsetof(ABP_Phosphorous_Dart_Phosporus_Projectile_C, EffectContext) == 0x000468, "Member 'ABP_Phosphorous_Dart_Phosporus_Projectile_C::EffectContext' has a wrong offset!");

}

