#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PartyMemberDisplaySlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PartyMemberDisplaySlot.BP_PartyMemberDisplaySlot_C
// 0x0018 (0x02F0 - 0x02D8)
class ABP_PartyMemberDisplaySlot_C final : public AGzPartyMemberDisplaySlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABPC_L_Pedestal_Lobby_Platform_01_C*    LPodium;                                           // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABPC_L_Pedestal_Lobby_Platform_01_C*    RPodium;                                           // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PartyMemberDisplaySlot(int32 EntryPoint);
	void OnCharacterCreatedBP();
	void OnCharacterRemovedBP();
	void ReceiveBeginPlay();
	void UpdateDisplaySlotInCharacter();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PartyMemberDisplaySlot_C">();
	}
	static class ABP_PartyMemberDisplaySlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PartyMemberDisplaySlot_C>();
	}
};
static_assert(alignof(ABP_PartyMemberDisplaySlot_C) == 0x000008, "Wrong alignment on ABP_PartyMemberDisplaySlot_C");
static_assert(sizeof(ABP_PartyMemberDisplaySlot_C) == 0x0002F0, "Wrong size on ABP_PartyMemberDisplaySlot_C");
static_assert(offsetof(ABP_PartyMemberDisplaySlot_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_PartyMemberDisplaySlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PartyMemberDisplaySlot_C, LPodium) == 0x0002E0, "Member 'ABP_PartyMemberDisplaySlot_C::LPodium' has a wrong offset!");
static_assert(offsetof(ABP_PartyMemberDisplaySlot_C, RPodium) == 0x0002E8, "Member 'ABP_PartyMemberDisplaySlot_C::RPodium' has a wrong offset!");

}

