#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PathfinderPathPreview

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PathfinderPathPreview.BP_PathfinderPathPreview_C.ExecuteUbergraph_BP_PathfinderPathPreview
// 0x0010 (0x0010 - 0x0000)
struct BP_PathfinderPathPreview_C_ExecuteUbergraph_BP_PathfinderPathPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdatePathMaterial_DeltaSeconds_ImplicitCast; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PathfinderPathPreview_C_ExecuteUbergraph_BP_PathfinderPathPreview) == 0x000008, "Wrong alignment on BP_PathfinderPathPreview_C_ExecuteUbergraph_BP_PathfinderPathPreview");
static_assert(sizeof(BP_PathfinderPathPreview_C_ExecuteUbergraph_BP_PathfinderPathPreview) == 0x000010, "Wrong size on BP_PathfinderPathPreview_C_ExecuteUbergraph_BP_PathfinderPathPreview");
static_assert(offsetof(BP_PathfinderPathPreview_C_ExecuteUbergraph_BP_PathfinderPathPreview, EntryPoint) == 0x000000, "Member 'BP_PathfinderPathPreview_C_ExecuteUbergraph_BP_PathfinderPathPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_ExecuteUbergraph_BP_PathfinderPathPreview, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_PathfinderPathPreview_C_ExecuteUbergraph_BP_PathfinderPathPreview::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_ExecuteUbergraph_BP_PathfinderPathPreview, CallFunc_UpdatePathMaterial_DeltaSeconds_ImplicitCast) == 0x000008, "Member 'BP_PathfinderPathPreview_C_ExecuteUbergraph_BP_PathfinderPathPreview::CallFunc_UpdatePathMaterial_DeltaSeconds_ImplicitCast' has a wrong offset!");

// Function BP_PathfinderPathPreview.BP_PathfinderPathPreview_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PathfinderPathPreview_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PathfinderPathPreview_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PathfinderPathPreview_C_ReceiveTick");
static_assert(sizeof(BP_PathfinderPathPreview_C_ReceiveTick) == 0x000004, "Wrong size on BP_PathfinderPathPreview_C_ReceiveTick");
static_assert(offsetof(BP_PathfinderPathPreview_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PathfinderPathPreview_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PathfinderPathPreview.BP_PathfinderPathPreview_C.UpdatePathMaterial
// 0x0090 (0x0090 - 0x0000)
struct BP_PathfinderPathPreview_C_UpdatePathMaterial final
{
public:
	double                                        DeltaSeconds;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AB3[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AB4[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AB5[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AB6[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PathfinderPathPreview_C_UpdatePathMaterial) == 0x000008, "Wrong alignment on BP_PathfinderPathPreview_C_UpdatePathMaterial");
static_assert(sizeof(BP_PathfinderPathPreview_C_UpdatePathMaterial) == 0x000090, "Wrong size on BP_PathfinderPathPreview_C_UpdatePathMaterial");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, DeltaSeconds) == 0x000000, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, CallFunc_GetSplineLength_ReturnValue) == 0x000008, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, CallFunc_MapRangeClamped_ReturnValue) == 0x000010, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, CallFunc_GetMaterial_ReturnValue) == 0x000018, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000020, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000048, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000060, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000064, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000078, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000088, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PathfinderPathPreview_C_UpdatePathMaterial, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x00008C, "Member 'BP_PathfinderPathPreview_C_UpdatePathMaterial::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");

}

