#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PickableEffectsComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PickableEffectsStruct_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PickableEffectsComponent.BP_PickableEffectsComponent_C
// 0x00C8 (0x0170 - 0x00A8)
class UBP_PickableEffectsComponent_C final : public UGzPickableEffectsComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<EGzItemRarity, struct FVector>           ScaleMap;                                          // 0x00B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_BeamMeshVFX_Template_C*             LootBeamMesh;                                      // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, struct FPickableEffectsStruct> EffectsMap;                                        // 0x0108(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SFXId;                                             // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6937[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          SFXEvent;                                          // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CreateLootBeam_BP(const struct FVector& Location);
	void CreateLootBeamEffect(const struct FVector& Location);
	void CreateNiagara_BP(const struct FVector& Location);
	void CreateNiagaraSystem(const struct FVector& Location);
	void CreateSFX_BP(const struct FVector& Location);
	void DestroyLootBeam_BP();
	void DestroyLootBeamEffect();
	void DestroyNiagara_BP();
	void DestroyNiagaraComponent();
	void DestroySFX();
	void DestroySFX_BP();
	void ExecuteUbergraph_BP_PickableEffectsComponent(int32 EntryPoint);
	void GetNiagaraSystemForItemType(const struct FGameplayTag& ItemType, class UNiagaraSystem** Param_NiagaraSystem);
	void GetPickableScaleForRarity(EGzItemRarity Rarity, struct FVector* Scale);
	void PlaySFX(const struct FVector& Location);

	void GetBeamMeshClassForItemType(const struct FGameplayTag& ItemType, class UClass** BeamMeshClass) const;
	void GetSFXForItemType(const struct FGameplayTag& ItemType, class UAkAudioEvent** AudioEvent, bool* bSuccess) const;
	bool IsLootBeamCreated() const;
	bool IsNiagaraCreated() const;
	bool IsSFXCreated() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PickableEffectsComponent_C">();
	}
	static class UBP_PickableEffectsComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PickableEffectsComponent_C>();
	}
};
static_assert(alignof(UBP_PickableEffectsComponent_C) == 0x000008, "Wrong alignment on UBP_PickableEffectsComponent_C");
static_assert(sizeof(UBP_PickableEffectsComponent_C) == 0x000170, "Wrong size on UBP_PickableEffectsComponent_C");
static_assert(offsetof(UBP_PickableEffectsComponent_C, UberGraphFrame) == 0x0000A8, "Member 'UBP_PickableEffectsComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PickableEffectsComponent_C, ScaleMap) == 0x0000B0, "Member 'UBP_PickableEffectsComponent_C::ScaleMap' has a wrong offset!");
static_assert(offsetof(UBP_PickableEffectsComponent_C, LootBeamMesh) == 0x000100, "Member 'UBP_PickableEffectsComponent_C::LootBeamMesh' has a wrong offset!");
static_assert(offsetof(UBP_PickableEffectsComponent_C, EffectsMap) == 0x000108, "Member 'UBP_PickableEffectsComponent_C::EffectsMap' has a wrong offset!");
static_assert(offsetof(UBP_PickableEffectsComponent_C, SFXId) == 0x000158, "Member 'UBP_PickableEffectsComponent_C::SFXId' has a wrong offset!");
static_assert(offsetof(UBP_PickableEffectsComponent_C, SFXEvent) == 0x000160, "Member 'UBP_PickableEffectsComponent_C::SFXEvent' has a wrong offset!");
static_assert(offsetof(UBP_PickableEffectsComponent_C, NiagaraSystem) == 0x000168, "Member 'UBP_PickableEffectsComponent_C::NiagaraSystem' has a wrong offset!");

}

