#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PropagationComponent_Overlap_Phosphor

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BP_PropagationComponent_Overlap_Phosphor.BP_PropagationComponent_Overlap_Phosphor_C.RemoveRemainingEffects
// 0x0040 (0x0040 - 0x0000)
struct BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61CE[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAbilitySystemComponent*>        CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61CF[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D0[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_Map_Find_Value;                           // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects) == 0x000008, "Wrong alignment on BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects");
static_assert(sizeof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects) == 0x000040, "Wrong size on BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects, CallFunc_Map_Keys_Keys) == 0x000010, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects, CallFunc_Map_Find_Value) == 0x000034, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects, CallFunc_Map_Find_ReturnValue) == 0x00003C, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x00003D, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_RemoveRemainingEffects::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");

// Function BP_PropagationComponent_Overlap_Phosphor.BP_PropagationComponent_Overlap_Phosphor_C.RemoveDoTEffect
// 0x0018 (0x0018 - 0x0000)
struct BP_PropagationComponent_Overlap_Phosphor_C_RemoveDoTEffect final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveDoTEffect) == 0x000008, "Wrong alignment on BP_PropagationComponent_Overlap_Phosphor_C_RemoveDoTEffect");
static_assert(sizeof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveDoTEffect) == 0x000018, "Wrong size on BP_PropagationComponent_Overlap_Phosphor_C_RemoveDoTEffect");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveDoTEffect, TargetActor) == 0x000000, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_RemoveDoTEffect::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveDoTEffect, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_RemoveDoTEffect::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_RemoveDoTEffect, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_RemoveDoTEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PropagationComponent_Overlap_Phosphor.BP_PropagationComponent_Overlap_Phosphor_C.ApplyDoTEffect
// 0x0180 (0x0180 - 0x0000)
struct BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect final
{
public:
	class UAbilitySystemComponent*                TargetASC;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            EffectHandle;                                      // 0x0008(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0010(0x0018)(Edit, BlueprintVisible)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0030(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Phosphorous_Dart_Projectile_C*      K2Node_DynamicCast_AsBP_Phosphorous_Dart_Projectile; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D1[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetPersistentPlayerState_ReturnValue;     // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingDamageSpec_ReturnValue;       // 0x0150(0x0010)()
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContextWithInstigator_ReturnValue; // 0x0160(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0178(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect) == 0x000008, "Wrong alignment on BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect");
static_assert(sizeof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect) == 0x000180, "Wrong size on BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect, TargetASC) == 0x000000, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect::TargetASC' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect, EffectHandle) == 0x000008, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect::EffectHandle' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect, EffectContext) == 0x000010, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect::EffectContext' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect, CallFunc_MakeHitResult_ReturnValue) == 0x000030, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect, CallFunc_GetOwner_ReturnValue_1) == 0x000128, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect, CallFunc_GetOwner_ReturnValue_2) == 0x000130, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect, K2Node_DynamicCast_AsBP_Phosphorous_Dart_Projectile) == 0x000138, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect::K2Node_DynamicCast_AsBP_Phosphorous_Dart_Projectile' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect, CallFunc_GetPersistentPlayerState_ReturnValue) == 0x000148, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect::CallFunc_GetPersistentPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect, CallFunc_MakeOutgoingDamageSpec_ReturnValue) == 0x000150, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect::CallFunc_MakeOutgoingDamageSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect, CallFunc_MakeEffectContextWithInstigator_ReturnValue) == 0x000160, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect::CallFunc_MakeEffectContextWithInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000178, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ApplyDoTEffect::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");

// Function BP_PropagationComponent_Overlap_Phosphor.BP_PropagationComponent_Overlap_Phosphor_C.OnPawnEndOverlap
// 0x0038 (0x0038 - 0x0000)
struct BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D2[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D3[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamId_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap) == 0x000008, "Wrong alignment on BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap");
static_assert(sizeof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap) == 0x000038, "Wrong size on BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap, OverlappedComponent) == 0x000000, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap, OtherActor) == 0x000008, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap, OtherComp) == 0x000010, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap, OtherBodyIndex) == 0x000018, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap, K2Node_DynamicCast_AsGz_Character) == 0x000020, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap, CallFunc_GetTeamId_ReturnValue) == 0x00002C, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap::CallFunc_GetTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000030, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap, CallFunc_BooleanOR_ReturnValue) == 0x000031, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnEndOverlap::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_PropagationComponent_Overlap_Phosphor.BP_PropagationComponent_Overlap_Phosphor_C.OnPawnBeginOverlap
// 0x0140 (0x0140 - 0x0000)
struct BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D4[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D5[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetTeamAttitude_ReturnValue;              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D6[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyDoTEffect_EffectHandle;              // 0x0134(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap) == 0x000008, "Wrong alignment on BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap");
static_assert(sizeof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap) == 0x000140, "Wrong size on BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap, OverlappedComponent) == 0x000000, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap, OtherActor) == 0x000008, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap, OtherComp) == 0x000010, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap, bFromSweep) == 0x00001C, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap, SweepResult) == 0x000020, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap::SweepResult' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap, K2Node_DynamicCast_AsGz_Character) == 0x000118, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000128, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap, CallFunc_GetTeamAttitude_ReturnValue) == 0x000130, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap::CallFunc_GetTeamAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap, CallFunc_ApplyDoTEffect_EffectHandle) == 0x000134, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap::CallFunc_ApplyDoTEffect_EffectHandle' has a wrong offset!");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap, K2Node_SwitchEnum_CmpSuccess) == 0x00013C, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_OnPawnBeginOverlap::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_PropagationComponent_Overlap_Phosphor.BP_PropagationComponent_Overlap_Phosphor_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PropagationComponent_Overlap_Phosphor_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PropagationComponent_Overlap_Phosphor_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PropagationComponent_Overlap_Phosphor_C_ReceiveEndPlay");
static_assert(sizeof(BP_PropagationComponent_Overlap_Phosphor_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PropagationComponent_Overlap_Phosphor_C_ReceiveEndPlay");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PropagationComponent_Overlap_Phosphor.BP_PropagationComponent_Overlap_Phosphor_C.ExecuteUbergraph_BP_PropagationComponent_Overlap_Phosphor
// 0x0040 (0x0040 - 0x0000)
struct BP_PropagationComponent_Overlap_Phosphor_C_ExecuteUbergraph_BP_PropagationComponent_Overlap_Phosphor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D7[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D8[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PropagationComponent_Overlap_Phosphor_C_ExecuteUbergraph_BP_PropagationComponent_Overlap_Phosphor) == 0x000008, "Wrong alignment on BP_PropagationComponent_Overlap_Phosphor_C_ExecuteUbergraph_BP_PropagationComponent_Overlap_Phosphor");
static_assert(sizeof(BP_PropagationComponent_Overlap_Phosphor_C_ExecuteUbergraph_BP_PropagationComponent_Overlap_Phosphor) == 0x000040, "Wrong size on BP_PropagationComponent_Overlap_Phosphor_C_ExecuteUbergraph_BP_PropagationComponent_Overlap_Phosphor");
static_assert(offsetof(BP_PropagationComponent_Overlap_Phosphor_C_ExecuteUbergraph_BP_PropagationComponent_Overlap_Phosphor, EntryPoint) == 0x000000, "Member 'BP_PropagationComponent_Overlap_Phosphor_C_ExecuteUbergraph_BP_PropagationComponent_Overlap_Phosphor::EntryPoint' has a wrong offset!");
