#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PredefinedSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function BP_PredefinedSpawner.BP_PredefinedSpawner_C.ExecuteUbergraph_BP_PredefinedSpawner
// 0x0160 (0x0160 - 0x0000)
struct BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58C0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGzPickableSpawnInfo                   K2Node_MakeStruct_GzPickableSpawnInfo;             // 0x0080(0x00D0)()
	class AGzPickableBase*                        CallFunc_CreatePickableOld_ReturnValue;            // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner) == 0x000010, "Wrong alignment on BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner");
static_assert(sizeof(BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner) == 0x000160, "Wrong size on BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner");
static_assert(offsetof(BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner, EntryPoint) == 0x000000, "Member 'BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000020, "Member 'BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner, K2Node_MakeStruct_GzPickableSpawnInfo) == 0x000080, "Member 'BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner::K2Node_MakeStruct_GzPickableSpawnInfo' has a wrong offset!");
static_assert(offsetof(BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner, CallFunc_CreatePickableOld_ReturnValue) == 0x000150, "Member 'BP_PredefinedSpawner_C_ExecuteUbergraph_BP_PredefinedSpawner::CallFunc_CreatePickableOld_ReturnValue' has a wrong offset!");

}

