#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Phosphorous_Dart_Phosporus_Projectile

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BP_Phosphorous_Dart_Phosporus_Projectile.BP_Phosphorous_Dart_Phosporus_Projectile_C.ApplyDoTEffect
// 0x0168 (0x0168 - 0x0000)
struct BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect final
{
public:
	class UAbilitySystemComponent*                TargetASC;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            EffectHandle;                                      // 0x0008(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0018(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingDamageSpec_ReturnValue;       // 0x0110(0x0010)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Phosphorous_Dart_Phosporus_Projectile_C* K2Node_DynamicCast_AsBP_Phosphorous_Dart_Phosporus_Projectile; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61E2[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetPersistentPlayerState_ReturnValue;     // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContextWithInstigator_ReturnValue; // 0x0150(0x0018)()
};
static_assert(alignof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect");
static_assert(sizeof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect) == 0x000168, "Wrong size on BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect, TargetASC) == 0x000000, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect::TargetASC' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect, EffectHandle) == 0x000008, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect::EffectHandle' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect, CallFunc_MakeHitResult_ReturnValue) == 0x000018, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect, CallFunc_MakeOutgoingDamageSpec_ReturnValue) == 0x000110, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect::CallFunc_MakeOutgoingDamageSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect, CallFunc_GetOwner_ReturnValue_1) == 0x000120, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000128, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect, CallFunc_GetOwner_ReturnValue_2) == 0x000130, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect, K2Node_DynamicCast_AsBP_Phosphorous_Dart_Phosporus_Projectile) == 0x000138, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect::K2Node_DynamicCast_AsBP_Phosphorous_Dart_Phosporus_Projectile' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect, CallFunc_GetPersistentPlayerState_ReturnValue) == 0x000148, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect::CallFunc_GetPersistentPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect, CallFunc_MakeEffectContextWithInstigator_ReturnValue) == 0x000150, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyDoTEffect::CallFunc_MakeEffectContextWithInstigator_ReturnValue' has a wrong offset!");

// Function BP_Phosphorous_Dart_Phosporus_Projectile.BP_Phosphorous_Dart_Phosporus_Projectile_C.ApplyGameplayEffect
// 0x0020 (0x0020 - 0x0000)
struct BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGameplayEffect final
{
public:
	class AGzBaseCharacter*                       Self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGameplayEffect) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGameplayEffect");
static_assert(sizeof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGameplayEffect) == 0x000020, "Wrong size on BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGameplayEffect");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGameplayEffect, Self2) == 0x000000, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGameplayEffect::Self2' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGameplayEffect, CallFunc_GetGzAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGameplayEffect::CallFunc_GetGzAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGameplayEffect, CallFunc_GetGzAbilitySystemComponent_ReturnValue_1) == 0x000010, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGameplayEffect::CallFunc_GetGzAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGameplayEffect, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000018, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGameplayEffect::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function BP_Phosphorous_Dart_Phosporus_Projectile.BP_Phosphorous_Dart_Phosporus_Projectile_C.ApplyGroundGameplayEffect
// 0x0328 (0x0328 - 0x0000)
struct BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect final
{
public:
	class AGzBaseCharacter*                       Self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0008(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 Param_HitActor;                                    // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Param_HitComponent;                                // 0x0108(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61E3[0x2];                                     // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61E4[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61E5[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue;  // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x01F0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContextWithInstigator_ReturnValue; // 0x02E8(0x0018)()
	ETeamAttitude                                 CallFunc_GetTeamAttitude_ReturnValue;              // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61E6[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingDamageSpec_ReturnValue;       // 0x0308(0x0010)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61E7[0x3];                                     // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x031C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect");
static_assert(sizeof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect) == 0x000328, "Wrong size on BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, Self2) == 0x000000, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::Self2' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, HitResult) == 0x000008, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::HitResult' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, Param_HitActor) == 0x000100, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::Param_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, Param_HitComponent) == 0x000108, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::Param_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_bBlockingHit) == 0x000110, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_bInitialOverlap) == 0x000111, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_Time) == 0x000114, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_Distance) == 0x000118, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_Location) == 0x000120, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_ImpactPoint) == 0x000138, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_Normal) == 0x000150, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_ImpactNormal) == 0x000168, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_PhysMat) == 0x000180, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_HitActor) == 0x000188, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_HitComponent) == 0x000190, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_HitBoneName) == 0x000198, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_BoneName) == 0x0001A0, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_HitItem) == 0x0001A8, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_ElementIndex) == 0x0001AC, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_FaceIndex) == 0x0001B0, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_TraceStart) == 0x0001B8, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BreakHitResult_TraceEnd) == 0x0001D0, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_GetGzAbilitySystemComponent_ReturnValue) == 0x0001E8, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_GetGzAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_MakeHitResult_ReturnValue) == 0x0001F0, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_MakeEffectContextWithInstigator_ReturnValue) == 0x0002E8, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_MakeEffectContextWithInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_GetTeamAttitude_ReturnValue) == 0x000300, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_GetTeamAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_MakeOutgoingDamageSpec_ReturnValue) == 0x000308, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_MakeOutgoingDamageSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000318, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x00031C, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ApplyGroundGameplayEffect::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");

// Function BP_Phosphorous_Dart_Phosporus_Projectile.BP_Phosphorous_Dart_Phosporus_Projectile_C.BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    Param_HitComponent;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000128, "Wrong size on BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Param_HitComponent) == 0x000000, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Param_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_BndEvt__BP_ExplosiveDart_Phosporus_Projectile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_Phosphorous_Dart_Phosporus_Projectile.BP_Phosphorous_Dart_Phosporus_Projectile_C.DrawDebugSpheres
// 0x0020 (0x0020 - 0x0000)
struct BP_Phosphorous_Dart_Phosporus_Projectile_C_DrawDebugSpheres final
{
public:
	bool                                          Param_bWithDebug;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61E8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Phosporus_Projectile_C_DrawDebugSpheres) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Phosporus_Projectile_C_DrawDebugSpheres");
static_assert(sizeof(BP_Phosphorous_Dart_Phosporus_Projectile_C_DrawDebugSpheres) == 0x000020, "Wrong size on BP_Phosphorous_Dart_Phosporus_Projectile_C_DrawDebugSpheres");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_DrawDebugSpheres, Param_bWithDebug) == 0x000000, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_DrawDebugSpheres::Param_bWithDebug' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_DrawDebugSpheres, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_DrawDebugSpheres::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_Phosphorous_Dart_Phosporus_Projectile.BP_Phosphorous_Dart_Phosporus_Projectile_C.ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile
// 0x0330 (0x0330 - 0x0000)
struct BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61E9[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61EA[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetPersistentPlayerState_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61EB[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61EC[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamId_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61ED[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character_1;               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61EE[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyDoTEffect_EffectHandle;              // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamId_ReturnValue_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamId_ReturnValue_2;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61EF[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x00B8(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61F0[0xF];                                     // 0x01B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeSpawnTransform_ReturnValue;           // 0x01C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61F1[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0280(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PropagationComponent_Overlap_Phosphor_C* CallFunc_AddComponent_ReturnValue;                 // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile) == 0x000010, "Wrong alignment on BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile");
static_assert(sizeof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile) == 0x000330, "Wrong size on BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, EntryPoint) == 0x000000, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, K2Node_Event_EndPlayReason) == 0x00000C, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_GetPersistentPlayerState_ReturnValue) == 0x000010, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_GetPersistentPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_HasAuthority_ReturnValue_1) == 0x000018, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000020, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_HasAuthority_ReturnValue_2) == 0x000029, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_GetTeamId_ReturnValue) == 0x00002C, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_GetTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, K2Node_Event_OtherActor_1) == 0x000038, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, K2Node_Event_OtherActor) == 0x000040, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, K2Node_DynamicCast_AsGz_Character) == 0x000048, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, K2Node_DynamicCast_AsGz_Character_1) == 0x000058, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::K2Node_DynamicCast_AsGz_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000068, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_ApplyDoTEffect_EffectHandle) == 0x000070, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_ApplyDoTEffect_EffectHandle' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_GetTeamId_ReturnValue_1) == 0x000078, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_GetTeamId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_GetTeamId_ReturnValue_2) == 0x00007C, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_GetTeamId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_HasAuthority_ReturnValue_3) == 0x000080, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000081, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_BooleanOR_ReturnValue) == 0x000082, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000083, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, K2Node_ComponentBoundEvent_HitComponent) == 0x000088, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, K2Node_ComponentBoundEvent_OtherActor) == 0x000090, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, K2Node_ComponentBoundEvent_OtherComp) == 0x000098, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0000A0, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, K2Node_ComponentBoundEvent_Hit) == 0x0000B8, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_BooleanOR_ReturnValue_1) == 0x0001B0, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_MakeSpawnTransform_ReturnValue) == 0x0001C0, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_MakeSpawnTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_GetDisplayName_ReturnValue) == 0x000220, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_BreakTransform_Location) == 0x000230, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_BreakTransform_Rotation) == 0x000248, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_BreakTransform_Scale) == 0x000260, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_HasAuthority_ReturnValue_4) == 0x000278, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_MakeTransform_ReturnValue) == 0x000280, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_AddComponent_ReturnValue) == 0x0002E0, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_GetDisplayName_ReturnValue_1) == 0x0002E8, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_Concat_StrStr_ReturnValue) == 0x0002F8, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000308, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000318, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000320, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_ExecuteUbergraph_BP_Phosphorous_Dart_Phosporus_Projectile::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");

// Function BP_Phosphorous_Dart_Phosporus_Projectile.BP_Phosphorous_Dart_Phosporus_Projectile_C.HitActorIsPawnOrVehicle
// 0x0003 (0x0003 - 0x0000)
struct BP_Phosphorous_Dart_Phosporus_Projectile_C_HitActorIsPawnOrVehicle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Phosporus_Projectile_C_HitActorIsPawnOrVehicle) == 0x000001, "Wrong alignment on BP_Phosphorous_Dart_Phosporus_Projectile_C_HitActorIsPawnOrVehicle");
static_assert(sizeof(BP_Phosphorous_Dart_Phosporus_Projectile_C_HitActorIsPawnOrVehicle) == 0x000003, "Wrong size on BP_Phosphorous_Dart_Phosporus_Projectile_C_HitActorIsPawnOrVehicle");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_HitActorIsPawnOrVehicle, ReturnValue) == 0x000000, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_HitActorIsPawnOrVehicle::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_HitActorIsPawnOrVehicle, CallFunc_GetCollisionObjectType_ReturnValue) == 0x000001, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_HitActorIsPawnOrVehicle::CallFunc_GetCollisionObjectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_HitActorIsPawnOrVehicle, CallFunc_Array_Contains_ReturnValue) == 0x000002, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_HitActorIsPawnOrVehicle::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_Phosphorous_Dart_Phosporus_Projectile.BP_Phosphorous_Dart_Phosporus_Projectile_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct BP_Phosphorous_Dart_Phosporus_Projectile_C_Initialize final
{
public:
	bool                                          CallFunc_HitActorIsPawnOrVehicle_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61F2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetPersistentPlayerState_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phosphorous_Dart_Phosporus_Projectile_C_Initialize) == 0x000008, "Wrong alignment on BP_Phosphorous_Dart_Phosporus_Projectile_C_Initialize");
static_assert(sizeof(BP_Phosphorous_Dart_Phosporus_Projectile_C_Initialize) == 0x000010, "Wrong size on BP_Phosphorous_Dart_Phosporus_Projectile_C_Initialize");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_Initialize, CallFunc_HitActorIsPawnOrVehicle_ReturnValue) == 0x000000, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_Initialize::CallFunc_HitActorIsPawnOrVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phosphorous_Dart_Phosporus_Projectile_C_Initialize, CallFunc_GetPersistentPlayerState_ReturnValue) == 0x000008, "Member 'BP_Phosphorous_Dart_Phosporus_Projectile_C_Initialize::CallFunc_GetPersistentPlayerState_ReturnValue' has a wrong offset!");

// Function BP_Phosphorous_Dart_Phosporus_Projectile.BP_Phosphorous_Dart_Phosporus_Projectile_C.IsPlayerInteractable
// 0x01D8 (0x01D8 - 0x0000)
struct BP_Phosphorous_Dart_Phosporus_Projectile_C_IsPlayerInteractable final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
