#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuickOrderComponent

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_QuickOrderComponent.BP_QuickOrderComponent_C.ExecuteUbergraph_BP_QuickOrderComponent
// 0x0128 (0x0128 - 0x0000)
struct BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EDD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EDE[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EDF[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EE0[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EE1[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x00D8(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x00E8(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryCallDrone_ReturnValue;                 // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EE2[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EE3[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent) == 0x000008, "Wrong alignment on BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent");
static_assert(sizeof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent) == 0x000128, "Wrong size on BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, EntryPoint) == 0x000000, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000008, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000028, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00002C, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000030, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_object_Variable) == 0x000038, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_real_Variable) == 0x000048, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_real_Variable_1) == 0x000050, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_real_Variable_0) == 0x000058, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_real_Variable_1_0) == 0x000060, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_bool_Variable) == 0x000068, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000070, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000090, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000094, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000098, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0000A0, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_object_Variable_1) == 0x0000A8, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_real_Variable_2) == 0x0000B0, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_real_Variable_2_0) == 0x0000B8, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_real_Variable_3) == 0x0000C0, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_bool_Variable_1) == 0x0000C8, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_real_Variable_3_0) == 0x0000D0, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_delegate_Variable) == 0x0000D8, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_delegate_Variable_1) == 0x0000E8, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, Temp_bool_Variable_2) == 0x0000F8, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, CallFunc_TryCallDrone_ReturnValue) == 0x0000F9, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::CallFunc_TryCallDrone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, CallFunc_GetOwner_ReturnValue) == 0x000100, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000108, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, CallFunc_PostEvent_ReturnValue) == 0x000110, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, K2Node_Select_Default) == 0x000118, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent, CallFunc_PostEvent_ReturnValue_1) == 0x000120, "Member 'BP_QuickOrderComponent_C_ExecuteUbergraph_BP_QuickOrderComponent::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");

// Function BP_QuickOrderComponent.BP_QuickOrderComponent_C.InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct BP_QuickOrderComponent_C_InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuickOrderComponent_C_InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on BP_QuickOrderComponent_C_InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(BP_QuickOrderComponent_C_InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on BP_QuickOrderComponent_C_InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(BP_QuickOrderComponent_C_InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'BP_QuickOrderComponent_C_InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'BP_QuickOrderComponent_C_InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'BP_QuickOrderComponent_C_InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'BP_QuickOrderComponent_C_InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function BP_QuickOrderComponent.BP_QuickOrderComponent_C.InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct BP_QuickOrderComponent_C_InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuickOrderComponent_C_InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on BP_QuickOrderComponent_C_InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(BP_QuickOrderComponent_C_InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on BP_QuickOrderComponent_C_InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(BP_QuickOrderComponent_C_InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'BP_QuickOrderComponent_C_InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'BP_QuickOrderComponent_C_InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'BP_QuickOrderComponent_C_InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_QuickOrderComponent_C_InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'BP_QuickOrderComponent_C_InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

}

