#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuickOrderComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QuickOrderComponent.BP_QuickOrderComponent_C
// 0x0030 (0x01A0 - 0x0170)
class UBP_QuickOrderComponent_C final : public UGzQuickOrderComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0170(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkAudioEvent*                          QuickOrderConfirmedEvent;                          // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          QuickOrderDeclinedEvent;                           // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          QuickOrderFailedEvent;                             // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnQuickOrderCalled;                                // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_QuickOrderComponent(int32 EntryPoint);
	void InpActEvt_IA_ConfirmQuickOrder_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_DeclineQuickOrder_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnQuickOrderCalled__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuickOrderComponent_C">();
	}
	static class UBP_QuickOrderComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuickOrderComponent_C>();
	}
};
static_assert(alignof(UBP_QuickOrderComponent_C) == 0x000008, "Wrong alignment on UBP_QuickOrderComponent_C");
static_assert(sizeof(UBP_QuickOrderComponent_C) == 0x0001A0, "Wrong size on UBP_QuickOrderComponent_C");
static_assert(offsetof(UBP_QuickOrderComponent_C, UberGraphFrame) == 0x000170, "Member 'UBP_QuickOrderComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_QuickOrderComponent_C, QuickOrderConfirmedEvent) == 0x000178, "Member 'UBP_QuickOrderComponent_C::QuickOrderConfirmedEvent' has a wrong offset!");
static_assert(offsetof(UBP_QuickOrderComponent_C, QuickOrderDeclinedEvent) == 0x000180, "Member 'UBP_QuickOrderComponent_C::QuickOrderDeclinedEvent' has a wrong offset!");
static_assert(offsetof(UBP_QuickOrderComponent_C, QuickOrderFailedEvent) == 0x000188, "Member 'UBP_QuickOrderComponent_C::QuickOrderFailedEvent' has a wrong offset!");
static_assert(offsetof(UBP_QuickOrderComponent_C, OnQuickOrderCalled) == 0x000190, "Member 'UBP_QuickOrderComponent_C::OnQuickOrderCalled' has a wrong offset!");

}

