#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Recycle_Garbage_Container_Small

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Recycle_Garbage_Container_Small.BP_Recycle_Garbage_Container_Small_C
// 0x0028 (0x02C8 - 0x02A0)
class ABP_Recycle_Garbage_Container_Small_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Recycle_Garbage_Container_Small_04;             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Recycle_Garbage_Container_Small_03;             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Recycle_Garbage_Container_Small_01;             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Recycle_Garbage_Container_Small_02;             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Recycle_Garbage_Container_Small_C">();
	}
	static class ABP_Recycle_Garbage_Container_Small_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Recycle_Garbage_Container_Small_C>();
	}
};
static_assert(alignof(ABP_Recycle_Garbage_Container_Small_C) == 0x000008, "Wrong alignment on ABP_Recycle_Garbage_Container_Small_C");
static_assert(sizeof(ABP_Recycle_Garbage_Container_Small_C) == 0x0002C8, "Wrong size on ABP_Recycle_Garbage_Container_Small_C");
static_assert(offsetof(ABP_Recycle_Garbage_Container_Small_C, SM_Recycle_Garbage_Container_Small_04) == 0x0002A0, "Member 'ABP_Recycle_Garbage_Container_Small_C::SM_Recycle_Garbage_Container_Small_04' has a wrong offset!");
static_assert(offsetof(ABP_Recycle_Garbage_Container_Small_C, SM_Recycle_Garbage_Container_Small_03) == 0x0002A8, "Member 'ABP_Recycle_Garbage_Container_Small_C::SM_Recycle_Garbage_Container_Small_03' has a wrong offset!");
static_assert(offsetof(ABP_Recycle_Garbage_Container_Small_C, SM_Recycle_Garbage_Container_Small_01) == 0x0002B0, "Member 'ABP_Recycle_Garbage_Container_Small_C::SM_Recycle_Garbage_Container_Small_01' has a wrong offset!");
static_assert(offsetof(ABP_Recycle_Garbage_Container_Small_C, SM_Recycle_Garbage_Container_Small_02) == 0x0002B8, "Member 'ABP_Recycle_Garbage_Container_Small_C::SM_Recycle_Garbage_Container_Small_02' has a wrong offset!");
static_assert(offsetof(ABP_Recycle_Garbage_Container_Small_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_Recycle_Garbage_Container_Small_C::DefaultSceneRoot' has a wrong offset!");

}

