#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Road_Barrier_02_04

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Road_Barrier_02_04.BP_Road_Barrier_02_04_C
// 0x0028 (0x02C8 - 0x02A0)
class ABP_Road_Barrier_02_04_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Road_Barrier_02_Plate_02;                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Road_Barrier_02_Plate_05;                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Road_Barrier_02_Plate_04;                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Road_Barrier_02;                                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Road_Barrier_02_04_C">();
	}
	static class ABP_Road_Barrier_02_04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Road_Barrier_02_04_C>();
	}
};
static_assert(alignof(ABP_Road_Barrier_02_04_C) == 0x000008, "Wrong alignment on ABP_Road_Barrier_02_04_C");
static_assert(sizeof(ABP_Road_Barrier_02_04_C) == 0x0002C8, "Wrong size on ABP_Road_Barrier_02_04_C");
static_assert(offsetof(ABP_Road_Barrier_02_04_C, SM_Road_Barrier_02_Plate_02) == 0x0002A0, "Member 'ABP_Road_Barrier_02_04_C::SM_Road_Barrier_02_Plate_02' has a wrong offset!");
static_assert(offsetof(ABP_Road_Barrier_02_04_C, SM_Road_Barrier_02_Plate_05) == 0x0002A8, "Member 'ABP_Road_Barrier_02_04_C::SM_Road_Barrier_02_Plate_05' has a wrong offset!");
static_assert(offsetof(ABP_Road_Barrier_02_04_C, SM_Road_Barrier_02_Plate_04) == 0x0002B0, "Member 'ABP_Road_Barrier_02_04_C::SM_Road_Barrier_02_Plate_04' has a wrong offset!");
static_assert(offsetof(ABP_Road_Barrier_02_04_C, SM_Road_Barrier_02) == 0x0002B8, "Member 'ABP_Road_Barrier_02_04_C::SM_Road_Barrier_02' has a wrong offset!");
static_assert(offsetof(ABP_Road_Barrier_02_04_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_Road_Barrier_02_04_C::DefaultSceneRoot' has a wrong offset!");

}

