#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Revealed_EffectHandler

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_Revealed_EffectHandler.BP_Revealed_EffectHandler_C.OnEffectAdded
// 0x02F0 (0x02F0 - 0x0000)
struct BP_Revealed_EffectHandler_C_OnEffectAdded final
{
public:
	class UGzAbilitySystemComponent*              Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    Spec;                                              // 0x0008(0x02A0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UAbilitySystemComponent*                CallFunc_GetInstigatorOfEffect_ReturnValue;        // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatar_ReturnValue;                    // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D11[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGzCharacter*>                   CallFunc_GetTeammatesOfASCOwner_ReturnValue;       // 0x02C0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D12[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_Array_Get_Item;                           // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D13[0x3];                                     // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Revealed_EffectHandler_C_OnEffectAdded) == 0x000008, "Wrong alignment on BP_Revealed_EffectHandler_C_OnEffectAdded");
static_assert(sizeof(BP_Revealed_EffectHandler_C_OnEffectAdded) == 0x0002F0, "Wrong size on BP_Revealed_EffectHandler_C_OnEffectAdded");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectAdded, Target) == 0x000000, "Member 'BP_Revealed_EffectHandler_C_OnEffectAdded::Target' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectAdded, Spec) == 0x000008, "Member 'BP_Revealed_EffectHandler_C_OnEffectAdded::Spec' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectAdded, CallFunc_GetInstigatorOfEffect_ReturnValue) == 0x0002A8, "Member 'BP_Revealed_EffectHandler_C_OnEffectAdded::CallFunc_GetInstigatorOfEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectAdded, CallFunc_GetAvatar_ReturnValue) == 0x0002B0, "Member 'BP_Revealed_EffectHandler_C_OnEffectAdded::CallFunc_GetAvatar_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectAdded, CallFunc_IsValid_ReturnValue) == 0x0002B8, "Member 'BP_Revealed_EffectHandler_C_OnEffectAdded::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectAdded, CallFunc_GetTeammatesOfASCOwner_ReturnValue) == 0x0002C0, "Member 'BP_Revealed_EffectHandler_C_OnEffectAdded::CallFunc_GetTeammatesOfASCOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectAdded, CallFunc_Array_Length_ReturnValue) == 0x0002D0, "Member 'BP_Revealed_EffectHandler_C_OnEffectAdded::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectAdded, Temp_int_Array_Index_Variable) == 0x0002D4, "Member 'BP_Revealed_EffectHandler_C_OnEffectAdded::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectAdded, Temp_int_Loop_Counter_Variable) == 0x0002D8, "Member 'BP_Revealed_EffectHandler_C_OnEffectAdded::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectAdded, CallFunc_Array_Get_Item) == 0x0002E0, "Member 'BP_Revealed_EffectHandler_C_OnEffectAdded::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectAdded, CallFunc_Less_IntInt_ReturnValue) == 0x0002E8, "Member 'BP_Revealed_EffectHandler_C_OnEffectAdded::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectAdded, CallFunc_Add_IntInt_ReturnValue) == 0x0002EC, "Member 'BP_Revealed_EffectHandler_C_OnEffectAdded::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Revealed_EffectHandler.BP_Revealed_EffectHandler_C.OnEffectRemoved
// 0x02F0 (0x02F0 - 0x0000)
struct BP_Revealed_EffectHandler_C_OnEffectRemoved final
{
public:
	class UGzAbilitySystemComponent*              Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    Spec;                                              // 0x0008(0x02A0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UAbilitySystemComponent*                CallFunc_GetInstigatorOfEffect_ReturnValue;        // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatar_ReturnValue;                    // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D14[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGzCharacter*>                   CallFunc_GetTeammatesOfASCOwner_ReturnValue;       // 0x02C0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D15[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_Array_Get_Item;                           // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D16[0x3];                                     // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Revealed_EffectHandler_C_OnEffectRemoved) == 0x000008, "Wrong alignment on BP_Revealed_EffectHandler_C_OnEffectRemoved");
static_assert(sizeof(BP_Revealed_EffectHandler_C_OnEffectRemoved) == 0x0002F0, "Wrong size on BP_Revealed_EffectHandler_C_OnEffectRemoved");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectRemoved, Target) == 0x000000, "Member 'BP_Revealed_EffectHandler_C_OnEffectRemoved::Target' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectRemoved, Spec) == 0x000008, "Member 'BP_Revealed_EffectHandler_C_OnEffectRemoved::Spec' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectRemoved, CallFunc_GetInstigatorOfEffect_ReturnValue) == 0x0002A8, "Member 'BP_Revealed_EffectHandler_C_OnEffectRemoved::CallFunc_GetInstigatorOfEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectRemoved, CallFunc_GetAvatar_ReturnValue) == 0x0002B0, "Member 'BP_Revealed_EffectHandler_C_OnEffectRemoved::CallFunc_GetAvatar_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectRemoved, CallFunc_IsValid_ReturnValue) == 0x0002B8, "Member 'BP_Revealed_EffectHandler_C_OnEffectRemoved::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectRemoved, CallFunc_GetTeammatesOfASCOwner_ReturnValue) == 0x0002C0, "Member 'BP_Revealed_EffectHandler_C_OnEffectRemoved::CallFunc_GetTeammatesOfASCOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectRemoved, CallFunc_Array_Length_ReturnValue) == 0x0002D0, "Member 'BP_Revealed_EffectHandler_C_OnEffectRemoved::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectRemoved, Temp_int_Array_Index_Variable) == 0x0002D4, "Member 'BP_Revealed_EffectHandler_C_OnEffectRemoved::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectRemoved, Temp_int_Loop_Counter_Variable) == 0x0002D8, "Member 'BP_Revealed_EffectHandler_C_OnEffectRemoved::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectRemoved, CallFunc_Array_Get_Item) == 0x0002E0, "Member 'BP_Revealed_EffectHandler_C_OnEffectRemoved::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectRemoved, CallFunc_Less_IntInt_ReturnValue) == 0x0002E8, "Member 'BP_Revealed_EffectHandler_C_OnEffectRemoved::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Revealed_EffectHandler_C_OnEffectRemoved, CallFunc_Add_IntInt_ReturnValue) == 0x0002EC, "Member 'BP_Revealed_EffectHandler_C_OnEffectRemoved::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

