#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReconDrone

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "G01_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BP_ReconDrone.BP_ReconDrone_C.OnScanStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_ReconDrone_C_OnScanStateChanged__DelegateSignature final
{
public:
	double                                        StartAngle;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RotationSpeedAnglePerSecond;                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReconDrone_C_OnScanStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on BP_ReconDrone_C_OnScanStateChanged__DelegateSignature");
static_assert(sizeof(BP_ReconDrone_C_OnScanStateChanged__DelegateSignature) == 0x000010, "Wrong size on BP_ReconDrone_C_OnScanStateChanged__DelegateSignature");
static_assert(offsetof(BP_ReconDrone_C_OnScanStateChanged__DelegateSignature, StartAngle) == 0x000000, "Member 'BP_ReconDrone_C_OnScanStateChanged__DelegateSignature::StartAngle' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_OnScanStateChanged__DelegateSignature, RotationSpeedAnglePerSecond) == 0x000008, "Member 'BP_ReconDrone_C_OnScanStateChanged__DelegateSignature::RotationSpeedAnglePerSecond' has a wrong offset!");

// Function BP_ReconDrone.BP_ReconDrone_C.CheckDistRadar
// 0x00B8 (0x00B8 - 0x0000)
struct BP_ReconDrone_C_CheckDistRadar final
{
public:
	class AActor*                                 Self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A0C[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A0D[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A0E[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_InRange_FloatFloat_Max_ImplicitCast;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReconDrone_C_CheckDistRadar) == 0x000008, "Wrong alignment on BP_ReconDrone_C_CheckDistRadar");
static_assert(sizeof(BP_ReconDrone_C_CheckDistRadar) == 0x0000B8, "Wrong size on BP_ReconDrone_C_CheckDistRadar");
static_assert(offsetof(BP_ReconDrone_C_CheckDistRadar, Self2) == 0x000000, "Member 'BP_ReconDrone_C_CheckDistRadar::Self2' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_CheckDistRadar, ReturnValue) == 0x000008, "Member 'BP_ReconDrone_C_CheckDistRadar::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_CheckDistRadar, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_ReconDrone_C_CheckDistRadar::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_CheckDistRadar, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'BP_ReconDrone_C_CheckDistRadar::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_CheckDistRadar, CallFunc_GetActorForwardVector_ReturnValue) == 0x000040, "Member 'BP_ReconDrone_C_CheckDistRadar::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_CheckDistRadar, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000058, "Member 'BP_ReconDrone_C_CheckDistRadar::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_CheckDistRadar, CallFunc_GetActorRightVector_ReturnValue) == 0x000070, "Member 'BP_ReconDrone_C_CheckDistRadar::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_CheckDistRadar, CallFunc_Dot_VectorVector_ReturnValue) == 0x000088, "Member 'BP_ReconDrone_C_CheckDistRadar::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_CheckDistRadar, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x000090, "Member 'BP_ReconDrone_C_CheckDistRadar::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_CheckDistRadar, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000098, "Member 'BP_ReconDrone_C_CheckDistRadar::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_CheckDistRadar, CallFunc_Abs_ReturnValue) == 0x0000A0, "Member 'BP_ReconDrone_C_CheckDistRadar::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_CheckDistRadar, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'BP_ReconDrone_C_CheckDistRadar::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_CheckDistRadar, CallFunc_BooleanAND_ReturnValue) == 0x0000A9, "Member 'BP_ReconDrone_C_CheckDistRadar::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_CheckDistRadar, CallFunc_InRange_FloatFloat_Max_ImplicitCast) == 0x0000B0, "Member 'BP_ReconDrone_C_CheckDistRadar::CallFunc_InRange_FloatFloat_Max_ImplicitCast' has a wrong offset!");

// Function BP_ReconDrone.BP_ReconDrone_C.DestroyFX
// 0x0088 (0x0088 - 0x0000)
struct BP_ReconDrone_C_DestroyFX final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_1;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_2;        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReconDrone_C_DestroyFX) == 0x000008, "Wrong alignment on BP_ReconDrone_C_DestroyFX");
static_assert(sizeof(BP_ReconDrone_C_DestroyFX) == 0x000088, "Wrong size on BP_ReconDrone_C_DestroyFX");
static_assert(offsetof(BP_ReconDrone_C_DestroyFX, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_ReconDrone_C_DestroyFX::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_DestroyFX, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000018, "Member 'BP_ReconDrone_C_DestroyFX::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_DestroyFX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000030, "Member 'BP_ReconDrone_C_DestroyFX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_DestroyFX, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000038, "Member 'BP_ReconDrone_C_DestroyFX::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_DestroyFX, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000040, "Member 'BP_ReconDrone_C_DestroyFX::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_DestroyFX, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000058, "Member 'BP_ReconDrone_C_DestroyFX::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_DestroyFX, CallFunc_SpawnSystemAtLocation_ReturnValue_2) == 0x000070, "Member 'BP_ReconDrone_C_DestroyFX::CallFunc_SpawnSystemAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_DestroyFX, CallFunc_PostEventAtLocation_ReturnValue) == 0x000078, "Member 'BP_ReconDrone_C_DestroyFX::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_DestroyFX, CallFunc_PostEventAtLocation_ReturnValue_1) == 0x00007C, "Member 'BP_ReconDrone_C_DestroyFX::CallFunc_PostEventAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_DestroyFX, CallFunc_PostEventAtLocation_ReturnValue_2) == 0x000080, "Member 'BP_ReconDrone_C_DestroyFX::CallFunc_PostEventAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_DestroyFX, K2Node_SwitchEnum_CmpSuccess) == 0x000084, "Member 'BP_ReconDrone_C_DestroyFX::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_ReconDrone.BP_ReconDrone_C.ExecuteUbergraph_BP_ReconDrone
// 0x0150 (0x0150 - 0x0000)
struct BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A0F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchStarted_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A10[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A11[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A12[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A13[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A14[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A15[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetTeamAttitude_ReturnValue;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A16[0x5];                                     // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzMultiPartCharacter*                  K2Node_DynamicCast_AsGz_Multi_Part_Character;      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Refresh_Tags_for_Enemy_NewParam;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A17[0x2];                                     // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A18[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_PlayerCharacter_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0110(0x0010)(ReferenceParm)
	TArray<class ABP_PlayerCharacter_C*>          CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0120(0x0010)(ReferenceParm)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchStarted_ReturnValue_1;            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A19[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone) == 0x000008, "Wrong alignment on BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone");
static_assert(sizeof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone) == 0x000150, "Wrong size on BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, EntryPoint) == 0x000000, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_HasMatchStarted_ReturnValue) == 0x000010, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_HasMatchStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_HasAuthority_ReturnValue) == 0x000011, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_IsDedicatedServer_ReturnValue) == 0x000030, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, Temp_delegate_Variable) == 0x000034, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000054, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000058, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000070, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, K2Node_Event_DeltaSeconds) == 0x000078, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_PostEvent_ReturnValue) == 0x000098, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_GetOwner_ReturnValue) == 0x0000A0, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000A8, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_GetTeamAttitude_ReturnValue) == 0x0000B0, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_GetTeamAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B1, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_HasAuthority_ReturnValue_1) == 0x0000B2, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x0000B8, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, K2Node_DynamicCast_AsGz_Multi_Part_Character) == 0x0000C0, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::K2Node_DynamicCast_AsGz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_Refresh_Tags_for_Enemy_NewParam) == 0x0000C9, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_Refresh_Tags_for_Enemy_NewParam' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_GetDistanceTo_ReturnValue) == 0x0000CC, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_MakeVector_ReturnValue) == 0x0000D0, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_MakeRotFromZ_ReturnValue) == 0x0000F0, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000108, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_GetAllActorsOfClass_OutActors) == 0x000110, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000120, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_GetGameMode_ReturnValue_1) == 0x000130, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_HasMatchStarted_ReturnValue_1) == 0x000138, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_HasMatchStarted_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000140, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000148, "Member 'BP_ReconDrone_C_ExecuteUbergraph_BP_ReconDrone::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_ReconDrone.BP_ReconDrone_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ReconDrone_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReconDrone_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ReconDrone_C_ReceiveTick");
static_assert(sizeof(BP_ReconDrone_C_ReceiveTick) == 0x000004, "Wrong size on BP_ReconDrone_C_ReceiveTick");
static_assert(offsetof(BP_ReconDrone_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ReconDrone_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ReconDrone.BP_ReconDrone_C.Refresh Tags for Enemy
// 0x0048 (0x0048 - 0x0000)
struct BP_ReconDrone_C_Refresh_Tags_for_Enemy final
{
public:
	class AGzMultiPartCharacter*                  InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          NewParam;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1A[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0020(0x0020)()
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReconDrone_C_Refresh_Tags_for_Enemy) == 0x000008, "Wrong alignment on BP_ReconDrone_C_Refresh_Tags_for_Enemy");
static_assert(sizeof(BP_ReconDrone_C_Refresh_Tags_for_Enemy) == 0x000048, "Wrong size on BP_ReconDrone_C_Refresh_Tags_for_Enemy");
static_assert(offsetof(BP_ReconDrone_C_Refresh_Tags_for_Enemy, InputPin) == 0x000000, "Member 'BP_ReconDrone_C_Refresh_Tags_for_Enemy::InputPin' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Refresh_Tags_for_Enemy, NewParam) == 0x000008, "Member 'BP_ReconDrone_C_Refresh_Tags_for_Enemy::NewParam' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Refresh_Tags_for_Enemy, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_ReconDrone_C_Refresh_Tags_for_Enemy::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Refresh_Tags_for_Enemy, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000020, "Member 'BP_ReconDrone_C_Refresh_Tags_for_Enemy::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Refresh_Tags_for_Enemy, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x000040, "Member 'BP_ReconDrone_C_Refresh_Tags_for_Enemy::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");

// Function BP_ReconDrone.BP_ReconDrone_C.Remove Tags for Enemy
// 0x0058 (0x0058 - 0x0000)
struct BP_ReconDrone_C_Remove_Tags_for_Enemy final
{
public:
	class AGzMultiPartCharacter*                  InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayTagCount_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1B[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0030(0x0020)()
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReconDrone_C_Remove_Tags_for_Enemy) == 0x000008, "Wrong alignment on BP_ReconDrone_C_Remove_Tags_for_Enemy");
static_assert(sizeof(BP_ReconDrone_C_Remove_Tags_for_Enemy) == 0x000058, "Wrong size on BP_ReconDrone_C_Remove_Tags_for_Enemy");
static_assert(offsetof(BP_ReconDrone_C_Remove_Tags_for_Enemy, InputPin) == 0x000000, "Member 'BP_ReconDrone_C_Remove_Tags_for_Enemy::InputPin' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Remove_Tags_for_Enemy, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'BP_ReconDrone_C_Remove_Tags_for_Enemy::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Remove_Tags_for_Enemy, Temp_int_Variable) == 0x000010, "Member 'BP_ReconDrone_C_Remove_Tags_for_Enemy::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Remove_Tags_for_Enemy, CallFunc_GetGameplayTagCount_ReturnValue) == 0x000014, "Member 'BP_ReconDrone_C_Remove_Tags_for_Enemy::CallFunc_GetGameplayTagCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Remove_Tags_for_Enemy, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_ReconDrone_C_Remove_Tags_for_Enemy::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Remove_Tags_for_Enemy, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000019, "Member 'BP_ReconDrone_C_Remove_Tags_for_Enemy::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Remove_Tags_for_Enemy, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_ReconDrone_C_Remove_Tags_for_Enemy::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Remove_Tags_for_Enemy, K2Node_MakeArray_Array) == 0x000020, "Member 'BP_ReconDrone_C_Remove_Tags_for_Enemy::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Remove_Tags_for_Enemy, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000030, "Member 'BP_ReconDrone_C_Remove_Tags_for_Enemy::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Remove_Tags_for_Enemy, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x000050, "Member 'BP_ReconDrone_C_Remove_Tags_for_Enemy::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");

// Function BP_ReconDrone.BP_ReconDrone_C.UpdateRevealedActors
// 0x0078 (0x0078 - 0x0000)
struct BP_ReconDrone_C_UpdateRevealedActors final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1C[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1D[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReconDrone_C_UpdateRevealedActors) == 0x000008, "Wrong alignment on BP_ReconDrone_C_UpdateRevealedActors");
static_assert(sizeof(BP_ReconDrone_C_UpdateRevealedActors) == 0x000078, "Wrong size on BP_ReconDrone_C_UpdateRevealedActors");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_ReconDrone_C_UpdateRevealedActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_ReconDrone_C_UpdateRevealedActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_ReconDrone_C_UpdateRevealedActors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'BP_ReconDrone_C_UpdateRevealedActors::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_ReconDrone_C_UpdateRevealedActors::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_ReconDrone_C_UpdateRevealedActors::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_ReconDrone_C_UpdateRevealedActors::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_ReconDrone_C_UpdateRevealedActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_ReconDrone_C_UpdateRevealedActors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'BP_ReconDrone_C_UpdateRevealedActors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, CallFunc_Less_IntInt_ReturnValue) == 0x00003D, "Member 'BP_ReconDrone_C_UpdateRevealedActors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000040, "Member 'BP_ReconDrone_C_UpdateRevealedActors::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, CallFunc_Vector_Distance2D_ReturnValue) == 0x000058, "Member 'BP_ReconDrone_C_UpdateRevealedActors::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'BP_ReconDrone_C_UpdateRevealedActors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000064, "Member 'BP_ReconDrone_C_UpdateRevealedActors::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'BP_ReconDrone_C_UpdateRevealedActors::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'BP_ReconDrone_C_UpdateRevealedActors::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_UpdateRevealedActors, CallFunc_Less_IntInt_ReturnValue_1) == 0x000074, "Member 'BP_ReconDrone_C_UpdateRevealedActors::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_ReconDrone.BP_ReconDrone_C.Vector 1D Max
// 0x0038 (0x0038 - 0x0000)
struct BP_ReconDrone_C_Vector_1D_Max final
{
public:
	double                                        Vector;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        B;                                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max;                                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SignOfFloat_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReconDrone_C_Vector_1D_Max) == 0x000008, "Wrong alignment on BP_ReconDrone_C_Vector_1D_Max");
static_assert(sizeof(BP_ReconDrone_C_Vector_1D_Max) == 0x000038, "Wrong size on BP_ReconDrone_C_Vector_1D_Max");
static_assert(offsetof(BP_ReconDrone_C_Vector_1D_Max, Vector) == 0x000000, "Member 'BP_ReconDrone_C_Vector_1D_Max::Vector' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Vector_1D_Max, B) == 0x000008, "Member 'BP_ReconDrone_C_Vector_1D_Max::B' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Vector_1D_Max, Max) == 0x000010, "Member 'BP_ReconDrone_C_Vector_1D_Max::Max' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Vector_1D_Max, CallFunc_Abs_ReturnValue) == 0x000018, "Member 'BP_ReconDrone_C_Vector_1D_Max::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Vector_1D_Max, CallFunc_SignOfFloat_ReturnValue) == 0x000020, "Member 'BP_ReconDrone_C_Vector_1D_Max::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Vector_1D_Max, CallFunc_FMax_ReturnValue) == 0x000028, "Member 'BP_ReconDrone_C_Vector_1D_Max::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReconDrone_C_Vector_1D_Max, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_ReconDrone_C_Vector_1D_Max::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_ReconDrone.BP_ReconDrone_C.GetDefilerTargetType
// 0x0001 (0x0001 - 0x0000)
struct BP_ReconDrone_C_GetDefilerTargetType final
{
public:
	EGzDefilerTargetType                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReconDrone_C_GetDefilerTargetType) == 0x000001, "Wrong alignment on BP_ReconDrone_C_GetDefilerTargetType");
static_assert(sizeof(BP_ReconDrone_C_GetDefilerTargetType) == 0x000001, "Wrong size on BP_ReconDrone_C_GetDefilerTargetType");
static_assert(offsetof(BP_ReconDrone_C_GetDefilerTargetType, ReturnValue) == 0x000000, "Member 'BP_ReconDrone_C_GetDefilerTargetType::ReturnValue' has a wrong offset!");

}

