#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScreenShake_ADS_MultipleScopeModes

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"


namespace SDK::Params
{

// Function BP_ScreenShake_ADS_MultipleScopeModes.BP_ScreenShake_ADS_MultipleScopeModes_C.ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes
// 0x0060 (0x0060 - 0x0000)
struct BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5893[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetFOVOscillationByPercentage_FOVOscillation; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFOscillator                           K2Node_MakeStruct_FOscillator;                     // 0x0014(0x000C)(NoDestructor)
	double                                        CallFunc_GetLocOscillationXAmplitude_XAmplitude;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFOscillator                           K2Node_MakeStruct_FOscillator_1;                   // 0x0028(0x000C)(NoDestructor)
	struct FVOscillator                           K2Node_MakeStruct_VOscillator;                     // 0x0034(0x0024)(NoDestructor)
	float                                         K2Node_MakeStruct_Amplitude_ImplicitCast;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Amplitude_ImplicitCast_1;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes) == 0x000008, "Wrong alignment on BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes");
static_assert(sizeof(BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes) == 0x000060, "Wrong size on BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes, EntryPoint) == 0x000000, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes, CallFunc_GetFOVOscillationByPercentage_FOVOscillation) == 0x000008, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes::CallFunc_GetFOVOscillationByPercentage_FOVOscillation' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes, K2Node_Event_Scale) == 0x000010, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes::K2Node_Event_Scale' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes, K2Node_MakeStruct_FOscillator) == 0x000014, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes::K2Node_MakeStruct_FOscillator' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes, CallFunc_GetLocOscillationXAmplitude_XAmplitude) == 0x000020, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes::CallFunc_GetLocOscillationXAmplitude_XAmplitude' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes, K2Node_MakeStruct_FOscillator_1) == 0x000028, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes::K2Node_MakeStruct_FOscillator_1' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes, K2Node_MakeStruct_VOscillator) == 0x000034, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes::K2Node_MakeStruct_VOscillator' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes, K2Node_MakeStruct_Amplitude_ImplicitCast) == 0x000058, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes::K2Node_MakeStruct_Amplitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes, K2Node_MakeStruct_Amplitude_ImplicitCast_1) == 0x00005C, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_ExecuteUbergraph_BP_ScreenShake_ADS_MultipleScopeModes::K2Node_MakeStruct_Amplitude_ImplicitCast_1' has a wrong offset!");

// Function BP_ScreenShake_ADS_MultipleScopeModes.BP_ScreenShake_ADS_MultipleScopeModes_C.GetFOVOscillationByPercentage
// 0x0038 (0x0038 - 0x0000)
struct BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage final
{
public:
	double                                        Param_FOVOscillation;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_BlueprintGetCameraManager_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFOVAngle_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5894[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage) == 0x000008, "Wrong alignment on BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage");
static_assert(sizeof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage) == 0x000038, "Wrong size on BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage, Param_FOVOscillation) == 0x000000, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage::Param_FOVOscillation' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage, CallFunc_BlueprintGetCameraManager_ReturnValue) == 0x000008, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage::CallFunc_BlueprintGetCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage, CallFunc_GetFOVAngle_ReturnValue) == 0x000018, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage::CallFunc_GetFOVAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetFOVOscillationByPercentage::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_ScreenShake_ADS_MultipleScopeModes.BP_ScreenShake_ADS_MultipleScopeModes_C.GetLocOscillationXAmplitude
// 0x0048 (0x0048 - 0x0000)
struct BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude final
{
public:
	double                                        XAmplitude;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStartWidth_StartWidth;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_BlueprintGetCameraManager_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFOVAngle_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5895[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegTan_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude) == 0x000008, "Wrong alignment on BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude");
static_assert(sizeof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude) == 0x000048, "Wrong size on BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude, XAmplitude) == 0x000000, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude::XAmplitude' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude, CallFunc_GetStartWidth_StartWidth) == 0x000008, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude::CallFunc_GetStartWidth_StartWidth' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude, CallFunc_BlueprintGetCameraManager_ReturnValue) == 0x000010, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude::CallFunc_BlueprintGetCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude, CallFunc_GetFOVAngle_ReturnValue) == 0x000018, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude::CallFunc_GetFOVAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude, CallFunc_DegTan_ReturnValue) == 0x000028, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude::CallFunc_DegTan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetLocOscillationXAmplitude::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_ScreenShake_ADS_MultipleScopeModes.BP_ScreenShake_ADS_MultipleScopeModes_C.GetStartWidth
// 0x0040 (0x0040 - 0x0000)
struct BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth final
{
public:
	double                                        StartWidth;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDefaultFOV_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5896[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegTan_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth) == 0x000008, "Wrong alignment on BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth");
static_assert(sizeof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth) == 0x000040, "Wrong size on BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth, StartWidth) == 0x000000, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth::StartWidth' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth, CallFunc_GetDefaultFOV_ReturnValue) == 0x000008, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth::CallFunc_GetDefaultFOV_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth, CallFunc_DegTan_ReturnValue) == 0x000018, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth::CallFunc_DegTan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000030, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_GetStartWidth::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_ScreenShake_ADS_MultipleScopeModes.BP_ScreenShake_ADS_MultipleScopeModes_C.ReceivePlayShake
// 0x0004 (0x0004 - 0x0000)
struct BP_ScreenShake_ADS_MultipleScopeModes_C_ReceivePlayShake final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScreenShake_ADS_MultipleScopeModes_C_ReceivePlayShake) == 0x000004, "Wrong alignment on BP_ScreenShake_ADS_MultipleScopeModes_C_ReceivePlayShake");
static_assert(sizeof(BP_ScreenShake_ADS_MultipleScopeModes_C_ReceivePlayShake) == 0x000004, "Wrong size on BP_ScreenShake_ADS_MultipleScopeModes_C_ReceivePlayShake");
static_assert(offsetof(BP_ScreenShake_ADS_MultipleScopeModes_C_ReceivePlayShake, Scale) == 0x000000, "Member 'BP_ScreenShake_ADS_MultipleScopeModes_C_ReceivePlayShake::Scale' has a wrong offset!");

}

