#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShrinkingZone

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ShrinkingZone.BP_ShrinkingZone_C.ExecuteUbergraph_BP_ShrinkingZone
// 0x0004 (0x0004 - 0x0000)
struct BP_ShrinkingZone_C_ExecuteUbergraph_BP_ShrinkingZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShrinkingZone_C_ExecuteUbergraph_BP_ShrinkingZone) == 0x000004, "Wrong alignment on BP_ShrinkingZone_C_ExecuteUbergraph_BP_ShrinkingZone");
static_assert(sizeof(BP_ShrinkingZone_C_ExecuteUbergraph_BP_ShrinkingZone) == 0x000004, "Wrong size on BP_ShrinkingZone_C_ExecuteUbergraph_BP_ShrinkingZone");
static_assert(offsetof(BP_ShrinkingZone_C_ExecuteUbergraph_BP_ShrinkingZone, EntryPoint) == 0x000000, "Member 'BP_ShrinkingZone_C_ExecuteUbergraph_BP_ShrinkingZone::EntryPoint' has a wrong offset!");

// Function BP_ShrinkingZone.BP_ShrinkingZone_C.SpawnNiagaraSystem
// 0x0018 (0x0018 - 0x0000)
struct BP_ShrinkingZone_C_SpawnNiagaraSystem final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1200[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShrinkingZone_C_SpawnNiagaraSystem) == 0x000008, "Wrong alignment on BP_ShrinkingZone_C_SpawnNiagaraSystem");
static_assert(sizeof(BP_ShrinkingZone_C_SpawnNiagaraSystem) == 0x000018, "Wrong size on BP_ShrinkingZone_C_SpawnNiagaraSystem");
static_assert(offsetof(BP_ShrinkingZone_C_SpawnNiagaraSystem, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_ShrinkingZone_C_SpawnNiagaraSystem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingZone_C_SpawnNiagaraSystem, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000008, "Member 'BP_ShrinkingZone_C_SpawnNiagaraSystem::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingZone_C_SpawnNiagaraSystem, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'BP_ShrinkingZone_C_SpawnNiagaraSystem::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingZone_C_SpawnNiagaraSystem, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BP_ShrinkingZone_C_SpawnNiagaraSystem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_ShrinkingZone.BP_ShrinkingZone_C.OnCurrentCircleChanged
// 0x0050 (0x0050 - 0x0000)
struct BP_ShrinkingZone_C_OnCurrentCircleChanged final
{
public:
	struct FGzCircle2D                            NewCurrentCircle;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_B_ImplicitCast;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_R_ImplicitCast;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShrinkingZone_C_OnCurrentCircleChanged) == 0x000008, "Wrong alignment on BP_ShrinkingZone_C_OnCurrentCircleChanged");
static_assert(sizeof(BP_ShrinkingZone_C_OnCurrentCircleChanged) == 0x000050, "Wrong size on BP_ShrinkingZone_C_OnCurrentCircleChanged");
static_assert(offsetof(BP_ShrinkingZone_C_OnCurrentCircleChanged, NewCurrentCircle) == 0x000000, "Member 'BP_ShrinkingZone_C_OnCurrentCircleChanged::NewCurrentCircle' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingZone_C_OnCurrentCircleChanged, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'BP_ShrinkingZone_C_OnCurrentCircleChanged::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingZone_C_OnCurrentCircleChanged, CallFunc_BreakVector2D_X) == 0x000020, "Member 'BP_ShrinkingZone_C_OnCurrentCircleChanged::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingZone_C_OnCurrentCircleChanged, CallFunc_BreakVector2D_Y) == 0x000028, "Member 'BP_ShrinkingZone_C_OnCurrentCircleChanged::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingZone_C_OnCurrentCircleChanged, K2Node_MakeStruct_LinearColor) == 0x000030, "Member 'BP_ShrinkingZone_C_OnCurrentCircleChanged::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingZone_C_OnCurrentCircleChanged, K2Node_MakeStruct_B_ImplicitCast) == 0x000040, "Member 'BP_ShrinkingZone_C_OnCurrentCircleChanged::K2Node_MakeStruct_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingZone_C_OnCurrentCircleChanged, K2Node_MakeStruct_R_ImplicitCast) == 0x000044, "Member 'BP_ShrinkingZone_C_OnCurrentCircleChanged::K2Node_MakeStruct_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingZone_C_OnCurrentCircleChanged, K2Node_MakeStruct_G_ImplicitCast) == 0x000048, "Member 'BP_ShrinkingZone_C_OnCurrentCircleChanged::K2Node_MakeStruct_G_ImplicitCast' has a wrong offset!");

}

