#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Shipping_Container_04_Medium_Open_01

#include "Basic.hpp"

#include "Shipping_Container_Material_Select_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Shipping_Container_04_Medium_Open_01.BP_Shipping_Container_04_Medium_Open_01_C
// 0x00A8 (0x0348 - 0x02A0)
class ABP_Shipping_Container_04_Medium_Open_01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Shipping_Container_04_Door_02_Decals;           // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Shipping_Container_04_Door_01_Decals;           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Shipping_Container_04_Medium_Decals;            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Shipping_Container_04_Door_03;                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Shipping_Container_04_Door_02;                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Shipping_Container_04_Door_01;                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Shipping_Container_04_Medium_Interior;          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Shipping_Container_04_Medium;                   // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Shipping_Container_04_Door_03_Decals;           // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Disable_Door_01_;                                  // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69FA[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Zero2Door01;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disable_Door_02_;                                  // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69FB[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Zero2Door02;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShipping_Container_Material_Select           Container_Material;                                // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69FC[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      White;                                             // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Green;                                             // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      ORANGE;                                            // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Blue;                                              // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Red;                                               // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Decals_Tinted;                                     // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EShipping_Container_Material_Select           Interior_Material;                                 // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Shipping_Container_04_Medium_Open_01_C">();
	}
	static class ABP_Shipping_Container_04_Medium_Open_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Shipping_Container_04_Medium_Open_01_C>();
	}
};
static_assert(alignof(ABP_Shipping_Container_04_Medium_Open_01_C) == 0x000008, "Wrong alignment on ABP_Shipping_Container_04_Medium_Open_01_C");
static_assert(sizeof(ABP_Shipping_Container_04_Medium_Open_01_C) == 0x000348, "Wrong size on ABP_Shipping_Container_04_Medium_Open_01_C");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, SM_Shipping_Container_04_Door_02_Decals) == 0x0002A0, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::SM_Shipping_Container_04_Door_02_Decals' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, SM_Shipping_Container_04_Door_01_Decals) == 0x0002A8, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::SM_Shipping_Container_04_Door_01_Decals' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, SM_Shipping_Container_04_Medium_Decals) == 0x0002B0, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::SM_Shipping_Container_04_Medium_Decals' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, SM_Shipping_Container_04_Door_03) == 0x0002B8, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::SM_Shipping_Container_04_Door_03' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, SM_Shipping_Container_04_Door_02) == 0x0002C0, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::SM_Shipping_Container_04_Door_02' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, SM_Shipping_Container_04_Door_01) == 0x0002C8, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::SM_Shipping_Container_04_Door_01' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, SM_Shipping_Container_04_Medium_Interior) == 0x0002D0, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::SM_Shipping_Container_04_Medium_Interior' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, SM_Shipping_Container_04_Medium) == 0x0002D8, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::SM_Shipping_Container_04_Medium' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, SM_Shipping_Container_04_Door_03_Decals) == 0x0002E0, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::SM_Shipping_Container_04_Door_03_Decals' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, Disable_Door_01_) == 0x0002E8, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::Disable_Door_01_' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, Zero2Door01) == 0x0002F0, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::Zero2Door01' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, Disable_Door_02_) == 0x0002F8, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::Disable_Door_02_' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, Zero2Door02) == 0x000300, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::Zero2Door02' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, Container_Material) == 0x000308, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::Container_Material' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, White) == 0x000310, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::White' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, Green) == 0x000318, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::Green' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, ORANGE) == 0x000320, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::ORANGE' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, Blue) == 0x000328, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::Blue' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, Red) == 0x000330, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::Red' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, Decals_Tinted) == 0x000338, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::Decals_Tinted' has a wrong offset!");
static_assert(offsetof(ABP_Shipping_Container_04_Medium_Open_01_C, Interior_Material) == 0x000340, "Member 'ABP_Shipping_Container_04_Medium_Open_01_C::Interior_Material' has a wrong offset!");

}

