#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SmashLandingDashFX

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SmashLandingDashFX.BP_SmashLandingDashFX_C.ExecuteUbergraph_BP_SmashLandingDashFX
// 0x0040 (0x0040 - 0x0000)
struct BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6105[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6106[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6107[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX) == 0x000008, "Wrong alignment on BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX");
static_assert(sizeof(BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX) == 0x000040, "Wrong size on BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX");
static_assert(offsetof(BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX, EntryPoint) == 0x000000, "Member 'BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000008, "Member 'BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x000028, "Member 'BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX, CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast) == 0x00003C, "Member 'BP_SmashLandingDashFX_C_ExecuteUbergraph_BP_SmashLandingDashFX::CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast' has a wrong offset!");

}

