#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Switch

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Switch.BP_Switch_C
// 0x0018 (0x02B8 - 0x02A0)
class ABP_Switch_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGzInteractableComponent*               GzInteractable;                                    // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Switch_C">();
	}
	static class ABP_Switch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Switch_C>();
	}
};
static_assert(alignof(ABP_Switch_C) == 0x000008, "Wrong alignment on ABP_Switch_C");
static_assert(sizeof(ABP_Switch_C) == 0x0002B8, "Wrong size on ABP_Switch_C");
static_assert(offsetof(ABP_Switch_C, StaticMesh) == 0x0002A0, "Member 'ABP_Switch_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Switch_C, GzInteractable) == 0x0002A8, "Member 'ABP_Switch_C::GzInteractable' has a wrong offset!");
static_assert(offsetof(ABP_Switch_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_Switch_C::DefaultSceneRoot' has a wrong offset!");

}

