#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Shipping_Container_04_Small_Open_02

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Shipping_Container_04_Small_Open_02.BP_Shipping_Container_04_Small_Open_02_C.UserConstructionScript
// 0x04B8 (0x04B8 - 0x0000)
struct BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript final
{
public:
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A03[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A04[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0050(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0160(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_3;              // 0x025B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_4;              // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_5;              // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_6;              // 0x0276(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_7;              // 0x0277(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A05[0x5];                                     // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x02B8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x03B0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_2;           // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_3;           // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript");
static_assert(sizeof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript) == 0x0004B8, "Wrong size on BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000008, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Roll) == 0x000018, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Pitch) == 0x00001C, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Yaw) == 0x000020, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Roll_1) == 0x000040, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Pitch_1) == 0x000044, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Yaw_1) == 0x000048, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000050, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_1) == 0x000148, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x000160, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000258, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000259, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_2) == 0x00025A, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_3) == 0x00025B, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Roll_2) == 0x00025C, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Pitch_2) == 0x000260, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Yaw_2) == 0x000264, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Roll_3) == 0x000268, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Pitch_3) == 0x00026C, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Yaw_3) == 0x000270, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_4) == 0x000274, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_5) == 0x000275, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_6) == 0x000276, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_7) == 0x000277, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x000278, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess_1) == 0x000279, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess_2) == 0x00027A, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000280, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_2) == 0x000288, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_3) == 0x0002A0, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult_2) == 0x0002B8, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult_3) == 0x0003B0, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0004A8, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast_1) == 0x0004AC, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast_2) == 0x0004B0, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast_3) == 0x0004B4, "Member 'BP_Shipping_Container_04_Small_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast_3' has a wrong offset!");

}

