#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Shipping_Container_04_Medium_Open_02

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Shipping_Container_04_Medium_Open_02.BP_Shipping_Container_04_Medium_Open_02_C.UserConstructionScript
// 0x04B0 (0x04B0 - 0x0000)
struct BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript final
{
public:
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_3;              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_4;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_5;              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_6;              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_7;              // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC2[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0068(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0188(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x0298(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x03A8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_2;           // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_3;           // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript");
static_assert(sizeof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript) == 0x0004B0, "Wrong size on BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Roll) == 0x000000, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Pitch) == 0x000004, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Yaw) == 0x000008, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Roll_1) == 0x00000C, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Pitch_1) == 0x000010, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Yaw_1) == 0x000014, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Roll_2) == 0x000018, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Pitch_2) == 0x00001C, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Yaw_2) == 0x000020, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Roll_3) == 0x000024, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Pitch_3) == 0x000028, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_BreakRotator_Yaw_3) == 0x00002C, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000030, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000031, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_2) == 0x000032, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_3) == 0x000033, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_4) == 0x000034, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_5) == 0x000035, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_6) == 0x000036, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_7) == 0x000037, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess_1) == 0x000039, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess_2) == 0x00003A, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000048, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000068, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000160, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_1) == 0x000168, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000180, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x000188, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_2) == 0x000280, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult_2) == 0x000298, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_3) == 0x000390, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult_3) == 0x0003A8, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0004A0, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast_1) == 0x0004A4, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast_2) == 0x0004A8, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast_3) == 0x0004AC, "Member 'BP_Shipping_Container_04_Medium_Open_02_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast_3' has a wrong offset!");

}

