#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Shipping_Container_05_Mediun_Open_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Shipping_Container_05_Mediun_Open_01.BP_Shipping_Container_05_Mediun_Open_01_C.UserConstructionScript
// 0x0720 (0x0720 - 0x0000)
struct BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript final
{
public:
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A0D[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A0E[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0050(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0160(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A0F[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A10[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x0290(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_3;              // 0x038A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_4;              // 0x038B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_5;              // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_6;              // 0x038D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_7;              // 0x038E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A11[0x1];                                     // 0x038F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A12[0x4];                                     // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x03C8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakRotator_Roll_4;                      // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_4;                     // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_4;                       // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_5;                      // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_5;                     // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_5;                       // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_8;              // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_9;              // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_10;             // 0x04DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_11;             // 0x04DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x04DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x04DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A13[0x1];                                     // 0x04DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_5;                // 0x0500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_4;  // 0x0518(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_5;  // 0x0610(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_2;           // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_3;           // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_4;           // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_5;           // 0x071C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript");
static_assert(sizeof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript) == 0x000720, "Wrong size on BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000008, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Roll) == 0x000018, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Pitch) == 0x00001C, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Yaw) == 0x000020, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Roll_1) == 0x000040, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Pitch_1) == 0x000044, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Yaw_1) == 0x000048, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000050, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_1) == 0x000148, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x000160, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000258, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Roll_2) == 0x000260, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Pitch_2) == 0x000264, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Yaw_2) == 0x000268, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_2) == 0x000270, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000288, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult_2) == 0x000290, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000388, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_2) == 0x000389, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_3) == 0x00038A, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_4) == 0x00038B, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_5) == 0x00038C, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_6) == 0x00038D, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_7) == 0x00038E, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000390, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000398, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Roll_3) == 0x0003A0, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Pitch_3) == 0x0003A4, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Yaw_3) == 0x0003A8, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_3) == 0x0003B0, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult_3) == 0x0003C8, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Roll_4) == 0x0004C0, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Roll_4' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Pitch_4) == 0x0004C4, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Pitch_4' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Yaw_4) == 0x0004C8, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Yaw_4' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Roll_5) == 0x0004CC, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Roll_5' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Pitch_5) == 0x0004D0, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Pitch_5' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_BreakRotator_Yaw_5) == 0x0004D4, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_BreakRotator_Yaw_5' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_8) == 0x0004D8, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_9) == 0x0004D9, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_10) == 0x0004DA, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_11) == 0x0004DB, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x0004DC, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess_1) == 0x0004DD, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess_2) == 0x0004DE, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0004E0, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_4) == 0x0004E8, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_5) == 0x000500, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult_4) == 0x000518, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult_5) == 0x000610, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult_5' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000708, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast_1) == 0x00070C, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast_2) == 0x000710, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast_3) == 0x000714, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast_4) == 0x000718, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast_5) == 0x00071C, "Member 'BP_Shipping_Container_05_Mediun_Open_01_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast_5' has a wrong offset!");

}

