#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpiderMine_PreviewComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SpiderMine_PreviewComponent.BP_SpiderMine_PreviewComponent_C
// 0x0030 (0x0318 - 0x02E8)
class UBP_SpiderMine_PreviewComponent_C final : public UGzSpiderMine_PreviewComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_SpiderMine_LinkPreviewActor_C*      LinkActor;                                         // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      LineTraceObjects;                                  // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnFinish;                                          // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_SpiderMine_PreviewComponent(int32 EntryPoint);
	void OnFinish__DelegateSignature();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SpawnSpiderMine_PreviewActor();
	void UpdateLinkLine(const struct FVector& Start, const struct FVector& End);
	void UpdateLinkPreviewActor(bool bCanShow, bool bValid, const struct FVector& Start, const struct FVector& End);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SpiderMine_PreviewComponent_C">();
	}
	static class UBP_SpiderMine_PreviewComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SpiderMine_PreviewComponent_C>();
	}
};
static_assert(alignof(UBP_SpiderMine_PreviewComponent_C) == 0x000008, "Wrong alignment on UBP_SpiderMine_PreviewComponent_C");
static_assert(sizeof(UBP_SpiderMine_PreviewComponent_C) == 0x000318, "Wrong size on UBP_SpiderMine_PreviewComponent_C");
static_assert(offsetof(UBP_SpiderMine_PreviewComponent_C, UberGraphFrame) == 0x0002E8, "Member 'UBP_SpiderMine_PreviewComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SpiderMine_PreviewComponent_C, LinkActor) == 0x0002F0, "Member 'UBP_SpiderMine_PreviewComponent_C::LinkActor' has a wrong offset!");
static_assert(offsetof(UBP_SpiderMine_PreviewComponent_C, LineTraceObjects) == 0x0002F8, "Member 'UBP_SpiderMine_PreviewComponent_C::LineTraceObjects' has a wrong offset!");
static_assert(offsetof(UBP_SpiderMine_PreviewComponent_C, OnFinish) == 0x000308, "Member 'UBP_SpiderMine_PreviewComponent_C::OnFinish' has a wrong offset!");

}

