#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Shipping_Container_04_Medium_01

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Shipping_Container_04_Medium_01.BP_Shipping_Container_04_Medium_01_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct BP_Shipping_Container_04_Medium_01_C_UserConstructionScript final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shipping_Container_04_Medium_01_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_Shipping_Container_04_Medium_01_C_UserConstructionScript");
static_assert(sizeof(BP_Shipping_Container_04_Medium_01_C_UserConstructionScript) == 0x000004, "Wrong size on BP_Shipping_Container_04_Medium_01_C_UserConstructionScript");
static_assert(offsetof(BP_Shipping_Container_04_Medium_01_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BP_Shipping_Container_04_Medium_01_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_01_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess_1) == 0x000001, "Member 'BP_Shipping_Container_04_Medium_01_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_01_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess_2) == 0x000002, "Member 'BP_Shipping_Container_04_Medium_01_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Shipping_Container_04_Medium_01_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess_3) == 0x000003, "Member 'BP_Shipping_Container_04_Medium_01_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");

}

