#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScreenShake_LMG_LMG02_ADJ_AMR_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ScreenShake_LMG_LMG02_ADJ_AMR_01.BP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C
// 0x0020 (0x0220 - 0x0200)
class UBP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C final : public UGzLegacyCameraShake
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0200(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        FOVOscillationToPercentCoefficient;                // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FOVOscillationPercentage;                          // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ScreenShake_LMG_LMG02_ADJ_AMR_01(int32 EntryPoint);
	void GetFOVOscillationByPercentage(double* Param_FOVOscillation);
	void GetLocOscillationXAmplitude(double* XAmplitude);
	void GetStartWidth(double* StartWidth);
	void ReceivePlayShake(float Scale);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C">();
	}
	static class UBP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C>();
	}
};
static_assert(alignof(UBP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C) == 0x000010, "Wrong alignment on UBP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C");
static_assert(sizeof(UBP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C) == 0x000220, "Wrong size on UBP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C");
static_assert(offsetof(UBP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C, UberGraphFrame) == 0x000200, "Member 'UBP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C, FOVOscillationToPercentCoefficient) == 0x000208, "Member 'UBP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C::FOVOscillationToPercentCoefficient' has a wrong offset!");
static_assert(offsetof(UBP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C, FOVOscillationPercentage) == 0x000210, "Member 'UBP_ScreenShake_LMG_LMG02_ADJ_AMR_01_C::FOVOscillationPercentage' has a wrong offset!");

}

