#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShadowBot

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ShadowBot.BP_ShadowBot_C.SelectRandomSkin
// 0x0004 (0x0004 - 0x0000)
struct BP_ShadowBot_C_SelectRandomSkin final
{
public:
	int32                                         Param_LoopNum;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShadowBot_C_SelectRandomSkin) == 0x000004, "Wrong alignment on BP_ShadowBot_C_SelectRandomSkin");
static_assert(sizeof(BP_ShadowBot_C_SelectRandomSkin) == 0x000004, "Wrong size on BP_ShadowBot_C_SelectRandomSkin");
static_assert(offsetof(BP_ShadowBot_C_SelectRandomSkin, Param_LoopNum) == 0x000000, "Member 'BP_ShadowBot_C_SelectRandomSkin::Param_LoopNum' has a wrong offset!");

// Function BP_ShadowBot.BP_ShadowBot_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ShadowBot_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShadowBot_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ShadowBot_C_ReceiveTick");
static_assert(sizeof(BP_ShadowBot_C_ReceiveTick) == 0x000004, "Wrong size on BP_ShadowBot_C_ReceiveTick");
static_assert(offsetof(BP_ShadowBot_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ShadowBot_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ShadowBot.BP_ShadowBot_C.IsMovingOnGround
// 0x0020 (0x0020 - 0x0000)
struct BP_ShadowBot_C_IsMovingOnGround final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5720[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class APawn*                            CallFunc_GetControlledPawn_ReturnValue;            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMovingOnGround_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShadowBot_C_IsMovingOnGround) == 0x000008, "Wrong alignment on BP_ShadowBot_C_IsMovingOnGround");
static_assert(sizeof(BP_ShadowBot_C_IsMovingOnGround) == 0x000020, "Wrong size on BP_ShadowBot_C_IsMovingOnGround");
static_assert(offsetof(BP_ShadowBot_C_IsMovingOnGround, ReturnValue) == 0x000000, "Member 'BP_ShadowBot_C_IsMovingOnGround::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsMovingOnGround, CallFunc_GetControlledPawn_ReturnValue) == 0x000008, "Member 'BP_ShadowBot_C_IsMovingOnGround::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsMovingOnGround, K2Node_DynamicCast_AsGz_Player_Character) == 0x000010, "Member 'BP_ShadowBot_C_IsMovingOnGround::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsMovingOnGround, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ShadowBot_C_IsMovingOnGround::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsMovingOnGround, CallFunc_IsMovingOnGround_ReturnValue) == 0x000019, "Member 'BP_ShadowBot_C_IsMovingOnGround::CallFunc_IsMovingOnGround_ReturnValue' has a wrong offset!");

// Function BP_ShadowBot.BP_ShadowBot_C.IsFalling
// 0x0020 (0x0020 - 0x0000)
struct BP_ShadowBot_C_IsFalling final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5721[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class APawn*                            CallFunc_GetControlledPawn_ReturnValue;            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShadowBot_C_IsFalling) == 0x000008, "Wrong alignment on BP_ShadowBot_C_IsFalling");
static_assert(sizeof(BP_ShadowBot_C_IsFalling) == 0x000020, "Wrong size on BP_ShadowBot_C_IsFalling");
static_assert(offsetof(BP_ShadowBot_C_IsFalling, ReturnValue) == 0x000000, "Member 'BP_ShadowBot_C_IsFalling::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsFalling, CallFunc_GetControlledPawn_ReturnValue) == 0x000008, "Member 'BP_ShadowBot_C_IsFalling::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsFalling, K2Node_DynamicCast_AsGz_Player_Character) == 0x000010, "Member 'BP_ShadowBot_C_IsFalling::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsFalling, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ShadowBot_C_IsFalling::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsFalling, CallFunc_IsFalling_ReturnValue) == 0x000019, "Member 'BP_ShadowBot_C_IsFalling::CallFunc_IsFalling_ReturnValue' has a wrong offset!");

// Function BP_ShadowBot.BP_ShadowBot_C.IsEnemyVisible
// 0x0158 (0x0158 - 0x0000)
struct BP_ShadowBot_C_IsEnemyVisible final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5722[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class APawn*                            CallFunc_GetControlledPawn_ReturnValue;            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5723[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0058(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShadowBot_C_IsEnemyVisible) == 0x000008, "Wrong alignment on BP_ShadowBot_C_IsEnemyVisible");
static_assert(sizeof(BP_ShadowBot_C_IsEnemyVisible) == 0x000158, "Wrong size on BP_ShadowBot_C_IsEnemyVisible");
static_assert(offsetof(BP_ShadowBot_C_IsEnemyVisible, Return) == 0x000000, "Member 'BP_ShadowBot_C_IsEnemyVisible::Return' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsEnemyVisible, CallFunc_GetControlledPawn_ReturnValue) == 0x000008, "Member 'BP_ShadowBot_C_IsEnemyVisible::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsEnemyVisible, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_ShadowBot_C_IsEnemyVisible::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsEnemyVisible, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_ShadowBot_C_IsEnemyVisible::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsEnemyVisible, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_ShadowBot_C_IsEnemyVisible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsEnemyVisible, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000040, "Member 'BP_ShadowBot_C_IsEnemyVisible::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsEnemyVisible, CallFunc_LineTraceSingle_OutHit) == 0x000058, "Member 'BP_ShadowBot_C_IsEnemyVisible::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsEnemyVisible, CallFunc_LineTraceSingle_ReturnValue) == 0x000150, "Member 'BP_ShadowBot_C_IsEnemyVisible::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsEnemyVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000151, "Member 'BP_ShadowBot_C_IsEnemyVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_ShadowBot.BP_ShadowBot_C.IsDeploymentPawn
// 0x0030 (0x0030 - 0x0000)
struct BP_ShadowBot_C_IsDeploymentPawn final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5724[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerController*                    CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5725[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzDeploymentPawn*                      K2Node_DynamicCast_AsGz_Deployment_Pawn;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShadowBot_C_IsDeploymentPawn) == 0x000008, "Wrong alignment on BP_ShadowBot_C_IsDeploymentPawn");
static_assert(sizeof(BP_ShadowBot_C_IsDeploymentPawn) == 0x000030, "Wrong size on BP_ShadowBot_C_IsDeploymentPawn");
static_assert(offsetof(BP_ShadowBot_C_IsDeploymentPawn, Return) == 0x000000, "Member 'BP_ShadowBot_C_IsDeploymentPawn::Return' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsDeploymentPawn, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_ShadowBot_C_IsDeploymentPawn::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsDeploymentPawn, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_ShadowBot_C_IsDeploymentPawn::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsDeploymentPawn, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_ShadowBot_C_IsDeploymentPawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsDeploymentPawn, K2Node_DynamicCast_AsGz_Deployment_Pawn) == 0x000020, "Member 'BP_ShadowBot_C_IsDeploymentPawn::K2Node_DynamicCast_AsGz_Deployment_Pawn' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_IsDeploymentPawn, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ShadowBot_C_IsDeploymentPawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ShadowBot.BP_ShadowBot_C.ExecuteUbergraph_BP_ShadowBot
// 0x02C0 (0x02C0 - 0x0000)
struct BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5726[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemyVisible_Return;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5727[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_6;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_7;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_8;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPawn_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWingSuiteMoveMode_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5728[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_9;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5729[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_10;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_11;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_12;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_13;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class APawn*                            CallFunc_GetControlledPawn_ReturnValue;            // 0x0090(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzBaseCharacter*                       K2Node_DynamicCast_AsGz_Base_Character;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_572A[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_14;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_FindClosestEnemy_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class APawn*                            CallFunc_GetControlledPawn_ReturnValue_1;          // 0x00B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class APawn*                            CallFunc_GetControlledPawn_ReturnValue_2;          // 0x00C0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_572B[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzAdvancedCameraParamsComponent*       CallFunc_GetAdvancedCameraComponent_ReturnValue;   // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraLocationObject*              CallFunc_GetCameraLocationObject_ReturnValue;      // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_572C[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_572D[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_572E[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerController*                    CallFunc_GetPlayerController_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_572F[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_15;        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_16;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeploymentPawn_Return;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5730[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_17;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class APawn*                            CallFunc_GetControlledPawn_ReturnValue_3;          // 0x01A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_18;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWingSuiteMoveMode_ReturnValue_1;        // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5731[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_19;        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5732[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPawn_ReturnValue_1;                    // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5733[0x6];                                     // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_20;        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5734[0x6];                                     // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_21;        // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRandomDeviationFloat_ReturnValue;      // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRandomDeviationFloat_ReturnValue_1;    // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRandomDeviationFloat_ReturnValue_2;    // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5735[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_22;        // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_23;        // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_24;        // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_2;            // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_3;            // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_4;            // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_5;            // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_6;            // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_7;            // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_8;            // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_9;            // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_10;           // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_11;           // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_12;           // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_13;           // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_14;           // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_15;           // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_16;           // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_17;           // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_18;           // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_19;           // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_20;           // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_21;           // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_22;           // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_23;           // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_24;           // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot) == 0x000008, "Wrong alignment on BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot");
static_assert(sizeof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot) == 0x0002C0, "Wrong size on BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, EntryPoint) == 0x000000, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000010, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_IsEnemyVisible_Return) == 0x000018, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_IsEnemyVisible_Return' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000020, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000028, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000030, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x000038, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_6) == 0x000040, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_7) == 0x000048, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_8) == 0x000050, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_HasPawn_ReturnValue) == 0x000058, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_HasPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_IsWingSuiteMoveMode_ReturnValue) == 0x000059, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_IsWingSuiteMoveMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_9) == 0x000060, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_BooleanAND_ReturnValue) == 0x000069, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_10) == 0x000070, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_11) == 0x000078, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_12) == 0x000080, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_13) == 0x000088, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_GetControlledPawn_ReturnValue) == 0x000090, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, K2Node_DynamicCast_AsGz_Base_Character) == 0x000098, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::K2Node_DynamicCast_AsGz_Base_Character' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_14) == 0x0000A8, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_FindClosestEnemy_ReturnValue) == 0x0000B0, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_FindClosestEnemy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_GetControlledPawn_ReturnValue_1) == 0x0000B8, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_GetControlledPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_GetControlledPawn_ReturnValue_2) == 0x0000C0, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_GetControlledPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000C8, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, K2Node_DynamicCast_AsGz_Player_Character) == 0x0000E0, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F0, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_GetAdvancedCameraComponent_ReturnValue) == 0x000108, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_GetAdvancedCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_GetCameraLocationObject_ReturnValue) == 0x000110, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_GetCameraLocationObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_GetCameraLocation_ReturnValue) == 0x000118, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, Temp_int_Variable) == 0x000130, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000138, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Less_IntInt_ReturnValue) == 0x000150, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_FindLookAtRotation_ReturnValue) == 0x000158, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_GetPlayerController_ReturnValue) == 0x000178, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, K2Node_Event_DeltaSeconds) == 0x000180, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_15) == 0x000188, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_16) == 0x000190, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_IsDeploymentPawn_Return) == 0x000198, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_IsDeploymentPawn_Return' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_17) == 0x0001A0, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_GetControlledPawn_ReturnValue_3) == 0x0001A8, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_GetControlledPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_18) == 0x0001B0, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_GetActorRightVector_ReturnValue) == 0x0001B8, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0001D0, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_IsWingSuiteMoveMode_ReturnValue_1) == 0x0001E8, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_IsWingSuiteMoveMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_19) == 0x0001F0, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001F8, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000200, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_IsFalling_ReturnValue) == 0x000208, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_HasPawn_ReturnValue_1) == 0x000209, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_HasPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_20) == 0x000210, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_BooleanAND_ReturnValue_1) == 0x000218, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_BooleanAND_ReturnValue_2) == 0x000219, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_21) == 0x000220, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_GetRandomDeviationFloat_ReturnValue) == 0x000228, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_GetRandomDeviationFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_GetRandomDeviationFloat_ReturnValue_1) == 0x00022C, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_GetRandomDeviationFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_GetRandomDeviationFloat_ReturnValue_2) == 0x000230, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_GetRandomDeviationFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_22) == 0x000238, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_23) == 0x000240, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomFloatInRange_ReturnValue_24) == 0x000248, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomFloatInRange_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000250, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Subtract_IntInt_ReturnValue) == 0x000254, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast) == 0x000258, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_1) == 0x00025C, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_2) == 0x000260, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_3) == 0x000264, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_4) == 0x000268, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_5) == 0x00026C, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_6) == 0x000270, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_7) == 0x000274, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_8) == 0x000278, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_9) == 0x00027C, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_10) == 0x000280, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_10' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_11) == 0x000284, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_11' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_12) == 0x000288, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_12' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_13) == 0x00028C, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_13' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_14) == 0x000290, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_14' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_15) == 0x000294, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_15' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_16) == 0x000298, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_16' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_17) == 0x00029C, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_17' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_18) == 0x0002A0, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_18' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_19) == 0x0002A4, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_19' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_20) == 0x0002A8, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_20' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_21) == 0x0002AC, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_21' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_22) == 0x0002B0, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_22' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_23) == 0x0002B4, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_23' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot, CallFunc_Delay_Duration_ImplicitCast_24) == 0x0002B8, "Member 'BP_ShadowBot_C_ExecuteUbergraph_BP_ShadowBot::CallFunc_Delay_Duration_ImplicitCast_24' has a wrong offset!");

// Function BP_ShadowBot.BP_ShadowBot_C.EquipRandomLimb
// 0x0001 (0x0001 - 0x0000)
struct BP_ShadowBot_C_EquipRandomLimb final
{
public:
	EGzLimbType                                   LimbType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShadowBot_C_EquipRandomLimb) == 0x000001, "Wrong alignment on BP_ShadowBot_C_EquipRandomLimb");
static_assert(sizeof(BP_ShadowBot_C_EquipRandomLimb) == 0x000001, "Wrong size on BP_ShadowBot_C_EquipRandomLimb");
static_assert(offsetof(BP_ShadowBot_C_EquipRandomLimb, LimbType) == 0x000000, "Member 'BP_ShadowBot_C_EquipRandomLimb::LimbType' has a wrong offset!");

// Function BP_ShadowBot.BP_ShadowBot_C.DoShoot
// 0x0010 (0x0010 - 0x0000)
struct BP_ShadowBot_C_DoShoot final
{
public:
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SimulateKeyPressedAndReleased_Delay_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShadowBot_C_DoShoot) == 0x000008, "Wrong alignment on BP_ShadowBot_C_DoShoot");
static_assert(sizeof(BP_ShadowBot_C_DoShoot) == 0x000010, "Wrong size on BP_ShadowBot_C_DoShoot");
static_assert(offsetof(BP_ShadowBot_C_DoShoot, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'BP_ShadowBot_C_DoShoot::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowBot_C_DoShoot, CallFunc_SimulateKeyPressedAndReleased_Delay_ImplicitCast) == 0x000008, "Member 'BP_ShadowBot_C_DoShoot::CallFunc_SimulateKeyPressedAndReleased_Delay_ImplicitCast' has a wrong offset!");

// Function BP_ShadowBot.BP_ShadowBot_C.CalculateMovementTime
// 0x01C0 (0x01C0 - 0x0000)
struct BP_ShadowBot_C_CalculateMovementTime final
{
public:
	struct FVector                                Dir;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class APawn*                            CallFunc_GetControlledPawn_ReturnValue;            // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Up_ReturnValue;                    // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x00C0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShadowBot_C_CalculateMovementTime) == 0x000008, "Wrong alignment on BP_ShadowBot_C_CalculateMovementTime");
static_assert(sizeof(BP_ShadowBot_C_CalculateMovementTime) == 0x0001C0, "Wrong size on BP_ShadowBot_C_CalculateMovementTime");
