#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SuperSprintComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SuperSprintComponent.BP_SuperSprintComponent_C
// 0x0010 (0x0178 - 0x0168)
class UBP_SuperSprintComponent_C final : public UGzSuperSprintComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0168(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         ProgressUIHandle;                                  // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReceivedDuration;                                  // 0x0174(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SuperSprintComponent(int32 EntryPoint);
	void OnActivationChanged(bool Param_bIsActive);
	void OnRep_SuperSprintDurationLeft();
	void ReceiveBeginPlay();
	void ShowProgressLog();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SuperSprintComponent_C">();
	}
	static class UBP_SuperSprintComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SuperSprintComponent_C>();
	}
};
static_assert(alignof(UBP_SuperSprintComponent_C) == 0x000008, "Wrong alignment on UBP_SuperSprintComponent_C");
static_assert(sizeof(UBP_SuperSprintComponent_C) == 0x000178, "Wrong size on UBP_SuperSprintComponent_C");
static_assert(offsetof(UBP_SuperSprintComponent_C, UberGraphFrame) == 0x000168, "Member 'UBP_SuperSprintComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SuperSprintComponent_C, ProgressUIHandle) == 0x000170, "Member 'UBP_SuperSprintComponent_C::ProgressUIHandle' has a wrong offset!");
static_assert(offsetof(UBP_SuperSprintComponent_C, ReceivedDuration) == 0x000174, "Member 'UBP_SuperSprintComponent_C::ReceivedDuration' has a wrong offset!");

}

