#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpiderMine_LinkPreviewActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SpiderMine_LinkPreviewActor.BP_SpiderMine_LinkPreviewActor_C.ExecuteUbergraph_BP_SpiderMine_LinkPreviewActor
// 0x0020 (0x0020 - 0x0000)
struct BP_SpiderMine_LinkPreviewActor_C_ExecuteUbergraph_BP_SpiderMine_LinkPreviewActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D17[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Value;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpiderMine_LinkPreviewActor_C_ExecuteUbergraph_BP_SpiderMine_LinkPreviewActor) == 0x000008, "Wrong alignment on BP_SpiderMine_LinkPreviewActor_C_ExecuteUbergraph_BP_SpiderMine_LinkPreviewActor");
static_assert(sizeof(BP_SpiderMine_LinkPreviewActor_C_ExecuteUbergraph_BP_SpiderMine_LinkPreviewActor) == 0x000020, "Wrong size on BP_SpiderMine_LinkPreviewActor_C_ExecuteUbergraph_BP_SpiderMine_LinkPreviewActor");
static_assert(offsetof(BP_SpiderMine_LinkPreviewActor_C_ExecuteUbergraph_BP_SpiderMine_LinkPreviewActor, EntryPoint) == 0x000000, "Member 'BP_SpiderMine_LinkPreviewActor_C_ExecuteUbergraph_BP_SpiderMine_LinkPreviewActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_LinkPreviewActor_C_ExecuteUbergraph_BP_SpiderMine_LinkPreviewActor, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_SpiderMine_LinkPreviewActor_C_ExecuteUbergraph_BP_SpiderMine_LinkPreviewActor::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_LinkPreviewActor_C_ExecuteUbergraph_BP_SpiderMine_LinkPreviewActor, K2Node_CustomEvent_Value) == 0x000010, "Member 'BP_SpiderMine_LinkPreviewActor_C_ExecuteUbergraph_BP_SpiderMine_LinkPreviewActor::K2Node_CustomEvent_Value' has a wrong offset!");

// Function BP_SpiderMine_LinkPreviewActor.BP_SpiderMine_LinkPreviewActor_C.UpdateColor
// 0x0010 (0x0010 - 0x0000)
struct BP_SpiderMine_LinkPreviewActor_C_UpdateColor final
{
public:
	struct FLinearColor                           Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpiderMine_LinkPreviewActor_C_UpdateColor) == 0x000004, "Wrong alignment on BP_SpiderMine_LinkPreviewActor_C_UpdateColor");
static_assert(sizeof(BP_SpiderMine_LinkPreviewActor_C_UpdateColor) == 0x000010, "Wrong size on BP_SpiderMine_LinkPreviewActor_C_UpdateColor");
static_assert(offsetof(BP_SpiderMine_LinkPreviewActor_C_UpdateColor, Value) == 0x000000, "Member 'BP_SpiderMine_LinkPreviewActor_C_UpdateColor::Value' has a wrong offset!");

}

