#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SuperSprintComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SuperSprintComponent.BP_SuperSprintComponent_C.ExecuteUbergraph_BP_SuperSprintComponent
// 0x0048 (0x0048 - 0x0000)
struct BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EF6[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzProgressLogUISubsystem*              CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzGA_BaseLimbAbility*            CallFunc_GetLimbAbility_ReturnValue;               // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsActive)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsActive;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EF7[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzProgressLogUISubsystem*              CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EF8[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartProgress_ReturnValue;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent) == 0x000008, "Wrong alignment on BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent");
static_assert(sizeof(BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent) == 0x000048, "Wrong size on BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent");
static_assert(offsetof(BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent, EntryPoint) == 0x000000, "Member 'BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent, CallFunc_GetLimbAbility_ReturnValue) == 0x000010, "Member 'BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent::CallFunc_GetLimbAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent, K2Node_CustomEvent_bIsActive) == 0x000028, "Member 'BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent::K2Node_CustomEvent_bIsActive' has a wrong offset!");
static_assert(offsetof(BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000030, "Member 'BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent, CallFunc_StartProgress_ReturnValue) == 0x00003C, "Member 'BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent::CallFunc_StartProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000040, "Member 'BP_SuperSprintComponent_C_ExecuteUbergraph_BP_SuperSprintComponent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");

// Function BP_SuperSprintComponent.BP_SuperSprintComponent_C.OnActivationChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_SuperSprintComponent_C_OnActivationChanged final
{
public:
	bool                                          Param_bIsActive;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuperSprintComponent_C_OnActivationChanged) == 0x000001, "Wrong alignment on BP_SuperSprintComponent_C_OnActivationChanged");
static_assert(sizeof(BP_SuperSprintComponent_C_OnActivationChanged) == 0x000001, "Wrong size on BP_SuperSprintComponent_C_OnActivationChanged");
static_assert(offsetof(BP_SuperSprintComponent_C_OnActivationChanged, Param_bIsActive) == 0x000000, "Member 'BP_SuperSprintComponent_C_OnActivationChanged::Param_bIsActive' has a wrong offset!");

}

