#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpiderMine_PreviewComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function BP_SpiderMine_PreviewComponent.BP_SpiderMine_PreviewComponent_C.ExecuteUbergraph_BP_SpiderMine_PreviewComponent
// 0x0170 (0x0170 - 0x0000)
struct BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCanShow;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bValid;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D12[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Start;                                // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_End;                                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D13[0x8];                                     // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D14[0xF];                                     // 0x00A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   CallFunc_GetLimbType_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D15[0x3];                                     // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_SpiderMine_LinkPreviewActor_C*      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_SpiderMine_PreviewActor_C*          CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D16[0x6];                                     // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent) == 0x000010, "Wrong alignment on BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent");
static_assert(sizeof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent) == 0x000170, "Wrong size on BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, EntryPoint) == 0x000000, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, K2Node_Event_bCanShow) == 0x000004, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::K2Node_Event_bCanShow' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, K2Node_Event_bValid) == 0x000005, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::K2Node_Event_bValid' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, K2Node_Event_Start) == 0x000008, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::K2Node_Event_Start' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, K2Node_Event_End) == 0x000020, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::K2Node_Event_End' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, CallFunc_Not_PreBool_ReturnValue) == 0x0000A0, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, CallFunc_MakeTransform_ReturnValue_1) == 0x0000B0, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, K2Node_MakeStruct_LinearColor) == 0x000110, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, K2Node_MakeStruct_LinearColor_1) == 0x000120, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, K2Node_Event_DeltaSeconds) == 0x000130, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, CallFunc_GetLimbType_ReturnValue) == 0x000134, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::CallFunc_GetLimbType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, CallFunc_GetOwner_ReturnValue) == 0x000138, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000140, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000148, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, CallFunc_FinishSpawningActor_ReturnValue) == 0x000150, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000158, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, CallFunc_K2_AttachToActor_ReturnValue) == 0x000160, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::CallFunc_K2_AttachToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, CallFunc_IsValid_ReturnValue) == 0x000161, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent, CallFunc_SetDoublePropertyByName_Value_ImplicitCast) == 0x000168, "Member 'BP_SpiderMine_PreviewComponent_C_ExecuteUbergraph_BP_SpiderMine_PreviewComponent::CallFunc_SetDoublePropertyByName_Value_ImplicitCast' has a wrong offset!");

// Function BP_SpiderMine_PreviewComponent.BP_SpiderMine_PreviewComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SpiderMine_PreviewComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpiderMine_PreviewComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SpiderMine_PreviewComponent_C_ReceiveTick");
static_assert(sizeof(BP_SpiderMine_PreviewComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_SpiderMine_PreviewComponent_C_ReceiveTick");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SpiderMine_PreviewComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SpiderMine_PreviewComponent.BP_SpiderMine_PreviewComponent_C.UpdateLinkLine
// 0x0200 (0x0200 - 0x0000)
struct BP_SpiderMine_PreviewComponent_C_UpdateLinkLine final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0100(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpiderMine_PreviewComponent_C_UpdateLinkLine) == 0x000010, "Wrong alignment on BP_SpiderMine_PreviewComponent_C_UpdateLinkLine");
static_assert(sizeof(BP_SpiderMine_PreviewComponent_C_UpdateLinkLine) == 0x000200, "Wrong size on BP_SpiderMine_PreviewComponent_C_UpdateLinkLine");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkLine, Start) == 0x000000, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkLine::Start' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkLine, End) == 0x000018, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkLine::End' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkLine, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000030, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkLine::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkLine, CallFunc_Normal_ReturnValue) == 0x000048, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkLine::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkLine, CallFunc_VSize_ReturnValue) == 0x000060, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkLine::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkLine, CallFunc_MakeRotFromZ_ReturnValue) == 0x000068, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkLine::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkLine, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000080, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkLine::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkLine, CallFunc_MakeVector_ReturnValue) == 0x000088, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkLine::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkLine, CallFunc_MakeTransform_ReturnValue) == 0x0000A0, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkLine::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkLine, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000100, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkLine::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkLine, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0001F8, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkLine::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function BP_SpiderMine_PreviewComponent.BP_SpiderMine_PreviewComponent_C.UpdateLinkPreviewActor
// 0x0038 (0x0038 - 0x0000)
struct BP_SpiderMine_PreviewComponent_C_UpdateLinkPreviewActor final
{
public:
	bool                                          bCanShow;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bValid;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D17[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Start;                                             // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpiderMine_PreviewComponent_C_UpdateLinkPreviewActor) == 0x000008, "Wrong alignment on BP_SpiderMine_PreviewComponent_C_UpdateLinkPreviewActor");
static_assert(sizeof(BP_SpiderMine_PreviewComponent_C_UpdateLinkPreviewActor) == 0x000038, "Wrong size on BP_SpiderMine_PreviewComponent_C_UpdateLinkPreviewActor");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkPreviewActor, bCanShow) == 0x000000, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkPreviewActor::bCanShow' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkPreviewActor, bValid) == 0x000001, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkPreviewActor::bValid' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkPreviewActor, Start) == 0x000008, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkPreviewActor::Start' has a wrong offset!");
static_assert(offsetof(BP_SpiderMine_PreviewComponent_C_UpdateLinkPreviewActor, End) == 0x000020, "Member 'BP_SpiderMine_PreviewComponent_C_UpdateLinkPreviewActor::End' has a wrong offset!");

}

