#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineSoundShape

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SplineSoundShape.BP_SplineSoundShape_C.ExecuteUbergraph_BP_SplineSoundShape
// 0x0230 (0x0230 - 0x0000)
struct BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAkMultiPositionType                          Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAkMultiPositionType                          Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68DF[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68E0[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_ConvertSplineToPolyLine_OutPoints;        // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_ConvertSplineToPolyLine_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68E1[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68E2[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68E3[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68E4[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68E5[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68E6[0x2];                                     // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68E7[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68E8[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPointInPolygon_ReturnValue;             // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68E9[0x3];                                     // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAkMultiPositionType                          K2Node_Select_Default;                             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68EA[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClosedLoop_ReturnValue;                 // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68EB[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     K2Node_MakeArray_Array;                            // 0x0208(0x0010)(ReferenceParm)
	TArray<struct FTransform>                     K2Node_Select_Default_1;                           // 0x0218(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape) == 0x000010, "Wrong alignment on BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape");
static_assert(sizeof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape) == 0x000230, "Wrong size on BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, EntryPoint) == 0x000000, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, Temp_bool_Variable) == 0x000005, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, Temp_byte_Variable) == 0x000007, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, Temp_byte_Variable_1) == 0x000008, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, Temp_delegate_Variable) == 0x000010, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_ConvertSplineToPolyLine_OutPoints) == 0x000028, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_ConvertSplineToPolyLine_OutPoints' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_ConvertSplineToPolyLine_ReturnValue) == 0x000038, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_ConvertSplineToPolyLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_BreakVector_X) == 0x0000C0, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_BreakVector_Y) == 0x0000C8, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_BreakVector_Z) == 0x0000D0, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_Array_Add_ReturnValue) == 0x0000D8, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_MakeVector2D_ReturnValue) == 0x0000E0, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, Temp_bool_Variable_1) == 0x0000F0, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x0000F4, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, K2Node_Event_DeltaSeconds) == 0x0000F8, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_GetPlayerController_ReturnValue) == 0x000100, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, Temp_int_Loop_Counter_Variable) == 0x000108, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_IsValid_ReturnValue) == 0x00010C, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_Less_IntInt_ReturnValue) == 0x00010D, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_Add_IntInt_ReturnValue) == 0x000110, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_K2_GetPawn_ReturnValue) == 0x000118, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_IsValid_ReturnValue_1) == 0x000120, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000128, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_BreakVector_X_1) == 0x000140, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_BreakVector_Y_1) == 0x000148, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_BreakVector_Z_1) == 0x000150, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_MakeVector2D_ReturnValue_1) == 0x000158, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_Array_Add_ReturnValue_1) == 0x000168, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_IsPointInPolygon_ReturnValue) == 0x00016C, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_IsPointInPolygon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_GetPlayerController_ReturnValue_1) == 0x000170, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, K2Node_Select_Default) == 0x000178, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000180, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000188, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_MakeTransform_ReturnValue_1) == 0x0001A0, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_IsClosedLoop_ReturnValue) == 0x000200, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_IsClosedLoop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, K2Node_MakeArray_Array) == 0x000208, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, K2Node_Select_Default_1) == 0x000218, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape, CallFunc_BooleanAND_ReturnValue) == 0x000228, "Member 'BP_SplineSoundShape_C_ExecuteUbergraph_BP_SplineSoundShape::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SplineSoundShape.BP_SplineSoundShape_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SplineSoundShape_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineSoundShape_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SplineSoundShape_C_ReceiveTick");
static_assert(sizeof(BP_SplineSoundShape_C_ReceiveTick) == 0x000004, "Wrong size on BP_SplineSoundShape_C_ReceiveTick");
static_assert(offsetof(BP_SplineSoundShape_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SplineSoundShape_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SplineSoundShape.BP_SplineSoundShape_C.UserConstructionScript
// 0x0090 (0x0090 - 0x0000)
struct BP_SplineSoundShape_C_UserConstructionScript final
{
public:
	class USplineMeshComponent*                   SplineMesh;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68EC[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtSplinePoint_ReturnValue;    // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68ED[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68EE[0x2];                                     // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineSoundShape_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_SplineSoundShape_C_UserConstructionScript");
static_assert(sizeof(BP_SplineSoundShape_C_UserConstructionScript) == 0x000090, "Wrong size on BP_SplineSoundShape_C_UserConstructionScript");
static_assert(offsetof(BP_SplineSoundShape_C_UserConstructionScript, SplineMesh) == 0x000000, "Member 'BP_SplineSoundShape_C_UserConstructionScript::SplineMesh' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_UserConstructionScript, Temp_int_Variable) == 0x000008, "Member 'BP_SplineSoundShape_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_UserConstructionScript, CallFunc_GetTransformAtSplinePoint_ReturnValue) == 0x000010, "Member 'BP_SplineSoundShape_C_UserConstructionScript::CallFunc_GetTransformAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000070, "Member 'BP_SplineSoundShape_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000078, "Member 'BP_SplineSoundShape_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000080, "Member 'BP_SplineSoundShape_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000084, "Member 'BP_SplineSoundShape_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000085, "Member 'BP_SplineSoundShape_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSoundShape_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000088, "Member 'BP_SplineSoundShape_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

