#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkyNavRoute_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SkyNavRoute_Base.BP_SkyNavRoute_Base_C.UserConstructionScript
// 0x0080 (0x0080 - 0x0000)
struct BP_SkyNavRoute_Base_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA4[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA5[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
};
static_assert(alignof(BP_SkyNavRoute_Base_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_SkyNavRoute_Base_C_UserConstructionScript");
static_assert(sizeof(BP_SkyNavRoute_Base_C_UserConstructionScript) == 0x000080, "Wrong size on BP_SkyNavRoute_Base_C_UserConstructionScript");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UserConstructionScript, CallFunc_IsWithEditor_ReturnValue) == 0x000000, "Member 'BP_SkyNavRoute_Base_C_UserConstructionScript::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000004, "Member 'BP_SkyNavRoute_Base_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BP_SkyNavRoute_Base_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UserConstructionScript, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'BP_SkyNavRoute_Base_C_UserConstructionScript::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UserConstructionScript, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BP_SkyNavRoute_Base_C_UserConstructionScript::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000060, "Member 'BP_SkyNavRoute_Base_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UserConstructionScript, CallFunc_Format_ReturnValue) == 0x000070, "Member 'BP_SkyNavRoute_Base_C_UserConstructionScript::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_SkyNavRoute_Base.BP_SkyNavRoute_Base_C.UpdateSplinePointsDetails
// 0x02D8 (0x02D8 - 0x0000)
struct BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails final
{
public:
	struct FRotator                               L_GateRot;                                         // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                L_GateLoc;                                         // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0040(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA6[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA7[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SkyNavGate_C*                       CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA8[0x2];                                     // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA9[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionAtSplinePoint_ReturnValue;    // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetDirectionAtSplinePoint_ReturnValue_1;  // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionAtSplinePoint_ReturnValue_2;  // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_2;       // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue_1;     // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_2;   // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BAA[0x4];                                     // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue_1;            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BAB[0x3];                                     // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BAC[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast_1;              // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails) == 0x000008, "Wrong alignment on BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails");
static_assert(sizeof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails) == 0x0002D8, "Wrong size on BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, L_GateRot) == 0x000000, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::L_GateRot' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, L_GateLoc) == 0x000018, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::L_GateLoc' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, Temp_struct_Variable) == 0x000040, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, Temp_int_Variable) == 0x000058, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Add_IntInt_ReturnValue_2) == 0x000064, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakVector_X) == 0x000068, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakVector_Y) == 0x000070, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakVector_Z) == 0x000078, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000080, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Array_Get_Item) == 0x000088, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_IsValid_ReturnValue) == 0x000094, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Less_IntInt_ReturnValue) == 0x000095, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000098, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B0, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakVector_X_1) == 0x0000C8, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakVector_Y_1) == 0x0000D0, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakVector_Z_1) == 0x0000D8, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Vector_Distance_ReturnValue) == 0x0000E0, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_FTrunc_ReturnValue) == 0x0000F0, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_FTrunc_ReturnValue_1) == 0x0000F4, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000F8, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000100, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000108, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000120, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakRotator_Roll) == 0x000124, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakRotator_Pitch) == 0x000128, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakRotator_Yaw) == 0x00012C, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_MakeVector_ReturnValue) == 0x000130, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_GetDirectionAtSplinePoint_ReturnValue) == 0x000148, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_GetDirectionAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000160, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000178, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_GetDirectionAtSplinePoint_ReturnValue_1) == 0x000190, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_GetDirectionAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_GetDirectionAtSplinePoint_ReturnValue_2) == 0x0001A8, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_GetDirectionAtSplinePoint_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x0001C0, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Conv_VectorToRotator_ReturnValue_2) == 0x0001D8, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Conv_VectorToRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x0001F0, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_NormalizedDeltaRotator_ReturnValue_1) == 0x000208, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_NormalizedDeltaRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakVector_X_2) == 0x000220, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakVector_Y_2) == 0x000228, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakVector_Z_2) == 0x000230, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakRotator_Roll_1) == 0x000238, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakRotator_Pitch_1) == 0x00023C, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakRotator_Yaw_1) == 0x000240, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000244, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_GetLocationAtSplinePoint_ReturnValue_2) == 0x000248, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_GetLocationAtSplinePoint_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000260, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Vector_Distance_ReturnValue_1) == 0x000268, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000270, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_FTrunc_ReturnValue_2) == 0x000274, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000278, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakVector_X_3) == 0x000280, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakVector_Y_3) == 0x000288, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_BreakVector_Z_3) == 0x000290, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000298, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_FTrunc_ReturnValue_3) == 0x0002A0, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x0002A8, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_MakeVector_ReturnValue_1) == 0x0002B0, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_MakeVector_Z_ImplicitCast) == 0x0002C8, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails, CallFunc_MakeVector_Z_ImplicitCast_1) == 0x0002D0, "Member 'BP_SkyNavRoute_Base_C_UpdateSplinePointsDetails::CallFunc_MakeVector_Z_ImplicitCast_1' has a wrong offset!");

// Function BP_SkyNavRoute_Base.BP_SkyNavRoute_Base_C.SetTrajectoryValuesToGate
// 0x01D0 (0x01D0 - 0x0000)
struct BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate final
{
public:
	class ABP_SkyNavGate_C*                       GateActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BAD[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTangentAtSplinePoint_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SkyNavGate_C*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BAE[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtSplinePoint_ReturnValue_1;    // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BAF[0x8];                                     // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_CalculateSplinePointTransform_Return;     // 0x0070(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB0[0x8];                                     // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_CalculateSplinePointTransform_Return_1;   // 0x0120(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate) == 0x000010, "Wrong alignment on BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate");
static_assert(sizeof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate) == 0x0001D0, "Wrong size on BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, GateActor) == 0x000000, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::GateActor' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_GetTangentAtSplinePoint_ReturnValue) == 0x000010, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_GetTangentAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000049, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00004C, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_GetTangentAtSplinePoint_ReturnValue_1) == 0x000050, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_GetTangentAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_CalculateSplinePointTransform_Return) == 0x000070, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_CalculateSplinePointTransform_Return' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_BreakTransform_Location) == 0x0000D0, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_BreakTransform_Rotation) == 0x0000E8, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_BreakTransform_Scale) == 0x000100, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_CalculateSplinePointTransform_Return_1) == 0x000120, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_CalculateSplinePointTransform_Return_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_BreakTransform_Location_1) == 0x000180, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_BreakTransform_Rotation_1) == 0x000198, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate, CallFunc_BreakTransform_Scale_1) == 0x0001B0, "Member 'BP_SkyNavRoute_Base_C_SetTrajectoryValuesToGate::CallFunc_BreakTransform_Scale_1' has a wrong offset!");

// Function BP_SkyNavRoute_Base.BP_SkyNavRoute_Base_C.SetActive
// 0x0010 (0x0010 - 0x0000)
struct BP_SkyNavRoute_Base_C_SetActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      Objective;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyNavRoute_Base_C_SetActive) == 0x000008, "Wrong alignment on BP_SkyNavRoute_Base_C_SetActive");
static_assert(sizeof(BP_SkyNavRoute_Base_C_SetActive) == 0x000010, "Wrong size on BP_SkyNavRoute_Base_C_SetActive");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetActive, bActive) == 0x000000, "Member 'BP_SkyNavRoute_Base_C_SetActive::bActive' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_SetActive, Objective) == 0x000008, "Member 'BP_SkyNavRoute_Base_C_SetActive::Objective' has a wrong offset!");

// Function BP_SkyNavRoute_Base.BP_SkyNavRoute_Base_C.RouteActivation_SC
// 0x0001 (0x0001 - 0x0000)
struct BP_SkyNavRoute_Base_C_RouteActivation_SC final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyNavRoute_Base_C_RouteActivation_SC) == 0x000001, "Wrong alignment on BP_SkyNavRoute_Base_C_RouteActivation_SC");
static_assert(sizeof(BP_SkyNavRoute_Base_C_RouteActivation_SC) == 0x000001, "Wrong size on BP_SkyNavRoute_Base_C_RouteActivation_SC");
static_assert(offsetof(BP_SkyNavRoute_Base_C_RouteActivation_SC, IsActive) == 0x000000, "Member 'BP_SkyNavRoute_Base_C_RouteActivation_SC::IsActive' has a wrong offset!");

// Function BP_SkyNavRoute_Base.BP_SkyNavRoute_Base_C.RotateStartEffectTowardsFirstGate
// 0x0220 (0x0220 - 0x0000)
struct BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB2[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_CalculateSplinePointTransform_Return;     // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB3[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0120(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate) == 0x000010, "Wrong alignment on BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate");
static_assert(sizeof(BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate) == 0x000220, "Wrong size on BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate");
static_assert(offsetof(BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate, CallFunc_CalculateSplinePointTransform_Return) == 0x000020, "Member 'BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate::CallFunc_CalculateSplinePointTransform_Return' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate, CallFunc_BreakTransform_Location) == 0x000080, "Member 'BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate, CallFunc_BreakTransform_Rotation) == 0x000098, "Member 'BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate, CallFunc_BreakTransform_Scale) == 0x0000B0, "Member 'BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000C8, "Member 'BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate, CallFunc_BreakRotator_Roll) == 0x0000E0, "Member 'BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate, CallFunc_BreakRotator_Pitch) == 0x0000E4, "Member 'BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate, CallFunc_BreakRotator_Yaw) == 0x0000E8, "Member 'BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate, CallFunc_MakeRotator_ReturnValue) == 0x0000F0, "Member 'BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate, CallFunc_ComposeRotators_ReturnValue) == 0x000108, "Member 'BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000120, "Member 'BP_SkyNavRoute_Base_C_RotateStartEffectTowardsFirstGate::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function BP_SkyNavRoute_Base.BP_SkyNavRoute_Base_C.OnPlayerFlyThrough__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_SkyNavRoute_Base_C_OnPlayerFlyThrough__DelegateSignature final
{
public:
	int32                                         FlyGateSplinePoint;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerId;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyNavRoute_Base_C_OnPlayerFlyThrough__DelegateSignature) == 0x000004, "Wrong alignment on BP_SkyNavRoute_Base_C_OnPlayerFlyThrough__DelegateSignature");
static_assert(sizeof(BP_SkyNavRoute_Base_C_OnPlayerFlyThrough__DelegateSignature) == 0x000008, "Wrong size on BP_SkyNavRoute_Base_C_OnPlayerFlyThrough__DelegateSignature");
static_assert(offsetof(BP_SkyNavRoute_Base_C_OnPlayerFlyThrough__DelegateSignature, FlyGateSplinePoint) == 0x000000, "Member 'BP_SkyNavRoute_Base_C_OnPlayerFlyThrough__DelegateSignature::FlyGateSplinePoint' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_OnPlayerFlyThrough__DelegateSignature, PlayerId) == 0x000004, "Member 'BP_SkyNavRoute_Base_C_OnPlayerFlyThrough__DelegateSignature::PlayerId' has a wrong offset!");

// Function BP_SkyNavRoute_Base.BP_SkyNavRoute_Base_C.OnGatePendingDestroyStarted
// 0x0038 (0x0038 - 0x0000)
struct BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted final
{
public:
	double                                        Duration;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB4[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB5[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted) == 0x000008, "Wrong alignment on BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted");
static_assert(sizeof(BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted) == 0x000038, "Wrong size on BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted");
static_assert(offsetof(BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted, Duration) == 0x000000, "Member 'BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted::Duration' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted, Temp_int_Variable) == 0x000018, "Member 'BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted, CallFunc_FMin_ReturnValue) == 0x000030, "Member 'BP_SkyNavRoute_Base_C_OnGatePendingDestroyStarted::CallFunc_FMin_ReturnValue' has a wrong offset!");

// Function BP_SkyNavRoute_Base.BP_SkyNavRoute_Base_C.OnGateConsumedEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_SkyNavRoute_Base_C_OnGateConsumedEvent final
{
public:
	class ABP_SkyNavGate_C*                       GateRef;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyNavRoute_Base_C_OnGateConsumedEvent) == 0x000008, "Wrong alignment on BP_SkyNavRoute_Base_C_OnGateConsumedEvent");
static_assert(sizeof(BP_SkyNavRoute_Base_C_OnGateConsumedEvent) == 0x000008, "Wrong size on BP_SkyNavRoute_Base_C_OnGateConsumedEvent");
static_assert(offsetof(BP_SkyNavRoute_Base_C_OnGateConsumedEvent, GateRef) == 0x000000, "Member 'BP_SkyNavRoute_Base_C_OnGateConsumedEvent::GateRef' has a wrong offset!");

// Function BP_SkyNavRoute_Base.BP_SkyNavRoute_Base_C.OnGateConsumed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_SkyNavRoute_Base_C_OnGateConsumed__DelegateSignature final
{
public:
	int32                                         GateIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyNavRoute_Base_C_OnGateConsumed__DelegateSignature) == 0x000004, "Wrong alignment on BP_SkyNavRoute_Base_C_OnGateConsumed__DelegateSignature");
static_assert(sizeof(BP_SkyNavRoute_Base_C_OnGateConsumed__DelegateSignature) == 0x000004, "Wrong size on BP_SkyNavRoute_Base_C_OnGateConsumed__DelegateSignature");
static_assert(offsetof(BP_SkyNavRoute_Base_C_OnGateConsumed__DelegateSignature, GateIndex) == 0x000000, "Member 'BP_SkyNavRoute_Base_C_OnGateConsumed__DelegateSignature::GateIndex' has a wrong offset!");

// Function BP_SkyNavRoute_Base.BP_SkyNavRoute_Base_C.OnEnoughGateConsumptionStarted__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_SkyNavRoute_Base_C_OnEnoughGateConsumptionStarted__DelegateSignature final
{
public:
	double                                        ShortestDuration;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyNavRoute_Base_C_OnEnoughGateConsumptionStarted__DelegateSignature) == 0x000008, "Wrong alignment on BP_SkyNavRoute_Base_C_OnEnoughGateConsumptionStarted__DelegateSignature");
static_assert(sizeof(BP_SkyNavRoute_Base_C_OnEnoughGateConsumptionStarted__DelegateSignature) == 0x000008, "Wrong size on BP_SkyNavRoute_Base_C_OnEnoughGateConsumptionStarted__DelegateSignature");
static_assert(offsetof(BP_SkyNavRoute_Base_C_OnEnoughGateConsumptionStarted__DelegateSignature, ShortestDuration) == 0x000000, "Member 'BP_SkyNavRoute_Base_C_OnEnoughGateConsumptionStarted__DelegateSignature::ShortestDuration' has a wrong offset!");

// Function BP_SkyNavRoute_Base.BP_SkyNavRoute_Base_C.GetLocalPlayerID
// 0x0030 (0x0030 - 0x0000)
struct BP_SkyNavRoute_Base_C_GetLocalPlayerID final
{
public:
	int32                                         PlayerId;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB7[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetPersistentPlayerState_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB8[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerId_ReturnValue;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
