#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Track

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Track.BP_Track_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_Track_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5983[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_MaxDistance_ImplicitCast;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Track_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Track_C_UserConstructionScript");
static_assert(sizeof(BP_Track_C_UserConstructionScript) == 0x000018, "Wrong size on BP_Track_C_UserConstructionScript");
static_assert(offsetof(BP_Track_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000000, "Member 'BP_Track_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Track_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'BP_Track_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Track_C_UserConstructionScript, CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue) == 0x000008, "Member 'BP_Track_C_UserConstructionScript::CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Track_C_UserConstructionScript, K2Node_VariableSet_MaxDistance_ImplicitCast) == 0x000010, "Member 'BP_Track_C_UserConstructionScript::K2Node_VariableSet_MaxDistance_ImplicitCast' has a wrong offset!");

}

