#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Track

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Track.BP_Track_C
// 0x0018 (0x02B8 - 0x02A0)
class ABP_Track_C final : public AActor
{
public:
	class UBillboardComponent*                    Billboard;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDistance;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Track_C">();
	}
	static class ABP_Track_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Track_C>();
	}
};
static_assert(alignof(ABP_Track_C) == 0x000008, "Wrong alignment on ABP_Track_C");
static_assert(sizeof(ABP_Track_C) == 0x0002B8, "Wrong size on ABP_Track_C");
static_assert(offsetof(ABP_Track_C, Billboard) == 0x0002A0, "Member 'ABP_Track_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_Track_C, Spline) == 0x0002A8, "Member 'ABP_Track_C::Spline' has a wrong offset!");
static_assert(offsetof(ABP_Track_C, MaxDistance) == 0x0002B0, "Member 'ABP_Track_C::MaxDistance' has a wrong offset!");

}

