#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrackTransport_ConvoyCar_JobZero

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_TrackTransport_ConvoyCar_JobZero.BP_TrackTransport_ConvoyCar_JobZero_C.CalculateControls
// 0x0350 (0x0350 - 0x0000)
struct BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E8F[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetWheelTransform_ReturnValue;            // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E90[0x8];                                     // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetHullTransformLocal_ReturnValue;        // 0x00C0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E91[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0128(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E92[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0228(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E93[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E94[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0250(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls) == 0x000010, "Wrong alignment on BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls");
static_assert(sizeof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls) == 0x000350, "Wrong size on BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls, CallFunc_GetWheelTransform_ReturnValue) == 0x000010, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls::CallFunc_GetWheelTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls, CallFunc_BreakTransform_Location) == 0x000070, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls, CallFunc_BreakTransform_Rotation) == 0x000088, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls, CallFunc_BreakTransform_Scale) == 0x0000A0, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls, CallFunc_GetHullTransformLocal_ReturnValue) == 0x0000C0, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls::CallFunc_GetHullTransformLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls, Temp_int_Loop_Counter_Variable) == 0x000120, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000128, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls, CallFunc_Add_IntInt_ReturnValue) == 0x000220, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls, K2Node_MakeArray_Array) == 0x000228, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls, CallFunc_Array_Length_ReturnValue) == 0x000238, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls, CallFunc_Array_Get_Item) == 0x000240, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls, CallFunc_Less_IntInt_ReturnValue) == 0x000248, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000250, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_CalculateControls::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");

// Function BP_TrackTransport_ConvoyCar_JobZero.BP_TrackTransport_ConvoyCar_JobZero_C.Changed_AAB7617A404C2BC00B62DBBF6EB5A5DB
// 0x0040 (0x0040 - 0x0000)
struct BP_TrackTransport_ConvoyCar_JobZero_C_Changed_AAB7617A404C2BC00B62DBBF6EB5A5DB final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrackTransport_ConvoyCar_JobZero_C_Changed_AAB7617A404C2BC00B62DBBF6EB5A5DB) == 0x000008, "Wrong alignment on BP_TrackTransport_ConvoyCar_JobZero_C_Changed_AAB7617A404C2BC00B62DBBF6EB5A5DB");
static_assert(sizeof(BP_TrackTransport_ConvoyCar_JobZero_C_Changed_AAB7617A404C2BC00B62DBBF6EB5A5DB) == 0x000040, "Wrong size on BP_TrackTransport_ConvoyCar_JobZero_C_Changed_AAB7617A404C2BC00B62DBBF6EB5A5DB");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_Changed_AAB7617A404C2BC00B62DBBF6EB5A5DB, Attribute) == 0x000000, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_Changed_AAB7617A404C2BC00B62DBBF6EB5A5DB::Attribute' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_Changed_AAB7617A404C2BC00B62DBBF6EB5A5DB, NewValue) == 0x000038, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_Changed_AAB7617A404C2BC00B62DBBF6EB5A5DB::NewValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_Changed_AAB7617A404C2BC00B62DBBF6EB5A5DB, OldValue) == 0x00003C, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_Changed_AAB7617A404C2BC00B62DBBF6EB5A5DB::OldValue' has a wrong offset!");

// Function BP_TrackTransport_ConvoyCar_JobZero.BP_TrackTransport_ConvoyCar_JobZero_C.Editor_SnapToSplineStart
// 0x0170 (0x0170 - 0x0000)
struct BP_TrackTransport_ConvoyCar_JobZero_C_Editor_SnapToSplineStart final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E95[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtSplinePoint_ReturnValue;    // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0070(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrackTransport_ConvoyCar_JobZero_C_Editor_SnapToSplineStart) == 0x000010, "Wrong alignment on BP_TrackTransport_ConvoyCar_JobZero_C_Editor_SnapToSplineStart");
static_assert(sizeof(BP_TrackTransport_ConvoyCar_JobZero_C_Editor_SnapToSplineStart) == 0x000170, "Wrong size on BP_TrackTransport_ConvoyCar_JobZero_C_Editor_SnapToSplineStart");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_Editor_SnapToSplineStart, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_Editor_SnapToSplineStart::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_Editor_SnapToSplineStart, CallFunc_GetTransformAtSplinePoint_ReturnValue) == 0x000010, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_Editor_SnapToSplineStart::CallFunc_GetTransformAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_Editor_SnapToSplineStart, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000070, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_Editor_SnapToSplineStart::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_Editor_SnapToSplineStart, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000168, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_Editor_SnapToSplineStart::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function BP_TrackTransport_ConvoyCar_JobZero.BP_TrackTransport_ConvoyCar_JobZero_C.ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero
// 0x0310 (0x0310 - 0x0000)
struct BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E96[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_SpawnPoint_NPC_C*>           K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x0068(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_6;                          // 0x0078(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentSpeed_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E97[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitAttributeChanged*     CallFunc_WaitForAttributeChanged_ReturnValue;      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E98[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E99[0x2];                                     // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x00A8(0x0038)(HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9A[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9B[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class WBP_Vehicle_Health::UWBP_Vehicle_Health_C* K2Node_DynamicCast_AsWBP_Vehicle_Health;           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9C[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_1;        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0148(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_Spawner_C*                      K2Node_DynamicCast_AsBP_NPC_Spawner;               // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9D[0x6];                                     // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x01C8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x02C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9E[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SpawnPoint_NPC_C*                   K2Node_DynamicCast_AsBP_Spawn_Point_NPC;           // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9F[0x3];                                     // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EA0[0x3];                                     // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_5;                // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_6;                // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateDamageMaterial_NewHealth_ImplicitCast; // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero) == 0x000008, "Wrong alignment on BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero");
static_assert(sizeof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero) == 0x000310, "Wrong size on BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, EntryPoint) == 0x000000, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, Temp_delegate_Variable) == 0x000004, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, Temp_delegate_Variable_2) == 0x000038, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, Temp_delegate_Variable_3) == 0x000048, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, Temp_delegate_Variable_4) == 0x000058, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, Temp_delegate_Variable_5) == 0x000068, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, Temp_delegate_Variable_6) == 0x000078, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::Temp_delegate_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_GetCurrentSpeed_ReturnValue) == 0x000088, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_GetCurrentSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_HasAuthority_ReturnValue) == 0x00008C, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_WaitForAttributeChanged_ReturnValue) == 0x000090, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_WaitForAttributeChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, K2Node_Event_DeltaSeconds) == 0x00009C, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_GetFloatValue_ReturnValue) == 0x0000A0, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_HasAuthority_ReturnValue_1) == 0x0000A4, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_HasAuthority_ReturnValue_2) == 0x0000A5, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, Temp_struct_Variable) == 0x0000A8, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, Temp_real_Variable) == 0x0000E0, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, Temp_real_Variable_1) == 0x0000E4, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_HasAuthority_ReturnValue_3) == 0x0000E8, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F0, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_PostEventAtLocation_ReturnValue) == 0x000108, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_GetWidget_ReturnValue) == 0x000110, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, K2Node_DynamicCast_AsWBP_Vehicle_Health) == 0x000118, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::K2Node_DynamicCast_AsWBP_Vehicle_Health' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000128, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_PostEventAtLocation_ReturnValue_1) == 0x000140, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_PostEventAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_PostAkEvent_ReturnValue) == 0x000144, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, K2Node_CustomEvent_Attribute) == 0x000148, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, K2Node_CustomEvent_NewValue) == 0x000180, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, K2Node_CustomEvent_OldValue) == 0x000184, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, K2Node_DynamicCast_AsBP_NPC_Spawner) == 0x000188, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::K2Node_DynamicCast_AsBP_NPC_Spawner' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, K2Node_DynamicCast_bSuccess_1) == 0x000190, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_IsValid_ReturnValue_1) == 0x000191, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000198, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0001B0, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0001C8, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, K2Node_CreateDelegate_OutputDelegate) == 0x0002C0, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_HasAuthority_ReturnValue_4) == 0x0002D0, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, K2Node_DynamicCast_AsBP_Spawn_Point_NPC) == 0x0002D8, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::K2Node_DynamicCast_AsBP_Spawn_Point_NPC' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, K2Node_DynamicCast_bSuccess_2) == 0x0002E0, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_PostAkEvent_ReturnValue_1) == 0x0002E4, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_IsValid_ReturnValue_2) == 0x0002E8, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_PostAkEvent_ReturnValue_2) == 0x0002EC, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_PostAkEvent_ReturnValue_3) == 0x0002F0, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_PostAkEvent_ReturnValue_4) == 0x0002F4, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_PostAkEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_PostAkEvent_ReturnValue_5) == 0x0002F8, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_PostAkEvent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_PostAkEvent_ReturnValue_6) == 0x0002FC, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_PostAkEvent_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_UpdateDamageMaterial_NewHealth_ImplicitCast) == 0x000300, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_UpdateDamageMaterial_NewHealth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x000308, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");

// Function BP_TrackTransport_ConvoyCar_JobZero.BP_TrackTransport_ConvoyCar_JobZero_C.HasReachedSplineEnd
// 0x0030 (0x0030 - 0x0000)
struct BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EA1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetDistanceAlongSpline_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EA2[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EA3[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd) == 0x000008, "Wrong alignment on BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd");
static_assert(sizeof(BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd) == 0x000030, "Wrong size on BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd, ReturnValue) == 0x000000, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd, CallFunc_GetDistanceAlongSpline_ReturnValue) == 0x000008, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd::CallFunc_GetDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd, CallFunc_GetSplineLength_ReturnValue) == 0x000010, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_HasReachedSplineEnd::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_TrackTransport_ConvoyCar_JobZero.BP_TrackTransport_ConvoyCar_JobZero_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TrackTransport_ConvoyCar_JobZero_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrackTransport_ConvoyCar_JobZero_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TrackTransport_ConvoyCar_JobZero_C_ReceiveTick");
static_assert(sizeof(BP_TrackTransport_ConvoyCar_JobZero_C_ReceiveTick) == 0x000004, "Wrong size on BP_TrackTransport_ConvoyCar_JobZero_C_ReceiveTick");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TrackTransport_ConvoyCar_JobZero.BP_TrackTransport_ConvoyCar_JobZero_C.SpawnNPC
// 0x0002 (0x0002 - 0x0000)
struct BP_TrackTransport_ConvoyCar_JobZero_C_SpawnNPC final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrySpawn_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrackTransport_ConvoyCar_JobZero_C_SpawnNPC) == 0x000001, "Wrong alignment on BP_TrackTransport_ConvoyCar_JobZero_C_SpawnNPC");
static_assert(sizeof(BP_TrackTransport_ConvoyCar_JobZero_C_SpawnNPC) == 0x000002, "Wrong size on BP_TrackTransport_ConvoyCar_JobZero_C_SpawnNPC");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_SpawnNPC, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_SpawnNPC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_SpawnNPC, CallFunc_TrySpawn_ReturnValue) == 0x000001, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_SpawnNPC::CallFunc_TrySpawn_ReturnValue' has a wrong offset!");

// Function BP_TrackTransport_ConvoyCar_JobZero.BP_TrackTransport_ConvoyCar_JobZero_C.UpdateDamageMaterial
// 0x0048 (0x0048 - 0x0000)
struct BP_TrackTransport_ConvoyCar_JobZero_C_UpdateDamageMaterial final
{
public:
	double                                        NewHealth;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DamageScalarValue;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HealthRatio;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EA4[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EA5[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_B_ImplicitCast;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrackTransport_ConvoyCar_JobZero_C_UpdateDamageMaterial) == 0x000008, "Wrong alignment on BP_TrackTransport_ConvoyCar_JobZero_C_UpdateDamageMaterial");
static_assert(sizeof(BP_TrackTransport_ConvoyCar_JobZero_C_UpdateDamageMaterial) == 0x000048, "Wrong size on BP_TrackTransport_ConvoyCar_JobZero_C_UpdateDamageMaterial");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_UpdateDamageMaterial, NewHealth) == 0x000000, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_UpdateDamageMaterial::NewHealth' has a wrong offset!");
static_assert(offsetof(BP_TrackTransport_ConvoyCar_JobZero_C_UpdateDamageMaterial, DamageScalarValue) == 0x000008, "Member 'BP_TrackTransport_ConvoyCar_JobZero_C_UpdateDamageMaterial::DamageScalarValue' has a wrong offset!");
