#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TempSpawners_NoPlatform

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PrefabParent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TempSpawners_NoPlatform.BP_TempSpawners_NoPlatform_C
// 0x0048 (0x02F8 - 0x02B0)
class ABP_TempSpawners_NoPlatform_C final : public ABP_PrefabParent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   EdgePoint3;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   EdgePoint2;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   EdgePoint1;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   EdgePoint;                                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Spawn3;                                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Spawn2;                                            // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Spawn1;                                            // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnTeamID;                                       // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreMatch;                                          // 0x02F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TempSpawners_NoPlatform(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TempSpawners_NoPlatform_C">();
	}
	static class ABP_TempSpawners_NoPlatform_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TempSpawners_NoPlatform_C>();
	}
};
static_assert(alignof(ABP_TempSpawners_NoPlatform_C) == 0x000008, "Wrong alignment on ABP_TempSpawners_NoPlatform_C");
static_assert(sizeof(ABP_TempSpawners_NoPlatform_C) == 0x0002F8, "Wrong size on ABP_TempSpawners_NoPlatform_C");
static_assert(offsetof(ABP_TempSpawners_NoPlatform_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_TempSpawners_NoPlatform_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TempSpawners_NoPlatform_C, EdgePoint3) == 0x0002B8, "Member 'ABP_TempSpawners_NoPlatform_C::EdgePoint3' has a wrong offset!");
static_assert(offsetof(ABP_TempSpawners_NoPlatform_C, EdgePoint2) == 0x0002C0, "Member 'ABP_TempSpawners_NoPlatform_C::EdgePoint2' has a wrong offset!");
static_assert(offsetof(ABP_TempSpawners_NoPlatform_C, EdgePoint1) == 0x0002C8, "Member 'ABP_TempSpawners_NoPlatform_C::EdgePoint1' has a wrong offset!");
static_assert(offsetof(ABP_TempSpawners_NoPlatform_C, EdgePoint) == 0x0002D0, "Member 'ABP_TempSpawners_NoPlatform_C::EdgePoint' has a wrong offset!");
static_assert(offsetof(ABP_TempSpawners_NoPlatform_C, Spawn3) == 0x0002D8, "Member 'ABP_TempSpawners_NoPlatform_C::Spawn3' has a wrong offset!");
static_assert(offsetof(ABP_TempSpawners_NoPlatform_C, Spawn2) == 0x0002E0, "Member 'ABP_TempSpawners_NoPlatform_C::Spawn2' has a wrong offset!");
static_assert(offsetof(ABP_TempSpawners_NoPlatform_C, Spawn1) == 0x0002E8, "Member 'ABP_TempSpawners_NoPlatform_C::Spawn1' has a wrong offset!");
static_assert(offsetof(ABP_TempSpawners_NoPlatform_C, SpawnTeamID) == 0x0002F0, "Member 'ABP_TempSpawners_NoPlatform_C::SpawnTeamID' has a wrong offset!");
static_assert(offsetof(ABP_TempSpawners_NoPlatform_C, PreMatch) == 0x0002F4, "Member 'ABP_TempSpawners_NoPlatform_C::PreMatch' has a wrong offset!");

}

