#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TriggerProxy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TriggerProxy.BP_TriggerProxy_C
// 0x0018 (0x02B8 - 0x02A0)
class ABP_TriggerProxy_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_Component_Trigger_C*                Trigger;                                           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TriggerProxy(int32 EntryPoint);
	void ActivateTrigger();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TriggerProxy_C">();
	}
	static class ABP_TriggerProxy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TriggerProxy_C>();
	}
};
static_assert(alignof(ABP_TriggerProxy_C) == 0x000008, "Wrong alignment on ABP_TriggerProxy_C");
static_assert(sizeof(ABP_TriggerProxy_C) == 0x0002B8, "Wrong size on ABP_TriggerProxy_C");
static_assert(offsetof(ABP_TriggerProxy_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_TriggerProxy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TriggerProxy_C, Trigger) == 0x0002A8, "Member 'ABP_TriggerProxy_C::Trigger' has a wrong offset!");
static_assert(offsetof(ABP_TriggerProxy_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_TriggerProxy_C::DefaultSceneRoot' has a wrong offset!");

}

