#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TetherLink_Preview

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TetherLink_Preview.BP_TetherLink_Preview_C
// 0x0020 (0x02C0 - 0x02A0)
class ABP_TetherLink_Preview_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   LaserCylinder;                                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CylinderDynMatRef;                                 // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TetherLink_Preview(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetupMaterials();
	void UpdateConnection(bool HasNoObstacle, bool IsInRange, double Distance, const struct FTransform& NewTransform);
	void UpdateMaterials(bool HasNoObstacles, bool IsInRange, double Distance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TetherLink_Preview_C">();
	}
	static class ABP_TetherLink_Preview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TetherLink_Preview_C>();
	}
};
static_assert(alignof(ABP_TetherLink_Preview_C) == 0x000008, "Wrong alignment on ABP_TetherLink_Preview_C");
static_assert(sizeof(ABP_TetherLink_Preview_C) == 0x0002C0, "Wrong size on ABP_TetherLink_Preview_C");
static_assert(offsetof(ABP_TetherLink_Preview_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_TetherLink_Preview_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TetherLink_Preview_C, LaserCylinder) == 0x0002A8, "Member 'ABP_TetherLink_Preview_C::LaserCylinder' has a wrong offset!");
static_assert(offsetof(ABP_TetherLink_Preview_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_TetherLink_Preview_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_TetherLink_Preview_C, CylinderDynMatRef) == 0x0002B8, "Member 'ABP_TetherLink_Preview_C::CylinderDynMatRef' has a wrong offset!");

}

