#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Track_Monorail

#include "Basic.hpp"

#include "S_TrackSpawnSegment_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Track_Monorail.BP_Track_Monorail_C
// 0x0040 (0x0410 - 0x03D0)
class ABP_Track_Monorail_C final : public AGzTrack
{
public:
	double                                        TrackSpacing;                                      // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Target;                                            // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnTrack;                                        // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_694F[0x7];                                     // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USplineMeshComponent*>           SplineMeshComponents;                              // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FS_TrackSpawnSegment>           SpawnTrackSegment;                                 // 0x03F8(0x0010)(Edit, BlueprintVisible)
	double                                        Section_Length;                                    // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CreateTrack(class UStaticMesh* TrackMesh, bool HiddenInGame);
	void GetLocationTangentAtIndex(int32 Param_Index, double Spacing, struct FVector* Location, struct FVector* Tangent);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Track_Monorail_C">();
	}
	static class ABP_Track_Monorail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Track_Monorail_C>();
	}
};
static_assert(alignof(ABP_Track_Monorail_C) == 0x000008, "Wrong alignment on ABP_Track_Monorail_C");
static_assert(sizeof(ABP_Track_Monorail_C) == 0x000410, "Wrong size on ABP_Track_Monorail_C");
static_assert(offsetof(ABP_Track_Monorail_C, TrackSpacing) == 0x0003D0, "Member 'ABP_Track_Monorail_C::TrackSpacing' has a wrong offset!");
static_assert(offsetof(ABP_Track_Monorail_C, Target) == 0x0003D8, "Member 'ABP_Track_Monorail_C::Target' has a wrong offset!");
static_assert(offsetof(ABP_Track_Monorail_C, SpawnTrack) == 0x0003E0, "Member 'ABP_Track_Monorail_C::SpawnTrack' has a wrong offset!");
static_assert(offsetof(ABP_Track_Monorail_C, SplineMeshComponents) == 0x0003E8, "Member 'ABP_Track_Monorail_C::SplineMeshComponents' has a wrong offset!");
static_assert(offsetof(ABP_Track_Monorail_C, SpawnTrackSegment) == 0x0003F8, "Member 'ABP_Track_Monorail_C::SpawnTrackSegment' has a wrong offset!");
static_assert(offsetof(ABP_Track_Monorail_C, Section_Length) == 0x000408, "Member 'ABP_Track_Monorail_C::Section_Length' has a wrong offset!");

}

