#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ToxicSmoke_Missile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ToxicSmoke_Missile.BP_ToxicSmoke_Missile_C.ExecuteUbergraph_BP_ToxicSmoke_Missile
// 0x0290 (0x0290 - 0x0000)
struct BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6204[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0038(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6205[0x2];                                     // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6206[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6207[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0220(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ToxicSmoke_TrailActor_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile) == 0x000010, "Wrong alignment on BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile");
static_assert(sizeof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile) == 0x000290, "Wrong size on BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, EntryPoint) == 0x000000, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000005, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_HasAuthority_ReturnValue_1) == 0x000006, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, K2Node_ComponentBoundEvent_HitComponent) == 0x000008, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000020, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, K2Node_ComponentBoundEvent_Hit) == 0x000038, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000130, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_bBlockingHit) == 0x000148, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_bInitialOverlap) == 0x000149, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_Time) == 0x00014C, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_Distance) == 0x000150, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_Location) == 0x000158, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_ImpactPoint) == 0x000170, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_Normal) == 0x000188, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A0, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_PhysMat) == 0x0001B8, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_HitActor) == 0x0001C0, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_HitComponent) == 0x0001C8, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_HitBoneName) == 0x0001D0, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_BoneName) == 0x0001D8, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_HitItem) == 0x0001E0, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_ElementIndex) == 0x0001E4, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_FaceIndex) == 0x0001E8, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_TraceStart) == 0x0001F0, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BreakHitResult_TraceEnd) == 0x000208, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_MakeTransform_ReturnValue) == 0x000220, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000280, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile, CallFunc_FinishSpawningActor_ReturnValue) == 0x000288, "Member 'BP_ToxicSmoke_Missile_C_ExecuteUbergraph_BP_ToxicSmoke_Missile::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_ToxicSmoke_Missile.BP_ToxicSmoke_Missile_C.DetachTrail
// 0x0040 (0x0040 - 0x0000)
struct BP_ToxicSmoke_Missile_C_DetachTrail final
{
public:
	struct FVector                                ImpactLocation;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactNormal;                                      // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ToxicSmoke_Missile_C_DetachTrail) == 0x000008, "Wrong alignment on BP_ToxicSmoke_Missile_C_DetachTrail");
static_assert(sizeof(BP_ToxicSmoke_Missile_C_DetachTrail) == 0x000040, "Wrong size on BP_ToxicSmoke_Missile_C_DetachTrail");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_DetachTrail, ImpactLocation) == 0x000000, "Member 'BP_ToxicSmoke_Missile_C_DetachTrail::ImpactLocation' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_DetachTrail, ImpactNormal) == 0x000018, "Member 'BP_ToxicSmoke_Missile_C_DetachTrail::ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_DetachTrail, CallFunc_GetAttachParentActor_ReturnValue) == 0x000030, "Member 'BP_ToxicSmoke_Missile_C_DetachTrail::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_DetachTrail, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_ToxicSmoke_Missile_C_DetachTrail::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_DetachTrail, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000039, "Member 'BP_ToxicSmoke_Missile_C_DetachTrail::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_ToxicSmoke_Missile.BP_ToxicSmoke_Missile_C.BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000128, "Wrong size on BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'BP_ToxicSmoke_Missile_C_BndEvt__BP_ToxicSmoke_Missile_SphereComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

}

