#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrackTransport_ConvoyCar_JobZero

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_ConvoyVehicleBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TrackTransport_ConvoyCar_JobZero.BP_TrackTransport_ConvoyCar_JobZero_C
// 0x0190 (0x06F0 - 0x0560)
class ABP_TrackTransport_ConvoyCar_JobZero_C final : public ABP_ConvoyVehicleBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_TrackTransport_ConvoyCar_JobZero_C; // 0x0560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_TailLight1;                                     // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_TailLight5;                                     // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_TailLight4;                                     // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_TailLight3;                                     // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_TailLight2;                                     // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_TailLight;                                      // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       HealthBar;                                         // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      DestructionEffect_Explosion;                       // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      DestructionEffect_Burn;                            // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      DestructionEffect_Fire;                            // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Component_Triggerable_C*            TriggerableComponent_Destruction;                  // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_BR;                                          // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_FR2;                                         // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WheelProxy_BR;                                     // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WheelProxy_FR2;                                    // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_FR1;                                         // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WheelProxy_FR1;                                    // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door_L;                                            // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Front;                                             // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door_R;                                            // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   APC_CarHull;                                       // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        APCHullProxy;                                      // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_BL;                                          // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_FL2;                                         // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_FL1;                                         // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   NPCSpawnPoint;                                     // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   NPCSpawner;                                        // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MoveHullUp_NewTrack_0_B4EC0AFC41ED1B62C7B4D99B13E87F0E; // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MoveHullUp__Direction_B4EC0AFC41ED1B62C7B4D99B13E87F0E; // 0x0644(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E8D[0x3];                                     // 0x0645(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MoveHullUp;                                        // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentPitchRotation;                              // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VehicleDamageableProxy_JobZero_C*   VehicleDamageProxy_0;                              // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_Spawner_C*                      NPCSpawnerRef;                                     // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_SpawnPoint_NPC_C*                   NPCSpawnPointRef;                                  // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStarted_0;                                       // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E8E[0x7];                                     // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HullGameplayLocation;                              // 0x0678(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            AudioRPMCurve;                                     // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       DamageableMaterials;                               // 0x0698(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        MaterialDamageIntensity;                           // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          EngineStartAudio;                                  // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          EngineAudioEvent;                                  // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          SurfaceAudioEvent;                                 // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          SuspensionAudioEvent;                              // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          ChassisAudioEvent;                                 // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          TireAudioEvent;                                    // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          EngineEndAudio;                                    // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_TrackTransport_ConvoyCar_JobZero_TriggerableComponent_Destruction_K2Node_ComponentBoundEvent_1_Triggered__DelegateSignature();
	void CalculateControls();
	void Changed_AAB7617A404C2BC00B62DBBF6EB5A5DB(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);
	void Editor_SnapToSplineStart();
	void ExecuteUbergraph_BP_TrackTransport_ConvoyCar_JobZero(int32 EntryPoint);
	bool HasReachedSplineEnd();
	void MoveHullUp__FinishedFunc();
	void MoveHullUp__UpdateFunc();
	void MULTICAST_DestructionEvent();
	void ReceiveBeginPlay();
	void ReceiveCarTransformUpdated();
	void ReceiveMovementEnd();
	void ReceiveMovementStart();
	void ReceiveTick(float DeltaSeconds);
	void SpawnNPC();
	void UpdateDamageMaterial(double NewHealth);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TrackTransport_ConvoyCar_JobZero_C">();
	}
	static class ABP_TrackTransport_ConvoyCar_JobZero_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TrackTransport_ConvoyCar_JobZero_C>();
	}
};
static_assert(alignof(ABP_TrackTransport_ConvoyCar_JobZero_C) == 0x000010, "Wrong alignment on ABP_TrackTransport_ConvoyCar_JobZero_C");
static_assert(sizeof(ABP_TrackTransport_ConvoyCar_JobZero_C) == 0x0006F0, "Wrong size on ABP_TrackTransport_ConvoyCar_JobZero_C");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, UberGraphFrame_BP_TrackTransport_ConvoyCar_JobZero_C) == 0x000560, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::UberGraphFrame_BP_TrackTransport_ConvoyCar_JobZero_C' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, SM_TailLight1) == 0x000568, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::SM_TailLight1' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, SM_TailLight5) == 0x000570, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::SM_TailLight5' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, SM_TailLight4) == 0x000578, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::SM_TailLight4' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, SM_TailLight3) == 0x000580, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::SM_TailLight3' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, SM_TailLight2) == 0x000588, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::SM_TailLight2' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, SM_TailLight) == 0x000590, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::SM_TailLight' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, HealthBar) == 0x000598, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::HealthBar' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, DestructionEffect_Explosion) == 0x0005A0, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::DestructionEffect_Explosion' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, DestructionEffect_Burn) == 0x0005A8, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::DestructionEffect_Burn' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, DestructionEffect_Fire) == 0x0005B0, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::DestructionEffect_Fire' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, TriggerableComponent_Destruction) == 0x0005B8, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::TriggerableComponent_Destruction' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, Wheel_BR) == 0x0005C0, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::Wheel_BR' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, Wheel_FR2) == 0x0005C8, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::Wheel_FR2' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, WheelProxy_BR) == 0x0005D0, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::WheelProxy_BR' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, WheelProxy_FR2) == 0x0005D8, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::WheelProxy_FR2' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, Wheel_FR1) == 0x0005E0, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::Wheel_FR1' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, WheelProxy_FR1) == 0x0005E8, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::WheelProxy_FR1' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, Door_L) == 0x0005F0, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::Door_L' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, Front) == 0x0005F8, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::Front' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, Door_R) == 0x000600, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::Door_R' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, APC_CarHull) == 0x000608, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::APC_CarHull' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, APCHullProxy) == 0x000610, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::APCHullProxy' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, Wheel_BL) == 0x000618, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::Wheel_BL' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, Wheel_FL2) == 0x000620, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::Wheel_FL2' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, Wheel_FL1) == 0x000628, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::Wheel_FL1' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, NPCSpawnPoint) == 0x000630, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::NPCSpawnPoint' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, NPCSpawner) == 0x000638, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::NPCSpawner' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, MoveHullUp_NewTrack_0_B4EC0AFC41ED1B62C7B4D99B13E87F0E) == 0x000640, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::MoveHullUp_NewTrack_0_B4EC0AFC41ED1B62C7B4D99B13E87F0E' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, MoveHullUp__Direction_B4EC0AFC41ED1B62C7B4D99B13E87F0E) == 0x000644, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::MoveHullUp__Direction_B4EC0AFC41ED1B62C7B4D99B13E87F0E' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, MoveHullUp) == 0x000648, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::MoveHullUp' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, CurrentPitchRotation) == 0x000650, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::CurrentPitchRotation' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, VehicleDamageProxy_0) == 0x000658, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::VehicleDamageProxy_0' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, NPCSpawnerRef) == 0x000660, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::NPCSpawnerRef' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, NPCSpawnPointRef) == 0x000668, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::NPCSpawnPointRef' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, IsStarted_0) == 0x000670, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::IsStarted_0' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, HullGameplayLocation) == 0x000678, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::HullGameplayLocation' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, AudioRPMCurve) == 0x000690, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::AudioRPMCurve' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, DamageableMaterials) == 0x000698, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::DamageableMaterials' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, MaterialDamageIntensity) == 0x0006A8, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::MaterialDamageIntensity' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, EngineStartAudio) == 0x0006B0, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::EngineStartAudio' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, EngineAudioEvent) == 0x0006B8, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::EngineAudioEvent' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, SurfaceAudioEvent) == 0x0006C0, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::SurfaceAudioEvent' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, SuspensionAudioEvent) == 0x0006C8, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::SuspensionAudioEvent' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, ChassisAudioEvent) == 0x0006D0, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::ChassisAudioEvent' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, TireAudioEvent) == 0x0006D8, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::TireAudioEvent' has a wrong offset!");
static_assert(offsetof(ABP_TrackTransport_ConvoyCar_JobZero_C, EngineEndAudio) == 0x0006E0, "Member 'ABP_TrackTransport_ConvoyCar_JobZero_C::EngineEndAudio' has a wrong offset!");

}

