#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UtilityFunctionLibrary

#include "Basic.hpp"

#include "G01_structs.hpp"


namespace SDK::Params
{

// Function BP_UtilityFunctionLibrary.BP_UtilityFunctionLibrary_C.GetItemDeliveryCost
// 0x0088 (0x0088 - 0x0000)
struct BP_UtilityFunctionLibrary_C_GetItemDeliveryCost final
{
public:
	TArray<struct FGzInventoryItemContent>        Items;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalCost;                                         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B03[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzInventoryItemContent                CallFunc_Array_Get_Item;                           // 0x0030(0x0048)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B04[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost) == 0x000008, "Wrong alignment on BP_UtilityFunctionLibrary_C_GetItemDeliveryCost");
static_assert(sizeof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost) == 0x000088, "Wrong size on BP_UtilityFunctionLibrary_C_GetItemDeliveryCost");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost, Items) == 0x000000, "Member 'BP_UtilityFunctionLibrary_C_GetItemDeliveryCost::Items' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost, __WorldContext) == 0x000010, "Member 'BP_UtilityFunctionLibrary_C_GetItemDeliveryCost::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost, ReturnValue) == 0x000018, "Member 'BP_UtilityFunctionLibrary_C_GetItemDeliveryCost::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost, TotalCost) == 0x00001C, "Member 'BP_UtilityFunctionLibrary_C_GetItemDeliveryCost::TotalCost' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_UtilityFunctionLibrary_C_GetItemDeliveryCost::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_UtilityFunctionLibrary_C_GetItemDeliveryCost::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_UtilityFunctionLibrary_C_GetItemDeliveryCost::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_UtilityFunctionLibrary_C_GetItemDeliveryCost::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_UtilityFunctionLibrary_C_GetItemDeliveryCost::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'BP_UtilityFunctionLibrary_C_GetItemDeliveryCost::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'BP_UtilityFunctionLibrary_C_GetItemDeliveryCost::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost, CallFunc_Multiply_IntInt_ReturnValue) == 0x000080, "Member 'BP_UtilityFunctionLibrary_C_GetItemDeliveryCost::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_GetItemDeliveryCost, CallFunc_Add_IntInt_ReturnValue_1) == 0x000084, "Member 'BP_UtilityFunctionLibrary_C_GetItemDeliveryCost::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_UtilityFunctionLibrary.BP_UtilityFunctionLibrary_C.Get Redeployment Cost
// 0x0048 (0x0048 - 0x0000)
struct BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost final
{
public:
	TArray<class AGzPlayerState*>                 PlayerStates;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzBattleRoyaleGameState*               K2Node_DynamicCast_AsGz_Battle_Royale_Game_State;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B05[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzBattleRoyaleSettings*                K2Node_DynamicCast_AsGz_Battle_Royale_Settings;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B06[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost) == 0x000008, "Wrong alignment on BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost");
static_assert(sizeof(BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost) == 0x000048, "Wrong size on BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost, PlayerStates) == 0x000000, "Member 'BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost::PlayerStates' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost, __WorldContext) == 0x000010, "Member 'BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost, ReturnValue) == 0x000018, "Member 'BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost, CallFunc_GetGameState_ReturnValue) == 0x000020, "Member 'BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost, K2Node_DynamicCast_AsGz_Battle_Royale_Game_State) == 0x000028, "Member 'BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost::K2Node_DynamicCast_AsGz_Battle_Royale_Game_State' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost, K2Node_DynamicCast_AsGz_Battle_Royale_Settings) == 0x000038, "Member 'BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost::K2Node_DynamicCast_AsGz_Battle_Royale_Settings' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost, CallFunc_Multiply_IntInt_ReturnValue) == 0x000044, "Member 'BP_UtilityFunctionLibrary_C_Get_Redeployment_Cost::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");

}

