#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VerticalAimSens_DS

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_VerticalAimSens_DS.BP_VerticalAimSens_DS_C.ExecuteUbergraph_BP_VerticalAimSens_DS
// 0x0020 (0x0020 - 0x0000)
struct BP_VerticalAimSens_DS_C_ExecuteUbergraph_BP_VerticalAimSens_DS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5110[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzGameUserSettings*                    CallFunc_GetUserSettings_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_NewValue;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVerticalAimSensitivityScaleFactor_NewScaleFactor_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerticalAimSens_DS_C_ExecuteUbergraph_BP_VerticalAimSens_DS) == 0x000008, "Wrong alignment on BP_VerticalAimSens_DS_C_ExecuteUbergraph_BP_VerticalAimSens_DS");
static_assert(sizeof(BP_VerticalAimSens_DS_C_ExecuteUbergraph_BP_VerticalAimSens_DS) == 0x000020, "Wrong size on BP_VerticalAimSens_DS_C_ExecuteUbergraph_BP_VerticalAimSens_DS");
static_assert(offsetof(BP_VerticalAimSens_DS_C_ExecuteUbergraph_BP_VerticalAimSens_DS, EntryPoint) == 0x000000, "Member 'BP_VerticalAimSens_DS_C_ExecuteUbergraph_BP_VerticalAimSens_DS::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VerticalAimSens_DS_C_ExecuteUbergraph_BP_VerticalAimSens_DS, CallFunc_GetUserSettings_ReturnValue) == 0x000008, "Member 'BP_VerticalAimSens_DS_C_ExecuteUbergraph_BP_VerticalAimSens_DS::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerticalAimSens_DS_C_ExecuteUbergraph_BP_VerticalAimSens_DS, K2Node_Event_NewValue) == 0x000010, "Member 'BP_VerticalAimSens_DS_C_ExecuteUbergraph_BP_VerticalAimSens_DS::K2Node_Event_NewValue' has a wrong offset!");
static_assert(offsetof(BP_VerticalAimSens_DS_C_ExecuteUbergraph_BP_VerticalAimSens_DS, CallFunc_SetVerticalAimSensitivityScaleFactor_NewScaleFactor_ImplicitCast) == 0x000018, "Member 'BP_VerticalAimSens_DS_C_ExecuteUbergraph_BP_VerticalAimSens_DS::CallFunc_SetVerticalAimSensitivityScaleFactor_NewScaleFactor_ImplicitCast' has a wrong offset!");

// Function BP_VerticalAimSens_DS.BP_VerticalAimSens_DS_C.GetValue
// 0x0020 (0x0020 - 0x0000)
struct BP_VerticalAimSens_DS_C_GetValue final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzGameUserSettings*                    CallFunc_GetUserSettings_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVerticalAimSensitivityScaleFactor_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5111[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerticalAimSens_DS_C_GetValue) == 0x000008, "Wrong alignment on BP_VerticalAimSens_DS_C_GetValue");
static_assert(sizeof(BP_VerticalAimSens_DS_C_GetValue) == 0x000020, "Wrong size on BP_VerticalAimSens_DS_C_GetValue");
static_assert(offsetof(BP_VerticalAimSens_DS_C_GetValue, ReturnValue) == 0x000000, "Member 'BP_VerticalAimSens_DS_C_GetValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerticalAimSens_DS_C_GetValue, CallFunc_GetUserSettings_ReturnValue) == 0x000008, "Member 'BP_VerticalAimSens_DS_C_GetValue::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerticalAimSens_DS_C_GetValue, CallFunc_GetVerticalAimSensitivityScaleFactor_ReturnValue) == 0x000010, "Member 'BP_VerticalAimSens_DS_C_GetValue::CallFunc_GetVerticalAimSensitivityScaleFactor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerticalAimSens_DS_C_GetValue, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000018, "Member 'BP_VerticalAimSens_DS_C_GetValue::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function BP_VerticalAimSens_DS.BP_VerticalAimSens_DS_C.SetValue
// 0x0008 (0x0008 - 0x0000)
struct BP_VerticalAimSens_DS_C_SetValue final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerticalAimSens_DS_C_SetValue) == 0x000008, "Wrong alignment on BP_VerticalAimSens_DS_C_SetValue");
static_assert(sizeof(BP_VerticalAimSens_DS_C_SetValue) == 0x000008, "Wrong size on BP_VerticalAimSens_DS_C_SetValue");
static_assert(offsetof(BP_VerticalAimSens_DS_C_SetValue, NewValue) == 0x000000, "Member 'BP_VerticalAimSens_DS_C_SetValue::NewValue' has a wrong offset!");

}

