#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VFX_LoadoutDrop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VFX_LoadoutDrop.BP_VFX_LoadoutDrop_C
// 0x0040 (0x02E0 - 0x02A0)
class ABP_VFX_LoadoutDrop_C final : public AGzLandingLocationVFX
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        ActorElapsedTime;                                  // 0x02B8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             NewEventDispatcher;                                // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           ActorLifeSpanTimer;                                // 0x02D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x02D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeForVFXToExpire;                                // 0x02DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActorLifeSpan();
	void Disable_Niagara_Effect();
	void ExecuteUbergraph_BP_VFX_LoadoutDrop(int32 EntryPoint);
	void NewEventDispatcher__DelegateSignature();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VFX_LoadoutDrop_C">();
	}
	static class ABP_VFX_LoadoutDrop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VFX_LoadoutDrop_C>();
	}
};
static_assert(alignof(ABP_VFX_LoadoutDrop_C) == 0x000008, "Wrong alignment on ABP_VFX_LoadoutDrop_C");
static_assert(sizeof(ABP_VFX_LoadoutDrop_C) == 0x0002E0, "Wrong size on ABP_VFX_LoadoutDrop_C");
static_assert(offsetof(ABP_VFX_LoadoutDrop_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_VFX_LoadoutDrop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VFX_LoadoutDrop_C, Niagara) == 0x0002A8, "Member 'ABP_VFX_LoadoutDrop_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_VFX_LoadoutDrop_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_VFX_LoadoutDrop_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_VFX_LoadoutDrop_C, ActorElapsedTime) == 0x0002B8, "Member 'ABP_VFX_LoadoutDrop_C::ActorElapsedTime' has a wrong offset!");
static_assert(offsetof(ABP_VFX_LoadoutDrop_C, NewEventDispatcher) == 0x0002C0, "Member 'ABP_VFX_LoadoutDrop_C::NewEventDispatcher' has a wrong offset!");
static_assert(offsetof(ABP_VFX_LoadoutDrop_C, ActorLifeSpanTimer) == 0x0002D0, "Member 'ABP_VFX_LoadoutDrop_C::ActorLifeSpanTimer' has a wrong offset!");
static_assert(offsetof(ABP_VFX_LoadoutDrop_C, Duration) == 0x0002D8, "Member 'ABP_VFX_LoadoutDrop_C::Duration' has a wrong offset!");
static_assert(offsetof(ABP_VFX_LoadoutDrop_C, TimeForVFXToExpire) == 0x0002DC, "Member 'ABP_VFX_LoadoutDrop_C::TimeForVFXToExpire' has a wrong offset!");

}

