#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VH_Static_Base

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VH_Static_Base.BP_VH_Static_Base_C
// 0x0028 (0x02C8 - 0x02A0)
class ABP_VH_Static_Base_C : public AActor
{
public:
	class UStaticMeshComponent*                   Wheel_RR;                                          // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_RF;                                          // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_LR;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_LF;                                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BodyMesh;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VH_Static_Base_C">();
	}
	static class ABP_VH_Static_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VH_Static_Base_C>();
	}
};
static_assert(alignof(ABP_VH_Static_Base_C) == 0x000008, "Wrong alignment on ABP_VH_Static_Base_C");
static_assert(sizeof(ABP_VH_Static_Base_C) == 0x0002C8, "Wrong size on ABP_VH_Static_Base_C");
static_assert(offsetof(ABP_VH_Static_Base_C, Wheel_RR) == 0x0002A0, "Member 'ABP_VH_Static_Base_C::Wheel_RR' has a wrong offset!");
static_assert(offsetof(ABP_VH_Static_Base_C, Wheel_RF) == 0x0002A8, "Member 'ABP_VH_Static_Base_C::Wheel_RF' has a wrong offset!");
static_assert(offsetof(ABP_VH_Static_Base_C, Wheel_LR) == 0x0002B0, "Member 'ABP_VH_Static_Base_C::Wheel_LR' has a wrong offset!");
static_assert(offsetof(ABP_VH_Static_Base_C, Wheel_LF) == 0x0002B8, "Member 'ABP_VH_Static_Base_C::Wheel_LF' has a wrong offset!");
static_assert(offsetof(ABP_VH_Static_Base_C, BodyMesh) == 0x0002C0, "Member 'ABP_VH_Static_Base_C::BodyMesh' has a wrong offset!");

}

