#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VFX_LoadoutDrop

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_VFX_LoadoutDrop.BP_VFX_LoadoutDrop_C.ActorLifeSpan
// 0x0010 (0x0010 - 0x0000)
struct BP_VFX_LoadoutDrop_C_ActorLifeSpan final
{
public:
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A6B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_ActorElapsedTime_ImplicitCast;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VFX_LoadoutDrop_C_ActorLifeSpan) == 0x000008, "Wrong alignment on BP_VFX_LoadoutDrop_C_ActorLifeSpan");
static_assert(sizeof(BP_VFX_LoadoutDrop_C_ActorLifeSpan) == 0x000010, "Wrong size on BP_VFX_LoadoutDrop_C_ActorLifeSpan");
static_assert(offsetof(BP_VFX_LoadoutDrop_C_ActorLifeSpan, CallFunc_GetGameTimeSinceCreation_ReturnValue) == 0x000000, "Member 'BP_VFX_LoadoutDrop_C_ActorLifeSpan::CallFunc_GetGameTimeSinceCreation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_LoadoutDrop_C_ActorLifeSpan, K2Node_VariableSet_ActorElapsedTime_ImplicitCast) == 0x000008, "Member 'BP_VFX_LoadoutDrop_C_ActorLifeSpan::K2Node_VariableSet_ActorElapsedTime_ImplicitCast' has a wrong offset!");

// Function BP_VFX_LoadoutDrop.BP_VFX_LoadoutDrop_C.ExecuteUbergraph_BP_VFX_LoadoutDrop
// 0x0058 (0x0058 - 0x0000)
struct BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDebugLoadoutDrop_ReturnValue;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDebugLoadoutDrop_ReturnValue_1;        // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDebugLoadoutDrop_ReturnValue_2;        // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A6C[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop) == 0x000008, "Wrong alignment on BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop");
static_assert(sizeof(BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop) == 0x000058, "Wrong size on BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop");
static_assert(offsetof(BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop, EntryPoint) == 0x000000, "Member 'BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop, CallFunc_Add_VectorVector_ReturnValue) == 0x000020, "Member 'BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop, CallFunc_HasAuthority_ReturnValue) == 0x000038, "Member 'BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop, CallFunc_IsDedicatedServer_ReturnValue) == 0x000039, "Member 'BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop, CallFunc_GetDebugLoadoutDrop_ReturnValue) == 0x00003A, "Member 'BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop::CallFunc_GetDebugLoadoutDrop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop, CallFunc_GetDebugLoadoutDrop_ReturnValue_1) == 0x00003B, "Member 'BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop::CallFunc_GetDebugLoadoutDrop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop, CallFunc_GetDebugLoadoutDrop_ReturnValue_2) == 0x00003C, "Member 'BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop::CallFunc_GetDebugLoadoutDrop_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'BP_VFX_LoadoutDrop_C_ExecuteUbergraph_BP_VFX_LoadoutDrop::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_VFX_LoadoutDrop.BP_VFX_LoadoutDrop_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_VFX_LoadoutDrop_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VFX_LoadoutDrop_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_VFX_LoadoutDrop_C_ReceiveTick");
static_assert(sizeof(BP_VFX_LoadoutDrop_C_ReceiveTick) == 0x000004, "Wrong size on BP_VFX_LoadoutDrop_C_ReceiveTick");
static_assert(offsetof(BP_VFX_LoadoutDrop_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_VFX_LoadoutDrop_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

