#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleDamageableProxy_JobZero

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_VehicleDamageableProxy_JobZero.BP_VehicleDamageableProxy_JobZero_C.BP_OnDeath
// 0x0020 (0x0020 - 0x0000)
struct BP_VehicleDamageableProxy_JobZero_C_BP_OnDeath final
{
public:
	bool                                          HasDeathHitPoint;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6654[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DeathHitPoint;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleDamageableProxy_JobZero_C_BP_OnDeath) == 0x000008, "Wrong alignment on BP_VehicleDamageableProxy_JobZero_C_BP_OnDeath");
static_assert(sizeof(BP_VehicleDamageableProxy_JobZero_C_BP_OnDeath) == 0x000020, "Wrong size on BP_VehicleDamageableProxy_JobZero_C_BP_OnDeath");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_BP_OnDeath, HasDeathHitPoint) == 0x000000, "Member 'BP_VehicleDamageableProxy_JobZero_C_BP_OnDeath::HasDeathHitPoint' has a wrong offset!");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_BP_OnDeath, DeathHitPoint) == 0x000008, "Member 'BP_VehicleDamageableProxy_JobZero_C_BP_OnDeath::DeathHitPoint' has a wrong offset!");

// Function BP_VehicleDamageableProxy_JobZero.BP_VehicleDamageableProxy_JobZero_C.BP_OnHealthChange
// 0x0004 (0x0004 - 0x0000)
struct BP_VehicleDamageableProxy_JobZero_C_BP_OnHealthChange final
{
public:
	float                                         Health;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleDamageableProxy_JobZero_C_BP_OnHealthChange) == 0x000004, "Wrong alignment on BP_VehicleDamageableProxy_JobZero_C_BP_OnHealthChange");
static_assert(sizeof(BP_VehicleDamageableProxy_JobZero_C_BP_OnHealthChange) == 0x000004, "Wrong size on BP_VehicleDamageableProxy_JobZero_C_BP_OnHealthChange");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_BP_OnHealthChange, Health) == 0x000000, "Member 'BP_VehicleDamageableProxy_JobZero_C_BP_OnHealthChange::Health' has a wrong offset!");

// Function BP_VehicleDamageableProxy_JobZero.BP_VehicleDamageableProxy_JobZero_C.ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero
// 0x0040 (0x0040 - 0x0000)
struct BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_HasDeathHitPoint;                     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6655[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_DeathHitPoint;                        // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Health;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6656[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero) == 0x000008, "Wrong alignment on BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero");
static_assert(sizeof(BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero) == 0x000040, "Wrong size on BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero, EntryPoint) == 0x000000, "Member 'BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero, CallFunc_GetMaxHealth_ReturnValue) == 0x000004, "Member 'BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000008, "Member 'BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero, K2Node_Event_HasDeathHitPoint) == 0x000009, "Member 'BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero::K2Node_Event_HasDeathHitPoint' has a wrong offset!");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero, K2Node_Event_DeathHitPoint) == 0x000010, "Member 'BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero::K2Node_Event_DeathHitPoint' has a wrong offset!");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero, K2Node_Event_Health) == 0x000028, "Member 'BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero::K2Node_Event_Health' has a wrong offset!");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00002C, "Member 'BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000030, "Member 'BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'BP_VehicleDamageableProxy_JobZero_C_ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_VehicleDamageableProxy_JobZero.BP_VehicleDamageableProxy_JobZero_C.RegenHealth
// 0x0028 (0x0028 - 0x0000)
struct BP_VehicleDamageableProxy_JobZero_C_RegenHealth final
{
public:
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0008(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleDamageableProxy_JobZero_C_RegenHealth) == 0x000008, "Wrong alignment on BP_VehicleDamageableProxy_JobZero_C_RegenHealth");
static_assert(sizeof(BP_VehicleDamageableProxy_JobZero_C_RegenHealth) == 0x000028, "Wrong size on BP_VehicleDamageableProxy_JobZero_C_RegenHealth");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_RegenHealth, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000000, "Member 'BP_VehicleDamageableProxy_JobZero_C_RegenHealth::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_RegenHealth, CallFunc_MakeEffectContext_ReturnValue) == 0x000008, "Member 'BP_VehicleDamageableProxy_JobZero_C_RegenHealth::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleDamageableProxy_JobZero_C_RegenHealth, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000020, "Member 'BP_VehicleDamageableProxy_JobZero_C_RegenHealth::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

}

