#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VEH_STC_SDN_Sport_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VEH_STC_SDN_Sport_01.BP_VEH_STC_SDN_Sport_01_C
// 0x0028 (0x02C8 - 0x02A0)
class ABP_VEH_STC_SDN_Sport_01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_VEH_SDN_Sport_05_SM_VEH_SDN_Sport_01_Hood;      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_VEH_SDN_Sport_05_SM_VEH_SDN_Sport_01_Bumper_FW; // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_VEH_SDN_Sport_05_SM_VEH_SDN_Sport_01_Bumper_BW; // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_VEH_SDN_Sport_05_SM_VEH_SDN_Sport_01_Body;      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VEH_STC_SDN_Sport_01_C">();
	}
	static class ABP_VEH_STC_SDN_Sport_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VEH_STC_SDN_Sport_01_C>();
	}
};
static_assert(alignof(ABP_VEH_STC_SDN_Sport_01_C) == 0x000008, "Wrong alignment on ABP_VEH_STC_SDN_Sport_01_C");
static_assert(sizeof(ABP_VEH_STC_SDN_Sport_01_C) == 0x0002C8, "Wrong size on ABP_VEH_STC_SDN_Sport_01_C");
static_assert(offsetof(ABP_VEH_STC_SDN_Sport_01_C, SM_VEH_SDN_Sport_05_SM_VEH_SDN_Sport_01_Hood) == 0x0002A0, "Member 'ABP_VEH_STC_SDN_Sport_01_C::SM_VEH_SDN_Sport_05_SM_VEH_SDN_Sport_01_Hood' has a wrong offset!");
static_assert(offsetof(ABP_VEH_STC_SDN_Sport_01_C, SM_VEH_SDN_Sport_05_SM_VEH_SDN_Sport_01_Bumper_FW) == 0x0002A8, "Member 'ABP_VEH_STC_SDN_Sport_01_C::SM_VEH_SDN_Sport_05_SM_VEH_SDN_Sport_01_Bumper_FW' has a wrong offset!");
static_assert(offsetof(ABP_VEH_STC_SDN_Sport_01_C, SM_VEH_SDN_Sport_05_SM_VEH_SDN_Sport_01_Bumper_BW) == 0x0002B0, "Member 'ABP_VEH_STC_SDN_Sport_01_C::SM_VEH_SDN_Sport_05_SM_VEH_SDN_Sport_01_Bumper_BW' has a wrong offset!");
static_assert(offsetof(ABP_VEH_STC_SDN_Sport_01_C, SM_VEH_SDN_Sport_05_SM_VEH_SDN_Sport_01_Body) == 0x0002B8, "Member 'ABP_VEH_STC_SDN_Sport_01_C::SM_VEH_SDN_Sport_05_SM_VEH_SDN_Sport_01_Body' has a wrong offset!");
static_assert(offsetof(ABP_VEH_STC_SDN_Sport_01_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_VEH_STC_SDN_Sport_01_C::DefaultSceneRoot' has a wrong offset!");

}

