#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleDamageableProxy_JobZero

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VehicleDamageableProxy_JobZero.BP_VehicleDamageableProxy_JobZero_C
// 0x0038 (0x0338 - 0x0300)
class ABP_VehicleDamageableProxy_JobZero_C final : public AGzDamageableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          HitBox;                                            // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnDeath;                                           // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         OutCombatCD;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_HealthRegen;                                    // 0x032C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeath(bool HasDeathHitPoint, const struct FVector& DeathHitPoint);
	void BP_OnHealthChange(float Health);
	void ExecuteUbergraph_BP_VehicleDamageableProxy_JobZero(int32 EntryPoint);
	void Multicast_OnDeath();
	void OnDeath__DelegateSignature();
	void RegenHealth();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VehicleDamageableProxy_JobZero_C">();
	}
	static class ABP_VehicleDamageableProxy_JobZero_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VehicleDamageableProxy_JobZero_C>();
	}
};
static_assert(alignof(ABP_VehicleDamageableProxy_JobZero_C) == 0x000008, "Wrong alignment on ABP_VehicleDamageableProxy_JobZero_C");
static_assert(sizeof(ABP_VehicleDamageableProxy_JobZero_C) == 0x000338, "Wrong size on ABP_VehicleDamageableProxy_JobZero_C");
static_assert(offsetof(ABP_VehicleDamageableProxy_JobZero_C, UberGraphFrame) == 0x000300, "Member 'ABP_VehicleDamageableProxy_JobZero_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VehicleDamageableProxy_JobZero_C, HitBox) == 0x000308, "Member 'ABP_VehicleDamageableProxy_JobZero_C::HitBox' has a wrong offset!");
static_assert(offsetof(ABP_VehicleDamageableProxy_JobZero_C, DefaultSceneRoot) == 0x000310, "Member 'ABP_VehicleDamageableProxy_JobZero_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_VehicleDamageableProxy_JobZero_C, OnDeath) == 0x000318, "Member 'ABP_VehicleDamageableProxy_JobZero_C::OnDeath' has a wrong offset!");
static_assert(offsetof(ABP_VehicleDamageableProxy_JobZero_C, OutCombatCD) == 0x000328, "Member 'ABP_VehicleDamageableProxy_JobZero_C::OutCombatCD' has a wrong offset!");
static_assert(offsetof(ABP_VehicleDamageableProxy_JobZero_C, GE_HealthRegen) == 0x00032C, "Member 'ABP_VehicleDamageableProxy_JobZero_C::GE_HealthRegen' has a wrong offset!");

}

