#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Warning_Material_PP

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Warning_Material_PP.BP_Warning_Material_PP_C.TickBP
// 0x0004 (0x0004 - 0x0000)
struct BP_Warning_Material_PP_C_TickBP final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Warning_Material_PP_C_TickBP) == 0x000004, "Wrong alignment on BP_Warning_Material_PP_C_TickBP");
static_assert(sizeof(BP_Warning_Material_PP_C_TickBP) == 0x000004, "Wrong size on BP_Warning_Material_PP_C_TickBP");
static_assert(offsetof(BP_Warning_Material_PP_C_TickBP, DeltaTime) == 0x000000, "Member 'BP_Warning_Material_PP_C_TickBP::DeltaTime' has a wrong offset!");

// Function BP_Warning_Material_PP.BP_Warning_Material_PP_C.ExecuteUbergraph_BP_Warning_Material_PP
// 0x0080 (0x0080 - 0x0000)
struct BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5897[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5898[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadingIn_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5899[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFadeInProgress_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadingOut_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589A[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFadeOutProgress_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589B[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589C[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP) == 0x000008, "Wrong alignment on BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP");
static_assert(sizeof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP) == 0x000080, "Wrong size on BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, EntryPoint) == 0x000000, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000008, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, K2Node_Event_DeltaTime) == 0x000014, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_IsFadingIn_ReturnValue) == 0x000018, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_IsFadingIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_GetFadeInProgress_ReturnValue) == 0x00001C, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_GetFadeInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_IsValid_ReturnValue_2) == 0x000020, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_IsFadingOut_ReturnValue) == 0x000021, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_IsFadingOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_GetFadeOutProgress_ReturnValue) == 0x000024, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_GetFadeOutProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000038, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000048, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x000058, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_IsValid_ReturnValue_3) == 0x000068, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast) == 0x00006C, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_AddOrUpdateBlendable_InWeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000070, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000078, "Member 'BP_Warning_Material_PP_C_ExecuteUbergraph_BP_Warning_Material_PP::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

