#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_XRS_PrepareMatch

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_XRS_PrepareMatch.BP_XRS_PrepareMatch_C.ExecuteUbergraph_BP_XRS_PrepareMatch
// 0x0004 (0x0004 - 0x0000)
struct BP_XRS_PrepareMatch_C_ExecuteUbergraph_BP_XRS_PrepareMatch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_XRS_PrepareMatch_C_ExecuteUbergraph_BP_XRS_PrepareMatch) == 0x000004, "Wrong alignment on BP_XRS_PrepareMatch_C_ExecuteUbergraph_BP_XRS_PrepareMatch");
static_assert(sizeof(BP_XRS_PrepareMatch_C_ExecuteUbergraph_BP_XRS_PrepareMatch) == 0x000004, "Wrong size on BP_XRS_PrepareMatch_C_ExecuteUbergraph_BP_XRS_PrepareMatch");
static_assert(offsetof(BP_XRS_PrepareMatch_C_ExecuteUbergraph_BP_XRS_PrepareMatch, EntryPoint) == 0x000000, "Member 'BP_XRS_PrepareMatch_C_ExecuteUbergraph_BP_XRS_PrepareMatch::EntryPoint' has a wrong offset!");

// Function BP_XRS_PrepareMatch.BP_XRS_PrepareMatch_C.SpawnPredefinedSpawners
// 0x0038 (0x0038 - 0x0000)
struct BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BF9[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PredefinedSpawner_C*>        CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BFA[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PredefinedSpawner_C*                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners) == 0x000008, "Wrong alignment on BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners");
static_assert(sizeof(BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners) == 0x000038, "Wrong size on BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_XRS_PrepareMatch_C_SpawnPredefinedSpawners::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_XRS_PrepareMatch.BP_XRS_PrepareMatch_C.SpawnPickableSpawner
// 0x0038 (0x0038 - 0x0000)
struct BP_XRS_PrepareMatch_C_SpawnPickableSpawner final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BFB[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PickableSpawner_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BFC[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PickableSpawner_C*                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_XRS_PrepareMatch_C_SpawnPickableSpawner) == 0x000008, "Wrong alignment on BP_XRS_PrepareMatch_C_SpawnPickableSpawner");
static_assert(sizeof(BP_XRS_PrepareMatch_C_SpawnPickableSpawner) == 0x000038, "Wrong size on BP_XRS_PrepareMatch_C_SpawnPickableSpawner");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPickableSpawner, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_XRS_PrepareMatch_C_SpawnPickableSpawner::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPickableSpawner, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_XRS_PrepareMatch_C_SpawnPickableSpawner::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPickableSpawner, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_XRS_PrepareMatch_C_SpawnPickableSpawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPickableSpawner, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_XRS_PrepareMatch_C_SpawnPickableSpawner::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPickableSpawner, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_XRS_PrepareMatch_C_SpawnPickableSpawner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPickableSpawner, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_XRS_PrepareMatch_C_SpawnPickableSpawner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPickableSpawner, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_XRS_PrepareMatch_C_SpawnPickableSpawner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_XRS_PrepareMatch_C_SpawnPickableSpawner, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'BP_XRS_PrepareMatch_C_SpawnPickableSpawner::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

