#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_XR_DeploymentPathSetup

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_XR_DeploymentPathSetup.BP_XR_DeploymentPathSetup_C
// 0x0030 (0x02F0 - 0x02C0)
class ABP_XR_DeploymentPathSetup_C final : public AGzDeploymentPathSetup
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EvenPlanesOffset;                                  // 0x02C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        VectorArray;                                       // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	struct FVector GetTransportOffset(int32 TransportIndex, int32 NumOfTransport) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_XR_DeploymentPathSetup_C">();
	}
	static class ABP_XR_DeploymentPathSetup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_XR_DeploymentPathSetup_C>();
	}
};
static_assert(alignof(ABP_XR_DeploymentPathSetup_C) == 0x000008, "Wrong alignment on ABP_XR_DeploymentPathSetup_C");
static_assert(sizeof(ABP_XR_DeploymentPathSetup_C) == 0x0002F0, "Wrong size on ABP_XR_DeploymentPathSetup_C");
static_assert(offsetof(ABP_XR_DeploymentPathSetup_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_XR_DeploymentPathSetup_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPathSetup_C, EvenPlanesOffset) == 0x0002C8, "Member 'ABP_XR_DeploymentPathSetup_C::EvenPlanesOffset' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPathSetup_C, VectorArray) == 0x0002E0, "Member 'ABP_XR_DeploymentPathSetup_C::VectorArray' has a wrong offset!");

}

