#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_XR_DeploymentPlane

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_XR_DeploymentPlane.BP_XR_DeploymentPlane_C
// 0x00F8 (0x0620 - 0x0528)
class ABP_XR_DeploymentPlane_C final : public AGzProceduralDeploymentTransport
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Plane_Flame_LM1;                                   // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane_Flame_LT_L1;                                 // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane_Flame_LB_R1;                                 // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane_Flame_LB_L1;                                 // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane_Flame_LT_R1;                                 // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane_Flame_LT_RM1;                                // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane_Flame_LM;                                    // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane_Flame_LT_RM;                                 // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane_Flame_LB_R;                                  // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane_Flame_LT_R;                                  // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane_Flame_LB_L;                                  // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane_Flame_LT_L;                                  // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CascadiaPlane_Helicopter_decals;                // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CascadiaPlane_Helicopter_base;                  // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Jets_Smoke_Trail_02;                            // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Jets_Smoke_Trail_01;                            // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Jets_Exhaust_01_L;                              // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Jets_Exhaust_01_R;                              // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPC_MarkerComponent_C*              BP_MarkerComponent;                                // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ForceDeployEventHandler_C*          BP_ForceDeployEventHandler;                        // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DeploymentAvailabilityEventHandler_C* BP_DeploymentAvailabilityEventHandler;             // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeTimeline_Fade_1062353E4695502D4F7EE59CE8B44C45; // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeTimeline__Direction_1062353E4695502D4F7EE59CE8B44C45; // 0x05DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ED0[0x3];                                     // 0x05DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeTimeline;                                      // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       Materials;                                         // 0x05E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UNiagaraComponent*>              VFX;                                               // 0x05F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UMaterialInstanceDynamic*>       FlameMaterials;                                    // 0x0608(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        FadeDelay;                                         // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_XR_DeploymentPlane(int32 EntryPoint);
	void FadeAnimation();
	void FadeTimeline__FinishedFunc();
	void FadeTimeline__UpdateFunc();
	void OnEndReached();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_XR_DeploymentPlane_C">();
	}
	static class ABP_XR_DeploymentPlane_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_XR_DeploymentPlane_C>();
	}
};
static_assert(alignof(ABP_XR_DeploymentPlane_C) == 0x000008, "Wrong alignment on ABP_XR_DeploymentPlane_C");
static_assert(sizeof(ABP_XR_DeploymentPlane_C) == 0x000620, "Wrong size on ABP_XR_DeploymentPlane_C");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, UberGraphFrame) == 0x000528, "Member 'ABP_XR_DeploymentPlane_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, Plane_Flame_LM1) == 0x000530, "Member 'ABP_XR_DeploymentPlane_C::Plane_Flame_LM1' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, Plane_Flame_LT_L1) == 0x000538, "Member 'ABP_XR_DeploymentPlane_C::Plane_Flame_LT_L1' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, Plane_Flame_LB_R1) == 0x000540, "Member 'ABP_XR_DeploymentPlane_C::Plane_Flame_LB_R1' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, Plane_Flame_LB_L1) == 0x000548, "Member 'ABP_XR_DeploymentPlane_C::Plane_Flame_LB_L1' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, Plane_Flame_LT_R1) == 0x000550, "Member 'ABP_XR_DeploymentPlane_C::Plane_Flame_LT_R1' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, Plane_Flame_LT_RM1) == 0x000558, "Member 'ABP_XR_DeploymentPlane_C::Plane_Flame_LT_RM1' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, Plane_Flame_LM) == 0x000560, "Member 'ABP_XR_DeploymentPlane_C::Plane_Flame_LM' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, Plane_Flame_LT_RM) == 0x000568, "Member 'ABP_XR_DeploymentPlane_C::Plane_Flame_LT_RM' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, Plane_Flame_LB_R) == 0x000570, "Member 'ABP_XR_DeploymentPlane_C::Plane_Flame_LB_R' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, Plane_Flame_LT_R) == 0x000578, "Member 'ABP_XR_DeploymentPlane_C::Plane_Flame_LT_R' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, Plane_Flame_LB_L) == 0x000580, "Member 'ABP_XR_DeploymentPlane_C::Plane_Flame_LB_L' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, Plane_Flame_LT_L) == 0x000588, "Member 'ABP_XR_DeploymentPlane_C::Plane_Flame_LT_L' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, SM_CascadiaPlane_Helicopter_decals) == 0x000590, "Member 'ABP_XR_DeploymentPlane_C::SM_CascadiaPlane_Helicopter_decals' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, SM_CascadiaPlane_Helicopter_base) == 0x000598, "Member 'ABP_XR_DeploymentPlane_C::SM_CascadiaPlane_Helicopter_base' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, NS_Jets_Smoke_Trail_02) == 0x0005A0, "Member 'ABP_XR_DeploymentPlane_C::NS_Jets_Smoke_Trail_02' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, NS_Jets_Smoke_Trail_01) == 0x0005A8, "Member 'ABP_XR_DeploymentPlane_C::NS_Jets_Smoke_Trail_01' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, NS_Jets_Exhaust_01_L) == 0x0005B0, "Member 'ABP_XR_DeploymentPlane_C::NS_Jets_Exhaust_01_L' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, NS_Jets_Exhaust_01_R) == 0x0005B8, "Member 'ABP_XR_DeploymentPlane_C::NS_Jets_Exhaust_01_R' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, BP_MarkerComponent) == 0x0005C0, "Member 'ABP_XR_DeploymentPlane_C::BP_MarkerComponent' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, BP_ForceDeployEventHandler) == 0x0005C8, "Member 'ABP_XR_DeploymentPlane_C::BP_ForceDeployEventHandler' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, BP_DeploymentAvailabilityEventHandler) == 0x0005D0, "Member 'ABP_XR_DeploymentPlane_C::BP_DeploymentAvailabilityEventHandler' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, FadeTimeline_Fade_1062353E4695502D4F7EE59CE8B44C45) == 0x0005D8, "Member 'ABP_XR_DeploymentPlane_C::FadeTimeline_Fade_1062353E4695502D4F7EE59CE8B44C45' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, FadeTimeline__Direction_1062353E4695502D4F7EE59CE8B44C45) == 0x0005DC, "Member 'ABP_XR_DeploymentPlane_C::FadeTimeline__Direction_1062353E4695502D4F7EE59CE8B44C45' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, FadeTimeline) == 0x0005E0, "Member 'ABP_XR_DeploymentPlane_C::FadeTimeline' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, Materials) == 0x0005E8, "Member 'ABP_XR_DeploymentPlane_C::Materials' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, VFX) == 0x0005F8, "Member 'ABP_XR_DeploymentPlane_C::VFX' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, FlameMaterials) == 0x000608, "Member 'ABP_XR_DeploymentPlane_C::FlameMaterials' has a wrong offset!");
static_assert(offsetof(ABP_XR_DeploymentPlane_C, FadeDelay) == 0x000618, "Member 'ABP_XR_DeploymentPlane_C::FadeDelay' has a wrong offset!");

}

