#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZiplineNiagaraComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_NonAutoActivatableNiagaraComponent_classes.hpp"
#include "G01_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ZiplineNiagaraComponent.BP_ZiplineNiagaraComponent_C
// 0x0020 (0x07A0 - 0x0780)
class UBP_ZiplineNiagaraComponent_C final : public UBP_NonAutoActivatableNiagaraComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0780(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   LeftArmSocket;                                     // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RightArmSocket;                                    // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AttachComponentToCharacter(class UActorComponent* Component, bool bReset);
	void AttachComponentToLimb(class AGzMultiPartCharacter* Character, class USceneComponent* SceneComponent, EGzLimbType LimbType, class FName AttachSocket, bool* bSuccess);
	void ExecuteUbergraph_BP_ZiplineNiagaraComponent(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ZiplineNiagaraComponent_C">();
	}
	static class UBP_ZiplineNiagaraComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ZiplineNiagaraComponent_C>();
	}
};
static_assert(alignof(UBP_ZiplineNiagaraComponent_C) == 0x000010, "Wrong alignment on UBP_ZiplineNiagaraComponent_C");
static_assert(sizeof(UBP_ZiplineNiagaraComponent_C) == 0x0007A0, "Wrong size on UBP_ZiplineNiagaraComponent_C");
static_assert(offsetof(UBP_ZiplineNiagaraComponent_C, UberGraphFrame) == 0x000780, "Member 'UBP_ZiplineNiagaraComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ZiplineNiagaraComponent_C, LeftArmSocket) == 0x000788, "Member 'UBP_ZiplineNiagaraComponent_C::LeftArmSocket' has a wrong offset!");
static_assert(offsetof(UBP_ZiplineNiagaraComponent_C, RightArmSocket) == 0x000790, "Member 'UBP_ZiplineNiagaraComponent_C::RightArmSocket' has a wrong offset!");

}

