#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZiplineTemplate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ZiplineTemplate.BP_ZiplineTemplate_C
// 0x0020 (0x0730 - 0x0710)
class ABP_ZiplineTemplate_C : public AGzZipline
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0710(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bUseVFXForStartEdgeSegment;                        // 0x0718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseVFXForEndEdgeSegment;                          // 0x0719(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B10[0x2];                                     // 0x071A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PillarVFXSocketName;                               // 0x071C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B11[0x4];                                     // 0x0724(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     BillboardMaterial;                                 // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_ZiplineTemplate(int32 EntryPoint);
	void CreateNiagaraComponent(const struct FTransform& Transform, class UObject* SelfIn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ZiplineTemplate_C">();
	}
	static class ABP_ZiplineTemplate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ZiplineTemplate_C>();
	}
};
static_assert(alignof(ABP_ZiplineTemplate_C) == 0x000010, "Wrong alignment on ABP_ZiplineTemplate_C");
static_assert(sizeof(ABP_ZiplineTemplate_C) == 0x000730, "Wrong size on ABP_ZiplineTemplate_C");
static_assert(offsetof(ABP_ZiplineTemplate_C, UberGraphFrame) == 0x000710, "Member 'ABP_ZiplineTemplate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ZiplineTemplate_C, bUseVFXForStartEdgeSegment) == 0x000718, "Member 'ABP_ZiplineTemplate_C::bUseVFXForStartEdgeSegment' has a wrong offset!");
static_assert(offsetof(ABP_ZiplineTemplate_C, bUseVFXForEndEdgeSegment) == 0x000719, "Member 'ABP_ZiplineTemplate_C::bUseVFXForEndEdgeSegment' has a wrong offset!");
static_assert(offsetof(ABP_ZiplineTemplate_C, PillarVFXSocketName) == 0x00071C, "Member 'ABP_ZiplineTemplate_C::PillarVFXSocketName' has a wrong offset!");
static_assert(offsetof(ABP_ZiplineTemplate_C, BillboardMaterial) == 0x000728, "Member 'ABP_ZiplineTemplate_C::BillboardMaterial' has a wrong offset!");

}

