#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZiplineTemplate

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ZiplineTemplate.BP_ZiplineTemplate_C.UserConstructionScript
// 0x02D0 (0x02D0 - 0x0000)
struct BP_ZiplineTemplate_C_UserConstructionScript final
{
public:
	struct FVector                                EndPointWorld;                                     // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndPointRel;                                       // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMaxElement_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_GetEndEdgeSegmentMeshComponent_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B12[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B13[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B14[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_GetStartEdgeSegmentMeshComponent_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B15[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0160(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x01C8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_SetBoundsScale_NewBoundsScale_ImplicitCast; // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast; // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZiplineTemplate_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_ZiplineTemplate_C_UserConstructionScript");
static_assert(sizeof(BP_ZiplineTemplate_C_UserConstructionScript) == 0x0002D0, "Wrong size on BP_ZiplineTemplate_C_UserConstructionScript");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, EndPointWorld) == 0x000000, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::EndPointWorld' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, EndPointRel) == 0x000018, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::EndPointRel' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_GetActorBounds_Origin) == 0x000030, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_GetActorBounds_BoxExtent) == 0x000048, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_GetMaxElement_ReturnValue) == 0x000060, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_GetMaxElement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_GetEndEdgeSegmentMeshComponent_ReturnValue) == 0x000068, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_GetEndEdgeSegmentMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_Array_LastIndex_ReturnValue) == 0x000070, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000074, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000088, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000A0, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue) == 0x0000A1, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000A8, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_GetStartEdgeSegmentMeshComponent_ReturnValue) == 0x0000C0, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_GetStartEdgeSegmentMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_2) == 0x0000C8, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0000D0, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_Vector_Distance_ReturnValue) == 0x0000E8, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000F0, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000108, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000110, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000118, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x000130, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_Divide_VectorVector_ReturnValue) == 0x000148, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000160, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x0001C0, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0001C8, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_SetBoundsScale_NewBoundsScale_ImplicitCast) == 0x0002C0, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_SetBoundsScale_NewBoundsScale_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_UserConstructionScript, CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast) == 0x0002C4, "Member 'BP_ZiplineTemplate_C_UserConstructionScript::CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast' has a wrong offset!");

// Function BP_ZiplineTemplate.BP_ZiplineTemplate_C.ExecuteUbergraph_BP_ZiplineTemplate
// 0x0004 (0x0004 - 0x0000)
struct BP_ZiplineTemplate_C_ExecuteUbergraph_BP_ZiplineTemplate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZiplineTemplate_C_ExecuteUbergraph_BP_ZiplineTemplate) == 0x000004, "Wrong alignment on BP_ZiplineTemplate_C_ExecuteUbergraph_BP_ZiplineTemplate");
static_assert(sizeof(BP_ZiplineTemplate_C_ExecuteUbergraph_BP_ZiplineTemplate) == 0x000004, "Wrong size on BP_ZiplineTemplate_C_ExecuteUbergraph_BP_ZiplineTemplate");
static_assert(offsetof(BP_ZiplineTemplate_C_ExecuteUbergraph_BP_ZiplineTemplate, EntryPoint) == 0x000000, "Member 'BP_ZiplineTemplate_C_ExecuteUbergraph_BP_ZiplineTemplate::EntryPoint' has a wrong offset!");

// Function BP_ZiplineTemplate.BP_ZiplineTemplate_C.CreateNiagaraComponent
// 0x01D0 (0x01D0 - 0x0000)
struct BP_ZiplineTemplate_C_CreateNiagaraComponent final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                SelfIn;                                            // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B16[0x8];                                     // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x00F0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0150(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZiplineTemplate_C_CreateNiagaraComponent) == 0x000010, "Wrong alignment on BP_ZiplineTemplate_C_CreateNiagaraComponent");
static_assert(sizeof(BP_ZiplineTemplate_C_CreateNiagaraComponent) == 0x0001D0, "Wrong size on BP_ZiplineTemplate_C_CreateNiagaraComponent");
static_assert(offsetof(BP_ZiplineTemplate_C_CreateNiagaraComponent, Transform) == 0x000000, "Member 'BP_ZiplineTemplate_C_CreateNiagaraComponent::Transform' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_CreateNiagaraComponent, SelfIn) == 0x000060, "Member 'BP_ZiplineTemplate_C_CreateNiagaraComponent::SelfIn' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_CreateNiagaraComponent, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000068, "Member 'BP_ZiplineTemplate_C_CreateNiagaraComponent::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_CreateNiagaraComponent, CallFunc_BreakTransform_Location) == 0x000080, "Member 'BP_ZiplineTemplate_C_CreateNiagaraComponent::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_CreateNiagaraComponent, CallFunc_BreakTransform_Rotation) == 0x000098, "Member 'BP_ZiplineTemplate_C_CreateNiagaraComponent::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_CreateNiagaraComponent, CallFunc_BreakTransform_Scale) == 0x0000B0, "Member 'BP_ZiplineTemplate_C_CreateNiagaraComponent::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_CreateNiagaraComponent, CallFunc_GetOwner_ReturnValue) == 0x0000C8, "Member 'BP_ZiplineTemplate_C_CreateNiagaraComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_CreateNiagaraComponent, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000D0, "Member 'BP_ZiplineTemplate_C_CreateNiagaraComponent::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_CreateNiagaraComponent, Temp_struct_Variable) == 0x0000F0, "Member 'BP_ZiplineTemplate_C_CreateNiagaraComponent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_CreateNiagaraComponent, CallFunc_MakeTransform_ReturnValue) == 0x000150, "Member 'BP_ZiplineTemplate_C_CreateNiagaraComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_CreateNiagaraComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001B0, "Member 'BP_ZiplineTemplate_C_CreateNiagaraComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_CreateNiagaraComponent, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001B8, "Member 'BP_ZiplineTemplate_C_CreateNiagaraComponent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineTemplate_C_CreateNiagaraComponent, CallFunc_AddComponent_ReturnValue) == 0x0001C0, "Member 'BP_ZiplineTemplate_C_CreateNiagaraComponent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

}

