#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZiplineDrone

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ZiplineDrone.BP_ZiplineDrone_C.ExecuteUbergraph_BP_ZiplineDrone
// 0x0080 (0x0080 - 0x0000)
struct BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AD5[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AD6[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AD7[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AD8[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0068(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone) == 0x000008, "Wrong alignment on BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone");
static_assert(sizeof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone) == 0x000080, "Wrong size on BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, EntryPoint) == 0x000000, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000010, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000018, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000048, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, CallFunc_Vector_Distance_ReturnValue) == 0x000060, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, Temp_delegate_Variable) == 0x000068, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x000078, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00007C, "Member 'BP_ZiplineDrone_C_ExecuteUbergraph_BP_ZiplineDrone::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_ZiplineDrone.BP_ZiplineDrone_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ZiplineDrone_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZiplineDrone_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ZiplineDrone_C_ReceiveTick");
static_assert(sizeof(BP_ZiplineDrone_C_ReceiveTick) == 0x000004, "Wrong size on BP_ZiplineDrone_C_ReceiveTick");
static_assert(offsetof(BP_ZiplineDrone_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ZiplineDrone_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ZiplineDrone.BP_ZiplineDrone_C.SpawnRepulsionZone
// 0x0080 (0x0080 - 0x0000)
struct BP_ZiplineDrone_C_SpawnRepulsionZone final
{
public:
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DropPodImpulseZone_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZiplineDrone_C_SpawnRepulsionZone) == 0x000010, "Wrong alignment on BP_ZiplineDrone_C_SpawnRepulsionZone");
static_assert(sizeof(BP_ZiplineDrone_C_SpawnRepulsionZone) == 0x000080, "Wrong size on BP_ZiplineDrone_C_SpawnRepulsionZone");
static_assert(offsetof(BP_ZiplineDrone_C_SpawnRepulsionZone, CallFunc_GetRelativeTransform_ReturnValue) == 0x000000, "Member 'BP_ZiplineDrone_C_SpawnRepulsionZone::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_SpawnRepulsionZone, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'BP_ZiplineDrone_C_SpawnRepulsionZone::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_SpawnRepulsionZone, CallFunc_FinishSpawningActor_ReturnValue) == 0x000068, "Member 'BP_ZiplineDrone_C_SpawnRepulsionZone::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZiplineDrone_C_SpawnRepulsionZone, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000070, "Member 'BP_ZiplineDrone_C_SpawnRepulsionZone::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function BP_ZiplineDrone.BP_ZiplineDrone_C.GetPingVoiceLineData
// 0x0010 (0x0010 - 0x0000)
struct BP_ZiplineDrone_C_GetPingVoiceLineData final
{
public:
	struct FGzPingVoiceLineData                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(BP_ZiplineDrone_C_GetPingVoiceLineData) == 0x000008, "Wrong alignment on BP_ZiplineDrone_C_GetPingVoiceLineData");
static_assert(sizeof(BP_ZiplineDrone_C_GetPingVoiceLineData) == 0x000010, "Wrong size on BP_ZiplineDrone_C_GetPingVoiceLineData");
static_assert(offsetof(BP_ZiplineDrone_C_GetPingVoiceLineData, ReturnValue) == 0x000000, "Member 'BP_ZiplineDrone_C_GetPingVoiceLineData::ReturnValue' has a wrong offset!");

}

