#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZoneSetup

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ZoneSetup.BP_ZoneSetup_C.UserConstructionScript
// 0x0098 (0x0098 - 0x0000)
struct BP_ZoneSetup_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetRadius_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67F4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZoneSetup_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ZoneSetup_C_UserConstructionScript");
static_assert(sizeof(BP_ZoneSetup_C_UserConstructionScript) == 0x000098, "Wrong size on BP_ZoneSetup_C_UserConstructionScript");
static_assert(offsetof(BP_ZoneSetup_C_UserConstructionScript, CallFunc_GetRadius_ReturnValue) == 0x000000, "Member 'BP_ZoneSetup_C_UserConstructionScript::CallFunc_GetRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZoneSetup_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_ZoneSetup_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZoneSetup_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000020, "Member 'BP_ZoneSetup_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZoneSetup_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000038, "Member 'BP_ZoneSetup_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ZoneSetup_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000040, "Member 'BP_ZoneSetup_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ZoneSetup_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000048, "Member 'BP_ZoneSetup_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ZoneSetup_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x000050, "Member 'BP_ZoneSetup_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_ZoneSetup_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000058, "Member 'BP_ZoneSetup_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_ZoneSetup_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x000060, "Member 'BP_ZoneSetup_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_ZoneSetup_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000068, "Member 'BP_ZoneSetup_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZoneSetup_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000080, "Member 'BP_ZoneSetup_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

}

