#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_NPC_MirrorBreaker

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_NPC_MirrorBreaker.BPC_NPC_MirrorBreaker_C.ReceivePossess
// 0x0008 (0x0008 - 0x0000)
struct BPC_NPC_MirrorBreaker_C_ReceivePossess final
{
public:
	class APawn*                                  PossessedPawn;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_NPC_MirrorBreaker_C_ReceivePossess) == 0x000008, "Wrong alignment on BPC_NPC_MirrorBreaker_C_ReceivePossess");
static_assert(sizeof(BPC_NPC_MirrorBreaker_C_ReceivePossess) == 0x000008, "Wrong size on BPC_NPC_MirrorBreaker_C_ReceivePossess");
static_assert(offsetof(BPC_NPC_MirrorBreaker_C_ReceivePossess, PossessedPawn) == 0x000000, "Member 'BPC_NPC_MirrorBreaker_C_ReceivePossess::PossessedPawn' has a wrong offset!");

// Function BPC_NPC_MirrorBreaker.BPC_NPC_MirrorBreaker_C.ExecuteUbergraph_BPC_NPC_MirrorBreaker
// 0x0030 (0x0030 - 0x0000)
struct BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_670C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_PossessedPawn;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzNonPlayerCharacter*                  K2Node_DynamicCast_AsGz_Non_Player_Character;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_670D[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryActivateAbilityByClass_ReturnValue;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker) == 0x000008, "Wrong alignment on BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker");
static_assert(sizeof(BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker) == 0x000030, "Wrong size on BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker");
static_assert(offsetof(BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker, EntryPoint) == 0x000000, "Member 'BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker, K2Node_Event_PossessedPawn) == 0x000008, "Member 'BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker::K2Node_Event_PossessedPawn' has a wrong offset!");
static_assert(offsetof(BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker, K2Node_DynamicCast_AsGz_Non_Player_Character) == 0x000010, "Member 'BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker::K2Node_DynamicCast_AsGz_Non_Player_Character' has a wrong offset!");
static_assert(offsetof(BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker, CallFunc_GetGzAbilitySystemComponent_ReturnValue) == 0x000020, "Member 'BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker::CallFunc_GetGzAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker, CallFunc_TryActivateAbilityByClass_ReturnValue) == 0x000028, "Member 'BPC_NPC_MirrorBreaker_C_ExecuteUbergraph_BPC_NPC_MirrorBreaker::CallFunc_TryActivateAbilityByClass_ReturnValue' has a wrong offset!");

// Function BPC_NPC_MirrorBreaker.BPC_NPC_MirrorBreaker_C.Event_IdleEnd__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BPC_NPC_MirrorBreaker_C_Event_IdleEnd__DelegateSignature final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_NPC_MirrorBreaker_C_Event_IdleEnd__DelegateSignature) == 0x000001, "Wrong alignment on BPC_NPC_MirrorBreaker_C_Event_IdleEnd__DelegateSignature");
static_assert(sizeof(BPC_NPC_MirrorBreaker_C_Event_IdleEnd__DelegateSignature) == 0x000001, "Wrong size on BPC_NPC_MirrorBreaker_C_Event_IdleEnd__DelegateSignature");
static_assert(offsetof(BPC_NPC_MirrorBreaker_C_Event_IdleEnd__DelegateSignature, Success) == 0x000000, "Member 'BPC_NPC_MirrorBreaker_C_Event_IdleEnd__DelegateSignature::Success' has a wrong offset!");

// Function BPC_NPC_MirrorBreaker.BPC_NPC_MirrorBreaker_C.Event_AlertEnd__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BPC_NPC_MirrorBreaker_C_Event_AlertEnd__DelegateSignature final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_NPC_MirrorBreaker_C_Event_AlertEnd__DelegateSignature) == 0x000001, "Wrong alignment on BPC_NPC_MirrorBreaker_C_Event_AlertEnd__DelegateSignature");
static_assert(sizeof(BPC_NPC_MirrorBreaker_C_Event_AlertEnd__DelegateSignature) == 0x000001, "Wrong size on BPC_NPC_MirrorBreaker_C_Event_AlertEnd__DelegateSignature");
static_assert(offsetof(BPC_NPC_MirrorBreaker_C_Event_AlertEnd__DelegateSignature, Success) == 0x000000, "Member 'BPC_NPC_MirrorBreaker_C_Event_AlertEnd__DelegateSignature::Success' has a wrong offset!");

}

