#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_Lighting

#include "Basic.hpp"

#include "S_PodiumBulb_01_Settings_structs.hpp"
#include "S_Bulb_01_Settings_structs.hpp"
#include "S_Light_Fitting_Mesh_Settings_structs.hpp"
#include "S_LED_Diode_03_structs.hpp"
#include "S_Bulb_Light_02_Settings_structs.hpp"
#include "S_PodiumBulb_03_Settings_structs.hpp"
#include "S_Bulb_Light_03_Settings_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_LED_Diode_02_structs.hpp"
#include "S_PodiumBulb_02_Settings_structs.hpp"
#include "S_Bulb_Light_01_Settings_structs.hpp"
#include "S_LED_Diode_01_structs.hpp"
#include "S_Bulb_03_Settings_structs.hpp"
#include "S_Prop_Mesh_01_structs.hpp"
#include "S_Procedural_Railings_structs.hpp"
#include "Engine_structs.hpp"
#include "S_Light_Presets_structs.hpp"
#include "S_Ambient_Emissive_Settings_structs.hpp"
#include "S_Light_02_Settings_structs.hpp"
#include "S_Light_01_Settings_structs.hpp"
#include "S_Bulb_Light_04_Emissive_Settings_structs.hpp"
#include "S_Main_Throw_Light_01_Settings_structs.hpp"
#include "S_LED_Diode_04_structs.hpp"
#include "S_Bulb_04_Setting_structs.hpp"
#include "S_Bulb_Light_04_Settings_structs.hpp"
#include "S_Bulb_02_Settings_structs.hpp"
#include "S_Main_Throw_Light_02_Settings_structs.hpp"
#include "S_Bulb_Light_03_Emissive_Settings_structs.hpp"
#include "S_Bulb_Light_02_Emissive_Settings_structs.hpp"
#include "S_Bulb_Light_01_Emissive_Settings_structs.hpp"
#include "S_Light_02_Emissive_Settings_structs.hpp"
#include "S_Light_01_Emissive_Settings_structs.hpp"


namespace SDK::Params
{

// Function BPFL_Lighting.BPFL_Lighting_C.AddSuspension
// 0x0B80 (0x0B80 - 0x0000)
struct BPFL_Lighting_C_AddSuspension final
{
public:
	class UObject*                                Blueprint;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            SuspensionMesh;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF3[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Prop_Mesh_01                        PropSettings;                                      // 0x0020(0x0120)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FVector                                PrevAnchor;                                        // 0x0140(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PrevProp;                                          // 0x0158(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        PrevSplinePoint0;                                  // 0x0170(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FVector>                        PrevSplinePoint1;                                  // 0x0180(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FS_Light_Fitting_Mesh_Settings         LightFittingSettings;                              // 0x0190(0x0120)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USplineComponent*>               Splines;                                           // 0x02B8(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FVector                                SplinePoint2;                                      // 0x02C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SplinePoint1;                                      // 0x02E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DistanceAlongSpline;                               // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x0300(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EF4[0x8];                                     // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_SelectTransform_ReturnValue;              // 0x0340(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_Origin;              // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_BoxExtent;           // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakBoxSphereBounds_SphereRadius;        // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF5[0x4];                                     // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0408(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF6[0x7];                                     // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0440(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_MaxOfFloatArray_IndexOfMaxValue;          // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MaxOfFloatArray_MaxValue;                 // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF7[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF8[0x7];                                     // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF9[0x3];                                     // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EFA[0x8];                                     // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0490(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EFB[0x3];                                     // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue;             // 0x0520(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0548(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EFC[0x4];                                     // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0580(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EFD[0x4];                                     // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x05A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EFE[0x3];                                     // 0x05B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue_1;                  // 0x05C0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakBoxSphereBounds_Origin_1;            // 0x05F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_BoxExtent_1;         // 0x0610(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakBoxSphereBounds_SphereRadius_1;      // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EFF[0x4];                                     // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0648(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                K2Node_MakeArray_Array_1;                          // 0x0660(0x0010)(ReferenceParm)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_2;                        // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F00[0x8];                                     // 0x0688(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0690(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array_2;                          // 0x06F0(0x0010)(ConstParm, ReferenceParm)
	struct FTransform                             CallFunc_SelectTransform_ReturnValue_1;            // 0x0700(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MaxOfFloatArray_IndexOfMaxValue_1;        // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MaxOfFloatArray_MaxValue_1;               // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0768(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0780(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0798(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item;                           // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x07B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F01[0x4];                                     // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SignOfFloat_ReturnValue;                  // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F02[0x3];                                     // 0x07C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x07CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x07D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_3;        // 0x07F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_4;        // 0x0808(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x0820(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F03[0x3];                                     // 0x0829(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponentByClass_ReturnValue;          // 0x0830(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F04[0x7];                                     // 0x0839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x0840(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_2;                         // 0x0858(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0870(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0888(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x08A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x08B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue_1;           // 0x08D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVectorAtDistanceAlongSpline_ReturnValue; // 0x08E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue; // 0x0900(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x0918(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0930(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0948(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x0960(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0978(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x0990(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_2;                           // 0x09A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x09C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_5;      // 0x09D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x09F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F05[0x8];                                     // 0x0A08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0A10(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0A70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F06[0x4];                                     // 0x0A74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x0A78(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x0A90(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x0AA8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0AC0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F07[0x8];                                     // 0x0AD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0AE0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue_1;                // 0x0B40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeArray__0__ImplicitCast;                 // 0x0B44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeArray__1__ImplicitCast;                 // 0x0B48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeArray__2__ImplicitCast;                 // 0x0B4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0B50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0B58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast;    // 0x0B60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeArray__2__ImplicitCast_1;               // 0x0B64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeArray__1__ImplicitCast_1;               // 0x0B68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeArray__0__ImplicitCast_1;               // 0x0B6C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0B70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0B74(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUpVectorAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0B78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRightVectorAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0B7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Lighting_C_AddSuspension) == 0x000010, "Wrong alignment on BPFL_Lighting_C_AddSuspension");
static_assert(sizeof(BPFL_Lighting_C_AddSuspension) == 0x000B80, "Wrong size on BPFL_Lighting_C_AddSuspension");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, Blueprint) == 0x000000, "Member 'BPFL_Lighting_C_AddSuspension::Blueprint' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, Spline) == 0x000008, "Member 'BPFL_Lighting_C_AddSuspension::Spline' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, SuspensionMesh) == 0x000010, "Member 'BPFL_Lighting_C_AddSuspension::SuspensionMesh' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, PropSettings) == 0x000020, "Member 'BPFL_Lighting_C_AddSuspension::PropSettings' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, PrevAnchor) == 0x000140, "Member 'BPFL_Lighting_C_AddSuspension::PrevAnchor' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, PrevProp) == 0x000158, "Member 'BPFL_Lighting_C_AddSuspension::PrevProp' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, PrevSplinePoint0) == 0x000170, "Member 'BPFL_Lighting_C_AddSuspension::PrevSplinePoint0' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, PrevSplinePoint1) == 0x000180, "Member 'BPFL_Lighting_C_AddSuspension::PrevSplinePoint1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, LightFittingSettings) == 0x000190, "Member 'BPFL_Lighting_C_AddSuspension::LightFittingSettings' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, __WorldContext) == 0x0002B0, "Member 'BPFL_Lighting_C_AddSuspension::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, Splines) == 0x0002B8, "Member 'BPFL_Lighting_C_AddSuspension::Splines' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, SplinePoint2) == 0x0002C8, "Member 'BPFL_Lighting_C_AddSuspension::SplinePoint2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, SplinePoint1) == 0x0002E0, "Member 'BPFL_Lighting_C_AddSuspension::SplinePoint1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, DistanceAlongSpline) == 0x0002F8, "Member 'BPFL_Lighting_C_AddSuspension::DistanceAlongSpline' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_GetBounds_ReturnValue) == 0x000300, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_GetBounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_SelectTransform_ReturnValue) == 0x000340, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_SelectTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakBoxSphereBounds_Origin) == 0x0003A0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakBoxSphereBounds_Origin' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakBoxSphereBounds_BoxExtent) == 0x0003B8, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakBoxSphereBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakBoxSphereBounds_SphereRadius) == 0x0003D0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakBoxSphereBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakTransform_Location) == 0x0003D8, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakTransform_Rotation) == 0x0003F0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakTransform_Scale) == 0x000408, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakVector_X) == 0x000420, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakVector_Y) == 0x000428, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakVector_Z) == 0x000430, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_IsValid_ReturnValue) == 0x000438, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_MakeArray_Array) == 0x000440, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_MaxOfFloatArray_IndexOfMaxValue) == 0x000450, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_MaxOfFloatArray_IndexOfMaxValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_MaxOfFloatArray_MaxValue) == 0x000454, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_MaxOfFloatArray_MaxValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_IsValid_ReturnValue_1) == 0x000458, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000460, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BooleanAND_ReturnValue) == 0x000468, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000470, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_DynamicCast_AsActor) == 0x000478, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_DynamicCast_bSuccess) == 0x000480, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, Temp_int_Variable) == 0x000484, "Member 'BPFL_Lighting_C_AddSuspension::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_GetRelativeTransform_ReturnValue) == 0x000490, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0004F0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0004F8, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Add_IntInt_ReturnValue) == 0x000500, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_GetSplineLength_ReturnValue) == 0x000504, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000508, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Round_ReturnValue) == 0x000510, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Subtract_IntInt_ReturnValue) == 0x000514, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000518, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, Temp_int_Variable_1) == 0x00051C, "Member 'BPFL_Lighting_C_AddSuspension::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Conv_IntToVector_ReturnValue) == 0x000520, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Conv_IntToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_SelectFloat_ReturnValue) == 0x000538, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_SelectFloat_ReturnValue_1) == 0x000540, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000548, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_RotateAngleAxis_ReturnValue) == 0x000560, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_SelectInt_ReturnValue) == 0x000578, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000580, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000598, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0005A0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0005B8, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Add_IntInt_ReturnValue_1) == 0x0005BC, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_GetBounds_ReturnValue_1) == 0x0005C0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_GetBounds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakBoxSphereBounds_Origin_1) == 0x0005F8, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakBoxSphereBounds_Origin_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakBoxSphereBounds_BoxExtent_1) == 0x000610, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakBoxSphereBounds_BoxExtent_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakBoxSphereBounds_SphereRadius_1) == 0x000628, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakBoxSphereBounds_SphereRadius_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakVector_X_1) == 0x000630, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakVector_Y_1) == 0x000638, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakVector_Z_1) == 0x000640, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000648, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_MakeArray_Array_1) == 0x000660, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Abs_ReturnValue) == 0x000670, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Abs_ReturnValue_1) == 0x000678, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Abs_ReturnValue_2) == 0x000680, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_MakeTransform_ReturnValue) == 0x000690, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_MakeArray_Array_2) == 0x0006F0, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_SelectTransform_ReturnValue_1) == 0x000700, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_SelectTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_MaxOfFloatArray_IndexOfMaxValue_1) == 0x000760, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_MaxOfFloatArray_IndexOfMaxValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_MaxOfFloatArray_MaxValue_1) == 0x000764, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_MaxOfFloatArray_MaxValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakTransform_Location_1) == 0x000768, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakTransform_Rotation_1) == 0x000780, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakTransform_Scale_1) == 0x000798, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Array_Get_Item) == 0x0007B0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, Temp_int_Variable_2) == 0x0007B8, "Member 'BPFL_Lighting_C_AddSuspension::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_SignOfFloat_ReturnValue) == 0x0007C0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x0007C8, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, Temp_int_Variable_3) == 0x0007CC, "Member 'BPFL_Lighting_C_AddSuspension::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_SelectFloat_ReturnValue_2) == 0x0007D0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x0007D8, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Conv_DoubleToVector_ReturnValue_3) == 0x0007F0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Conv_DoubleToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Conv_DoubleToVector_ReturnValue_4) == 0x000808, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Conv_DoubleToVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_DynamicCast_AsActor_1) == 0x000820, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_DynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_DynamicCast_bSuccess_1) == 0x000828, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, Temp_int_Variable_4) == 0x00082C, "Member 'BPFL_Lighting_C_AddSuspension::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_AddComponentByClass_ReturnValue) == 0x000830, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_SetStaticMesh_ReturnValue) == 0x000838, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Array_Get_Item_1) == 0x000840, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Array_Get_Item_2) == 0x000858, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000870, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000888, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Add_VectorVector_ReturnValue) == 0x0008A0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0008B8, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Conv_IntToVector_ReturnValue_1) == 0x0008D0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Conv_IntToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_GetRightVectorAtDistanceAlongSpline_ReturnValue) == 0x0008E8, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_GetRightVectorAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue) == 0x000900, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue) == 0x000918, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000930, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_Select_Default) == 0x000948, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_Select_Default_1) == 0x000960, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000978, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Multiply_VectorVector_ReturnValue_4) == 0x000990, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Multiply_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_Select_Default_2) == 0x0009A8, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x0009C0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Multiply_VectorVector_ReturnValue_5) == 0x0009D8, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Multiply_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x0009F0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_MakeTransform_ReturnValue_1) == 0x000A10, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_AddInstance_ReturnValue) == 0x000A70, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakTransform_Location_2) == 0x000A78, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakTransform_Rotation_2) == 0x000A90, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_BreakTransform_Scale_2) == 0x000AA8, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000AC0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_MakeTransform_ReturnValue_2) == 0x000AE0, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_AddInstance_ReturnValue_1) == 0x000B40, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_AddInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_MakeArray__0__ImplicitCast) == 0x000B44, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_MakeArray__0__ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_MakeArray__1__ImplicitCast) == 0x000B48, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_MakeArray__1__ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_MakeArray__2__ImplicitCast) == 0x000B4C, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_MakeArray__2__ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000B50, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000B58, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast) == 0x000B60, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_MakeArray__2__ImplicitCast_1) == 0x000B64, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_MakeArray__2__ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_MakeArray__1__ImplicitCast_1) == 0x000B68, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_MakeArray__1__ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, K2Node_MakeArray__0__ImplicitCast_1) == 0x000B6C, "Member 'BPFL_Lighting_C_AddSuspension::K2Node_MakeArray__0__ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000B70, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000B74, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_GetUpVectorAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000B78, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_GetUpVectorAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPFL_Lighting_C_AddSuspension, CallFunc_GetRightVectorAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000B7C, "Member 'BPFL_Lighting_C_AddSuspension::CallFunc_GetRightVectorAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");

// Function BPFL_Lighting.BPFL_Lighting_C.Bulb 01 Settings
// 0x0330 (0x0330 - 0x0000)
struct BPFL_Lighting_C_Bulb_01_Settings final
{
public:
	class UObject*                                Self_Reference;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F08[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Bulb_01_Settings                    Param_Bulb_01_Settings;                            // 0x0010(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Bulb_Light_01_Settings              Bulb_Light_01_Settings;                            // 0x0100(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          Off;                                               // 0x0240(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F09[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LED_Diode_01                        LED_Diode_01_Settings;                             // 0x0248(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Bulb_Light_On_;                                 // 0x02C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F0A[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USpotLightComponent*                    Spot;                                              // 0x02C8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Point;                                             // 0x02D0(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    Rect;                                              // 0x02D8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Prop_Mesh_Reference;                               // 0x02E0(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Bulb_Mesh_Reference;                               // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Turn_Bulb_Light_On_;                               // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F0B[0x6];                                     // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Create_LED_Diode_Mesh_LED_Didoe_Mesh_Reference; // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Create_Bulb_Mesh_Bulb_Mesh_Reference;     // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    CallFunc_Create_Light_Component_Spot_Light_Reference; // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
