#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPP_Bufferzone_Tunnel_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPP_Bufferzone_Tunnel_01.BPP_Bufferzone_Tunnel_01_C
// 0x0098 (0x03D8 - 0x0340)
class ABPP_Bufferzone_Tunnel_01_C final : public APackedLevelActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMesh15;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh14;                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh13;                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh12;                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh2;                  // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh1;                  // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh11;                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh10;                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh9;                              // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh8;                              // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh7;                              // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh6;                              // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh5;                              // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh4;                              // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh;                   // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh3;                              // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh2;                              // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh1;                              // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPP_Bufferzone_Tunnel_01_C">();
	}
	static class ABPP_Bufferzone_Tunnel_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPP_Bufferzone_Tunnel_01_C>();
	}
};
static_assert(alignof(ABPP_Bufferzone_Tunnel_01_C) == 0x000008, "Wrong alignment on ABPP_Bufferzone_Tunnel_01_C");
static_assert(sizeof(ABPP_Bufferzone_Tunnel_01_C) == 0x0003D8, "Wrong size on ABPP_Bufferzone_Tunnel_01_C");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh15) == 0x000340, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh15' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh14) == 0x000348, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh14' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh13) == 0x000350, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh13' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh12) == 0x000358, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh12' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, HierarchicalInstancedStaticMesh2) == 0x000360, "Member 'ABPP_Bufferzone_Tunnel_01_C::HierarchicalInstancedStaticMesh2' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, HierarchicalInstancedStaticMesh1) == 0x000368, "Member 'ABPP_Bufferzone_Tunnel_01_C::HierarchicalInstancedStaticMesh1' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh11) == 0x000370, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh11' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh10) == 0x000378, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh10' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh9) == 0x000380, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh9' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh8) == 0x000388, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh8' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh7) == 0x000390, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh7' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh6) == 0x000398, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh6' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh5) == 0x0003A0, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh5' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh4) == 0x0003A8, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh4' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, HierarchicalInstancedStaticMesh) == 0x0003B0, "Member 'ABPP_Bufferzone_Tunnel_01_C::HierarchicalInstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh3) == 0x0003B8, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh3' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh2) == 0x0003C0, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh2' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh1) == 0x0003C8, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh1' has a wrong offset!");
static_assert(offsetof(ABPP_Bufferzone_Tunnel_01_C, InstancedStaticMesh) == 0x0003D0, "Member 'ABPP_Bufferzone_Tunnel_01_C::InstancedStaticMesh' has a wrong offset!");

}

