#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPP_PF_SA_BU_Main_SetDress_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPP_PF_SA_BU_Main_SetDress_01.BPP_PF_SA_BU_Main_SetDress_01_C
// 0x01D0 (0x0510 - 0x0340)
class ABPP_PF_SA_BU_Main_SetDress_01_C final : public APackedLevelActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMesh57;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh56;                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh55;                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh54;                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh53;                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh52;                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh51;                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh50;                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh49;                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh48;                             // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh47;                             // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh46;                             // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh45;                             // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh44;                             // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh43;                             // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh42;                             // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh41;                             // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh40;                             // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh39;                             // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh38;                             // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh37;                             // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh36;                             // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh35;                             // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh34;                             // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh33;                             // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh32;                             // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh31;                             // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh30;                             // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh29;                             // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh28;                             // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh27;                             // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh26;                             // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh25;                             // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh24;                             // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh23;                             // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh22;                             // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh21;                             // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh20;                             // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh19;                             // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh18;                             // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh17;                             // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh16;                             // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh15;                             // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh14;                             // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh13;                             // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh12;                             // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh11;                             // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh10;                             // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh9;                              // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh8;                              // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh7;                              // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh6;                              // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh5;                              // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh4;                              // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh3;                              // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh2;                              // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh1;                              // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPP_PF_SA_BU_Main_SetDress_01_C">();
	}
	static class ABPP_PF_SA_BU_Main_SetDress_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPP_PF_SA_BU_Main_SetDress_01_C>();
	}
};
static_assert(alignof(ABPP_PF_SA_BU_Main_SetDress_01_C) == 0x000008, "Wrong alignment on ABPP_PF_SA_BU_Main_SetDress_01_C");
static_assert(sizeof(ABPP_PF_SA_BU_Main_SetDress_01_C) == 0x000510, "Wrong size on ABPP_PF_SA_BU_Main_SetDress_01_C");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh57) == 0x000340, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh57' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh56) == 0x000348, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh56' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh55) == 0x000350, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh55' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh54) == 0x000358, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh54' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh53) == 0x000360, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh53' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh52) == 0x000368, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh52' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh51) == 0x000370, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh51' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh50) == 0x000378, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh50' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh49) == 0x000380, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh49' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh48) == 0x000388, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh48' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh47) == 0x000390, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh47' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh46) == 0x000398, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh46' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh45) == 0x0003A0, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh45' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh44) == 0x0003A8, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh44' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh43) == 0x0003B0, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh43' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh42) == 0x0003B8, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh42' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh41) == 0x0003C0, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh41' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh40) == 0x0003C8, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh40' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh39) == 0x0003D0, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh39' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh38) == 0x0003D8, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh38' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh37) == 0x0003E0, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh37' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh36) == 0x0003E8, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh36' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh35) == 0x0003F0, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh35' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh34) == 0x0003F8, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh34' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh33) == 0x000400, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh33' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh32) == 0x000408, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh32' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh31) == 0x000410, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh31' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh30) == 0x000418, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh30' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh29) == 0x000420, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh29' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh28) == 0x000428, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh28' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh27) == 0x000430, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh27' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh26) == 0x000438, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh26' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh25) == 0x000440, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh25' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh24) == 0x000448, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh24' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh23) == 0x000450, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh23' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh22) == 0x000458, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh22' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh21) == 0x000460, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh21' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh20) == 0x000468, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh20' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh19) == 0x000470, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh19' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh18) == 0x000478, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh18' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh17) == 0x000480, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh17' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh16) == 0x000488, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh16' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh15) == 0x000490, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh15' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh14) == 0x000498, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh14' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh13) == 0x0004A0, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh13' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh12) == 0x0004A8, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh12' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh11) == 0x0004B0, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh11' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh10) == 0x0004B8, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh10' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh9) == 0x0004C0, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh9' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh8) == 0x0004C8, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh8' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh7) == 0x0004D0, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh7' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh6) == 0x0004D8, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh6' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh5) == 0x0004E0, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh5' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh4) == 0x0004E8, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh4' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh3) == 0x0004F0, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh3' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh2) == 0x0004F8, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh2' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh1) == 0x000500, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh1' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Main_SetDress_01_C, InstancedStaticMesh) == 0x000508, "Member 'ABPP_PF_SA_BU_Main_SetDress_01_C::InstancedStaticMesh' has a wrong offset!");

}

