#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPP_Smooth_Assembly_02

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPP_Smooth_Assembly_02.BPP_Smooth_Assembly_02_C
// 0x0030 (0x0370 - 0x0340)
class ABPP_Smooth_Assembly_02_C final : public APackedLevelActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMesh5;                              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh4;                              // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh3;                              // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh2;                              // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh1;                              // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPP_Smooth_Assembly_02_C">();
	}
	static class ABPP_Smooth_Assembly_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPP_Smooth_Assembly_02_C>();
	}
};
static_assert(alignof(ABPP_Smooth_Assembly_02_C) == 0x000008, "Wrong alignment on ABPP_Smooth_Assembly_02_C");
static_assert(sizeof(ABPP_Smooth_Assembly_02_C) == 0x000370, "Wrong size on ABPP_Smooth_Assembly_02_C");
static_assert(offsetof(ABPP_Smooth_Assembly_02_C, InstancedStaticMesh5) == 0x000340, "Member 'ABPP_Smooth_Assembly_02_C::InstancedStaticMesh5' has a wrong offset!");
static_assert(offsetof(ABPP_Smooth_Assembly_02_C, InstancedStaticMesh4) == 0x000348, "Member 'ABPP_Smooth_Assembly_02_C::InstancedStaticMesh4' has a wrong offset!");
static_assert(offsetof(ABPP_Smooth_Assembly_02_C, InstancedStaticMesh3) == 0x000350, "Member 'ABPP_Smooth_Assembly_02_C::InstancedStaticMesh3' has a wrong offset!");
static_assert(offsetof(ABPP_Smooth_Assembly_02_C, InstancedStaticMesh2) == 0x000358, "Member 'ABPP_Smooth_Assembly_02_C::InstancedStaticMesh2' has a wrong offset!");
static_assert(offsetof(ABPP_Smooth_Assembly_02_C, InstancedStaticMesh1) == 0x000360, "Member 'ABPP_Smooth_Assembly_02_C::InstancedStaticMesh1' has a wrong offset!");
static_assert(offsetof(ABPP_Smooth_Assembly_02_C, InstancedStaticMesh) == 0x000368, "Member 'ABPP_Smooth_Assembly_02_C::InstancedStaticMesh' has a wrong offset!");

}

