#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPP_SA_ROBuilding_02_Glass

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPP_SA_ROBuilding_02_Glass.BPP_SA_ROBuilding_02_Glass_C
// 0x02E8 (0x0628 - 0x0340)
class ABPP_SA_ROBuilding_02_Glass_C final : public APackedLevelActor
{
public:
	class UGzMultipleDamageableComponent*         GzMultipleDamageable;                              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge91;          // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge90;          // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge89;          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge88;          // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge87;          // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge86;          // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge85;          // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge84;          // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge83;          // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge82;          // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge81;          // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge80;          // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge79;          // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge78;          // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge77;          // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge76;          // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge75;          // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge74;          // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge73;          // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge72;          // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge71;          // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge70;          // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge69;          // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge68;          // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge67;          // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge66;          // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge65;          // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge64;          // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge63;          // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge62;          // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge61;          // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge60;          // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge59;          // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge58;          // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge57;          // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge56;          // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge55;          // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge54;          // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge53;          // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge52;          // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge51;          // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge50;          // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge49;          // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge48;          // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge47;          // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge46;          // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge45;          // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge44;          // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge43;          // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge42;          // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge41;          // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge40;          // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge39;          // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge38;          // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge37;          // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge36;          // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge35;          // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge34;          // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge33;          // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge32;          // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge31;          // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge30;          // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge29;          // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge28;          // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge27;          // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge26;          // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge25;          // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge24;          // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge23;          // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge22;          // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge21;          // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge20;          // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge19;          // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge18;          // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge17;          // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge16;          // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge15;          // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge14;          // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge13;          // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge12;          // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge11;          // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge10;          // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge9;           // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge8;           // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge7;           // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge6;           // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge5;           // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge4;           // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge3;           // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge2;           // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge1;           // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GzDamageableSMComp_4X4_Without_Edge_C* BP_GzDamageableSMComp_4X4_Without_Edge;            // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPP_SA_ROBuilding_02_Glass_C">();
	}
	static class ABPP_SA_ROBuilding_02_Glass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPP_SA_ROBuilding_02_Glass_C>();
	}
};
static_assert(alignof(ABPP_SA_ROBuilding_02_Glass_C) == 0x000008, "Wrong alignment on ABPP_SA_ROBuilding_02_Glass_C");
static_assert(sizeof(ABPP_SA_ROBuilding_02_Glass_C) == 0x000628, "Wrong size on ABPP_SA_ROBuilding_02_Glass_C");
static_assert(offsetof(ABPP_SA_ROBuilding_02_Glass_C, GzMultipleDamageable) == 0x000340, "Member 'ABPP_SA_ROBuilding_02_Glass_C::GzMultipleDamageable' has a wrong offset!");
static_assert(offsetof(ABPP_SA_ROBuilding_02_Glass_C, BP_GzDamageableSMComp_4X4_Without_Edge91) == 0x000348, "Member 'ABPP_SA_ROBuilding_02_Glass_C::BP_GzDamageableSMComp_4X4_Without_Edge91' has a wrong offset!");
