#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPP_SM_Conrete_Rubble_Assembly_07

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPP_SM_Conrete_Rubble_Assembly_07.BPP_SM_Conrete_Rubble_Assembly_07_C
// 0x00E8 (0x0388 - 0x02A0)
class ABPP_SM_Conrete_Rubble_Assembly_07_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Concrete_Rubble_20;                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_018;                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_19;                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_017;                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_016;                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_015;                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_18;                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_17;                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_16;                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_014;                            // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_013;                            // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_03;                             // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_012;                            // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_13;                             // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_12;                             // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_011;                            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_010;                            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_07;                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_06;                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_09;                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_11;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_14;                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_05;                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_02;                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_04;                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_08;                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_10;                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Concrete_Rubble_15;                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPP_SM_Conrete_Rubble_Assembly_07_C">();
	}
	static class ABPP_SM_Conrete_Rubble_Assembly_07_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPP_SM_Conrete_Rubble_Assembly_07_C>();
	}
};
static_assert(alignof(ABPP_SM_Conrete_Rubble_Assembly_07_C) == 0x000008, "Wrong alignment on ABPP_SM_Conrete_Rubble_Assembly_07_C");
static_assert(sizeof(ABPP_SM_Conrete_Rubble_Assembly_07_C) == 0x000388, "Wrong size on ABPP_SM_Conrete_Rubble_Assembly_07_C");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_20) == 0x0002A0, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_20' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_018) == 0x0002A8, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_018' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_19) == 0x0002B0, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_19' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_017) == 0x0002B8, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_017' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_016) == 0x0002C0, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_016' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_015) == 0x0002C8, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_015' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_18) == 0x0002D0, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_18' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_17) == 0x0002D8, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_17' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_16) == 0x0002E0, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_16' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_014) == 0x0002E8, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_014' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_013) == 0x0002F0, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_013' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_03) == 0x0002F8, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_03' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_012) == 0x000300, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_012' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_13) == 0x000308, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_13' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_12) == 0x000310, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_12' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_011) == 0x000318, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_011' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_010) == 0x000320, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_010' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_07) == 0x000328, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_07' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_06) == 0x000330, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_06' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_09) == 0x000338, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_09' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_11) == 0x000340, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_11' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_14) == 0x000348, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_14' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_05) == 0x000350, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_05' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_02) == 0x000358, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_02' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_04) == 0x000360, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_04' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_08) == 0x000368, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_08' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_10) == 0x000370, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_10' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, SM_Concrete_Rubble_15) == 0x000378, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::SM_Concrete_Rubble_15' has a wrong offset!");
static_assert(offsetof(ABPP_SM_Conrete_Rubble_Assembly_07_C, DefaultSceneRoot) == 0x000380, "Member 'ABPP_SM_Conrete_Rubble_Assembly_07_C::DefaultSceneRoot' has a wrong offset!");

}

