#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPP_LK_BusStop_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPP_LK_BusStop_01.BPP_LK_BusStop_01_C
// 0x0078 (0x03B8 - 0x0340)
class ABPP_LK_BusStop_01_C final : public APackedLevelActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh7;                              // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh6;                              // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh5;                              // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh4;                              // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh3;                              // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh2;                              // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh1;                              // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SoundPositionOffset;                               // 0x0388(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          BusStopEvent;                                      // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         BusStopPlayingId;                                  // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B28[0x4];                                     // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzStaticAkComponent*                   GzStaticAk;                                        // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPP_LK_BusStop_01(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPP_LK_BusStop_01_C">();
	}
	static class ABPP_LK_BusStop_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPP_LK_BusStop_01_C>();
	}
};
static_assert(alignof(ABPP_LK_BusStop_01_C) == 0x000008, "Wrong alignment on ABPP_LK_BusStop_01_C");
static_assert(sizeof(ABPP_LK_BusStop_01_C) == 0x0003B8, "Wrong size on ABPP_LK_BusStop_01_C");
static_assert(offsetof(ABPP_LK_BusStop_01_C, UberGraphFrame) == 0x000340, "Member 'ABPP_LK_BusStop_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPP_LK_BusStop_01_C, InstancedStaticMesh7) == 0x000348, "Member 'ABPP_LK_BusStop_01_C::InstancedStaticMesh7' has a wrong offset!");
static_assert(offsetof(ABPP_LK_BusStop_01_C, InstancedStaticMesh6) == 0x000350, "Member 'ABPP_LK_BusStop_01_C::InstancedStaticMesh6' has a wrong offset!");
static_assert(offsetof(ABPP_LK_BusStop_01_C, InstancedStaticMesh5) == 0x000358, "Member 'ABPP_LK_BusStop_01_C::InstancedStaticMesh5' has a wrong offset!");
static_assert(offsetof(ABPP_LK_BusStop_01_C, InstancedStaticMesh4) == 0x000360, "Member 'ABPP_LK_BusStop_01_C::InstancedStaticMesh4' has a wrong offset!");
static_assert(offsetof(ABPP_LK_BusStop_01_C, InstancedStaticMesh3) == 0x000368, "Member 'ABPP_LK_BusStop_01_C::InstancedStaticMesh3' has a wrong offset!");
static_assert(offsetof(ABPP_LK_BusStop_01_C, InstancedStaticMesh2) == 0x000370, "Member 'ABPP_LK_BusStop_01_C::InstancedStaticMesh2' has a wrong offset!");
static_assert(offsetof(ABPP_LK_BusStop_01_C, InstancedStaticMesh1) == 0x000378, "Member 'ABPP_LK_BusStop_01_C::InstancedStaticMesh1' has a wrong offset!");
static_assert(offsetof(ABPP_LK_BusStop_01_C, InstancedStaticMesh) == 0x000380, "Member 'ABPP_LK_BusStop_01_C::InstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABPP_LK_BusStop_01_C, SoundPositionOffset) == 0x000388, "Member 'ABPP_LK_BusStop_01_C::SoundPositionOffset' has a wrong offset!");
static_assert(offsetof(ABPP_LK_BusStop_01_C, BusStopEvent) == 0x0003A0, "Member 'ABPP_LK_BusStop_01_C::BusStopEvent' has a wrong offset!");
static_assert(offsetof(ABPP_LK_BusStop_01_C, BusStopPlayingId) == 0x0003A8, "Member 'ABPP_LK_BusStop_01_C::BusStopPlayingId' has a wrong offset!");
static_assert(offsetof(ABPP_LK_BusStop_01_C, GzStaticAk) == 0x0003B0, "Member 'ABPP_LK_BusStop_01_C::GzStaticAk' has a wrong offset!");

}

