#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPP_Marsh_NorthWestFoliageMerge

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPP_Marsh_NorthWestFoliageMerge.BPP_Marsh_NorthWestFoliageMerge_C
// 0x0108 (0x0448 - 0x0340)
class ABPP_Marsh_NorthWestFoliageMerge_C final : public APackedLevelActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMesh17;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh16;                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh15;                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh14;                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh14;                 // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh13;                 // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh12;                 // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh11;                 // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh13;                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh12;                             // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh11;                             // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh10;                             // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh9;                              // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh8;                              // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh10;                 // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh7;                              // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh9;                  // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh8;                  // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh7;                  // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh6;                              // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh5;                              // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh6;                  // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh4;                              // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh3;                              // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh2;                              // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh5;                  // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh4;                  // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh1;                              // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh3;                  // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh2;                  // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh1;                  // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh;                   // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPP_Marsh_NorthWestFoliageMerge_C">();
	}
	static class ABPP_Marsh_NorthWestFoliageMerge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPP_Marsh_NorthWestFoliageMerge_C>();
	}
};
static_assert(alignof(ABPP_Marsh_NorthWestFoliageMerge_C) == 0x000008, "Wrong alignment on ABPP_Marsh_NorthWestFoliageMerge_C");
static_assert(sizeof(ABPP_Marsh_NorthWestFoliageMerge_C) == 0x000448, "Wrong size on ABPP_Marsh_NorthWestFoliageMerge_C");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh17) == 0x000340, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh17' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh16) == 0x000348, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh16' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh15) == 0x000350, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh15' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh14) == 0x000358, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh14' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh14) == 0x000360, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh14' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh13) == 0x000368, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh13' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh12) == 0x000370, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh12' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh11) == 0x000378, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh11' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh13) == 0x000380, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh13' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh12) == 0x000388, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh12' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh11) == 0x000390, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh11' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh10) == 0x000398, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh10' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh9) == 0x0003A0, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh9' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh8) == 0x0003A8, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh8' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh10) == 0x0003B0, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh10' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh7) == 0x0003B8, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh7' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh9) == 0x0003C0, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh9' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh8) == 0x0003C8, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh8' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh7) == 0x0003D0, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh7' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh6) == 0x0003D8, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh6' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh5) == 0x0003E0, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh5' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh6) == 0x0003E8, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh6' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh4) == 0x0003F0, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh4' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh3) == 0x0003F8, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh3' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh2) == 0x000400, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh2' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh5) == 0x000408, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh5' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh4) == 0x000410, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh4' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh1) == 0x000418, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh1' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh3) == 0x000420, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh3' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh2) == 0x000428, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh2' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh1) == 0x000430, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh1' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, HierarchicalInstancedStaticMesh) == 0x000438, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::HierarchicalInstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABPP_Marsh_NorthWestFoliageMerge_C, InstancedStaticMesh) == 0x000440, "Member 'ABPP_Marsh_NorthWestFoliageMerge_C::InstancedStaticMesh' has a wrong offset!");

}

