#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPP_Assembly_IMinus00

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPP_Assembly_I-00.BPP_Assembly_I-00_C
// 0x0068 (0x03A8 - 0x0340)
class ABPP_Assembly_IMinus00_C final : public APackedLevelActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMesh23;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh22;                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh21;                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh20;                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh19;                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh18;                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh17;                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh16;                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh15;                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh14;                             // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh13;                             // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh12;                             // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh1;                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPP_Assembly_I-00_C">();
	}
	static class ABPP_Assembly_IMinus00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPP_Assembly_IMinus00_C>();
	}
};
static_assert(alignof(ABPP_Assembly_IMinus00_C) == 0x000008, "Wrong alignment on ABPP_Assembly_IMinus00_C");
static_assert(sizeof(ABPP_Assembly_IMinus00_C) == 0x0003A8, "Wrong size on ABPP_Assembly_IMinus00_C");
static_assert(offsetof(ABPP_Assembly_IMinus00_C, InstancedStaticMesh23) == 0x000340, "Member 'ABPP_Assembly_IMinus00_C::InstancedStaticMesh23' has a wrong offset!");
static_assert(offsetof(ABPP_Assembly_IMinus00_C, InstancedStaticMesh22) == 0x000348, "Member 'ABPP_Assembly_IMinus00_C::InstancedStaticMesh22' has a wrong offset!");
static_assert(offsetof(ABPP_Assembly_IMinus00_C, InstancedStaticMesh21) == 0x000350, "Member 'ABPP_Assembly_IMinus00_C::InstancedStaticMesh21' has a wrong offset!");
static_assert(offsetof(ABPP_Assembly_IMinus00_C, InstancedStaticMesh20) == 0x000358, "Member 'ABPP_Assembly_IMinus00_C::InstancedStaticMesh20' has a wrong offset!");
static_assert(offsetof(ABPP_Assembly_IMinus00_C, InstancedStaticMesh19) == 0x000360, "Member 'ABPP_Assembly_IMinus00_C::InstancedStaticMesh19' has a wrong offset!");
static_assert(offsetof(ABPP_Assembly_IMinus00_C, InstancedStaticMesh18) == 0x000368, "Member 'ABPP_Assembly_IMinus00_C::InstancedStaticMesh18' has a wrong offset!");
static_assert(offsetof(ABPP_Assembly_IMinus00_C, InstancedStaticMesh17) == 0x000370, "Member 'ABPP_Assembly_IMinus00_C::InstancedStaticMesh17' has a wrong offset!");
static_assert(offsetof(ABPP_Assembly_IMinus00_C, InstancedStaticMesh16) == 0x000378, "Member 'ABPP_Assembly_IMinus00_C::InstancedStaticMesh16' has a wrong offset!");
static_assert(offsetof(ABPP_Assembly_IMinus00_C, InstancedStaticMesh15) == 0x000380, "Member 'ABPP_Assembly_IMinus00_C::InstancedStaticMesh15' has a wrong offset!");
static_assert(offsetof(ABPP_Assembly_IMinus00_C, InstancedStaticMesh14) == 0x000388, "Member 'ABPP_Assembly_IMinus00_C::InstancedStaticMesh14' has a wrong offset!");
static_assert(offsetof(ABPP_Assembly_IMinus00_C, InstancedStaticMesh13) == 0x000390, "Member 'ABPP_Assembly_IMinus00_C::InstancedStaticMesh13' has a wrong offset!");
static_assert(offsetof(ABPP_Assembly_IMinus00_C, InstancedStaticMesh12) == 0x000398, "Member 'ABPP_Assembly_IMinus00_C::InstancedStaticMesh12' has a wrong offset!");
static_assert(offsetof(ABPP_Assembly_IMinus00_C, HierarchicalInstancedStaticMesh1) == 0x0003A0, "Member 'ABPP_Assembly_IMinus00_C::HierarchicalInstancedStaticMesh1' has a wrong offset!");

}

