#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPP_MH_Warehouse_Cabins_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPP_MH_Warehouse_Cabins_01.BPP_MH_Warehouse_Cabins_01_C
// 0x0048 (0x0388 - 0x0340)
class ABPP_MH_Warehouse_Cabins_01_C final : public APackedLevelActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMesh17;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh15;                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh14;                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh13;                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh12;                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh11;                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh10;                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh9;                              // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh8;                              // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPP_MH_Warehouse_Cabins_01_C">();
	}
	static class ABPP_MH_Warehouse_Cabins_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPP_MH_Warehouse_Cabins_01_C>();
	}
};
static_assert(alignof(ABPP_MH_Warehouse_Cabins_01_C) == 0x000008, "Wrong alignment on ABPP_MH_Warehouse_Cabins_01_C");
static_assert(sizeof(ABPP_MH_Warehouse_Cabins_01_C) == 0x000388, "Wrong size on ABPP_MH_Warehouse_Cabins_01_C");
static_assert(offsetof(ABPP_MH_Warehouse_Cabins_01_C, InstancedStaticMesh17) == 0x000340, "Member 'ABPP_MH_Warehouse_Cabins_01_C::InstancedStaticMesh17' has a wrong offset!");
static_assert(offsetof(ABPP_MH_Warehouse_Cabins_01_C, InstancedStaticMesh15) == 0x000348, "Member 'ABPP_MH_Warehouse_Cabins_01_C::InstancedStaticMesh15' has a wrong offset!");
static_assert(offsetof(ABPP_MH_Warehouse_Cabins_01_C, InstancedStaticMesh14) == 0x000350, "Member 'ABPP_MH_Warehouse_Cabins_01_C::InstancedStaticMesh14' has a wrong offset!");
static_assert(offsetof(ABPP_MH_Warehouse_Cabins_01_C, InstancedStaticMesh13) == 0x000358, "Member 'ABPP_MH_Warehouse_Cabins_01_C::InstancedStaticMesh13' has a wrong offset!");
static_assert(offsetof(ABPP_MH_Warehouse_Cabins_01_C, InstancedStaticMesh12) == 0x000360, "Member 'ABPP_MH_Warehouse_Cabins_01_C::InstancedStaticMesh12' has a wrong offset!");
static_assert(offsetof(ABPP_MH_Warehouse_Cabins_01_C, InstancedStaticMesh11) == 0x000368, "Member 'ABPP_MH_Warehouse_Cabins_01_C::InstancedStaticMesh11' has a wrong offset!");
static_assert(offsetof(ABPP_MH_Warehouse_Cabins_01_C, InstancedStaticMesh10) == 0x000370, "Member 'ABPP_MH_Warehouse_Cabins_01_C::InstancedStaticMesh10' has a wrong offset!");
static_assert(offsetof(ABPP_MH_Warehouse_Cabins_01_C, InstancedStaticMesh9) == 0x000378, "Member 'ABPP_MH_Warehouse_Cabins_01_C::InstancedStaticMesh9' has a wrong offset!");
static_assert(offsetof(ABPP_MH_Warehouse_Cabins_01_C, InstancedStaticMesh8) == 0x000380, "Member 'ABPP_MH_Warehouse_Cabins_01_C::InstancedStaticMesh8' has a wrong offset!");

}

