#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPP_PF_SA_BU_Grid_GuardBooth_03

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPP_PF_SA_BU_Grid_GuardBooth_03.BPP_PF_SA_BU_Grid_GuardBooth_03_C
// 0x0040 (0x0380 - 0x0340)
class ABPP_PF_SA_BU_Grid_GuardBooth_03_C final : public APackedLevelActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMesh15;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh13;                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh10;                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh9;                              // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh7;                              // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh4;                              // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh3;                              // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh1;                              // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPP_PF_SA_BU_Grid_GuardBooth_03_C">();
	}
	static class ABPP_PF_SA_BU_Grid_GuardBooth_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPP_PF_SA_BU_Grid_GuardBooth_03_C>();
	}
};
static_assert(alignof(ABPP_PF_SA_BU_Grid_GuardBooth_03_C) == 0x000008, "Wrong alignment on ABPP_PF_SA_BU_Grid_GuardBooth_03_C");
static_assert(sizeof(ABPP_PF_SA_BU_Grid_GuardBooth_03_C) == 0x000380, "Wrong size on ABPP_PF_SA_BU_Grid_GuardBooth_03_C");
static_assert(offsetof(ABPP_PF_SA_BU_Grid_GuardBooth_03_C, InstancedStaticMesh15) == 0x000340, "Member 'ABPP_PF_SA_BU_Grid_GuardBooth_03_C::InstancedStaticMesh15' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Grid_GuardBooth_03_C, InstancedStaticMesh13) == 0x000348, "Member 'ABPP_PF_SA_BU_Grid_GuardBooth_03_C::InstancedStaticMesh13' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Grid_GuardBooth_03_C, InstancedStaticMesh10) == 0x000350, "Member 'ABPP_PF_SA_BU_Grid_GuardBooth_03_C::InstancedStaticMesh10' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Grid_GuardBooth_03_C, InstancedStaticMesh9) == 0x000358, "Member 'ABPP_PF_SA_BU_Grid_GuardBooth_03_C::InstancedStaticMesh9' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Grid_GuardBooth_03_C, InstancedStaticMesh7) == 0x000360, "Member 'ABPP_PF_SA_BU_Grid_GuardBooth_03_C::InstancedStaticMesh7' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Grid_GuardBooth_03_C, InstancedStaticMesh4) == 0x000368, "Member 'ABPP_PF_SA_BU_Grid_GuardBooth_03_C::InstancedStaticMesh4' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Grid_GuardBooth_03_C, InstancedStaticMesh3) == 0x000370, "Member 'ABPP_PF_SA_BU_Grid_GuardBooth_03_C::InstancedStaticMesh3' has a wrong offset!");
static_assert(offsetof(ABPP_PF_SA_BU_Grid_GuardBooth_03_C, InstancedStaticMesh1) == 0x000378, "Member 'ABPP_PF_SA_BU_Grid_GuardBooth_03_C::InstancedStaticMesh1' has a wrong offset!");

}

