#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPP_Military_Container_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPP_Military_Container_01.BPP_Military_Container_01_C
// 0x01B8 (0x0458 - 0x02A0)
class ABPP_Military_Container_01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   MI_Military_Container_01_Logo;                     // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_E2;                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_A10;                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_F1;                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_F;                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_E1;                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D20;                     // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D19;                     // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D18;                     // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D17;                     // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D16;                     // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_H12;                     // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_H11;                     // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_H10;                     // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D15;                     // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D14;                     // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_A9;                      // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_A8;                      // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_A7;                      // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_A6;                      // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_B2;                      // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_B6;                      // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_B5;                      // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_G6;                      // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_B4;                      // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_A5;                      // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_G4;                      // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D10;                     // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D9;                      // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D8;                      // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D13;                     // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_H9;                      // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_H8;                      // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_H7;                      // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_H6;                      // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_H5;                      // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_H4;                      // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D7;                      // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_H3;                      // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_H2;                      // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D6;                      // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D5;                      // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_H;                       // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D4;                      // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D1;                      // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_D;                       // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_G1;                      // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_G;                       // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_A4;                      // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_B1;                      // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_B;                       // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_A2;                      // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Grunge_Decal_A1;                      // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Military_Container_01;                          // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPP_Military_Container_01_C">();
	}
	static class ABPP_Military_Container_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPP_Military_Container_01_C>();
	}
};
static_assert(alignof(ABPP_Military_Container_01_C) == 0x000008, "Wrong alignment on ABPP_Military_Container_01_C");
static_assert(sizeof(ABPP_Military_Container_01_C) == 0x000458, "Wrong size on ABPP_Military_Container_01_C");
static_assert(offsetof(ABPP_Military_Container_01_C, MI_Military_Container_01_Logo) == 0x0002A0, "Member 'ABPP_Military_Container_01_C::MI_Military_Container_01_Logo' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_E2) == 0x0002A8, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_E2' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_A10) == 0x0002B0, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_A10' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_F1) == 0x0002B8, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_F1' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_F) == 0x0002C0, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_F' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_E1) == 0x0002C8, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_E1' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D20) == 0x0002D0, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D20' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D19) == 0x0002D8, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D19' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D18) == 0x0002E0, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D18' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D17) == 0x0002E8, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D17' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D16) == 0x0002F0, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D16' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_H12) == 0x0002F8, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_H12' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_H11) == 0x000300, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_H11' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_H10) == 0x000308, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_H10' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D15) == 0x000310, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D15' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D14) == 0x000318, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D14' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_A9) == 0x000320, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_A9' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_A8) == 0x000328, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_A8' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_A7) == 0x000330, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_A7' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_A6) == 0x000338, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_A6' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_B2) == 0x000340, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_B2' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_B6) == 0x000348, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_B6' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_B5) == 0x000350, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_B5' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_G6) == 0x000358, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_G6' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_B4) == 0x000360, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_B4' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_A5) == 0x000368, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_A5' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_G4) == 0x000370, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_G4' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D10) == 0x000378, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D10' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D9) == 0x000380, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D9' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D8) == 0x000388, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D8' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D13) == 0x000390, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D13' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_H9) == 0x000398, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_H9' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_H8) == 0x0003A0, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_H8' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_H7) == 0x0003A8, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_H7' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_H6) == 0x0003B0, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_H6' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_H5) == 0x0003B8, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_H5' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_H4) == 0x0003C0, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_H4' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D7) == 0x0003C8, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D7' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_H3) == 0x0003D0, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_H3' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_H2) == 0x0003D8, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_H2' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D6) == 0x0003E0, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D6' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D5) == 0x0003E8, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D5' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_H) == 0x0003F0, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_H' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D4) == 0x0003F8, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D4' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D1) == 0x000400, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D1' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_D) == 0x000408, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_D' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_G1) == 0x000410, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_G1' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_G) == 0x000418, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_G' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_A4) == 0x000420, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_A4' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_B1) == 0x000428, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_B1' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_B) == 0x000430, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_B' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_A2) == 0x000438, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_A2' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Container_Grunge_Decal_A1) == 0x000440, "Member 'ABPP_Military_Container_01_C::SM_Container_Grunge_Decal_A1' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, SM_Military_Container_01) == 0x000448, "Member 'ABPP_Military_Container_01_C::SM_Military_Container_01' has a wrong offset!");
static_assert(offsetof(ABPP_Military_Container_01_C, DefaultSceneRoot) == 0x000450, "Member 'ABPP_Military_Container_01_C::DefaultSceneRoot' has a wrong offset!");

}

