#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BT_Decorator_IsPointInZoneControl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BT_Decorator_IsPointInZoneControl.BT_Decorator_IsPointInZoneControl_C.PerformConditionCheckAI
// 0x0048 (0x0048 - 0x0000)
struct BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4905[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzAIController*                        K2Node_DynamicCast_AsGz_AIController;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4906[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPointInZoneControl_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasZoneControl_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVectorValueSet_ReturnValue;             // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI");
static_assert(sizeof(BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI) == 0x000048, "Wrong size on BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI");
static_assert(offsetof(BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI, K2Node_DynamicCast_AsGz_AIController) == 0x000018, "Member 'BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI::K2Node_DynamicCast_AsGz_AIController' has a wrong offset!");
static_assert(offsetof(BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000028, "Member 'BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI, CallFunc_IsPointInZoneControl_ReturnValue) == 0x000040, "Member 'BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI::CallFunc_IsPointInZoneControl_ReturnValue' has a wrong offset!");
static_assert(offsetof(BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI, CallFunc_HasZoneControl_ReturnValue) == 0x000041, "Member 'BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI::CallFunc_HasZoneControl_ReturnValue' has a wrong offset!");
static_assert(offsetof(BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI, CallFunc_MakeLiteralBool_ReturnValue) == 0x000042, "Member 'BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI, CallFunc_IsVectorValueSet_ReturnValue) == 0x000043, "Member 'BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI::CallFunc_IsVectorValueSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI, CallFunc_BooleanAND_ReturnValue) == 0x000044, "Member 'BT_Decorator_IsPointInZoneControl_C_PerformConditionCheckAI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

