#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_IsPlayingAnyMontage

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTD_IsPlayingAnyMontage.BTD_IsPlayingAnyMontage_C.PerformConditionCheckAI
// 0x0038 (0x0038 - 0x0000)
struct BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6700[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6701[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyMontagePlaying_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI) == 0x000038, "Wrong size on BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI, K2Node_DynamicCast_AsGz_Character) == 0x000018, "Member 'BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI, CallFunc_GetAnimInstance_ReturnValue) == 0x000028, "Member 'BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI, CallFunc_IsAnyMontagePlaying_ReturnValue) == 0x000030, "Member 'BTD_IsPlayingAnyMontage_C_PerformConditionCheckAI::CallFunc_IsAnyMontagePlaying_ReturnValue' has a wrong offset!");

}

