#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTServiceSetEnemyFocus

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "G01_structs.hpp"
#include "E_NPCBodyPart_structs.hpp"


namespace SDK::Params
{

// Function BTServiceSetEnemyFocus.BTServiceSetEnemyFocus_C.SetEnemyFocus
// 0x0068 (0x0068 - 0x0000)
struct BTServiceSetEnemyFocus_C_SetEnemyFocus final
{
public:
	class AAIController*                          AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBlackboardValueAsBool_ReturnValue;     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_677E[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzAIController*                        K2Node_DynamicCast_AsGz_AIController;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetBlackboardValueAsEnum_ReturnValue;     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_677F[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzCharacterDamageAreaType                    CallFunc_Get_Body_Part_Enum_BPart;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6780[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVectorValueSet_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6781[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetValueAsVector_ReturnValue;             // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTServiceSetEnemyFocus_C_SetEnemyFocus) == 0x000008, "Wrong alignment on BTServiceSetEnemyFocus_C_SetEnemyFocus");
static_assert(sizeof(BTServiceSetEnemyFocus_C_SetEnemyFocus) == 0x000068, "Wrong size on BTServiceSetEnemyFocus_C_SetEnemyFocus");
static_assert(offsetof(BTServiceSetEnemyFocus_C_SetEnemyFocus, AIController) == 0x000000, "Member 'BTServiceSetEnemyFocus_C_SetEnemyFocus::AIController' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_SetEnemyFocus, CallFunc_GetBlackboardValueAsBool_ReturnValue) == 0x000008, "Member 'BTServiceSetEnemyFocus_C_SetEnemyFocus::CallFunc_GetBlackboardValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_SetEnemyFocus, K2Node_DynamicCast_AsGz_AIController) == 0x000010, "Member 'BTServiceSetEnemyFocus_C_SetEnemyFocus::K2Node_DynamicCast_AsGz_AIController' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_SetEnemyFocus, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTServiceSetEnemyFocus_C_SetEnemyFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_SetEnemyFocus, CallFunc_GetBlackboardValueAsEnum_ReturnValue) == 0x000019, "Member 'BTServiceSetEnemyFocus_C_SetEnemyFocus::CallFunc_GetBlackboardValueAsEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_SetEnemyFocus, CallFunc_GetValidValue_ReturnValue) == 0x00001A, "Member 'BTServiceSetEnemyFocus_C_SetEnemyFocus::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_SetEnemyFocus, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000020, "Member 'BTServiceSetEnemyFocus_C_SetEnemyFocus::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_SetEnemyFocus, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BTServiceSetEnemyFocus_C_SetEnemyFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_SetEnemyFocus, CallFunc_Get_Body_Part_Enum_BPart) == 0x000029, "Member 'BTServiceSetEnemyFocus_C_SetEnemyFocus::CallFunc_Get_Body_Part_Enum_BPart' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_SetEnemyFocus, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000030, "Member 'BTServiceSetEnemyFocus_C_SetEnemyFocus::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_SetEnemyFocus, CallFunc_IsVectorValueSet_ReturnValue) == 0x000048, "Member 'BTServiceSetEnemyFocus_C_SetEnemyFocus::CallFunc_IsVectorValueSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_SetEnemyFocus, CallFunc_GetValueAsVector_ReturnValue) == 0x000050, "Member 'BTServiceSetEnemyFocus_C_SetEnemyFocus::CallFunc_GetValueAsVector_ReturnValue' has a wrong offset!");

// Function BTServiceSetEnemyFocus.BTServiceSetEnemyFocus_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTServiceSetEnemyFocus_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTServiceSetEnemyFocus_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTServiceSetEnemyFocus_C_ReceiveTickAI");
static_assert(sizeof(BTServiceSetEnemyFocus_C_ReceiveTickAI) == 0x000018, "Wrong size on BTServiceSetEnemyFocus_C_ReceiveTickAI");
static_assert(offsetof(BTServiceSetEnemyFocus_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTServiceSetEnemyFocus_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTServiceSetEnemyFocus_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTServiceSetEnemyFocus_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTServiceSetEnemyFocus.BTServiceSetEnemyFocus_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTServiceSetEnemyFocus_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTServiceSetEnemyFocus_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTServiceSetEnemyFocus_C_ReceiveActivationAI");
static_assert(sizeof(BTServiceSetEnemyFocus_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTServiceSetEnemyFocus_C_ReceiveActivationAI");
static_assert(offsetof(BTServiceSetEnemyFocus_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTServiceSetEnemyFocus_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTServiceSetEnemyFocus_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function BTServiceSetEnemyFocus.BTServiceSetEnemyFocus_C.Get Body Part Enum
// 0x0018 (0x0018 - 0x0000)
struct BTServiceSetEnemyFocus_C_Get_Body_Part_Enum final
{
public:
	E_NPCBodyPart                                 Expected_BPart;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzCharacterDamageAreaType                    BPart;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6782[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6783[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTServiceSetEnemyFocus_C_Get_Body_Part_Enum) == 0x000008, "Wrong alignment on BTServiceSetEnemyFocus_C_Get_Body_Part_Enum");
static_assert(sizeof(BTServiceSetEnemyFocus_C_Get_Body_Part_Enum) == 0x000018, "Wrong size on BTServiceSetEnemyFocus_C_Get_Body_Part_Enum");
static_assert(offsetof(BTServiceSetEnemyFocus_C_Get_Body_Part_Enum, Expected_BPart) == 0x000000, "Member 'BTServiceSetEnemyFocus_C_Get_Body_Part_Enum::Expected_BPart' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_Get_Body_Part_Enum, BPart) == 0x000001, "Member 'BTServiceSetEnemyFocus_C_Get_Body_Part_Enum::BPart' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_Get_Body_Part_Enum, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'BTServiceSetEnemyFocus_C_Get_Body_Part_Enum::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_Get_Body_Part_Enum, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x000004, "Member 'BTServiceSetEnemyFocus_C_Get_Body_Part_Enum::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_Get_Body_Part_Enum, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000008, "Member 'BTServiceSetEnemyFocus_C_Get_Body_Part_Enum::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_Get_Body_Part_Enum, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000010, "Member 'BTServiceSetEnemyFocus_C_Get_Body_Part_Enum::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BTServiceSetEnemyFocus.BTServiceSetEnemyFocus_C.ExecuteUbergraph_BTServiceSetEnemyFocus
// 0x0030 (0x0030 - 0x0000)
struct BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6784[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus) == 0x000008, "Wrong alignment on BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus");
static_assert(sizeof(BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus) == 0x000030, "Wrong size on BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus");
static_assert(offsetof(BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus, EntryPoint) == 0x000000, "Member 'BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus, K2Node_Event_OwnerController) == 0x000008, "Member 'BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus, K2Node_Event_OwnerController_1) == 0x000018, "Member 'BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus, K2Node_Event_ControlledPawn_1) == 0x000020, "Member 'BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BTServiceSetEnemyFocus_C_ExecuteUbergraph_BTServiceSetEnemyFocus::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

