#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTServiceSetAlertFocus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTServiceSetAlertFocus.BTServiceSetAlertFocus_C
// 0x0030 (0x00C8 - 0x0098)
class UBTServiceSetAlertFocus_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   StimulosLocationBBName;                            // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x00A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinDistanceForFocusOnPoint;                        // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ExecuteUbergraph_BTServiceSetAlertFocus(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTServiceSetAlertFocus_C">();
	}
	static class UBTServiceSetAlertFocus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTServiceSetAlertFocus_C>();
	}
};
static_assert(alignof(UBTServiceSetAlertFocus_C) == 0x000008, "Wrong alignment on UBTServiceSetAlertFocus_C");
static_assert(sizeof(UBTServiceSetAlertFocus_C) == 0x0000C8, "Wrong size on UBTServiceSetAlertFocus_C");
static_assert(offsetof(UBTServiceSetAlertFocus_C, UberGraphFrame) == 0x000098, "Member 'UBTServiceSetAlertFocus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTServiceSetAlertFocus_C, StimulosLocationBBName) == 0x0000A0, "Member 'UBTServiceSetAlertFocus_C::StimulosLocationBBName' has a wrong offset!");
static_assert(offsetof(UBTServiceSetAlertFocus_C, Offset) == 0x0000A8, "Member 'UBTServiceSetAlertFocus_C::Offset' has a wrong offset!");
static_assert(offsetof(UBTServiceSetAlertFocus_C, MinDistanceForFocusOnPoint) == 0x0000C0, "Member 'UBTServiceSetAlertFocus_C::MinDistanceForFocusOnPoint' has a wrong offset!");

}

