#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_TokenCheck

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTService_TokenCheck.BTService_TokenCheck_C
// 0x0058 (0x00F0 - 0x0098)
class UBTService_TokenCheck_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Enemy;                                             // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 EnemyCanbeAttack;                                  // 0x00C8(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTService_TokenCheck(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTService_TokenCheck_C">();
	}
	static class UBTService_TokenCheck_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_TokenCheck_C>();
	}
};
static_assert(alignof(UBTService_TokenCheck_C) == 0x000008, "Wrong alignment on UBTService_TokenCheck_C");
static_assert(sizeof(UBTService_TokenCheck_C) == 0x0000F0, "Wrong size on UBTService_TokenCheck_C");
static_assert(offsetof(UBTService_TokenCheck_C, UberGraphFrame) == 0x000098, "Member 'UBTService_TokenCheck_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTService_TokenCheck_C, Enemy) == 0x0000A0, "Member 'UBTService_TokenCheck_C::Enemy' has a wrong offset!");
static_assert(offsetof(UBTService_TokenCheck_C, EnemyCanbeAttack) == 0x0000C8, "Member 'UBTService_TokenCheck_C::EnemyCanbeAttack' has a wrong offset!");

}

