#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_FindCombatPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTService_FindCombatPoint.BTService_FindCombatPoint_C
// 0x00A8 (0x0140 - 0x0098)
class UBTService_FindCombatPoint_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 CoverPoint;                                        // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 Enemy;                                             // 0x00C8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 InCover;                                           // 0x00F0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 KindOfCover;                                       // 0x0118(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTService_FindCombatPoint(int32 EntryPoint);
	void ClearCoverData(class APawn* InPawn);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTService_FindCombatPoint_C">();
	}
	static class UBTService_FindCombatPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_FindCombatPoint_C>();
	}
};
static_assert(alignof(UBTService_FindCombatPoint_C) == 0x000008, "Wrong alignment on UBTService_FindCombatPoint_C");
static_assert(sizeof(UBTService_FindCombatPoint_C) == 0x000140, "Wrong size on UBTService_FindCombatPoint_C");
static_assert(offsetof(UBTService_FindCombatPoint_C, UberGraphFrame) == 0x000098, "Member 'UBTService_FindCombatPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTService_FindCombatPoint_C, CoverPoint) == 0x0000A0, "Member 'UBTService_FindCombatPoint_C::CoverPoint' has a wrong offset!");
static_assert(offsetof(UBTService_FindCombatPoint_C, Enemy) == 0x0000C8, "Member 'UBTService_FindCombatPoint_C::Enemy' has a wrong offset!");
static_assert(offsetof(UBTService_FindCombatPoint_C, InCover) == 0x0000F0, "Member 'UBTService_FindCombatPoint_C::InCover' has a wrong offset!");
static_assert(offsetof(UBTService_FindCombatPoint_C, KindOfCover) == 0x000118, "Member 'UBTService_FindCombatPoint_C::KindOfCover' has a wrong offset!");

}

