#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTServiceSetAlertFocus

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTServiceSetAlertFocus.BTServiceSetAlertFocus_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTServiceSetAlertFocus_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTServiceSetAlertFocus_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTServiceSetAlertFocus_C_ReceiveTickAI");
static_assert(sizeof(BTServiceSetAlertFocus_C_ReceiveTickAI) == 0x000018, "Wrong size on BTServiceSetAlertFocus_C_ReceiveTickAI");
static_assert(offsetof(BTServiceSetAlertFocus_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTServiceSetAlertFocus_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTServiceSetAlertFocus_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTServiceSetAlertFocus_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTServiceSetAlertFocus.BTServiceSetAlertFocus_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTServiceSetAlertFocus_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTServiceSetAlertFocus_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTServiceSetAlertFocus_C_ReceiveActivationAI");
static_assert(sizeof(BTServiceSetAlertFocus_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTServiceSetAlertFocus_C_ReceiveActivationAI");
static_assert(offsetof(BTServiceSetAlertFocus_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTServiceSetAlertFocus_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTServiceSetAlertFocus_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function BTServiceSetAlertFocus.BTServiceSetAlertFocus_C.ExecuteUbergraph_BTServiceSetAlertFocus
// 0x0080 (0x0080 - 0x0000)
struct BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6792[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6793[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzAIController*                        K2Node_DynamicCast_AsGz_AIController;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVectorValueSet_ReturnValue;             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6794[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetValueAsVector_ReturnValue;             // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus) == 0x000008, "Wrong alignment on BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus");
static_assert(sizeof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus) == 0x000080, "Wrong size on BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus");
static_assert(offsetof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus, EntryPoint) == 0x000000, "Member 'BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus, K2Node_Event_OwnerController) == 0x000008, "Member 'BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus, K2Node_Event_OwnerController_1) == 0x000018, "Member 'BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus, K2Node_Event_ControlledPawn_1) == 0x000020, "Member 'BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus, K2Node_DynamicCast_AsGz_AIController) == 0x000048, "Member 'BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus::K2Node_DynamicCast_AsGz_AIController' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus, CallFunc_IsVectorValueSet_ReturnValue) == 0x000051, "Member 'BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus::CallFunc_IsVectorValueSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus, CallFunc_GetValueAsVector_ReturnValue) == 0x000058, "Member 'BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus::CallFunc_GetValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus, CallFunc_Vector_Distance_ReturnValue) == 0x000070, "Member 'BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000078, "Member 'BTServiceSetAlertFocus_C_ExecuteUbergraph_BTServiceSetAlertFocus::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");

}

