#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_QuickMeleeAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTService_QuickMeleeAttack.BTService_QuickMeleeAttack_C
// 0x0060 (0x00F8 - 0x0098)
class UBTService_QuickMeleeAttack_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Enemy;                                             // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 TargetVisible;                                     // 0x00C8(0x0028)(Edit, BlueprintVisible)
	double                                        QuickMeleeDistance;                                // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);
	void ExecuteUbergraph_BTService_QuickMeleeAttack(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTService_QuickMeleeAttack_C">();
	}
	static class UBTService_QuickMeleeAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_QuickMeleeAttack_C>();
	}
};
static_assert(alignof(UBTService_QuickMeleeAttack_C) == 0x000008, "Wrong alignment on UBTService_QuickMeleeAttack_C");
static_assert(sizeof(UBTService_QuickMeleeAttack_C) == 0x0000F8, "Wrong size on UBTService_QuickMeleeAttack_C");
static_assert(offsetof(UBTService_QuickMeleeAttack_C, UberGraphFrame) == 0x000098, "Member 'UBTService_QuickMeleeAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTService_QuickMeleeAttack_C, Enemy) == 0x0000A0, "Member 'UBTService_QuickMeleeAttack_C::Enemy' has a wrong offset!");
static_assert(offsetof(UBTService_QuickMeleeAttack_C, TargetVisible) == 0x0000C8, "Member 'UBTService_QuickMeleeAttack_C::TargetVisible' has a wrong offset!");
static_assert(offsetof(UBTService_QuickMeleeAttack_C, QuickMeleeDistance) == 0x0000F0, "Member 'UBTService_QuickMeleeAttack_C::QuickMeleeDistance' has a wrong offset!");

}

