#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_TokenCheck

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTService_TokenCheck.BTService_TokenCheck_C.ExecuteUbergraph_BTService_TokenCheck
// 0x0040 (0x0040 - 0x0000)
struct BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C1[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C2[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAITokenComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeAttackedBy_ReturnValue;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck) == 0x000008, "Wrong alignment on BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck");
static_assert(sizeof(BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck) == 0x000040, "Wrong size on BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck");
static_assert(offsetof(BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck, EntryPoint) == 0x000000, "Member 'BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck, K2Node_Event_OwnerController) == 0x000008, "Member 'BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000020, "Member 'BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck, CallFunc_IsValid_ReturnValue_2) == 0x000038, "Member 'BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck, CallFunc_CanBeAttackedBy_ReturnValue) == 0x000039, "Member 'BTService_TokenCheck_C_ExecuteUbergraph_BTService_TokenCheck::CallFunc_CanBeAttackedBy_ReturnValue' has a wrong offset!");

// Function BTService_TokenCheck.BTService_TokenCheck_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTService_TokenCheck_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_TokenCheck_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTService_TokenCheck_C_ReceiveTickAI");
static_assert(sizeof(BTService_TokenCheck_C_ReceiveTickAI) == 0x000018, "Wrong size on BTService_TokenCheck_C_ReceiveTickAI");
static_assert(offsetof(BTService_TokenCheck_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTService_TokenCheck_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_TokenCheck_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTService_TokenCheck_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTService_TokenCheck_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTService_TokenCheck_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

