#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_Reload

#include "Basic.hpp"

#include "G01_structs.hpp"


namespace SDK::Params
{

// Function BTService_Reload.BTService_Reload_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTService_Reload_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_Reload_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTService_Reload_C_ReceiveTickAI");
static_assert(sizeof(BTService_Reload_C_ReceiveTickAI) == 0x000018, "Wrong size on BTService_Reload_C_ReceiveTickAI");
static_assert(offsetof(BTService_Reload_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTService_Reload_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTService_Reload_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTService_Reload_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTService_Reload.BTService_Reload_C.Get Ammo in Clip
// 0x0028 (0x0028 - 0x0000)
struct BTService_Reload_C_Get_Ammo_in_Clip final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletsInClip;                                     // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6678[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzCombatComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGzInvPocketId                         CallFunc_GetEquippedPocketID_ReturnValue;          // 0x0018(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6679[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAmmoCountForWeaponPocket_ReturnValue;  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_Reload_C_Get_Ammo_in_Clip) == 0x000008, "Wrong alignment on BTService_Reload_C_Get_Ammo_in_Clip");
static_assert(sizeof(BTService_Reload_C_Get_Ammo_in_Clip) == 0x000028, "Wrong size on BTService_Reload_C_Get_Ammo_in_Clip");
static_assert(offsetof(BTService_Reload_C_Get_Ammo_in_Clip, Pawn) == 0x000000, "Member 'BTService_Reload_C_Get_Ammo_in_Clip::Pawn' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_Get_Ammo_in_Clip, BulletsInClip) == 0x000008, "Member 'BTService_Reload_C_Get_Ammo_in_Clip::BulletsInClip' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_Get_Ammo_in_Clip, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BTService_Reload_C_Get_Ammo_in_Clip::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_Get_Ammo_in_Clip, CallFunc_GetEquippedPocketID_ReturnValue) == 0x000018, "Member 'BTService_Reload_C_Get_Ammo_in_Clip::CallFunc_GetEquippedPocketID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_Get_Ammo_in_Clip, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BTService_Reload_C_Get_Ammo_in_Clip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_Get_Ammo_in_Clip, CallFunc_GetAmmoCountForWeaponPocket_ReturnValue) == 0x000024, "Member 'BTService_Reload_C_Get_Ammo_in_Clip::CallFunc_GetAmmoCountForWeaponPocket_ReturnValue' has a wrong offset!");

// Function BTService_Reload.BTService_Reload_C.ExecuteUbergraph_BTService_Reload
// 0x00A0 (0x00A0 - 0x0000)
struct BTService_Reload_C_ExecuteUbergraph_BTService_Reload final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_667A[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_667B[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAIActivateAbilityAsyncTaskBlueprintProxy* CallFunc_CreateActivateAbilityProxyObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveWeaponClipEmpty_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_667C[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzAIController*                        K2Node_DynamicCast_AsGz_AIController;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_667D[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAIVoiceComponent*                    CallFunc_GetAIVoiceComponent_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentMentalStateTime_ReturnValue;    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartSound_ReturnValue;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_667E[0x1];                                     // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveWeaponClipFull_ReturnValue;       // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_667F[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload) == 0x000008, "Wrong alignment on BTService_Reload_C_ExecuteUbergraph_BTService_Reload");
static_assert(sizeof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload) == 0x0000A0, "Wrong size on BTService_Reload_C_ExecuteUbergraph_BTService_Reload");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, EntryPoint) == 0x000000, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, K2Node_Event_OwnerController) == 0x000028, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, K2Node_Event_ControlledPawn) == 0x000030, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_CreateActivateAbilityProxyObject_ReturnValue) == 0x000040, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_CreateActivateAbilityProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_IsActiveWeaponClipEmpty_ReturnValue) == 0x000048, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_IsActiveWeaponClipEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, K2Node_DynamicCast_AsGz_AIController) == 0x000050, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::K2Node_DynamicCast_AsGz_AIController' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_GetAIVoiceComponent_ReturnValue) == 0x000060, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_GetAIVoiceComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_GetCurrentMentalStateTime_ReturnValue) == 0x000068, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_GetCurrentMentalStateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_StartSound_ReturnValue) == 0x00006C, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_StartSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_IsValid_ReturnValue_1) == 0x00006D, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00006E, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000070, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_Not_PreBool_ReturnValue) == 0x000078, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_IsValid_ReturnValue_2) == 0x000079, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_BooleanAND_ReturnValue) == 0x00007A, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_IsActiveWeaponClipFull_ReturnValue) == 0x00007B, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_IsActiveWeaponClipFull_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, K2Node_CreateDelegate_OutputDelegate_2) == 0x00007C, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000090, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTService_Reload_C_ExecuteUbergraph_BTService_Reload, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000098, "Member 'BTService_Reload_C_ExecuteUbergraph_BTService_Reload::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");

}

