#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_NPC_OUTofVehicle

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTTask_NPC_OUTofVehicle.BTTask_NPC_OUTofVehicle_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_NPC_OUTofVehicle_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_NPC_OUTofVehicle_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_NPC_OUTofVehicle_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_NPC_OUTofVehicle_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_NPC_OUTofVehicle_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_NPC_OUTofVehicle_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_NPC_OUTofVehicle_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTTask_NPC_OUTofVehicle.BTTask_NPC_OUTofVehicle_C.ExecuteUbergraph_BTTask_NPC_OUTofVehicle
// 0x0060 (0x0060 - 0x0000)
struct BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D3[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D4[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_1;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzVehicle*                             K2Node_DynamicCast_AsGz_Vehicle;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AssignSeat_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle) == 0x000008, "Wrong alignment on BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle");
static_assert(sizeof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle) == 0x000060, "Wrong size on BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle, EntryPoint) == 0x000000, "Member 'BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle, CallFunc_MakeLiteralName_ReturnValue_1) == 0x00000C, "Member 'BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle, K2Node_Event_OwnerController) == 0x000018, "Member 'BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle, K2Node_Event_ControlledPawn) == 0x000020, "Member 'BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle, CallFunc_GetBlackboard_ReturnValue) == 0x000028, "Member 'BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle, K2Node_DynamicCast_AsGz_Character) == 0x000030, "Member 'BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle, CallFunc_GetValueAsObject_ReturnValue) == 0x000040, "Member 'BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle, CallFunc_GetBlackboard_ReturnValue_1) == 0x000048, "Member 'BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle::CallFunc_GetBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle, K2Node_DynamicCast_AsGz_Vehicle) == 0x000050, "Member 'BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle::K2Node_DynamicCast_AsGz_Vehicle' has a wrong offset!");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle, CallFunc_AssignSeat_ReturnValue) == 0x000059, "Member 'BTTask_NPC_OUTofVehicle_C_ExecuteUbergraph_BTTask_NPC_OUTofVehicle::CallFunc_AssignSeat_ReturnValue' has a wrong offset!");

}

