#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_PlayAnimMontage

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTTask_PlayAnimMontage.BTTask_PlayAnimMontage_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_PlayAnimMontage_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_PlayAnimMontage_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_PlayAnimMontage_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_PlayAnimMontage_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_PlayAnimMontage_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_PlayAnimMontage_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_PlayAnimMontage_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTTask_PlayAnimMontage.BTTask_PlayAnimMontage_C.ReceiveAbortAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_PlayAnimMontage_C_ReceiveAbortAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_PlayAnimMontage_C_ReceiveAbortAI) == 0x000008, "Wrong alignment on BTTask_PlayAnimMontage_C_ReceiveAbortAI");
static_assert(sizeof(BTTask_PlayAnimMontage_C_ReceiveAbortAI) == 0x000010, "Wrong size on BTTask_PlayAnimMontage_C_ReceiveAbortAI");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ReceiveAbortAI, OwnerController) == 0x000000, "Member 'BTTask_PlayAnimMontage_C_ReceiveAbortAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ReceiveAbortAI, ControlledPawn) == 0x000008, "Member 'BTTask_PlayAnimMontage_C_ReceiveAbortAI::ControlledPawn' has a wrong offset!");

// Function BTTask_PlayAnimMontage.BTTask_PlayAnimMontage_C.ExecuteUbergraph_BTTask_PlayAnimMontage
// 0x0080 (0x0080 - 0x0000)
struct BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6680[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzAIActivateAbilityAsyncTaskBlueprintProxy* CallFunc_CreateActivateAbilityMontageProxyObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6681[0x5];                                     // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAbilitySystemComponent*              K2Node_DynamicCast_AsGz_Ability_System_Component;  // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage) == 0x000008, "Wrong alignment on BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage");
static_assert(sizeof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage) == 0x000080, "Wrong size on BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, EntryPoint) == 0x000000, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, K2Node_Event_OwnerController_1) == 0x000038, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, K2Node_Event_ControlledPawn_1) == 0x000040, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, K2Node_Event_OwnerController) == 0x000048, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, K2Node_Event_ControlledPawn) == 0x000050, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, CallFunc_CreateActivateAbilityMontageProxyObject_ReturnValue) == 0x000058, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::CallFunc_CreateActivateAbilityMontageProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, CallFunc_IsValid_ReturnValue_2) == 0x000062, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000068, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, K2Node_DynamicCast_AsGz_Ability_System_Component) == 0x000070, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::K2Node_DynamicCast_AsGz_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BTTask_PlayAnimMontage_C_ExecuteUbergraph_BTTask_PlayAnimMontage::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

