#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_NPCintoVehicle

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTTask_NPCintoVehicle.BTTask_NPCintoVehicle_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_NPCintoVehicle_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_NPCintoVehicle_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_NPCintoVehicle_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_NPCintoVehicle_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_NPCintoVehicle_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_NPCintoVehicle_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_NPCintoVehicle_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_NPCintoVehicle_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTTask_NPCintoVehicle.BTTask_NPCintoVehicle_C.Find the Seat
// 0x0038 (0x0038 - 0x0000)
struct BTTask_NPCintoVehicle_C_Find_the_Seat final
{
public:
	class AGzVehicle*                             Vehicle;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          PlaceFound;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E25[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_GetCharacterInSeat_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E26[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_GetCharacterInSeat_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           CallFunc_GetCharacterInSeat_ReturnValue_2;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_NPCintoVehicle_C_Find_the_Seat) == 0x000008, "Wrong alignment on BTTask_NPCintoVehicle_C_Find_the_Seat");
static_assert(sizeof(BTTask_NPCintoVehicle_C_Find_the_Seat) == 0x000038, "Wrong size on BTTask_NPCintoVehicle_C_Find_the_Seat");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Find_the_Seat, Vehicle) == 0x000000, "Member 'BTTask_NPCintoVehicle_C_Find_the_Seat::Vehicle' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Find_the_Seat, PlaceFound) == 0x000008, "Member 'BTTask_NPCintoVehicle_C_Find_the_Seat::PlaceFound' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Find_the_Seat, CallFunc_GetCharacterInSeat_ReturnValue) == 0x000010, "Member 'BTTask_NPCintoVehicle_C_Find_the_Seat::CallFunc_GetCharacterInSeat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Find_the_Seat, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000018, "Member 'BTTask_NPCintoVehicle_C_Find_the_Seat::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Find_the_Seat, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BTTask_NPCintoVehicle_C_Find_the_Seat::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Find_the_Seat, CallFunc_GetCharacterInSeat_ReturnValue_1) == 0x000020, "Member 'BTTask_NPCintoVehicle_C_Find_the_Seat::CallFunc_GetCharacterInSeat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Find_the_Seat, CallFunc_GetCharacterInSeat_ReturnValue_2) == 0x000028, "Member 'BTTask_NPCintoVehicle_C_Find_the_Seat::CallFunc_GetCharacterInSeat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Find_the_Seat, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'BTTask_NPCintoVehicle_C_Find_the_Seat::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Find_the_Seat, CallFunc_IsValid_ReturnValue_2) == 0x000031, "Member 'BTTask_NPCintoVehicle_C_Find_the_Seat::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BTTask_NPCintoVehicle.BTTask_NPCintoVehicle_C.ExecuteUbergraph_BTTask_NPCintoVehicle
// 0x0040 (0x0040 - 0x0000)
struct BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Find_the_Seat_PlaceFound;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E27[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E28[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Available_seats_in_vehicle_Empty_seats;   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AssignSeat_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle) == 0x000008, "Wrong alignment on BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle");
static_assert(sizeof(BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle) == 0x000040, "Wrong size on BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle");
static_assert(offsetof(BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle, EntryPoint) == 0x000000, "Member 'BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle, CallFunc_Find_the_Seat_PlaceFound) == 0x00000C, "Member 'BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle::CallFunc_Find_the_Seat_PlaceFound' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle, K2Node_Event_OwnerController) == 0x000010, "Member 'BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle, K2Node_Event_ControlledPawn) == 0x000018, "Member 'BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle, K2Node_DynamicCast_AsGz_Character) == 0x000020, "Member 'BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle, CallFunc_GetBlackboard_ReturnValue) == 0x000030, "Member 'BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle, CallFunc_Available_seats_in_vehicle_Empty_seats) == 0x000038, "Member 'BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle::CallFunc_Available_seats_in_vehicle_Empty_seats' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle, CallFunc_AssignSeat_ReturnValue) == 0x000039, "Member 'BTTask_NPCintoVehicle_C_ExecuteUbergraph_BTTask_NPCintoVehicle::CallFunc_AssignSeat_ReturnValue' has a wrong offset!");

// Function BTTask_NPCintoVehicle.BTTask_NPCintoVehicle_C.Available seats in vehicle
// 0x0040 (0x0040 - 0x0000)
struct BTTask_NPCintoVehicle_C_Available_seats_in_vehicle final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Empty_seats;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E29[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasEmptySeats_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2A[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2B[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzVehicle*                             K2Node_DynamicCast_AsGz_Vehicle;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_NPCintoVehicle_C_Available_seats_in_vehicle) == 0x000008, "Wrong alignment on BTTask_NPCintoVehicle_C_Available_seats_in_vehicle");
static_assert(sizeof(BTTask_NPCintoVehicle_C_Available_seats_in_vehicle) == 0x000040, "Wrong size on BTTask_NPCintoVehicle_C_Available_seats_in_vehicle");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Available_seats_in_vehicle, Target) == 0x000000, "Member 'BTTask_NPCintoVehicle_C_Available_seats_in_vehicle::Target' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Available_seats_in_vehicle, Empty_seats) == 0x000008, "Member 'BTTask_NPCintoVehicle_C_Available_seats_in_vehicle::Empty_seats' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Available_seats_in_vehicle, CallFunc_GetBlackboard_ReturnValue) == 0x000010, "Member 'BTTask_NPCintoVehicle_C_Available_seats_in_vehicle::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Available_seats_in_vehicle, CallFunc_HasEmptySeats_ReturnValue) == 0x000018, "Member 'BTTask_NPCintoVehicle_C_Available_seats_in_vehicle::CallFunc_HasEmptySeats_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Available_seats_in_vehicle, CallFunc_MakeLiteralName_ReturnValue) == 0x00001C, "Member 'BTTask_NPCintoVehicle_C_Available_seats_in_vehicle::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Available_seats_in_vehicle, CallFunc_GetValueAsObject_ReturnValue) == 0x000028, "Member 'BTTask_NPCintoVehicle_C_Available_seats_in_vehicle::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Available_seats_in_vehicle, K2Node_DynamicCast_AsGz_Vehicle) == 0x000030, "Member 'BTTask_NPCintoVehicle_C_Available_seats_in_vehicle::K2Node_DynamicCast_AsGz_Vehicle' has a wrong offset!");
static_assert(offsetof(BTTask_NPCintoVehicle_C_Available_seats_in_vehicle, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BTTask_NPCintoVehicle_C_Available_seats_in_vehicle::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

