#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_SetReachedCover

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTTask_SetReachedCover.BTTask_SetReachedCover_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_SetReachedCover_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_SetReachedCover_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_SetReachedCover_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_SetReachedCover_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_SetReachedCover_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_SetReachedCover_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_SetReachedCover_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_SetReachedCover_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_SetReachedCover_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTTask_SetReachedCover.BTTask_SetReachedCover_C.ExecuteUbergraph_BTTask_SetReachedCover
// 0x0028 (0x0028 - 0x0000)
struct BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F64[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover) == 0x000008, "Wrong alignment on BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover");
static_assert(sizeof(BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover) == 0x000028, "Wrong size on BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover");
static_assert(offsetof(BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover, EntryPoint) == 0x000000, "Member 'BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover, K2Node_Event_OwnerController) == 0x000010, "Member 'BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover, K2Node_Event_ControlledPawn) == 0x000018, "Member 'BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover, CallFunc_GetBlackboard_ReturnValue) == 0x000020, "Member 'BTTask_SetReachedCover_C_ExecuteUbergraph_BTTask_SetReachedCover::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");

}

