#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_ClearBBValue

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTTask_ClearBBValue.BTTask_ClearBBValue_C.ExecuteUbergraph_BTTask_ClearBBValue
// 0x0020 (0x0020 - 0x0000)
struct BTTask_ClearBBValue_C_ExecuteUbergraph_BTTask_ClearBBValue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E23[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_ClearBBValue_C_ExecuteUbergraph_BTTask_ClearBBValue) == 0x000008, "Wrong alignment on BTTask_ClearBBValue_C_ExecuteUbergraph_BTTask_ClearBBValue");
static_assert(sizeof(BTTask_ClearBBValue_C_ExecuteUbergraph_BTTask_ClearBBValue) == 0x000020, "Wrong size on BTTask_ClearBBValue_C_ExecuteUbergraph_BTTask_ClearBBValue");
static_assert(offsetof(BTTask_ClearBBValue_C_ExecuteUbergraph_BTTask_ClearBBValue, EntryPoint) == 0x000000, "Member 'BTTask_ClearBBValue_C_ExecuteUbergraph_BTTask_ClearBBValue::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_ClearBBValue_C_ExecuteUbergraph_BTTask_ClearBBValue, K2Node_Event_OwnerController) == 0x000008, "Member 'BTTask_ClearBBValue_C_ExecuteUbergraph_BTTask_ClearBBValue::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_ClearBBValue_C_ExecuteUbergraph_BTTask_ClearBBValue, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTTask_ClearBBValue_C_ExecuteUbergraph_BTTask_ClearBBValue::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_ClearBBValue_C_ExecuteUbergraph_BTTask_ClearBBValue, CallFunc_GetBlackboard_ReturnValue) == 0x000018, "Member 'BTTask_ClearBBValue_C_ExecuteUbergraph_BTTask_ClearBBValue::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");

// Function BTTask_ClearBBValue.BTTask_ClearBBValue_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_ClearBBValue_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_ClearBBValue_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_ClearBBValue_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_ClearBBValue_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_ClearBBValue_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_ClearBBValue_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_ClearBBValue_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_ClearBBValue_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_ClearBBValue_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

