#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_MoveToActor_Bot

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BTTask_MoveToActor_Bot.BTTask_MoveToActor_Bot_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_MoveToActor_Bot_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_MoveToActor_Bot_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_MoveToActor_Bot_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_MoveToActor_Bot_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_MoveToActor_Bot_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_MoveToActor_Bot_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_MoveToActor_Bot_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTTask_MoveToActor_Bot.BTTask_MoveToActor_Bot_C.ReceiveAbortAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_MoveToActor_Bot_C_ReceiveAbortAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_MoveToActor_Bot_C_ReceiveAbortAI) == 0x000008, "Wrong alignment on BTTask_MoveToActor_Bot_C_ReceiveAbortAI");
static_assert(sizeof(BTTask_MoveToActor_Bot_C_ReceiveAbortAI) == 0x000010, "Wrong size on BTTask_MoveToActor_Bot_C_ReceiveAbortAI");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ReceiveAbortAI, OwnerController) == 0x000000, "Member 'BTTask_MoveToActor_Bot_C_ReceiveAbortAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ReceiveAbortAI, ControlledPawn) == 0x000008, "Member 'BTTask_MoveToActor_Bot_C_ReceiveAbortAI::ControlledPawn' has a wrong offset!");

// Function BTTask_MoveToActor_Bot.BTTask_MoveToActor_Bot_C.OnMoveFinished_8DFB18DE47D88A8E98DF3B89FC895888
// 0x0010 (0x0010 - 0x0000)
struct BTTask_MoveToActor_Bot_C_OnMoveFinished_8DFB18DE47D88A8E98DF3B89FC895888 final
{
public:
	EPathFollowingResult                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6759[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          AIController;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_MoveToActor_Bot_C_OnMoveFinished_8DFB18DE47D88A8E98DF3B89FC895888) == 0x000008, "Wrong alignment on BTTask_MoveToActor_Bot_C_OnMoveFinished_8DFB18DE47D88A8E98DF3B89FC895888");
static_assert(sizeof(BTTask_MoveToActor_Bot_C_OnMoveFinished_8DFB18DE47D88A8E98DF3B89FC895888) == 0x000010, "Wrong size on BTTask_MoveToActor_Bot_C_OnMoveFinished_8DFB18DE47D88A8E98DF3B89FC895888");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_OnMoveFinished_8DFB18DE47D88A8E98DF3B89FC895888, Result) == 0x000000, "Member 'BTTask_MoveToActor_Bot_C_OnMoveFinished_8DFB18DE47D88A8E98DF3B89FC895888::Result' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_OnMoveFinished_8DFB18DE47D88A8E98DF3B89FC895888, AIController) == 0x000008, "Member 'BTTask_MoveToActor_Bot_C_OnMoveFinished_8DFB18DE47D88A8E98DF3B89FC895888::AIController' has a wrong offset!");

// Function BTTask_MoveToActor_Bot.BTTask_MoveToActor_Bot_C.ExecuteUbergraph_BTTask_MoveToActor_Bot
// 0x0098 (0x0098 - 0x0000)
struct BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_675A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult Result, class AAIController* AIController)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_675B[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue_1;  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue;      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_Result;                         // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_675C[0x1];                                     // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_AIController;                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAITask_MoveTo*                         CallFunc_AIMoveTo_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_675D[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AIMoveTo_AcceptanceRadius_ImplicitCast;   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot) == 0x000008, "Wrong alignment on BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot");
static_assert(sizeof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot) == 0x000098, "Wrong size on BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, EntryPoint) == 0x000000, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, K2Node_Event_OwnerController_1) == 0x000020, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, K2Node_Event_ControlledPawn_1) == 0x000028, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000030, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, K2Node_Event_OwnerController) == 0x000038, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, K2Node_Event_ControlledPawn) == 0x000040, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, CallFunc_GetBlackboardValueAsActor_ReturnValue_1) == 0x000050, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::CallFunc_GetBlackboardValueAsActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, CallFunc_GetHorizontalDistanceTo_ReturnValue) == 0x000068, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::CallFunc_GetHorizontalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, CallFunc_IsValid_ReturnValue_1) == 0x00006C, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00006D, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, K2Node_CustomEvent_Result) == 0x00006E, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, K2Node_CustomEvent_AIController) == 0x000070, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::K2Node_CustomEvent_AIController' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, CallFunc_AIMoveTo_ReturnValue) == 0x000078, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::CallFunc_AIMoveTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, CallFunc_IsValid_ReturnValue_2) == 0x000080, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000088, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot, CallFunc_AIMoveTo_AcceptanceRadius_ImplicitCast) == 0x000090, "Member 'BTTask_MoveToActor_Bot_C_ExecuteUbergraph_BTTask_MoveToActor_Bot::CallFunc_AIMoveTo_AcceptanceRadius_ImplicitCast' has a wrong offset!");

}

