#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_PlayAnimMontageAndSound

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_PlayAnimMontageAndSound.BTTask_PlayAnimMontageAndSound_C
// 0x0018 (0x00C0 - 0x00A8)
class UBTTask_PlayAnimMontageAndSound_C : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           Anim_Montage;                                      // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AIBark_Tag;                                        // 0x00B8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveAbortAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void OnFail_717301FC4BCCB1C5448FE59CF5215BC9();
	void OnEnd_717301FC4BCCB1C5448FE59CF5215BC9();
	void OnCancel_717301FC4BCCB1C5448FE59CF5215BC9();
	void ExecuteUbergraph_BTTask_PlayAnimMontageAndSound(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTTask_PlayAnimMontageAndSound_C">();
	}
	static class UBTTask_PlayAnimMontageAndSound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_PlayAnimMontageAndSound_C>();
	}
};
static_assert(alignof(UBTTask_PlayAnimMontageAndSound_C) == 0x000008, "Wrong alignment on UBTTask_PlayAnimMontageAndSound_C");
static_assert(sizeof(UBTTask_PlayAnimMontageAndSound_C) == 0x0000C0, "Wrong size on UBTTask_PlayAnimMontageAndSound_C");
static_assert(offsetof(UBTTask_PlayAnimMontageAndSound_C, UberGraphFrame) == 0x0000A8, "Member 'UBTTask_PlayAnimMontageAndSound_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTTask_PlayAnimMontageAndSound_C, Anim_Montage) == 0x0000B0, "Member 'UBTTask_PlayAnimMontageAndSound_C::Anim_Montage' has a wrong offset!");
static_assert(offsetof(UBTTask_PlayAnimMontageAndSound_C, AIBark_Tag) == 0x0000B8, "Member 'UBTTask_PlayAnimMontageAndSound_C::AIBark_Tag' has a wrong offset!");

}

