#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_PatrolPointPlayAnimMontageAndSound

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTTask_PatrolPointPlayAnimMontageAndSound.BTTask_PatrolPointPlayAnimMontageAndSound_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_PatrolPointPlayAnimMontageAndSound_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_PatrolPointPlayAnimMontageAndSound_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_PatrolPointPlayAnimMontageAndSound_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_PatrolPointPlayAnimMontageAndSound_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_PatrolPointPlayAnimMontageAndSound_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTTask_PatrolPointPlayAnimMontageAndSound.BTTask_PatrolPointPlayAnimMontageAndSound_C.ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound
// 0x0050 (0x0050 - 0x0000)
struct BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DB8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABPC_NPC_Enemy_C*                       K2Node_DynamicCast_AsBPC_NPC_Enemy;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DB9[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NPC_PatrolPoint_C*                  K2Node_DynamicCast_AsBP_NPC_Patrol_Point;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DBA[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetIdleMontageToPlay_Montage;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound) == 0x000008, "Wrong alignment on BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound");
static_assert(sizeof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound) == 0x000050, "Wrong size on BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound");
static_assert(offsetof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound, EntryPoint) == 0x000000, "Member 'BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound, K2Node_Event_OwnerController) == 0x000008, "Member 'BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound, CallFunc_GetValueAsObject_ReturnValue) == 0x000018, "Member 'BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound, K2Node_DynamicCast_AsBPC_NPC_Enemy) == 0x000020, "Member 'BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound::K2Node_DynamicCast_AsBPC_NPC_Enemy' has a wrong offset!");
static_assert(offsetof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound, K2Node_DynamicCast_AsBP_NPC_Patrol_Point) == 0x000030, "Member 'BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound::K2Node_DynamicCast_AsBP_NPC_Patrol_Point' has a wrong offset!");
static_assert(offsetof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound, CallFunc_GetIdleMontageToPlay_Montage) == 0x000040, "Member 'BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound::CallFunc_GetIdleMontageToPlay_Montage' has a wrong offset!");
static_assert(offsetof(BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BTTask_PatrolPointPlayAnimMontageAndSound_C_ExecuteUbergraph_BTTask_PatrolPointPlayAnimMontageAndSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

