#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConcertSyncCore

#include "Basic.hpp"

#include "Concert_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ConcertTransport_structs.hpp"


namespace SDK
{

// Enum ConcertSyncCore.EConcertReplicationChangeFrequencyFlags
// NumValues: 0x0003
enum class EConcertReplicationChangeFrequencyFlags : uint8
{
	None                                     = 0,
	SetDefaults                              = 1,
	EConcertReplicationChangeFrequencyFlags_MAX = 2,
};

// Enum ConcertSyncCore.EConcertPutObjectErrorCode
// NumValues: 0x0004
enum class EConcertPutObjectErrorCode : uint8
{
	UnresolvedStream                         = 0,
	MissingData                              = 1,
	Count                                    = 2,
	EConcertPutObjectErrorCode_MAX           = 3,
};

// Enum ConcertSyncCore.EConcertChangeObjectFrequencyErrorCode
// NumValues: 0x0004
enum class EConcertChangeObjectFrequencyErrorCode : uint8
{
	NotRegistered                            = 0,
	InvalidReplicationRate                   = 1,
	Count                                    = 2,
	EConcertChangeObjectFrequencyErrorCode_MAX = 3,
};

// Enum ConcertSyncCore.EConcertChangeStreamFrequencyErrorCode
// NumValues: 0x0004
enum class EConcertChangeStreamFrequencyErrorCode : uint8
{
	UnknownStream                            = 0,
	InvalidReplicationRate                   = 1,
	Count                                    = 2,
	EConcertChangeStreamFrequencyErrorCode_MAX = 3,
};

// Enum ConcertSyncCore.EConcertQueryClientStreamFlags
// NumValues: 0x0006
enum class EConcertQueryClientStreamFlags : uint8
{
	None                                     = 0,
	SkipStreamInfo                           = 1,
	SkipProperties                           = 2,
	SkipAuthority                            = 4,
	SkipFrequency                            = 8,
	EConcertQueryClientStreamFlags_MAX       = 9,
};

// Enum ConcertSyncCore.EConcertDataStoreResultCode
// NumValues: 0x0007
enum class EConcertDataStoreResultCode : uint8
{
	Added                                    = 0,
	Fetched                                  = 1,
	Exchanged                                = 2,
	NotFound                                 = 3,
	TypeMismatch                             = 4,
	UnexpectedError                          = 5,
	EConcertDataStoreResultCode_MAX          = 6,
};

// Enum ConcertSyncCore.EPresenceModeType
// NumValues: 0x0003
enum class EPresenceModeType : uint32
{
	Desktop                                  = 0,
	VRMode                                   = 1,
	EPresenceModeType_MAX                    = 2,
};

// Enum ConcertSyncCore.EConcertMovieScenePlayerStatus
// NumValues: 0x0007
enum class EConcertMovieScenePlayerStatus : uint8
{
	Stopped                                  = 0,
	Playing                                  = 1,
	Scrubbing                                = 2,
	Jumping                                  = 3,
	Stepping                                 = 4,
	Paused                                   = 5,
	MAX                                      = 6,
};

// Enum ConcertSyncCore.EConcertSequencerPreloadStatus
// NumValues: 0x0004
enum class EConcertSequencerPreloadStatus : uint8
{
	Pending                                  = 0,
	Succeeded                                = 1,
	Failed                                   = 2,
	EConcertSequencerPreloadStatus_MAX       = 3,
};

// Enum ConcertSyncCore.ETransactionFilterResult
// NumValues: 0x0005
enum class ETransactionFilterResult : uint8
{
	IncludeObject                            = 0,
	ExcludeObject                            = 1,
	ExcludeTransaction                       = 2,
	UseDefault                               = 3,
	ETransactionFilterResult_MAX             = 4,
};

// Enum ConcertSyncCore.EConcertPackageUpdateType
// NumValues: 0x0007
enum class EConcertPackageUpdateType : uint8
{
	Dummy                                    = 0,
	Added                                    = 1,
	Saved                                    = 2,
	Renamed                                  = 3,
	Deleted                                  = 4,
	Count                                    = 5,
	EConcertPackageUpdateType_MAX            = 6,
};

// Enum ConcertSyncCore.EConcertResourceLockType
// NumValues: 0x0004
enum class EConcertResourceLockType : uint8
{
	None                                     = 0,
	Lock                                     = 1,
	Unlock                                   = 2,
	EConcertResourceLockType_MAX             = 3,
};

// Enum ConcertSyncCore.EConcertPlaySessionEventType
// NumValues: 0x0005
enum class EConcertPlaySessionEventType : uint8
{
	None                                     = 0,
	BeginPlay                                = 1,
	SwitchPlay                               = 2,
	EndPlay                                  = 3,
	EConcertPlaySessionEventType_MAX         = 4,
};

// Enum ConcertSyncCore.EReplicationResponseErrorCode
// NumValues: 0x0003
enum class EReplicationResponseErrorCode : uint8
{
	Timeout                                  = 0,
	Handled                                  = 1,
	EReplicationResponseErrorCode_MAX        = 2,
};

// Enum ConcertSyncCore.EJoinReplicationErrorCode
// NumValues: 0x000C
enum class EJoinReplicationErrorCode : uint8
{
	Success                                  = 0,
	NetworkError                             = 1,
	Cancelled                                = 2,
	AlreadyInProgress                        = 3,
	NotInAnyConcertSession                   = 4,
	AlreadyInSession                         = 5,
	InvalidClass                             = 6,
	DuplicateProperty                        = 7,
	DuplicateStreamId                        = 8,
	FailedToUnpackStream                     = 9,
	MaxPlusOne                               = 10,
	Max                                      = 9,
};

// Enum ConcertSyncCore.EConcertObjectReplicationMode
// NumValues: 0x0004
enum class EConcertObjectReplicationMode : uint8
{
	SpecifiedRate                            = 0,
	Realtime                                 = 1,
	Count                                    = 2,
	EConcertObjectReplicationMode_MAX        = 3,
};

// Enum ConcertSyncCore.EConcertSyncConnectionEventType
// NumValues: 0x0003
enum class EConcertSyncConnectionEventType : uint8
{
	Connected                                = 0,
	Disconnected                             = 1,
	EConcertSyncConnectionEventType_MAX      = 2,
};

// Enum ConcertSyncCore.EConcertSyncLockEventType
// NumValues: 0x0003
enum class EConcertSyncLockEventType : uint8
{
	Locked                                   = 0,
	Unlocked                                 = 1,
	EConcertSyncLockEventType_MAX            = 2,
};

// Enum ConcertSyncCore.EConcertSyncActivityEventType
// NumValues: 0x0006
enum class EConcertSyncActivityEventType : uint8
{
	None                                     = 0,
	Connection                               = 1,
	Lock                                     = 2,
	Transaction                              = 3,
	Package                                  = 4,
	EConcertSyncActivityEventType_MAX        = 5,
};

// Enum ConcertSyncCore.EConcertSyncTransactionActivitySummaryType
// NumValues: 0x0005
enum class EConcertSyncTransactionActivitySummaryType : uint8
{
	Added                                    = 0,
	Updated                                  = 1,
	Renamed                                  = 2,
	Deleted                                  = 3,
	EConcertSyncTransactionActivitySummaryType_MAX = 4,
};

// Enum ConcertSyncCore.EConcertSyncActivityFlags
// NumValues: 0x0003
enum class EConcertSyncActivityFlags : uint8
{
	None                                     = 0,
	Muted                                    = 1,
	EConcertSyncActivityFlags_MAX            = 2,
};

// ScriptStruct ConcertSyncCore.ConcertPropertyChain
// 0x0010 (0x0010 - 0x0000)
struct FConcertPropertyChain final
{
public:
	TArray<class FName>                           PathToProperty;                                    // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FConcertPropertyChain) == 0x000008, "Wrong alignment on FConcertPropertyChain");
static_assert(sizeof(FConcertPropertyChain) == 0x000010, "Wrong size on FConcertPropertyChain");
static_assert(offsetof(FConcertPropertyChain, PathToProperty) == 0x000000, "Member 'FConcertPropertyChain::PathToProperty' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertPropertySelection
// 0x0010 (0x0010 - 0x0000)
struct FConcertPropertySelection final
{
public:
	TArray<struct FConcertPropertyChain>          ReplicatedProperties;                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertPropertySelection) == 0x000008, "Wrong alignment on FConcertPropertySelection");
static_assert(sizeof(FConcertPropertySelection) == 0x000010, "Wrong size on FConcertPropertySelection");
static_assert(offsetof(FConcertPropertySelection, ReplicatedProperties) == 0x000000, "Member 'FConcertPropertySelection::ReplicatedProperties' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeStream_PutObject
// 0x0030 (0x0030 - 0x0000)
struct FConcertReplication_ChangeStream_PutObject final
{
public:
	struct FConcertPropertySelection              Properties;                                        // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	struct FSoftClassPath                         ClassPath;                                         // 0x0010(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertReplication_ChangeStream_PutObject) == 0x000008, "Wrong alignment on FConcertReplication_ChangeStream_PutObject");
static_assert(sizeof(FConcertReplication_ChangeStream_PutObject) == 0x000030, "Wrong size on FConcertReplication_ChangeStream_PutObject");
static_assert(offsetof(FConcertReplication_ChangeStream_PutObject, Properties) == 0x000000, "Member 'FConcertReplication_ChangeStream_PutObject::Properties' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeStream_PutObject, ClassPath) == 0x000010, "Member 'FConcertReplication_ChangeStream_PutObject::ClassPath' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertClientPresenceEventBase
// 0x0004 (0x0004 - 0x0000)
struct FConcertClientPresenceEventBase
{
public:
	uint32                                        TransactionUpdateIndex;                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertClientPresenceEventBase) == 0x000004, "Wrong alignment on FConcertClientPresenceEventBase");
static_assert(sizeof(FConcertClientPresenceEventBase) == 0x000004, "Wrong size on FConcertClientPresenceEventBase");
static_assert(offsetof(FConcertClientPresenceEventBase, TransactionUpdateIndex) == 0x000000, "Member 'FConcertClientPresenceEventBase::TransactionUpdateIndex' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertClientPresenceDataUpdateEvent
// 0x005C (0x0060 - 0x0004)
struct FConcertClientPresenceDataUpdateEvent final : public FConcertClientPresenceEventBase
{
public:
	class FName                                   WorldPath;                                         // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4750[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Position;                                          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4751[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Orientation;                                       // 0x0030(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPresenceModeType                             PresenceType;                                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4752[0xC];                                     // 0x0054(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConcertClientPresenceDataUpdateEvent) == 0x000010, "Wrong alignment on FConcertClientPresenceDataUpdateEvent");
static_assert(sizeof(FConcertClientPresenceDataUpdateEvent) == 0x000060, "Wrong size on FConcertClientPresenceDataUpdateEvent");
static_assert(offsetof(FConcertClientPresenceDataUpdateEvent, WorldPath) == 0x000004, "Member 'FConcertClientPresenceDataUpdateEvent::WorldPath' has a wrong offset!");
static_assert(offsetof(FConcertClientPresenceDataUpdateEvent, Position) == 0x000010, "Member 'FConcertClientPresenceDataUpdateEvent::Position' has a wrong offset!");
static_assert(offsetof(FConcertClientPresenceDataUpdateEvent, Orientation) == 0x000030, "Member 'FConcertClientPresenceDataUpdateEvent::Orientation' has a wrong offset!");
static_assert(offsetof(FConcertClientPresenceDataUpdateEvent, PresenceType) == 0x000050, "Member 'FConcertClientPresenceDataUpdateEvent::PresenceType' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertStreamArray
// 0x0010 (0x0010 - 0x0000)
struct FConcertStreamArray final
{
public:
	TArray<struct FGuid>                          StreamIds;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertStreamArray) == 0x000008, "Wrong alignment on FConcertStreamArray");
static_assert(sizeof(FConcertStreamArray) == 0x000010, "Wrong size on FConcertStreamArray");
static_assert(offsetof(FConcertStreamArray, StreamIds) == 0x000000, "Member 'FConcertStreamArray::StreamIds' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeAuthority_Request
// 0x00A0 (0x00A0 - 0x0000)
struct FConcertReplication_ChangeAuthority_Request final
{
public:
	TMap<struct FSoftObjectPath, struct FConcertStreamArray> TakeAuthority;                                     // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FSoftObjectPath, struct FConcertStreamArray> ReleaseAuthority;                                  // 0x0050(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertReplication_ChangeAuthority_Request) == 0x000008, "Wrong alignment on FConcertReplication_ChangeAuthority_Request");
static_assert(sizeof(FConcertReplication_ChangeAuthority_Request) == 0x0000A0, "Wrong size on FConcertReplication_ChangeAuthority_Request");
static_assert(offsetof(FConcertReplication_ChangeAuthority_Request, TakeAuthority) == 0x000000, "Member 'FConcertReplication_ChangeAuthority_Request::TakeAuthority' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeAuthority_Request, ReleaseAuthority) == 0x000050, "Member 'FConcertReplication_ChangeAuthority_Request::ReleaseAuthority' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeAuthority_Response
// 0x0058 (0x0058 - 0x0000)
struct FConcertReplication_ChangeAuthority_Response final
{
public:
	EReplicationResponseErrorCode                 ErrorCode;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4753[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FSoftObjectPath, struct FConcertStreamArray> RejectedObjects;                                   // 0x0008(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertReplication_ChangeAuthority_Response) == 0x000008, "Wrong alignment on FConcertReplication_ChangeAuthority_Response");
static_assert(sizeof(FConcertReplication_ChangeAuthority_Response) == 0x000058, "Wrong size on FConcertReplication_ChangeAuthority_Response");
static_assert(offsetof(FConcertReplication_ChangeAuthority_Response, ErrorCode) == 0x000000, "Member 'FConcertReplication_ChangeAuthority_Response::ErrorCode' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeAuthority_Response, RejectedObjects) == 0x000008, "Member 'FConcertReplication_ChangeAuthority_Response::RejectedObjects' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertObjectReplicationSettings
// 0x0002 (0x0002 - 0x0000)
struct FConcertObjectReplicationSettings final
{
public:
	EConcertObjectReplicationMode                 ReplicationMode;                                   // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReplicationRate;                                   // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertObjectReplicationSettings) == 0x000001, "Wrong alignment on FConcertObjectReplicationSettings");
static_assert(sizeof(FConcertObjectReplicationSettings) == 0x000002, "Wrong size on FConcertObjectReplicationSettings");
static_assert(offsetof(FConcertObjectReplicationSettings, ReplicationMode) == 0x000000, "Member 'FConcertObjectReplicationSettings::ReplicationMode' has a wrong offset!");
static_assert(offsetof(FConcertObjectReplicationSettings, ReplicationRate) == 0x000001, "Member 'FConcertObjectReplicationSettings::ReplicationRate' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeStream_Frequency
// 0x00F8 (0x00F8 - 0x0000)
struct FConcertReplication_ChangeStream_Frequency final
{
public:
	TMap<struct FSoftObjectPath, struct FConcertObjectReplicationSettings> OverridesToPut;                                    // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TSet<struct FSoftObjectPath>                  OverridesToRemove;                                 // 0x0050(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FSoftObjectPath, struct FConcertObjectReplicationSettings> OverridesToAdd;                                    // 0x00A0(0x0050)(NativeAccessSpecifierPublic)
	struct FConcertObjectReplicationSettings      NewDefaults;                                       // 0x00F0(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	EConcertReplicationChangeFrequencyFlags       Flags;                                             // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4754[0x5];                                     // 0x00F3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConcertReplication_ChangeStream_Frequency) == 0x000008, "Wrong alignment on FConcertReplication_ChangeStream_Frequency");
static_assert(sizeof(FConcertReplication_ChangeStream_Frequency) == 0x0000F8, "Wrong size on FConcertReplication_ChangeStream_Frequency");
static_assert(offsetof(FConcertReplication_ChangeStream_Frequency, OverridesToPut) == 0x000000, "Member 'FConcertReplication_ChangeStream_Frequency::OverridesToPut' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeStream_Frequency, OverridesToRemove) == 0x000050, "Member 'FConcertReplication_ChangeStream_Frequency::OverridesToRemove' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeStream_Frequency, OverridesToAdd) == 0x0000A0, "Member 'FConcertReplication_ChangeStream_Frequency::OverridesToAdd' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeStream_Frequency, NewDefaults) == 0x0000F0, "Member 'FConcertReplication_ChangeStream_Frequency::NewDefaults' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeStream_Frequency, Flags) == 0x0000F2, "Member 'FConcertReplication_ChangeStream_Frequency::Flags' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertObjectInStreamID
// 0x0030 (0x0030 - 0x0000)
struct FConcertObjectInStreamID
{
public:
	struct FGuid                                  StreamId;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        Object;                                            // 0x0010(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertObjectInStreamID) == 0x000008, "Wrong alignment on FConcertObjectInStreamID");
static_assert(sizeof(FConcertObjectInStreamID) == 0x000030, "Wrong size on FConcertObjectInStreamID");
static_assert(offsetof(FConcertObjectInStreamID, StreamId) == 0x000000, "Member 'FConcertObjectInStreamID::StreamId' has a wrong offset!");
static_assert(offsetof(FConcertObjectInStreamID, Object) == 0x000010, "Member 'FConcertObjectInStreamID::Object' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertReplicatedObjectInfo
// 0x0030 (0x0030 - 0x0000)
struct FConcertReplicatedObjectInfo final
{
public:
	struct FSoftClassPath                         ClassPath;                                         // 0x0000(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertPropertySelection              PropertySelection;                                 // 0x0020(0x0010)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertReplicatedObjectInfo) == 0x000008, "Wrong alignment on FConcertReplicatedObjectInfo");
static_assert(sizeof(FConcertReplicatedObjectInfo) == 0x000030, "Wrong size on FConcertReplicatedObjectInfo");
static_assert(offsetof(FConcertReplicatedObjectInfo, ClassPath) == 0x000000, "Member 'FConcertReplicatedObjectInfo::ClassPath' has a wrong offset!");
static_assert(offsetof(FConcertReplicatedObjectInfo, PropertySelection) == 0x000020, "Member 'FConcertReplicatedObjectInfo::PropertySelection' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertObjectReplicationMap
// 0x0050 (0x0050 - 0x0000)
struct FConcertObjectReplicationMap final
{
public:
	TMap<struct FSoftObjectPath, struct FConcertReplicatedObjectInfo> ReplicatedObjects;                                 // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertObjectReplicationMap) == 0x000008, "Wrong alignment on FConcertObjectReplicationMap");
static_assert(sizeof(FConcertObjectReplicationMap) == 0x000050, "Wrong size on FConcertObjectReplicationMap");
static_assert(offsetof(FConcertObjectReplicationMap, ReplicatedObjects) == 0x000000, "Member 'FConcertObjectReplicationMap::ReplicatedObjects' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertStreamFrequencySettings
// 0x0058 (0x0058 - 0x0000)
struct FConcertStreamFrequencySettings final
{
public:
	struct FConcertObjectReplicationSettings      Defaults;                                          // 0x0000(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4755[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FSoftObjectPath, struct FConcertObjectReplicationSettings> ObjectOverrides;                                   // 0x0008(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertStreamFrequencySettings) == 0x000008, "Wrong alignment on FConcertStreamFrequencySettings");
static_assert(sizeof(FConcertStreamFrequencySettings) == 0x000058, "Wrong size on FConcertStreamFrequencySettings");
static_assert(offsetof(FConcertStreamFrequencySettings, Defaults) == 0x000000, "Member 'FConcertStreamFrequencySettings::Defaults' has a wrong offset!");
static_assert(offsetof(FConcertStreamFrequencySettings, ObjectOverrides) == 0x000008, "Member 'FConcertStreamFrequencySettings::ObjectOverrides' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertBaseStreamInfo
// 0x00B8 (0x00B8 - 0x0000)
struct FConcertBaseStreamInfo final
{
public:
	struct FGuid                                  Identifier;                                        // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertObjectReplicationMap           ReplicationMap;                                    // 0x0010(0x0050)(NativeAccessSpecifierPublic)
	struct FConcertStreamFrequencySettings        FrequencySettings;                                 // 0x0060(0x0058)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertBaseStreamInfo) == 0x000008, "Wrong alignment on FConcertBaseStreamInfo");
static_assert(sizeof(FConcertBaseStreamInfo) == 0x0000B8, "Wrong size on FConcertBaseStreamInfo");
static_assert(offsetof(FConcertBaseStreamInfo, Identifier) == 0x000000, "Member 'FConcertBaseStreamInfo::Identifier' has a wrong offset!");
static_assert(offsetof(FConcertBaseStreamInfo, ReplicationMap) == 0x000010, "Member 'FConcertBaseStreamInfo::ReplicationMap' has a wrong offset!");
static_assert(offsetof(FConcertBaseStreamInfo, FrequencySettings) == 0x000060, "Member 'FConcertBaseStreamInfo::FrequencySettings' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertReplicationStream
// 0x00B8 (0x00B8 - 0x0000)
struct FConcertReplicationStream final
{
public:
	struct FConcertBaseStreamInfo                 BaseDescription;                                   // 0x0000(0x00B8)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertReplicationStream) == 0x000008, "Wrong alignment on FConcertReplicationStream");
static_assert(sizeof(FConcertReplicationStream) == 0x0000B8, "Wrong size on FConcertReplicationStream");
static_assert(offsetof(FConcertReplicationStream, BaseDescription) == 0x000000, "Member 'FConcertReplicationStream::BaseDescription' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeStream_Request
// 0x0150 (0x0150 - 0x0000)
struct FConcertReplication_ChangeStream_Request final
{
public:
	TSet<struct FConcertObjectInStreamID>         ObjectsToRemove;                                   // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FConcertObjectInStreamID, struct FConcertReplication_ChangeStream_PutObject> ObjectsToPut;                                      // 0x0050(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FGuid, struct FConcertReplication_ChangeStream_Frequency> FrequencyChanges;                                  // 0x00A0(0x0050)(NativeAccessSpecifierPublic)
	TArray<struct FConcertReplicationStream>      StreamsToAdd;                                      // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TSet<struct FGuid>                            StreamsToRemove;                                   // 0x0100(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertReplication_ChangeStream_Request) == 0x000008, "Wrong alignment on FConcertReplication_ChangeStream_Request");
static_assert(sizeof(FConcertReplication_ChangeStream_Request) == 0x000150, "Wrong size on FConcertReplication_ChangeStream_Request");
static_assert(offsetof(FConcertReplication_ChangeStream_Request, ObjectsToRemove) == 0x000000, "Member 'FConcertReplication_ChangeStream_Request::ObjectsToRemove' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeStream_Request, ObjectsToPut) == 0x000050, "Member 'FConcertReplication_ChangeStream_Request::ObjectsToPut' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeStream_Request, FrequencyChanges) == 0x0000A0, "Member 'FConcertReplication_ChangeStream_Request::FrequencyChanges' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeStream_Request, StreamsToAdd) == 0x0000F0, "Member 'FConcertReplication_ChangeStream_Request::StreamsToAdd' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeStream_Request, StreamsToRemove) == 0x000100, "Member 'FConcertReplication_ChangeStream_Request::StreamsToRemove' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeStream_FrequencyResponse
// 0x00A0 (0x00A0 - 0x0000)
struct FConcertReplication_ChangeStream_FrequencyResponse final
{
public:
	TMap<struct FConcertObjectInStreamID, EConcertChangeObjectFrequencyErrorCode> OverrideFailures;                                  // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FGuid, EConcertChangeStreamFrequencyErrorCode> DefaultFailures;                                   // 0x0050(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertReplication_ChangeStream_FrequencyResponse) == 0x000008, "Wrong alignment on FConcertReplication_ChangeStream_FrequencyResponse");
static_assert(sizeof(FConcertReplication_ChangeStream_FrequencyResponse) == 0x0000A0, "Wrong size on FConcertReplication_ChangeStream_FrequencyResponse");
static_assert(offsetof(FConcertReplication_ChangeStream_FrequencyResponse, OverrideFailures) == 0x000000, "Member 'FConcertReplication_ChangeStream_FrequencyResponse::OverrideFailures' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeStream_FrequencyResponse, DefaultFailures) == 0x000050, "Member 'FConcertReplication_ChangeStream_FrequencyResponse::DefaultFailures' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertReplicatedObjectId
// 0x0010 (0x0040 - 0x0030)
struct FConcertReplicatedObjectId final : public FConcertObjectInStreamID
{
public:
	uint8                                         Pad_4756[0x10];                                    // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConcertReplicatedObjectId) == 0x000008, "Wrong alignment on FConcertReplicatedObjectId");
static_assert(sizeof(FConcertReplicatedObjectId) == 0x000040, "Wrong size on FConcertReplicatedObjectId");

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeStream_Response
// 0x0198 (0x0198 - 0x0000)
struct FConcertReplication_ChangeStream_Response final
{
public:
	EReplicationResponseErrorCode                 ErrorCode;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4757[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FConcertObjectInStreamID, struct FConcertReplicatedObjectId> AuthorityConflicts;                                // 0x0008(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FConcertObjectInStreamID, EConcertPutObjectErrorCode> ObjectsToPutSemanticErrors;                        // 0x0058(0x0050)(NativeAccessSpecifierPublic)
	TSet<struct FGuid>                            FailedStreamCreation;                              // 0x00A8(0x0050)(NativeAccessSpecifierPublic)
	struct FConcertReplication_ChangeStream_FrequencyResponse FrequencyErrors;                                   // 0x00F8(0x00A0)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertReplication_ChangeStream_Response) == 0x000008, "Wrong alignment on FConcertReplication_ChangeStream_Response");
static_assert(sizeof(FConcertReplication_ChangeStream_Response) == 0x000198, "Wrong size on FConcertReplication_ChangeStream_Response");
static_assert(offsetof(FConcertReplication_ChangeStream_Response, ErrorCode) == 0x000000, "Member 'FConcertReplication_ChangeStream_Response::ErrorCode' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeStream_Response, AuthorityConflicts) == 0x000008, "Member 'FConcertReplication_ChangeStream_Response::AuthorityConflicts' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeStream_Response, ObjectsToPutSemanticErrors) == 0x000058, "Member 'FConcertReplication_ChangeStream_Response::ObjectsToPutSemanticErrors' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeStream_Response, FailedStreamCreation) == 0x0000A8, "Member 'FConcertReplication_ChangeStream_Response::FailedStreamCreation' has a wrong offset!");
static_assert(offsetof(FConcertReplication_ChangeStream_Response, FrequencyErrors) == 0x0000F8, "Member 'FConcertReplication_ChangeStream_Response::FrequencyErrors' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertAuthorityClientInfo
// 0x0020 (0x0020 - 0x0000)
struct FConcertAuthorityClientInfo final
{
public:
	struct FGuid                                  StreamId;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                AuthoredObjects;                                   // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertAuthorityClientInfo) == 0x000008, "Wrong alignment on FConcertAuthorityClientInfo");
static_assert(sizeof(FConcertAuthorityClientInfo) == 0x000020, "Wrong size on FConcertAuthorityClientInfo");
static_assert(offsetof(FConcertAuthorityClientInfo, StreamId) == 0x000000, "Member 'FConcertAuthorityClientInfo::StreamId' has a wrong offset!");
static_assert(offsetof(FConcertAuthorityClientInfo, AuthoredObjects) == 0x000010, "Member 'FConcertAuthorityClientInfo::AuthoredObjects' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertQueriedClientInfo
// 0x0020 (0x0020 - 0x0000)
struct FConcertQueriedClientInfo final
{
public:
	TArray<struct FConcertBaseStreamInfo>         Streams;                                           // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FConcertAuthorityClientInfo>    Authority;                                         // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertQueriedClientInfo) == 0x000008, "Wrong alignment on FConcertQueriedClientInfo");
static_assert(sizeof(FConcertQueriedClientInfo) == 0x000020, "Wrong size on FConcertQueriedClientInfo");
static_assert(offsetof(FConcertQueriedClientInfo, Streams) == 0x000000, "Member 'FConcertQueriedClientInfo::Streams' has a wrong offset!");
static_assert(offsetof(FConcertQueriedClientInfo, Authority) == 0x000010, "Member 'FConcertQueriedClientInfo::Authority' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertReplication_QueryReplicationInfo_Request
// 0x0058 (0x0058 - 0x0000)
struct FConcertReplication_QueryReplicationInfo_Request final
{
public:
	TSet<struct FGuid>                            ClientEndpointIds;                                 // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	EConcertQueryClientStreamFlags                QueryFlags;                                        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4758[0x7];                                     // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConcertReplication_QueryReplicationInfo_Request) == 0x000008, "Wrong alignment on FConcertReplication_QueryReplicationInfo_Request");
static_assert(sizeof(FConcertReplication_QueryReplicationInfo_Request) == 0x000058, "Wrong size on FConcertReplication_QueryReplicationInfo_Request");
static_assert(offsetof(FConcertReplication_QueryReplicationInfo_Request, ClientEndpointIds) == 0x000000, "Member 'FConcertReplication_QueryReplicationInfo_Request::ClientEndpointIds' has a wrong offset!");
static_assert(offsetof(FConcertReplication_QueryReplicationInfo_Request, QueryFlags) == 0x000050, "Member 'FConcertReplication_QueryReplicationInfo_Request::QueryFlags' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertReplication_QueryReplicationInfo_Response
// 0x0058 (0x0058 - 0x0000)
struct FConcertReplication_QueryReplicationInfo_Response final
{
public:
	EReplicationResponseErrorCode                 ErrorCode;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4759[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, struct FConcertQueriedClientInfo> ClientInfo;                                        // 0x0008(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertReplication_QueryReplicationInfo_Response) == 0x000008, "Wrong alignment on FConcertReplication_QueryReplicationInfo_Response");
static_assert(sizeof(FConcertReplication_QueryReplicationInfo_Response) == 0x000058, "Wrong size on FConcertReplication_QueryReplicationInfo_Response");
static_assert(offsetof(FConcertReplication_QueryReplicationInfo_Response, ErrorCode) == 0x000000, "Member 'FConcertReplication_QueryReplicationInfo_Response::ErrorCode' has a wrong offset!");
static_assert(offsetof(FConcertReplication_QueryReplicationInfo_Response, ClientInfo) == 0x000008, "Member 'FConcertReplication_QueryReplicationInfo_Response::ClientInfo' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertDataStore_Integer
// 0x0008 (0x0008 - 0x0000)
struct FConcertDataStore_Integer final
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertDataStore_Integer) == 0x000008, "Wrong alignment on FConcertDataStore_Integer");
static_assert(sizeof(FConcertDataStore_Integer) == 0x000008, "Wrong size on FConcertDataStore_Integer");
static_assert(offsetof(FConcertDataStore_Integer, Value) == 0x000000, "Member 'FConcertDataStore_Integer::Value' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertDataStore_Double
// 0x0008 (0x0008 - 0x0000)
struct FConcertDataStore_Double final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertDataStore_Double) == 0x000008, "Wrong alignment on FConcertDataStore_Double");
static_assert(sizeof(FConcertDataStore_Double) == 0x000008, "Wrong size on FConcertDataStore_Double");
static_assert(offsetof(FConcertDataStore_Double, Value) == 0x000000, "Member 'FConcertDataStore_Double::Value' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertDataStore_String
// 0x0010 (0x0010 - 0x0000)
struct FConcertDataStore_String final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertDataStore_String) == 0x000008, "Wrong alignment on FConcertDataStore_String");
static_assert(sizeof(FConcertDataStore_String) == 0x000010, "Wrong size on FConcertDataStore_String");
static_assert(offsetof(FConcertDataStore_String, Value) == 0x000000, "Member 'FConcertDataStore_String::Value' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertDataStore_Text
// 0x0010 (0x0010 - 0x0000)
struct FConcertDataStore_Text final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0010)(Edit, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertDataStore_Text) == 0x000008, "Wrong alignment on FConcertDataStore_Text");
static_assert(sizeof(FConcertDataStore_Text) == 0x000010, "Wrong size on FConcertDataStore_Text");
static_assert(offsetof(FConcertDataStore_Text, Value) == 0x000000, "Member 'FConcertDataStore_Text::Value' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertDataStore_StoreValue
// 0x0030 (0x0030 - 0x0000)
struct FConcertDataStore_StoreValue final
{
public:
	class FName                                   TypeName;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Version;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_475A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConcertSessionSerializedPayload       SerializedValue;                                   // 0x0010(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertDataStore_StoreValue) == 0x000008, "Wrong alignment on FConcertDataStore_StoreValue");
static_assert(sizeof(FConcertDataStore_StoreValue) == 0x000030, "Wrong size on FConcertDataStore_StoreValue");
static_assert(offsetof(FConcertDataStore_StoreValue, TypeName) == 0x000000, "Member 'FConcertDataStore_StoreValue::TypeName' has a wrong offset!");
static_assert(offsetof(FConcertDataStore_StoreValue, Version) == 0x000008, "Member 'FConcertDataStore_StoreValue::Version' has a wrong offset!");
static_assert(offsetof(FConcertDataStore_StoreValue, SerializedValue) == 0x000010, "Member 'FConcertDataStore_StoreValue::SerializedValue' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertDataStore_KeyValuePair
// 0x0038 (0x0038 - 0x0000)
struct FConcertDataStore_KeyValuePair final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertDataStore_StoreValue           Value;                                             // 0x0008(0x0030)(Edit, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertDataStore_KeyValuePair) == 0x000008, "Wrong alignment on FConcertDataStore_KeyValuePair");
static_assert(sizeof(FConcertDataStore_KeyValuePair) == 0x000038, "Wrong size on FConcertDataStore_KeyValuePair");
static_assert(offsetof(FConcertDataStore_KeyValuePair, Key) == 0x000000, "Member 'FConcertDataStore_KeyValuePair::Key' has a wrong offset!");
static_assert(offsetof(FConcertDataStore_KeyValuePair, Value) == 0x000008, "Member 'FConcertDataStore_KeyValuePair::Value' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertDataStore_ReplicateEvent
// 0x0010 (0x0010 - 0x0000)
struct FConcertDataStore_ReplicateEvent final
{
public:
	TArray<struct FConcertDataStore_KeyValuePair> Values;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertDataStore_ReplicateEvent) == 0x000008, "Wrong alignment on FConcertDataStore_ReplicateEvent");
static_assert(sizeof(FConcertDataStore_ReplicateEvent) == 0x000010, "Wrong size on FConcertDataStore_ReplicateEvent");
static_assert(offsetof(FConcertDataStore_ReplicateEvent, Values) == 0x000000, "Member 'FConcertDataStore_ReplicateEvent::Values' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertDataStore_Request
// 0x0010 (0x0010 - 0x0000)
struct FConcertDataStore_Request
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TypeName;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertDataStore_Request) == 0x000004, "Wrong alignment on FConcertDataStore_Request");
static_assert(sizeof(FConcertDataStore_Request) == 0x000010, "Wrong size on FConcertDataStore_Request");
static_assert(offsetof(FConcertDataStore_Request, Key) == 0x000000, "Member 'FConcertDataStore_Request::Key' has a wrong offset!");
static_assert(offsetof(FConcertDataStore_Request, TypeName) == 0x000008, "Member 'FConcertDataStore_Request::TypeName' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertDataStore_FetchOrAddRequest
// 0x0020 (0x0030 - 0x0010)
struct FConcertDataStore_FetchOrAddRequest final : public FConcertDataStore_Request
{
public:
	struct FConcertSessionSerializedPayload       SerializedValue;                                   // 0x0010(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertDataStore_FetchOrAddRequest) == 0x000008, "Wrong alignment on FConcertDataStore_FetchOrAddRequest");
static_assert(sizeof(FConcertDataStore_FetchOrAddRequest) == 0x000030, "Wrong size on FConcertDataStore_FetchOrAddRequest");
static_assert(offsetof(FConcertDataStore_FetchOrAddRequest, SerializedValue) == 0x000010, "Member 'FConcertDataStore_FetchOrAddRequest::SerializedValue' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertDataStore_CompareExchangeRequest
// 0x0048 (0x0058 - 0x0010)
struct FConcertDataStore_CompareExchangeRequest final : public FConcertDataStore_Request
{
public:
	uint32                                        ExpectedVersion;                                   // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_475B[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConcertSessionSerializedPayload       Expected;                                          // 0x0018(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FConcertSessionSerializedPayload       Desired;                                           // 0x0038(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertDataStore_CompareExchangeRequest) == 0x000008, "Wrong alignment on FConcertDataStore_CompareExchangeRequest");
static_assert(sizeof(FConcertDataStore_CompareExchangeRequest) == 0x000058, "Wrong size on FConcertDataStore_CompareExchangeRequest");
static_assert(offsetof(FConcertDataStore_CompareExchangeRequest, ExpectedVersion) == 0x000010, "Member 'FConcertDataStore_CompareExchangeRequest::ExpectedVersion' has a wrong offset!");
static_assert(offsetof(FConcertDataStore_CompareExchangeRequest, Expected) == 0x000018, "Member 'FConcertDataStore_CompareExchangeRequest::Expected' has a wrong offset!");
static_assert(offsetof(FConcertDataStore_CompareExchangeRequest, Desired) == 0x000038, "Member 'FConcertDataStore_CompareExchangeRequest::Desired' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertDataStore_Response
// 0x0038 (0x0038 - 0x0000)
struct FConcertDataStore_Response final
{
public:
	EConcertDataStoreResultCode                   ResultCode;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_475C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConcertDataStore_StoreValue           Value;                                             // 0x0008(0x0030)(Edit, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertDataStore_Response) == 0x000008, "Wrong alignment on FConcertDataStore_Response");
static_assert(sizeof(FConcertDataStore_Response) == 0x000038, "Wrong size on FConcertDataStore_Response");
static_assert(offsetof(FConcertDataStore_Response, ResultCode) == 0x000000, "Member 'FConcertDataStore_Response::ResultCode' has a wrong offset!");
static_assert(offsetof(FConcertDataStore_Response, Value) == 0x000008, "Member 'FConcertDataStore_Response::Value' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertClientPresenceVisibilityUpdateEvent
// 0x0014 (0x0014 - 0x0000)
struct FConcertClientPresenceVisibilityUpdateEvent final
{
public:
	struct FGuid                                  ModifiedEndpointId;                                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisibility;                                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_475D[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConcertClientPresenceVisibilityUpdateEvent) == 0x000004, "Wrong alignment on FConcertClientPresenceVisibilityUpdateEvent");
static_assert(sizeof(FConcertClientPresenceVisibilityUpdateEvent) == 0x000014, "Wrong size on FConcertClientPresenceVisibilityUpdateEvent");
static_assert(offsetof(FConcertClientPresenceVisibilityUpdateEvent, ModifiedEndpointId) == 0x000000, "Member 'FConcertClientPresenceVisibilityUpdateEvent::ModifiedEndpointId' has a wrong offset!");
static_assert(offsetof(FConcertClientPresenceVisibilityUpdateEvent, bVisibility) == 0x000010, "Member 'FConcertClientPresenceVisibilityUpdateEvent::bVisibility' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertClientPresenceInVREvent
// 0x0008 (0x0008 - 0x0000)
struct FConcertClientPresenceInVREvent final
{
public:
	class FName                                   VRDevice;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertClientPresenceInVREvent) == 0x000004, "Wrong alignment on FConcertClientPresenceInVREvent");
static_assert(sizeof(FConcertClientPresenceInVREvent) == 0x000008, "Wrong size on FConcertClientPresenceInVREvent");
static_assert(offsetof(FConcertClientPresenceInVREvent, VRDevice) == 0x000000, "Member 'FConcertClientPresenceInVREvent::VRDevice' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertClientDesktopPresenceUpdateEvent
// 0x003C (0x0040 - 0x0004)
struct FConcertClientDesktopPresenceUpdateEvent final : public FConcertClientPresenceEventBase
{
public:
	uint8                                         Pad_475E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TraceStart;                                        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TraceEnd;                                          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMovingCamera;                                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_475F[0x7];                                     // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConcertClientDesktopPresenceUpdateEvent) == 0x000008, "Wrong alignment on FConcertClientDesktopPresenceUpdateEvent");
static_assert(sizeof(FConcertClientDesktopPresenceUpdateEvent) == 0x000040, "Wrong size on FConcertClientDesktopPresenceUpdateEvent");
static_assert(offsetof(FConcertClientDesktopPresenceUpdateEvent, TraceStart) == 0x000008, "Member 'FConcertClientDesktopPresenceUpdateEvent::TraceStart' has a wrong offset!");
static_assert(offsetof(FConcertClientDesktopPresenceUpdateEvent, TraceEnd) == 0x000020, "Member 'FConcertClientDesktopPresenceUpdateEvent::TraceEnd' has a wrong offset!");
static_assert(offsetof(FConcertClientDesktopPresenceUpdateEvent, bMovingCamera) == 0x000038, "Member 'FConcertClientDesktopPresenceUpdateEvent::bMovingCamera' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertLaserData
// 0x0030 (0x0030 - 0x0000)
struct FConcertLaserData final
{
public:
	struct FVector                                LaserStart;                                        // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LaserEnd;                                          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertLaserData) == 0x000008, "Wrong alignment on FConcertLaserData");
static_assert(sizeof(FConcertLaserData) == 0x000030, "Wrong size on FConcertLaserData");
static_assert(offsetof(FConcertLaserData, LaserStart) == 0x000000, "Member 'FConcertLaserData::LaserStart' has a wrong offset!");
static_assert(offsetof(FConcertLaserData, LaserEnd) == 0x000018, "Member 'FConcertLaserData::LaserEnd' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertClientVRPresenceUpdateEvent
// 0x00DC (0x00E0 - 0x0004)
struct FConcertClientVRPresenceUpdateEvent final : public FConcertClientPresenceEventBase
{
public:
	uint8                                         Pad_4760[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LeftMotionControllerPosition;                      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  LeftMotionControllerOrientation;                   // 0x0020(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RightMotionControllerPosition;                     // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4761[0x8];                                     // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RightMotionControllerOrientation;                  // 0x0060(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertLaserData                      Lasers[0x2];                                       // 0x0080(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertClientVRPresenceUpdateEvent) == 0x000010, "Wrong alignment on FConcertClientVRPresenceUpdateEvent");
static_assert(sizeof(FConcertClientVRPresenceUpdateEvent) == 0x0000E0, "Wrong size on FConcertClientVRPresenceUpdateEvent");
static_assert(offsetof(FConcertClientVRPresenceUpdateEvent, LeftMotionControllerPosition) == 0x000008, "Member 'FConcertClientVRPresenceUpdateEvent::LeftMotionControllerPosition' has a wrong offset!");
static_assert(offsetof(FConcertClientVRPresenceUpdateEvent, LeftMotionControllerOrientation) == 0x000020, "Member 'FConcertClientVRPresenceUpdateEvent::LeftMotionControllerOrientation' has a wrong offset!");
static_assert(offsetof(FConcertClientVRPresenceUpdateEvent, RightMotionControllerPosition) == 0x000040, "Member 'FConcertClientVRPresenceUpdateEvent::RightMotionControllerPosition' has a wrong offset!");
static_assert(offsetof(FConcertClientVRPresenceUpdateEvent, RightMotionControllerOrientation) == 0x000060, "Member 'FConcertClientVRPresenceUpdateEvent::RightMotionControllerOrientation' has a wrong offset!");
static_assert(offsetof(FConcertClientVRPresenceUpdateEvent, Lasers) == 0x000080, "Member 'FConcertClientVRPresenceUpdateEvent::Lasers' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertSequencerState
// 0x0050 (0x0050 - 0x0000)
struct FConcertSequencerState final
{
public:
	class FString                                 SequenceObjectPath;                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQualifiedFrameTime                    Time;                                              // 0x0010(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertMovieScenePlayerStatus                PlayerStatus;                                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4762[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameNumberRange                      PlaybackRange;                                     // 0x0024(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackSpeed;                                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoopMode;                                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4763[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConcertByteArray                      TakeData;                                          // 0x0040(0x0010)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertSequencerState) == 0x000008, "Wrong alignment on FConcertSequencerState");
static_assert(sizeof(FConcertSequencerState) == 0x000050, "Wrong size on FConcertSequencerState");
static_assert(offsetof(FConcertSequencerState, SequenceObjectPath) == 0x000000, "Member 'FConcertSequencerState::SequenceObjectPath' has a wrong offset!");
static_assert(offsetof(FConcertSequencerState, Time) == 0x000010, "Member 'FConcertSequencerState::Time' has a wrong offset!");
static_assert(offsetof(FConcertSequencerState, PlayerStatus) == 0x000020, "Member 'FConcertSequencerState::PlayerStatus' has a wrong offset!");
static_assert(offsetof(FConcertSequencerState, PlaybackRange) == 0x000024, "Member 'FConcertSequencerState::PlaybackRange' has a wrong offset!");
static_assert(offsetof(FConcertSequencerState, PlaybackSpeed) == 0x000034, "Member 'FConcertSequencerState::PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(FConcertSequencerState, bLoopMode) == 0x000038, "Member 'FConcertSequencerState::bLoopMode' has a wrong offset!");
static_assert(offsetof(FConcertSequencerState, TakeData) == 0x000040, "Member 'FConcertSequencerState::TakeData' has a wrong offset!");

// ScriptStruct ConcertSyncCore.ConcertSequencerOpenEvent
// 0x0020 (0x0020 - 0x0000)
struct FConcertSequencerOpenEvent final
{
public:
	class FString                                 SequenceObjectPath;                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertByteArray                      TakeData;                                          // 0x0010(0x0010)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertSequencerOpenEvent) == 0x000008, "Wrong alignment on FConcertSequencerOpenEvent");
static_assert(sizeof(FConcertSequencerOpenEvent) == 0x000020, "Wrong size on FConcertSequencerOpenEvent");
