#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConcertReplicationScripting

#include "Basic.hpp"

#include "ConcertSyncCore_structs.hpp"


namespace SDK
{

// ScriptStruct ConcertReplicationScripting.ConcertPropertyChainWrapper
// 0x0010 (0x0010 - 0x0000)
struct FConcertPropertyChainWrapper final
{
public:
	struct FConcertPropertyChain                  PropertyChain;                                     // 0x0000(0x0010)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertPropertyChainWrapper) == 0x000008, "Wrong alignment on FConcertPropertyChainWrapper");
static_assert(sizeof(FConcertPropertyChainWrapper) == 0x000010, "Wrong size on FConcertPropertyChainWrapper");
static_assert(offsetof(FConcertPropertyChainWrapper, PropertyChain) == 0x000000, "Member 'FConcertPropertyChainWrapper::PropertyChain' has a wrong offset!");

// ScriptStruct ConcertReplicationScripting.ConcertPropertyChainWrapperContainer
// 0x0010 (0x0010 - 0x0000)
struct FConcertPropertyChainWrapperContainer final
{
public:
	TArray<struct FConcertPropertyChainWrapper>   PropertyChains;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertPropertyChainWrapperContainer) == 0x000008, "Wrong alignment on FConcertPropertyChainWrapperContainer");
static_assert(sizeof(FConcertPropertyChainWrapperContainer) == 0x000010, "Wrong size on FConcertPropertyChainWrapperContainer");
static_assert(offsetof(FConcertPropertyChainWrapperContainer, PropertyChains) == 0x000000, "Member 'FConcertPropertyChainWrapperContainer::PropertyChains' has a wrong offset!");

}

