#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConcertSyncCore

#include "Basic.hpp"

#include "ConcertSyncCore_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ConcertSyncCore.ConcertSyncConfig
// 0x0068 (0x0090 - 0x0028)
class UConcertSyncConfig final : public UObject
{
public:
	bool                                          bInteractiveHotReload;                             // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowPresenceInPIE;                                // 0x0029(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeAnnotationObjectChanges;                   // 0x002A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4788[0x1];                                     // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SnapshotTransactionsPerSecond;                     // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransactionClassFilter>        IncludeObjectClassFilters;                         // 0x0030(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FTransactionClassFilter>        ExcludeTransactionClassFilters;                    // 0x0040(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<TFieldPath<struct FProperty>>          AllowedTransientProperties;                        // 0x0050(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<TFieldPath<struct FProperty>>          ExcludedProperties;                                // 0x0060(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           ExcludedPropertyTypes;                             // 0x0070(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FPackageClassFilter>            ExcludePackageClassFilters;                        // 0x0080(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConcertSyncConfig">();
	}
	static class UConcertSyncConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConcertSyncConfig>();
	}
};
static_assert(alignof(UConcertSyncConfig) == 0x000008, "Wrong alignment on UConcertSyncConfig");
static_assert(sizeof(UConcertSyncConfig) == 0x000090, "Wrong size on UConcertSyncConfig");
static_assert(offsetof(UConcertSyncConfig, bInteractiveHotReload) == 0x000028, "Member 'UConcertSyncConfig::bInteractiveHotReload' has a wrong offset!");
static_assert(offsetof(UConcertSyncConfig, bShowPresenceInPIE) == 0x000029, "Member 'UConcertSyncConfig::bShowPresenceInPIE' has a wrong offset!");
static_assert(offsetof(UConcertSyncConfig, bIncludeAnnotationObjectChanges) == 0x00002A, "Member 'UConcertSyncConfig::bIncludeAnnotationObjectChanges' has a wrong offset!");
static_assert(offsetof(UConcertSyncConfig, SnapshotTransactionsPerSecond) == 0x00002C, "Member 'UConcertSyncConfig::SnapshotTransactionsPerSecond' has a wrong offset!");
static_assert(offsetof(UConcertSyncConfig, IncludeObjectClassFilters) == 0x000030, "Member 'UConcertSyncConfig::IncludeObjectClassFilters' has a wrong offset!");
static_assert(offsetof(UConcertSyncConfig, ExcludeTransactionClassFilters) == 0x000040, "Member 'UConcertSyncConfig::ExcludeTransactionClassFilters' has a wrong offset!");
static_assert(offsetof(UConcertSyncConfig, AllowedTransientProperties) == 0x000050, "Member 'UConcertSyncConfig::AllowedTransientProperties' has a wrong offset!");
static_assert(offsetof(UConcertSyncConfig, ExcludedProperties) == 0x000060, "Member 'UConcertSyncConfig::ExcludedProperties' has a wrong offset!");
static_assert(offsetof(UConcertSyncConfig, ExcludedPropertyTypes) == 0x000070, "Member 'UConcertSyncConfig::ExcludedPropertyTypes' has a wrong offset!");
static_assert(offsetof(UConcertSyncConfig, ExcludePackageClassFilters) == 0x000080, "Member 'UConcertSyncConfig::ExcludePackageClassFilters' has a wrong offset!");

}

