#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConcertReplicationScripting

#include "Basic.hpp"

#include "ConcertReplicationScripting_structs.hpp"


namespace SDK::Params
{

// Function ConcertReplicationScripting.ConcertReplicationBlueprintFunctionLibrary.GetAllProperties
// 0x0018 (0x0018 - 0x0000)
struct ConcertReplicationBlueprintFunctionLibrary_GetAllProperties final
{
public:
	TSubclassOf<class UObject>                    Param_Class;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FConcertPropertyChainWrapper>   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConcertReplicationBlueprintFunctionLibrary_GetAllProperties) == 0x000008, "Wrong alignment on ConcertReplicationBlueprintFunctionLibrary_GetAllProperties");
static_assert(sizeof(ConcertReplicationBlueprintFunctionLibrary_GetAllProperties) == 0x000018, "Wrong size on ConcertReplicationBlueprintFunctionLibrary_GetAllProperties");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetAllProperties, Param_Class) == 0x000000, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetAllProperties::Param_Class' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetAllProperties, ReturnValue) == 0x000008, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetAllProperties::ReturnValue' has a wrong offset!");

// Function ConcertReplicationScripting.ConcertReplicationBlueprintFunctionLibrary.GetChildProperties
// 0x0030 (0x0030 - 0x0000)
struct ConcertReplicationBlueprintFunctionLibrary_GetChildProperties final
{
public:
	struct FConcertPropertyChainWrapper           Parent;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    Param_Class;                                       // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyDirect;                                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_47D1[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConcertPropertyChainWrapper>   ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConcertReplicationBlueprintFunctionLibrary_GetChildProperties) == 0x000008, "Wrong alignment on ConcertReplicationBlueprintFunctionLibrary_GetChildProperties");
static_assert(sizeof(ConcertReplicationBlueprintFunctionLibrary_GetChildProperties) == 0x000030, "Wrong size on ConcertReplicationBlueprintFunctionLibrary_GetChildProperties");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetChildProperties, Parent) == 0x000000, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetChildProperties::Parent' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetChildProperties, Param_Class) == 0x000010, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetChildProperties::Param_Class' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetChildProperties, bOnlyDirect) == 0x000018, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetChildProperties::bOnlyDirect' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetChildProperties, ReturnValue) == 0x000020, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetChildProperties::ReturnValue' has a wrong offset!");

// Function ConcertReplicationScripting.ConcertReplicationBlueprintFunctionLibrary.GetPropertiesIn
// 0x0028 (0x0028 - 0x0000)
struct ConcertReplicationBlueprintFunctionLibrary_GetPropertiesIn final
{
public:
	TSubclassOf<class UObject>                    Param_Class;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(struct FConcertPropertyChainWrapper& PathToProperty)> Filter;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FConcertPropertyChainWrapper>   ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConcertReplicationBlueprintFunctionLibrary_GetPropertiesIn) == 0x000008, "Wrong alignment on ConcertReplicationBlueprintFunctionLibrary_GetPropertiesIn");
static_assert(sizeof(ConcertReplicationBlueprintFunctionLibrary_GetPropertiesIn) == 0x000028, "Wrong size on ConcertReplicationBlueprintFunctionLibrary_GetPropertiesIn");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetPropertiesIn, Param_Class) == 0x000000, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetPropertiesIn::Param_Class' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetPropertiesIn, Filter) == 0x000008, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetPropertiesIn::Filter' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetPropertiesIn, ReturnValue) == 0x000018, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetPropertiesIn::ReturnValue' has a wrong offset!");

// Function ConcertReplicationScripting.ConcertReplicationBlueprintFunctionLibrary.GetPropertyFromLeaf
// 0x0020 (0x0020 - 0x0000)
struct ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromLeaf final
{
public:
	struct FConcertPropertyChainWrapper           Path;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0014(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_47D2[0x4];                                     // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromLeaf) == 0x000008, "Wrong alignment on ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromLeaf");
static_assert(sizeof(ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromLeaf) == 0x000020, "Wrong size on ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromLeaf");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromLeaf, Path) == 0x000000, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromLeaf::Path' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromLeaf, Param_Index) == 0x000010, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromLeaf::Param_Index' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromLeaf, ReturnValue) == 0x000014, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromLeaf::ReturnValue' has a wrong offset!");

// Function ConcertReplicationScripting.ConcertReplicationBlueprintFunctionLibrary.GetPropertyFromRoot
// 0x0020 (0x0020 - 0x0000)
struct ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromRoot final
{
public:
	struct FConcertPropertyChainWrapper           Path;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0014(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_47D3[0x4];                                     // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromRoot) == 0x000008, "Wrong alignment on ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromRoot");
static_assert(sizeof(ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromRoot) == 0x000020, "Wrong size on ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromRoot");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromRoot, Path) == 0x000000, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromRoot::Path' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromRoot, Param_Index) == 0x000010, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromRoot::Param_Index' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromRoot, ReturnValue) == 0x000014, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetPropertyFromRoot::ReturnValue' has a wrong offset!");

// Function ConcertReplicationScripting.ConcertReplicationBlueprintFunctionLibrary.GetPropertyStringPath
// 0x0020 (0x0020 - 0x0000)
struct ConcertReplicationBlueprintFunctionLibrary_GetPropertyStringPath final
{
public:
	struct FConcertPropertyChainWrapper           Path;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConcertReplicationBlueprintFunctionLibrary_GetPropertyStringPath) == 0x000008, "Wrong alignment on ConcertReplicationBlueprintFunctionLibrary_GetPropertyStringPath");
static_assert(sizeof(ConcertReplicationBlueprintFunctionLibrary_GetPropertyStringPath) == 0x000020, "Wrong size on ConcertReplicationBlueprintFunctionLibrary_GetPropertyStringPath");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetPropertyStringPath, Path) == 0x000000, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetPropertyStringPath::Path' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_GetPropertyStringPath, ReturnValue) == 0x000010, "Member 'ConcertReplicationBlueprintFunctionLibrary_GetPropertyStringPath::ReturnValue' has a wrong offset!");

// Function ConcertReplicationScripting.ConcertReplicationBlueprintFunctionLibrary.IsChildOf
// 0x0028 (0x0028 - 0x0000)
struct ConcertReplicationBlueprintFunctionLibrary_IsChildOf final
{
public:
	struct FConcertPropertyChainWrapper           ToTest;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertPropertyChainWrapper           Parent;                                            // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_47D4[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConcertReplicationBlueprintFunctionLibrary_IsChildOf) == 0x000008, "Wrong alignment on ConcertReplicationBlueprintFunctionLibrary_IsChildOf");
static_assert(sizeof(ConcertReplicationBlueprintFunctionLibrary_IsChildOf) == 0x000028, "Wrong size on ConcertReplicationBlueprintFunctionLibrary_IsChildOf");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_IsChildOf, ToTest) == 0x000000, "Member 'ConcertReplicationBlueprintFunctionLibrary_IsChildOf::ToTest' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_IsChildOf, Parent) == 0x000010, "Member 'ConcertReplicationBlueprintFunctionLibrary_IsChildOf::Parent' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_IsChildOf, ReturnValue) == 0x000020, "Member 'ConcertReplicationBlueprintFunctionLibrary_IsChildOf::ReturnValue' has a wrong offset!");

// Function ConcertReplicationScripting.ConcertReplicationBlueprintFunctionLibrary.IsDirectChildOf
// 0x0028 (0x0028 - 0x0000)
struct ConcertReplicationBlueprintFunctionLibrary_IsDirectChildOf final
{
public:
	struct FConcertPropertyChainWrapper           ToTest;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertPropertyChainWrapper           Parent;                                            // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_47D5[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConcertReplicationBlueprintFunctionLibrary_IsDirectChildOf) == 0x000008, "Wrong alignment on ConcertReplicationBlueprintFunctionLibrary_IsDirectChildOf");
static_assert(sizeof(ConcertReplicationBlueprintFunctionLibrary_IsDirectChildOf) == 0x000028, "Wrong size on ConcertReplicationBlueprintFunctionLibrary_IsDirectChildOf");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_IsDirectChildOf, ToTest) == 0x000000, "Member 'ConcertReplicationBlueprintFunctionLibrary_IsDirectChildOf::ToTest' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_IsDirectChildOf, Parent) == 0x000010, "Member 'ConcertReplicationBlueprintFunctionLibrary_IsDirectChildOf::Parent' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_IsDirectChildOf, ReturnValue) == 0x000020, "Member 'ConcertReplicationBlueprintFunctionLibrary_IsDirectChildOf::ReturnValue' has a wrong offset!");

// Function ConcertReplicationScripting.ConcertReplicationBlueprintFunctionLibrary.MakePropertyChainByLiteralPath
// 0x0030 (0x0030 - 0x0000)
struct ConcertReplicationBlueprintFunctionLibrary_MakePropertyChainByLiteralPath final
{
public:
	TSubclassOf<class UObject>                    Param_Class;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           PathToProperty;                                    // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FConcertPropertyChainWrapper           Result;                                            // 0x0018(0x0010)(Parm, OutParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_47D6[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConcertReplicationBlueprintFunctionLibrary_MakePropertyChainByLiteralPath) == 0x000008, "Wrong alignment on ConcertReplicationBlueprintFunctionLibrary_MakePropertyChainByLiteralPath");
static_assert(sizeof(ConcertReplicationBlueprintFunctionLibrary_MakePropertyChainByLiteralPath) == 0x000030, "Wrong size on ConcertReplicationBlueprintFunctionLibrary_MakePropertyChainByLiteralPath");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_MakePropertyChainByLiteralPath, Param_Class) == 0x000000, "Member 'ConcertReplicationBlueprintFunctionLibrary_MakePropertyChainByLiteralPath::Param_Class' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_MakePropertyChainByLiteralPath, PathToProperty) == 0x000008, "Member 'ConcertReplicationBlueprintFunctionLibrary_MakePropertyChainByLiteralPath::PathToProperty' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_MakePropertyChainByLiteralPath, Result) == 0x000018, "Member 'ConcertReplicationBlueprintFunctionLibrary_MakePropertyChainByLiteralPath::Result' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_MakePropertyChainByLiteralPath, ReturnValue) == 0x000028, "Member 'ConcertReplicationBlueprintFunctionLibrary_MakePropertyChainByLiteralPath::ReturnValue' has a wrong offset!");

// Function ConcertReplicationScripting.ConcertReplicationBlueprintFunctionLibrary.ToString
// 0x0020 (0x0020 - 0x0000)
struct ConcertReplicationBlueprintFunctionLibrary_ToString final
{
public:
	struct FConcertPropertyChainWrapper           PropertyChain;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConcertReplicationBlueprintFunctionLibrary_ToString) == 0x000008, "Wrong alignment on ConcertReplicationBlueprintFunctionLibrary_ToString");
static_assert(sizeof(ConcertReplicationBlueprintFunctionLibrary_ToString) == 0x000020, "Wrong size on ConcertReplicationBlueprintFunctionLibrary_ToString");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_ToString, PropertyChain) == 0x000000, "Member 'ConcertReplicationBlueprintFunctionLibrary_ToString::PropertyChain' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_ToString, ReturnValue) == 0x000010, "Member 'ConcertReplicationBlueprintFunctionLibrary_ToString::ReturnValue' has a wrong offset!");

// DelegateFunction ConcertReplicationScripting.ConcertReplicationBlueprintFunctionLibrary.PropertyChainPredicate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct ConcertReplicationBlueprintFunctionLibrary_PropertyChainPredicate__DelegateSignature final
{
public:
	struct FConcertPropertyChainWrapper           PathToProperty;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_47D7[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConcertReplicationBlueprintFunctionLibrary_PropertyChainPredicate__DelegateSignature) == 0x000008, "Wrong alignment on ConcertReplicationBlueprintFunctionLibrary_PropertyChainPredicate__DelegateSignature");
static_assert(sizeof(ConcertReplicationBlueprintFunctionLibrary_PropertyChainPredicate__DelegateSignature) == 0x000018, "Wrong size on ConcertReplicationBlueprintFunctionLibrary_PropertyChainPredicate__DelegateSignature");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_PropertyChainPredicate__DelegateSignature, PathToProperty) == 0x000000, "Member 'ConcertReplicationBlueprintFunctionLibrary_PropertyChainPredicate__DelegateSignature::PathToProperty' has a wrong offset!");
static_assert(offsetof(ConcertReplicationBlueprintFunctionLibrary_PropertyChainPredicate__DelegateSignature, ReturnValue) == 0x000010, "Member 'ConcertReplicationBlueprintFunctionLibrary_PropertyChainPredicate__DelegateSignature::ReturnValue' has a wrong offset!");

}

