#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CTRL_CLA_Cloaking_L

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass CTRL_CLA_Cloaking_L.CTRL_CLA_Cloaking_L_C
// 0x00F8 (0x0BA0 - 0x0AA8)
class UCTRL_CLA_Cloaking_L_C final : public UControlRig
{
public:
	uint8                                         Pad_60CA[0x8];                                     // 0x0AA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Upperarm_twist_xform;                              // 0x0AB0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Static_upvector;                                   // 0x0B10(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                UpVector;                                          // 0x0B28(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Calvicle_twist_xform;                              // 0x0B40(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CTRL_CLA_Cloaking_L_C">();
	}
	static class UCTRL_CLA_Cloaking_L_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCTRL_CLA_Cloaking_L_C>();
	}
};
static_assert(alignof(UCTRL_CLA_Cloaking_L_C) == 0x000010, "Wrong alignment on UCTRL_CLA_Cloaking_L_C");
static_assert(sizeof(UCTRL_CLA_Cloaking_L_C) == 0x000BA0, "Wrong size on UCTRL_CLA_Cloaking_L_C");
static_assert(offsetof(UCTRL_CLA_Cloaking_L_C, Upperarm_twist_xform) == 0x000AB0, "Member 'UCTRL_CLA_Cloaking_L_C::Upperarm_twist_xform' has a wrong offset!");
static_assert(offsetof(UCTRL_CLA_Cloaking_L_C, Static_upvector) == 0x000B10, "Member 'UCTRL_CLA_Cloaking_L_C::Static_upvector' has a wrong offset!");
static_assert(offsetof(UCTRL_CLA_Cloaking_L_C, UpVector) == 0x000B28, "Member 'UCTRL_CLA_Cloaking_L_C::UpVector' has a wrong offset!");
static_assert(offsetof(UCTRL_CLA_Cloaking_L_C, Calvicle_twist_xform) == 0x000B40, "Member 'UCTRL_CLA_Cloaking_L_C::Calvicle_twist_xform' has a wrong offset!");

}

