#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBP_DestructibleAsset

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DBP_DestructibleAsset.DBP_DestructibleAsset_C
// 0x00C0 (0x03D0 - 0x0310)
class ADBP_DestructibleAsset_C : public AGzHitReactableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   ExtraBrokenGlass;                                  // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   OriginalMesh;                                      // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CustomGlassMesh;                                   // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AChaosCacheManager*                     Chaos_Cache;                                       // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RTDamage;                                          // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MIDSurface;                                        // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MIDDamage;                                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          RTCreated_;                                        // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6422[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture*>                       DamageTexture;                                     // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        MaxHealth;                                         // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    In_Component;                                      // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UseChaos_;                                         // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6423[0x7];                                     // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          ExplosionSound;                                    // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DestructionFx;                                     // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DestructionDustFx;                                 // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          BrokenMesh_;                                       // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6424[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            BrokenMesh;                                        // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DamageMaterial;                                    // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ImpactFX;                                          // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ImpactDustFX;                                      // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentHealth;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_ClientOnDiedPlayFx(const struct FVector& LastHitLocation);
	void BP_OnHealthChange(float Health);
	void BP_OnHitApplied(const struct FHitResult& HitResult);
	void DoDamage(const struct FHitResult& HitResult);
	void ExecuteUbergraph_DBP_DestructibleAsset(int32 EntryPoint);
	void OnDied();
	void PlayExplosionFX(const struct FVector& Location);
	void TryDestroyOriginalMesh();
	void TrySetupRenderTarget();
	void UpdateDamage(const struct FHitResult& Hit);
	void UserConstructionScript();

	bool CanAttachTo(class AActor* Actor) const;
	bool IsValidAttachment() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DBP_DestructibleAsset_C">();
	}
	static class ADBP_DestructibleAsset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADBP_DestructibleAsset_C>();
	}
};
static_assert(alignof(ADBP_DestructibleAsset_C) == 0x000008, "Wrong alignment on ADBP_DestructibleAsset_C");
static_assert(sizeof(ADBP_DestructibleAsset_C) == 0x0003D0, "Wrong size on ADBP_DestructibleAsset_C");
static_assert(offsetof(ADBP_DestructibleAsset_C, UberGraphFrame) == 0x000310, "Member 'ADBP_DestructibleAsset_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, ExtraBrokenGlass) == 0x000318, "Member 'ADBP_DestructibleAsset_C::ExtraBrokenGlass' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, OriginalMesh) == 0x000320, "Member 'ADBP_DestructibleAsset_C::OriginalMesh' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, Scene) == 0x000328, "Member 'ADBP_DestructibleAsset_C::Scene' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, CustomGlassMesh) == 0x000330, "Member 'ADBP_DestructibleAsset_C::CustomGlassMesh' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, Chaos_Cache) == 0x000338, "Member 'ADBP_DestructibleAsset_C::Chaos_Cache' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, RTDamage) == 0x000340, "Member 'ADBP_DestructibleAsset_C::RTDamage' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, MIDSurface) == 0x000348, "Member 'ADBP_DestructibleAsset_C::MIDSurface' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, MIDDamage) == 0x000350, "Member 'ADBP_DestructibleAsset_C::MIDDamage' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, RTCreated_) == 0x000358, "Member 'ADBP_DestructibleAsset_C::RTCreated_' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, DamageTexture) == 0x000360, "Member 'ADBP_DestructibleAsset_C::DamageTexture' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, MaxHealth) == 0x000370, "Member 'ADBP_DestructibleAsset_C::MaxHealth' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, In_Component) == 0x000378, "Member 'ADBP_DestructibleAsset_C::In_Component' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, UseChaos_) == 0x000380, "Member 'ADBP_DestructibleAsset_C::UseChaos_' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, ExplosionSound) == 0x000388, "Member 'ADBP_DestructibleAsset_C::ExplosionSound' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, DestructionFx) == 0x000390, "Member 'ADBP_DestructibleAsset_C::DestructionFx' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, DestructionDustFx) == 0x000398, "Member 'ADBP_DestructibleAsset_C::DestructionDustFx' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, BrokenMesh_) == 0x0003A0, "Member 'ADBP_DestructibleAsset_C::BrokenMesh_' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, BrokenMesh) == 0x0003A8, "Member 'ADBP_DestructibleAsset_C::BrokenMesh' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, DamageMaterial) == 0x0003B0, "Member 'ADBP_DestructibleAsset_C::DamageMaterial' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, ImpactFX) == 0x0003B8, "Member 'ADBP_DestructibleAsset_C::ImpactFX' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, ImpactDustFX) == 0x0003C0, "Member 'ADBP_DestructibleAsset_C::ImpactDustFX' has a wrong offset!");
static_assert(offsetof(ADBP_DestructibleAsset_C, CurrentHealth) == 0x0003C8, "Member 'ADBP_DestructibleAsset_C::CurrentHealth' has a wrong offset!");

}

