#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DecoupledOutputProvider

#include "Basic.hpp"

#include "VCamCore_classes.hpp"


namespace SDK
{

// Class DecoupledOutputProvider.DecoupledOutputProvider
// 0x0000 (0x0160 - 0x0160)
class UDecoupledOutputProvider : public UVCamOutputProviderBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DecoupledOutputProvider">();
	}
	static class UDecoupledOutputProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDecoupledOutputProvider>();
	}
};
static_assert(alignof(UDecoupledOutputProvider) == 0x000008, "Wrong alignment on UDecoupledOutputProvider");
static_assert(sizeof(UDecoupledOutputProvider) == 0x000160, "Wrong size on UDecoupledOutputProvider");

// Class DecoupledOutputProvider.VCamPixelStreamingSession
// 0x0018 (0x0178 - 0x0160)
class UVCamPixelStreamingSession final : public UDecoupledOutputProvider
{
public:
	int32                                         FromComposureOutputProviderIndex;                  // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchRemoteResolution;                            // 0x0164(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableARKitTracking;                               // 0x0165(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PreventEditorIdle;                                 // 0x0166(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSetLiveLinkSubject;                           // 0x0167(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StreamerId;                                        // 0x0168(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VCamPixelStreamingSession">();
	}
	static class UVCamPixelStreamingSession* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVCamPixelStreamingSession>();
	}
};
static_assert(alignof(UVCamPixelStreamingSession) == 0x000008, "Wrong alignment on UVCamPixelStreamingSession");
static_assert(sizeof(UVCamPixelStreamingSession) == 0x000178, "Wrong size on UVCamPixelStreamingSession");
static_assert(offsetof(UVCamPixelStreamingSession, FromComposureOutputProviderIndex) == 0x000160, "Member 'UVCamPixelStreamingSession::FromComposureOutputProviderIndex' has a wrong offset!");
static_assert(offsetof(UVCamPixelStreamingSession, bMatchRemoteResolution) == 0x000164, "Member 'UVCamPixelStreamingSession::bMatchRemoteResolution' has a wrong offset!");
static_assert(offsetof(UVCamPixelStreamingSession, EnableARKitTracking) == 0x000165, "Member 'UVCamPixelStreamingSession::EnableARKitTracking' has a wrong offset!");
static_assert(offsetof(UVCamPixelStreamingSession, PreventEditorIdle) == 0x000166, "Member 'UVCamPixelStreamingSession::PreventEditorIdle' has a wrong offset!");
static_assert(offsetof(UVCamPixelStreamingSession, bAutoSetLiveLinkSubject) == 0x000167, "Member 'UVCamPixelStreamingSession::bAutoSetLiveLinkSubject' has a wrong offset!");
static_assert(offsetof(UVCamPixelStreamingSession, StreamerId) == 0x000168, "Member 'UVCamPixelStreamingSession::StreamerId' has a wrong offset!");

}

