#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DevF_BP_AR02_S01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DevF_BP_AR02_S01.DevF_BP_AR02_S01_C
// 0x0038 (0x02D8 - 0x02A0)
class ADevF_BP_AR02_S01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_AT_AR02_MAG_DFL;                                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AT_AR02_S01_MUZ;                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AT_AR02_S01_STK;                                // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AT_AR02_S01_GRP;                                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AT_AR02_S01_BRL;                                // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_WPN_AR02;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DevF_BP_AR02_S01_C">();
	}
	static class ADevF_BP_AR02_S01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADevF_BP_AR02_S01_C>();
	}
};
static_assert(alignof(ADevF_BP_AR02_S01_C) == 0x000008, "Wrong alignment on ADevF_BP_AR02_S01_C");
static_assert(sizeof(ADevF_BP_AR02_S01_C) == 0x0002D8, "Wrong size on ADevF_BP_AR02_S01_C");
static_assert(offsetof(ADevF_BP_AR02_S01_C, SM_AT_AR02_MAG_DFL) == 0x0002A0, "Member 'ADevF_BP_AR02_S01_C::SM_AT_AR02_MAG_DFL' has a wrong offset!");
static_assert(offsetof(ADevF_BP_AR02_S01_C, SM_AT_AR02_S01_MUZ) == 0x0002A8, "Member 'ADevF_BP_AR02_S01_C::SM_AT_AR02_S01_MUZ' has a wrong offset!");
static_assert(offsetof(ADevF_BP_AR02_S01_C, SM_AT_AR02_S01_STK) == 0x0002B0, "Member 'ADevF_BP_AR02_S01_C::SM_AT_AR02_S01_STK' has a wrong offset!");
static_assert(offsetof(ADevF_BP_AR02_S01_C, SM_AT_AR02_S01_GRP) == 0x0002B8, "Member 'ADevF_BP_AR02_S01_C::SM_AT_AR02_S01_GRP' has a wrong offset!");
static_assert(offsetof(ADevF_BP_AR02_S01_C, SM_AT_AR02_S01_BRL) == 0x0002C0, "Member 'ADevF_BP_AR02_S01_C::SM_AT_AR02_S01_BRL' has a wrong offset!");
static_assert(offsetof(ADevF_BP_AR02_S01_C, SK_WPN_AR02) == 0x0002C8, "Member 'ADevF_BP_AR02_S01_C::SK_WPN_AR02' has a wrong offset!");
static_assert(offsetof(ADevF_BP_AR02_S01_C, DefaultSceneRoot) == 0x0002D0, "Member 'ADevF_BP_AR02_S01_C::DefaultSceneRoot' has a wrong offset!");

}

