#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DevF_BP_LMG02_S03

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DevF_BP_LMG02_S03.DevF_BP_LMG02_S03_C
// 0x0030 (0x02D0 - 0x02A0)
class ADevF_BP_LMG02_S03_C final : public AActor
{
public:
	class USkeletalMeshComponent*                 SK_AT_LMG02_S03_STK;                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_AT_LMG02_S03_GRP;                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_AT_LMG02_S03_BRL;                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AT_LMG02_MAG;                                   // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_WPN_LMG02;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DevF_BP_LMG02_S03_C">();
	}
	static class ADevF_BP_LMG02_S03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADevF_BP_LMG02_S03_C>();
	}
};
static_assert(alignof(ADevF_BP_LMG02_S03_C) == 0x000008, "Wrong alignment on ADevF_BP_LMG02_S03_C");
static_assert(sizeof(ADevF_BP_LMG02_S03_C) == 0x0002D0, "Wrong size on ADevF_BP_LMG02_S03_C");
static_assert(offsetof(ADevF_BP_LMG02_S03_C, SK_AT_LMG02_S03_STK) == 0x0002A0, "Member 'ADevF_BP_LMG02_S03_C::SK_AT_LMG02_S03_STK' has a wrong offset!");
static_assert(offsetof(ADevF_BP_LMG02_S03_C, SK_AT_LMG02_S03_GRP) == 0x0002A8, "Member 'ADevF_BP_LMG02_S03_C::SK_AT_LMG02_S03_GRP' has a wrong offset!");
static_assert(offsetof(ADevF_BP_LMG02_S03_C, SK_AT_LMG02_S03_BRL) == 0x0002B0, "Member 'ADevF_BP_LMG02_S03_C::SK_AT_LMG02_S03_BRL' has a wrong offset!");
static_assert(offsetof(ADevF_BP_LMG02_S03_C, SM_AT_LMG02_MAG) == 0x0002B8, "Member 'ADevF_BP_LMG02_S03_C::SM_AT_LMG02_MAG' has a wrong offset!");
static_assert(offsetof(ADevF_BP_LMG02_S03_C, SK_WPN_LMG02) == 0x0002C0, "Member 'ADevF_BP_LMG02_S03_C::SK_WPN_LMG02' has a wrong offset!");
static_assert(offsetof(ADevF_BP_LMG02_S03_C, DefaultSceneRoot) == 0x0002C8, "Member 'ADevF_BP_LMG02_S03_C::DefaultSceneRoot' has a wrong offset!");

}

