#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQC_CentraPatrolPoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EQC_CentraPatrolPoint.EQC_CentraPatrolPoint_C.ProvideSingleLocation
// 0x0068 (0x0068 - 0x0000)
struct EQC_CentraPatrolPoint_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultingLocation;                                 // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_675E[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValueAsVector_ReturnValue;             // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidAILocation_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQC_CentraPatrolPoint_C_ProvideSingleLocation) == 0x000008, "Wrong alignment on EQC_CentraPatrolPoint_C_ProvideSingleLocation");
static_assert(sizeof(EQC_CentraPatrolPoint_C_ProvideSingleLocation) == 0x000068, "Wrong size on EQC_CentraPatrolPoint_C_ProvideSingleLocation");
static_assert(offsetof(EQC_CentraPatrolPoint_C_ProvideSingleLocation, QuerierObject) == 0x000000, "Member 'EQC_CentraPatrolPoint_C_ProvideSingleLocation::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQC_CentraPatrolPoint_C_ProvideSingleLocation, QuerierActor) == 0x000008, "Member 'EQC_CentraPatrolPoint_C_ProvideSingleLocation::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQC_CentraPatrolPoint_C_ProvideSingleLocation, ResultingLocation) == 0x000010, "Member 'EQC_CentraPatrolPoint_C_ProvideSingleLocation::ResultingLocation' has a wrong offset!");
static_assert(offsetof(EQC_CentraPatrolPoint_C_ProvideSingleLocation, CallFunc_MakeLiteralName_ReturnValue) == 0x000028, "Member 'EQC_CentraPatrolPoint_C_ProvideSingleLocation::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQC_CentraPatrolPoint_C_ProvideSingleLocation, K2Node_DynamicCast_AsPawn) == 0x000030, "Member 'EQC_CentraPatrolPoint_C_ProvideSingleLocation::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(EQC_CentraPatrolPoint_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'EQC_CentraPatrolPoint_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EQC_CentraPatrolPoint_C_ProvideSingleLocation, CallFunc_GetAIController_ReturnValue) == 0x000040, "Member 'EQC_CentraPatrolPoint_C_ProvideSingleLocation::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQC_CentraPatrolPoint_C_ProvideSingleLocation, CallFunc_GetValueAsVector_ReturnValue) == 0x000048, "Member 'EQC_CentraPatrolPoint_C_ProvideSingleLocation::CallFunc_GetValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQC_CentraPatrolPoint_C_ProvideSingleLocation, CallFunc_IsValidAILocation_ReturnValue) == 0x000060, "Member 'EQC_CentraPatrolPoint_C_ProvideSingleLocation::CallFunc_IsValidAILocation_ReturnValue' has a wrong offset!");

}

