#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FGzEventStatusSetting

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FGzEventStatusSetting.FGzEventStatusSetting
// 0x001C (0x001C - 0x0000)
struct FFGzEventStatusSetting final
{
public:
	bool                                          bEnableDynamicCreate_13_309237F74F48B043D6A0D28D3EB13C6F; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ADC[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActiveStateID_14_46D4D29F44E1C1FF70B9339299312F9D; // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableInactiveState_15_C1709832493E1B915BD24EA9062360E5; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ADD[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InactiveStateID_16_D4263F2C450D401B40A7E3ABF4EE012B; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowGameNotification_20_347B2BC14EB12247BE99DFBC9328461B; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFGzEventStatusSetting) == 0x000004, "Wrong alignment on FFGzEventStatusSetting");
static_assert(sizeof(FFGzEventStatusSetting) == 0x00001C, "Wrong size on FFGzEventStatusSetting");
static_assert(offsetof(FFGzEventStatusSetting, bEnableDynamicCreate_13_309237F74F48B043D6A0D28D3EB13C6F) == 0x000000, "Member 'FFGzEventStatusSetting::bEnableDynamicCreate_13_309237F74F48B043D6A0D28D3EB13C6F' has a wrong offset!");
static_assert(offsetof(FFGzEventStatusSetting, ActiveStateID_14_46D4D29F44E1C1FF70B9339299312F9D) == 0x000004, "Member 'FFGzEventStatusSetting::ActiveStateID_14_46D4D29F44E1C1FF70B9339299312F9D' has a wrong offset!");
static_assert(offsetof(FFGzEventStatusSetting, bEnableInactiveState_15_C1709832493E1B915BD24EA9062360E5) == 0x00000C, "Member 'FFGzEventStatusSetting::bEnableInactiveState_15_C1709832493E1B915BD24EA9062360E5' has a wrong offset!");
static_assert(offsetof(FFGzEventStatusSetting, InactiveStateID_16_D4263F2C450D401B40A7E3ABF4EE012B) == 0x000010, "Member 'FFGzEventStatusSetting::InactiveStateID_16_D4263F2C450D401B40A7E3ABF4EE012B' has a wrong offset!");
static_assert(offsetof(FFGzEventStatusSetting, ShowGameNotification_20_347B2BC14EB12247BE99DFBC9328461B) == 0x000018, "Member 'FFGzEventStatusSetting::ShowGameNotification_20_347B2BC14EB12247BE99DFBC9328461B' has a wrong offset!");

}

