#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AutoWeaponReload

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AutoWeaponReload.GA_AutoWeaponReload_C
// 0x0030 (0x05A0 - 0x0570)
class UGA_AutoWeaponReload_C final : public UGzGA_AutoWeaponReload
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        ScopeStartTime;                                    // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReloadStartTime;                                   // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCameraAnimationHandle                 CameraAnimationHandle;                             // 0x0588(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AnimationPlaying;                                  // 0x058C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6385[0x3];                                     // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraAnimationSequence*               SelectedCameraSequence;                            // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            LeglessReloadEffect;                               // 0x0598(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Added_AF1189DF434DAD6433614DA156F494BF();
	void Added_BA2B2B16466FAEC97B9CD19AF1CFAE70();
	void ExecuteUbergraph_GA_AutoWeaponReload(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void Removed_9A9D24014E47E1E427B5918683E3676D();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_AutoWeaponReload_C">();
	}
	static class UGA_AutoWeaponReload_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AutoWeaponReload_C>();
	}
};
static_assert(alignof(UGA_AutoWeaponReload_C) == 0x000008, "Wrong alignment on UGA_AutoWeaponReload_C");
static_assert(sizeof(UGA_AutoWeaponReload_C) == 0x0005A0, "Wrong size on UGA_AutoWeaponReload_C");
static_assert(offsetof(UGA_AutoWeaponReload_C, UberGraphFrame) == 0x000570, "Member 'UGA_AutoWeaponReload_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_AutoWeaponReload_C, ScopeStartTime) == 0x000578, "Member 'UGA_AutoWeaponReload_C::ScopeStartTime' has a wrong offset!");
static_assert(offsetof(UGA_AutoWeaponReload_C, ReloadStartTime) == 0x000580, "Member 'UGA_AutoWeaponReload_C::ReloadStartTime' has a wrong offset!");
static_assert(offsetof(UGA_AutoWeaponReload_C, CameraAnimationHandle) == 0x000588, "Member 'UGA_AutoWeaponReload_C::CameraAnimationHandle' has a wrong offset!");
static_assert(offsetof(UGA_AutoWeaponReload_C, AnimationPlaying) == 0x00058C, "Member 'UGA_AutoWeaponReload_C::AnimationPlaying' has a wrong offset!");
static_assert(offsetof(UGA_AutoWeaponReload_C, SelectedCameraSequence) == 0x000590, "Member 'UGA_AutoWeaponReload_C::SelectedCameraSequence' has a wrong offset!");
static_assert(offsetof(UGA_AutoWeaponReload_C, LeglessReloadEffect) == 0x000598, "Member 'UGA_AutoWeaponReload_C::LeglessReloadEffect' has a wrong offset!");

}

