#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AssaultDrone_Redirect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AssaultDrone_Redirect.GA_AssaultDrone_Redirect_C
// 0x0018 (0x0520 - 0x0508)
class UGA_AssaultDrone_Redirect_C : public UGzGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bRight;                                            // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D82[0x7];                                     // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UBP_AssaultDroneComponent_C> Component_Class;                                   // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_AssaultDrone_Redirect(int32 EntryPoint);
	void K2_ActivateAbility();
	void RedirectDrone();

	void GetLimbComponent(class UBP_AssaultDroneComponent_C** Component) const;
	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_AssaultDrone_Redirect_C">();
	}
	static class UGA_AssaultDrone_Redirect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AssaultDrone_Redirect_C>();
	}
};
static_assert(alignof(UGA_AssaultDrone_Redirect_C) == 0x000008, "Wrong alignment on UGA_AssaultDrone_Redirect_C");
static_assert(sizeof(UGA_AssaultDrone_Redirect_C) == 0x000520, "Wrong size on UGA_AssaultDrone_Redirect_C");
static_assert(offsetof(UGA_AssaultDrone_Redirect_C, UberGraphFrame) == 0x000508, "Member 'UGA_AssaultDrone_Redirect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_AssaultDrone_Redirect_C, bRight) == 0x000510, "Member 'UGA_AssaultDrone_Redirect_C::bRight' has a wrong offset!");
static_assert(offsetof(UGA_AssaultDrone_Redirect_C, Component_Class) == 0x000518, "Member 'UGA_AssaultDrone_Redirect_C::Component_Class' has a wrong offset!");

}

