#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ArmorSmall2

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_ArmorSmall2.GA_ArmorSmall2_C.ExecuteUbergraph_GA_ArmorSmall2
// 0x0030 (0x0030 - 0x0000)
struct GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C26[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C27[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2) == 0x000008, "Wrong alignment on GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2");
static_assert(sizeof(GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2) == 0x000030, "Wrong size on GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2");
static_assert(offsetof(GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2, EntryPoint) == 0x000000, "Member 'GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000018, "Member 'GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2, K2Node_Event_bWasCancelled) == 0x000021, "Member 'GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2, CallFunc_K2_HasAuthority_ReturnValue) == 0x000022, "Member 'GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000024, "Member 'GA_ArmorSmall2_C_ExecuteUbergraph_GA_ArmorSmall2::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_ArmorSmall2.GA_ArmorSmall2_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_ArmorSmall2_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ArmorSmall2_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_ArmorSmall2_C_K2_OnEndAbility");
static_assert(sizeof(GA_ArmorSmall2_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_ArmorSmall2_C_K2_OnEndAbility");
static_assert(offsetof(GA_ArmorSmall2_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_ArmorSmall2_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_ArmorSmall2.GA_ArmorSmall2_C.K2_CanActivateAbility
// 0x00B8 (0x00B8 - 0x0000)
struct GA_ArmorSmall2_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0048(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C28[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C29[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C2A[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C2B[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C2C[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C2D[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ArmorSmall2_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_ArmorSmall2_C_K2_CanActivateAbility");
static_assert(sizeof(GA_ArmorSmall2_C_K2_CanActivateAbility) == 0x0000B8, "Wrong size on GA_ArmorSmall2_C_K2_CanActivateAbility");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, Handle) == 0x000048, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, RelevantTags) == 0x000050, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, ReturnValue) == 0x000070, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, K2Node_DynamicCast_AsGz_Character) == 0x000078, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000088, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000090, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x000094, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1) == 0x000098, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1) == 0x00009C, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, CallFunc_BooleanAND_ReturnValue) == 0x0000A0, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000A1, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A2, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, CallFunc_BooleanAND_ReturnValue_2) == 0x0000A3, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x0000A8, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_ArmorSmall2_C_K2_CanActivateAbility, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0000B0, "Member 'GA_ArmorSmall2_C_K2_CanActivateAbility::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

