#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AssaultDrone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AssaultDrone.GA_AssaultDrone_C
// 0x0158 (0x07D0 - 0x0678)
class UGA_AssaultDrone_C : public UGzGA_BaseLimbAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0678(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FHitResult                             Hit;                                               // 0x0680(0x00F8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AGzMultiPartCharacter*                  As_Gz_Multi_Part_Character;                        // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MaxFlyDist;                                        // 0x0780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetPositionBufferArrea;                         // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzBodyPartAbilityData_ADrone*          As_Gz_Body_Part_Ability_Data_ADrone;               // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0798(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64D0[0x4];                                     // 0x079C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   NPCType_Tag;                                       // 0x07A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                           Montage;                                           // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   HandBoneName;                                      // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      TraceType;                                         // 0x07C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddCharacterFlySpeedToDrone(class AGzAssaultDrone* InDrone);
	void EventReceived_FB1082FF4318D4E92525F9BC5BD551A2(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void ExecuteUbergraph_GA_AssaultDrone(int32 EntryPoint);
	void HandlSpawnData(const struct FGameplayAbilityTargetDataHandle& HitResult);
	void K2_ActivateAbility();
	void OnBlendOut_FB1082FF4318D4E92525F9BC5BD551A2();
	void OnCompleted_FB1082FF4318D4E92525F9BC5BD551A2();
	void OnInterrupted_FB1082FF4318D4E92525F9BC5BD551A2();
	void OnNotifyBegin_FB1082FF4318D4E92525F9BC5BD551A2(class FName NotifyName);
	void OnNotifyEnd_FB1082FF4318D4E92525F9BC5BD551A2(class FName NotifyName);
	void SpawnTurret(const struct FVector& InTransform_Location, const struct FVector& InTargetPoint);
	void ValidData_85C4B5ED421D328D18276DAD09F41D96(const struct FGameplayAbilityTargetDataHandle& Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_AssaultDrone_C">();
	}
	static class UGA_AssaultDrone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AssaultDrone_C>();
	}
};
static_assert(alignof(UGA_AssaultDrone_C) == 0x000008, "Wrong alignment on UGA_AssaultDrone_C");
static_assert(sizeof(UGA_AssaultDrone_C) == 0x0007D0, "Wrong size on UGA_AssaultDrone_C");
static_assert(offsetof(UGA_AssaultDrone_C, UberGraphFrame) == 0x000678, "Member 'UGA_AssaultDrone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_AssaultDrone_C, Hit) == 0x000680, "Member 'UGA_AssaultDrone_C::Hit' has a wrong offset!");
static_assert(offsetof(UGA_AssaultDrone_C, As_Gz_Multi_Part_Character) == 0x000778, "Member 'UGA_AssaultDrone_C::As_Gz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(UGA_AssaultDrone_C, MaxFlyDist) == 0x000780, "Member 'UGA_AssaultDrone_C::MaxFlyDist' has a wrong offset!");
static_assert(offsetof(UGA_AssaultDrone_C, TargetPositionBufferArrea) == 0x000788, "Member 'UGA_AssaultDrone_C::TargetPositionBufferArrea' has a wrong offset!");
static_assert(offsetof(UGA_AssaultDrone_C, As_Gz_Body_Part_Ability_Data_ADrone) == 0x000790, "Member 'UGA_AssaultDrone_C::As_Gz_Body_Part_Ability_Data_ADrone' has a wrong offset!");
static_assert(offsetof(UGA_AssaultDrone_C, Level) == 0x000798, "Member 'UGA_AssaultDrone_C::Level' has a wrong offset!");
static_assert(offsetof(UGA_AssaultDrone_C, NPCType_Tag) == 0x0007A0, "Member 'UGA_AssaultDrone_C::NPCType_Tag' has a wrong offset!");
static_assert(offsetof(UGA_AssaultDrone_C, Montage) == 0x0007B0, "Member 'UGA_AssaultDrone_C::Montage' has a wrong offset!");
static_assert(offsetof(UGA_AssaultDrone_C, HandBoneName) == 0x0007B8, "Member 'UGA_AssaultDrone_C::HandBoneName' has a wrong offset!");
static_assert(offsetof(UGA_AssaultDrone_C, TraceType) == 0x0007C0, "Member 'UGA_AssaultDrone_C::TraceType' has a wrong offset!");

}

