#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BarrierLegs

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_BarrierLegs.GA_BarrierLegs_C.ExecuteUbergraph_GA_BarrierLegs
// 0x0418 (0x0418 - 0x0000)
struct GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59DE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzCombatComponent*                     CallFunc_GetCombatComponent_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_GetViewHitResult_ReturnValue;             // 0x0010(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59DF[0x2];                                     // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E0[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E1[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate;              // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E2[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     K2Node_MakeArray_Array;                            // 0x0208(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeGameplayAbilityTargetDataHandleFromHitResults_ReturnValue; // 0x0218(0x0028)()
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzAT_ServerWaitForTargetData*          CallFunc_ServerWaitForClientTargetData_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E3[0x5];                                     // 0x025B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0260(0x0028)()
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E4[0x6];                                     // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_BP_GetAbilityComponent_ReturnValue;       // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E5[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BarrierComponent_C*                 K2Node_DynamicCast_AsBP_Barrier_Component;         // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E6[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_BP_GetAbilityComponent_ReturnValue_1;     // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_BarrierComponent_C*                 K2Node_DynamicCast_AsBP_Barrier_Component_1;       // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_1;            // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E7[0x6];                                     // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data;                           // 0x02C8(0x0028)(ConstParm)
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzMultiPartCharacter*                  K2Node_DynamicCast_AsGz_Multi_Part_Character;      // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E8[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0320(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs) == 0x000008, "Wrong alignment on GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs");
static_assert(sizeof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs) == 0x000418, "Wrong size on GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, EntryPoint) == 0x000000, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_GetCombatComponent_ReturnValue) == 0x000008, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_GetCombatComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_GetViewHitResult_ReturnValue) == 0x000010, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_GetViewHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_bBlockingHit) == 0x000108, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_bInitialOverlap) == 0x000109, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_Time) == 0x00010C, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_Distance) == 0x000110, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_Location) == 0x000118, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_ImpactPoint) == 0x000130, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_Normal) == 0x000148, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_ImpactNormal) == 0x000160, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_PhysMat) == 0x000178, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_HitActor) == 0x000180, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_HitComponent) == 0x000188, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_HitBoneName) == 0x000190, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_BoneName) == 0x000198, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_HitItem) == 0x0001A0, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_ElementIndex) == 0x0001A4, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_FaceIndex) == 0x0001A8, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_TraceStart) == 0x0001B0, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BreakHitResult_TraceEnd) == 0x0001C8, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, K2Node_CreateDelegate_OutputDelegate) == 0x0001E0, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, K2Node_CustomEvent_TimeHeld) == 0x0001F0, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, Temp_real_Variable) == 0x0001F4, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_WaitInputRelease_ReturnValue) == 0x0001F8, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_IsValid_ReturnValue) == 0x000200, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, K2Node_MakeArray_Array) == 0x000208, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_MakeGameplayAbilityTargetDataHandleFromHitResults_ReturnValue) == 0x000218, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_MakeGameplayAbilityTargetDataHandleFromHitResults_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, K2Node_CreateDelegate_OutputDelegate_1) == 0x000240, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_ServerWaitForClientTargetData_ReturnValue) == 0x000250, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_ServerWaitForClientTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_K2_HasAuthority_ReturnValue) == 0x000258, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_IsValid_ReturnValue_1) == 0x000259, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_IsDedicatedServer_ReturnValue) == 0x00025A, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, Temp_struct_Variable) == 0x000260, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000288, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_K2_CommitAbility_ReturnValue) == 0x000289, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BP_GetAbilityComponent_ReturnValue) == 0x000290, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BP_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, K2Node_Event_bWasCancelled) == 0x000298, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, K2Node_DynamicCast_AsBP_Barrier_Component) == 0x0002A0, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::K2Node_DynamicCast_AsBP_Barrier_Component' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, K2Node_DynamicCast_bSuccess) == 0x0002A8, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_BP_GetAbilityComponent_ReturnValue_1) == 0x0002B0, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_BP_GetAbilityComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, K2Node_DynamicCast_AsBP_Barrier_Component_1) == 0x0002B8, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::K2Node_DynamicCast_AsBP_Barrier_Component_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, K2Node_DynamicCast_bSuccess_1) == 0x0002C0, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_K2_HasAuthority_ReturnValue_1) == 0x0002C1, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_K2_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, K2Node_CustomEvent_Data) == 0x0002C8, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_GetOwningCharacter_ReturnValue) == 0x0002F0, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002F8, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, K2Node_DynamicCast_AsGz_Multi_Part_Character) == 0x000310, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::K2Node_DynamicCast_AsGz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, K2Node_DynamicCast_bSuccess_2) == 0x000318, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs, CallFunc_MakeHitResult_ReturnValue) == 0x000320, "Member 'GA_BarrierLegs_C_ExecuteUbergraph_GA_BarrierLegs::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");

// Function GA_BarrierLegs.GA_BarrierLegs_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_BarrierLegs_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BarrierLegs_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_BarrierLegs_C_K2_OnEndAbility");
static_assert(sizeof(GA_BarrierLegs_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_BarrierLegs_C_K2_OnEndAbility");
static_assert(offsetof(GA_BarrierLegs_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_BarrierLegs_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_BarrierLegs.GA_BarrierLegs_C.OnRelease_519A2D4442E88F21C8407DA5832B1F01
// 0x0004 (0x0004 - 0x0000)
struct GA_BarrierLegs_C_OnRelease_519A2D4442E88F21C8407DA5832B1F01 final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BarrierLegs_C_OnRelease_519A2D4442E88F21C8407DA5832B1F01) == 0x000004, "Wrong alignment on GA_BarrierLegs_C_OnRelease_519A2D4442E88F21C8407DA5832B1F01");
static_assert(sizeof(GA_BarrierLegs_C_OnRelease_519A2D4442E88F21C8407DA5832B1F01) == 0x000004, "Wrong size on GA_BarrierLegs_C_OnRelease_519A2D4442E88F21C8407DA5832B1F01");
static_assert(offsetof(GA_BarrierLegs_C_OnRelease_519A2D4442E88F21C8407DA5832B1F01, TimeHeld) == 0x000000, "Member 'GA_BarrierLegs_C_OnRelease_519A2D4442E88F21C8407DA5832B1F01::TimeHeld' has a wrong offset!");

// Function GA_BarrierLegs.GA_BarrierLegs_C.SpawnBarrier
// 0x05F0 (0x05F0 - 0x0000)
struct GA_BarrierLegs_C_SpawnBarrier final
{
public:
	struct FGameplayAbilityTargetDataHandle       HitResult;                                         // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FHitResult                             CallFunc_GetHitResultFromTargetData_ReturnValue;   // 0x0028(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E9[0x2];                                     // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59EA[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59EB[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue_1;         // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BarrierComponent_C*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59EC[0x6];                                     // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0240(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue_2;         // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0318(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0412(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59ED[0x1];                                     // 0x0413(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59EE[0x4];                                     // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0420(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0490(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59EF[0x4];                                     // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0508(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0520(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0538(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0550(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZY_ReturnValue;                // 0x0568(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0580(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x05E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Barrier_C*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x05E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BarrierLegs_C_SpawnBarrier) == 0x000010, "Wrong alignment on GA_BarrierLegs_C_SpawnBarrier");
static_assert(sizeof(GA_BarrierLegs_C_SpawnBarrier) == 0x0005F0, "Wrong size on GA_BarrierLegs_C_SpawnBarrier");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, HitResult) == 0x000000, "Member 'GA_BarrierLegs_C_SpawnBarrier::HitResult' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_GetHitResultFromTargetData_ReturnValue) == 0x000028, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_GetHitResultFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_bBlockingHit) == 0x000120, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_bInitialOverlap) == 0x000121, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_Time) == 0x000124, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_Distance) == 0x000128, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_Location) == 0x000130, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_ImpactPoint) == 0x000148, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_Normal) == 0x000160, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_ImpactNormal) == 0x000178, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_PhysMat) == 0x000190, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_HitActor) == 0x000198, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_HitComponent) == 0x0001A0, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_HitBoneName) == 0x0001A8, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_BoneName) == 0x0001B0, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_HitItem) == 0x0001B8, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_ElementIndex) == 0x0001BC, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_FaceIndex) == 0x0001C0, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_TraceStart) == 0x0001C8, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_TraceEnd) == 0x0001E0, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001F8, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_VSize_ReturnValue) == 0x000210, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000218, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_GetOwningCharacter_ReturnValue) == 0x000220, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_GetOwningCharacter_ReturnValue_1) == 0x000228, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_GetOwningCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_GetComponentByClass_ReturnValue) == 0x000230, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_IsValid_ReturnValue) == 0x000238, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_IsValid_ReturnValue_1) == 0x000239, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, Temp_object_Variable) == 0x000240, "Member 'GA_BarrierLegs_C_SpawnBarrier::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000250, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_MakeVector_ReturnValue) == 0x000258, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000270, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_GetOwningCharacter_ReturnValue_2) == 0x000288, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_GetOwningCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_GetActorRightVector_ReturnValue) == 0x000290, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_FMin_ReturnValue) == 0x0002A8, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0002B0, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x0002B8, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0002D0, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Add_VectorVector_ReturnValue) == 0x0002E8, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000300, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000318, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000410, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000411, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000412, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_Time_1) == 0x000414, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_Distance_1) == 0x000418, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_Location_1) == 0x000420, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000438, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_Normal_1) == 0x000450, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000468, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_PhysMat_1) == 0x000480, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_HitActor_1) == 0x000488, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_HitComponent_1) == 0x000490, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_HitBoneName_1) == 0x000498, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_BoneName_1) == 0x0004A0, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_HitItem_1) == 0x0004A8, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_ElementIndex_1) == 0x0004AC, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_FaceIndex_1) == 0x0004B0, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_TraceStart_1) == 0x0004B8, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BreakHitResult_TraceEnd_1) == 0x0004D0, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Dot_VectorVector_ReturnValue) == 0x0004E8, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x0004F0, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000508, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000520, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000538, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_Normal_ReturnValue) == 0x000550, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_MakeRotFromZY_ReturnValue) == 0x000568, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_MakeRotFromZY_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_MakeTransform_ReturnValue) == 0x000580, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0005E0, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BarrierLegs_C_SpawnBarrier, CallFunc_FinishSpawningActor_ReturnValue) == 0x0005E8, "Member 'GA_BarrierLegs_C_SpawnBarrier::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function GA_BarrierLegs.GA_BarrierLegs_C.ValidData_97D13F2F440307B3F6BE0FA4262F6A0A
// 0x0028 (0x0028 - 0x0000)
struct GA_BarrierLegs_C_ValidData_97D13F2F440307B3F6BE0FA4262F6A0A final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_BarrierLegs_C_ValidData_97D13F2F440307B3F6BE0FA4262F6A0A) == 0x000008, "Wrong alignment on GA_BarrierLegs_C_ValidData_97D13F2F440307B3F6BE0FA4262F6A0A");
static_assert(sizeof(GA_BarrierLegs_C_ValidData_97D13F2F440307B3F6BE0FA4262F6A0A) == 0x000028, "Wrong size on GA_BarrierLegs_C_ValidData_97D13F2F440307B3F6BE0FA4262F6A0A");
static_assert(offsetof(GA_BarrierLegs_C_ValidData_97D13F2F440307B3F6BE0FA4262F6A0A, Data) == 0x000000, "Member 'GA_BarrierLegs_C_ValidData_97D13F2F440307B3F6BE0FA4262F6A0A::Data' has a wrong offset!");

}

