#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DefaultSeatState

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_DefaultSeatState.GA_DefaultSeatState_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_DefaultSeatState_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DefaultSeatState_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_DefaultSeatState_C_K2_OnEndAbility");
static_assert(sizeof(GA_DefaultSeatState_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_DefaultSeatState_C_K2_OnEndAbility");
static_assert(offsetof(GA_DefaultSeatState_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_DefaultSeatState_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_DefaultSeatState.GA_DefaultSeatState_C.GetOwnerVehicle
// 0x0018 (0x0018 - 0x0000)
struct GA_DefaultSeatState_C_GetOwnerVehicle final
{
public:
	class AGzVehicle*                             Vehicle;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzVehicle*                             CallFunc_GetCurrentVehicle_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DefaultSeatState_C_GetOwnerVehicle) == 0x000008, "Wrong alignment on GA_DefaultSeatState_C_GetOwnerVehicle");
static_assert(sizeof(GA_DefaultSeatState_C_GetOwnerVehicle) == 0x000018, "Wrong size on GA_DefaultSeatState_C_GetOwnerVehicle");
static_assert(offsetof(GA_DefaultSeatState_C_GetOwnerVehicle, Vehicle) == 0x000000, "Member 'GA_DefaultSeatState_C_GetOwnerVehicle::Vehicle' has a wrong offset!");
static_assert(offsetof(GA_DefaultSeatState_C_GetOwnerVehicle, CallFunc_GetOwningCharacter_ReturnValue) == 0x000008, "Member 'GA_DefaultSeatState_C_GetOwnerVehicle::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DefaultSeatState_C_GetOwnerVehicle, CallFunc_GetCurrentVehicle_ReturnValue) == 0x000010, "Member 'GA_DefaultSeatState_C_GetOwnerVehicle::CallFunc_GetCurrentVehicle_ReturnValue' has a wrong offset!");

}

