#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Defiler_Shoot

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Defiler_Shoot.GA_Defiler_Shoot_C.ExecuteUbergraph_GA_Defiler_Shoot
// 0x0058 (0x0058 - 0x0000)
struct GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6588[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot) == 0x000008, "Wrong alignment on GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot");
static_assert(sizeof(GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot) == 0x000058, "Wrong size on GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot");
static_assert(offsetof(GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot, EntryPoint) == 0x000000, "Member 'GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000048, "Member 'GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'GA_Defiler_Shoot_C_ExecuteUbergraph_GA_Defiler_Shoot::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Defiler_Shoot.GA_Defiler_Shoot_C.SpawnTape
// 0x0030 (0x0030 - 0x0000)
struct GA_Defiler_Shoot_C_SpawnTape final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6589[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_658A[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Defiler_Component_C*                K2Node_DynamicCast_AsBP_Defiler_Component;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Defiler_Shoot_C_SpawnTape) == 0x000008, "Wrong alignment on GA_Defiler_Shoot_C_SpawnTape");
static_assert(sizeof(GA_Defiler_Shoot_C_SpawnTape) == 0x000030, "Wrong size on GA_Defiler_Shoot_C_SpawnTape");
static_assert(offsetof(GA_Defiler_Shoot_C_SpawnTape, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'GA_Defiler_Shoot_C_SpawnTape::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_SpawnTape, CallFunc_K2_HasAuthority_ReturnValue) == 0x000001, "Member 'GA_Defiler_Shoot_C_SpawnTape::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_SpawnTape, CallFunc_GetOwningCharacter_ReturnValue) == 0x000008, "Member 'GA_Defiler_Shoot_C_SpawnTape::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_SpawnTape, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GA_Defiler_Shoot_C_SpawnTape::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_SpawnTape, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_Defiler_Shoot_C_SpawnTape::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_SpawnTape, K2Node_DynamicCast_AsBP_Defiler_Component) == 0x000020, "Member 'GA_Defiler_Shoot_C_SpawnTape::K2Node_DynamicCast_AsBP_Defiler_Component' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_SpawnTape, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GA_Defiler_Shoot_C_SpawnTape::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Defiler_Shoot.GA_Defiler_Shoot_C.K2_CanActivateAbility
// 0x00C8 (0x00C8 - 0x0000)
struct GA_Defiler_Shoot_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0048(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_658B[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_658C[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_658D[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_GetComponentByClass_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_Defiler_Component_C*                K2Node_DynamicCast_AsBP_Defiler_Component;         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_658E[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue_1;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckReload_Reloaded;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_658F[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_GetComponentByClass_ReturnValue_1;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_Defiler_Component_C*                K2Node_DynamicCast_AsBP_Defiler_Component_1;       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharged_NewParam;                       // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Defiler_Shoot_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Defiler_Shoot_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Defiler_Shoot_C_K2_CanActivateAbility) == 0x0000C8, "Wrong size on GA_Defiler_Shoot_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, Handle) == 0x000048, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, RelevantTags) == 0x000050, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, ReturnValue) == 0x000070, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, CallFunc_GetOwningCharacter_ReturnValue) == 0x000078, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, CallFunc_GetComponentByClass_ReturnValue) == 0x000088, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, K2Node_DynamicCast_AsBP_Defiler_Component) == 0x000090, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::K2Node_DynamicCast_AsBP_Defiler_Component' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, CallFunc_GetOwningCharacter_ReturnValue_1) == 0x0000A0, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::CallFunc_GetOwningCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, CallFunc_CheckReload_Reloaded) == 0x0000A8, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::CallFunc_CheckReload_Reloaded' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, CallFunc_IsValid_ReturnValue_1) == 0x0000A9, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0000B0, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, K2Node_DynamicCast_AsBP_Defiler_Component_1) == 0x0000B8, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::K2Node_DynamicCast_AsBP_Defiler_Component_1' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Defiler_Shoot_C_K2_CanActivateAbility, CallFunc_IsCharged_NewParam) == 0x0000C1, "Member 'GA_Defiler_Shoot_C_K2_CanActivateAbility::CallFunc_IsCharged_NewParam' has a wrong offset!");

}

