#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Disarmer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S_Disarmer_InitData_structs.hpp"


namespace SDK::Params
{

// Function GA_Disarmer.GA_Disarmer_C.DestroyOldGadjet
// 0x0058 (0x0058 - 0x0000)
struct GA_Disarmer_C_DestroyOldGadjet final
{
public:
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0000(0x0048)(ContainsInstancedReference)
	class UBP_CloakComponent_C*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Disarmer_C_DestroyOldGadjet) == 0x000008, "Wrong alignment on GA_Disarmer_C_DestroyOldGadjet");
static_assert(sizeof(GA_Disarmer_C_DestroyOldGadjet) == 0x000058, "Wrong size on GA_Disarmer_C_DestroyOldGadjet");
static_assert(offsetof(GA_Disarmer_C_DestroyOldGadjet, CallFunc_GetActorInfo_ReturnValue) == 0x000000, "Member 'GA_Disarmer_C_DestroyOldGadjet::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_DestroyOldGadjet, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'GA_Disarmer_C_DestroyOldGadjet::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_DestroyOldGadjet, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'GA_Disarmer_C_DestroyOldGadjet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_DestroyOldGadjet, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'GA_Disarmer_C_DestroyOldGadjet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_DestroyOldGadjet, CallFunc_IsValid_ReturnValue_2) == 0x000052, "Member 'GA_Disarmer_C_DestroyOldGadjet::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function GA_Disarmer.GA_Disarmer_C.EventReceived_0D6FB611472FA98BE4A16DBF6A136D22
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Disarmer_C_EventReceived_0D6FB611472FA98BE4A16DBF6A136D22 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Disarmer_C_EventReceived_0D6FB611472FA98BE4A16DBF6A136D22) == 0x000008, "Wrong alignment on GA_Disarmer_C_EventReceived_0D6FB611472FA98BE4A16DBF6A136D22");
static_assert(sizeof(GA_Disarmer_C_EventReceived_0D6FB611472FA98BE4A16DBF6A136D22) == 0x0000B8, "Wrong size on GA_Disarmer_C_EventReceived_0D6FB611472FA98BE4A16DBF6A136D22");
static_assert(offsetof(GA_Disarmer_C_EventReceived_0D6FB611472FA98BE4A16DBF6A136D22, EventTag) == 0x000000, "Member 'GA_Disarmer_C_EventReceived_0D6FB611472FA98BE4A16DBF6A136D22::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_EventReceived_0D6FB611472FA98BE4A16DBF6A136D22, EventData) == 0x000008, "Member 'GA_Disarmer_C_EventReceived_0D6FB611472FA98BE4A16DBF6A136D22::EventData' has a wrong offset!");

// Function GA_Disarmer.GA_Disarmer_C.EventReceived_B1854D9142AD02660393DB93A2FD092D
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Disarmer_C_EventReceived_B1854D9142AD02660393DB93A2FD092D final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Disarmer_C_EventReceived_B1854D9142AD02660393DB93A2FD092D) == 0x000008, "Wrong alignment on GA_Disarmer_C_EventReceived_B1854D9142AD02660393DB93A2FD092D");
static_assert(sizeof(GA_Disarmer_C_EventReceived_B1854D9142AD02660393DB93A2FD092D) == 0x0000B8, "Wrong size on GA_Disarmer_C_EventReceived_B1854D9142AD02660393DB93A2FD092D");
static_assert(offsetof(GA_Disarmer_C_EventReceived_B1854D9142AD02660393DB93A2FD092D, EventTag) == 0x000000, "Member 'GA_Disarmer_C_EventReceived_B1854D9142AD02660393DB93A2FD092D::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_EventReceived_B1854D9142AD02660393DB93A2FD092D, EventData) == 0x000008, "Member 'GA_Disarmer_C_EventReceived_B1854D9142AD02660393DB93A2FD092D::EventData' has a wrong offset!");

// Function GA_Disarmer.GA_Disarmer_C.ExecuteUbergraph_GA_Disarmer
// 0x0580 (0x0580 - 0x0000)
struct GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64BD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data;                           // 0x0010(0x0028)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0048(0x0028)()
	class UGzAT_ServerWaitForTargetData*          CallFunc_ServerWaitForClientTargetData_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64BE[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_GetHitResultFromTargetData_ReturnValue;   // 0x0080(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64BF[0x2];                                     // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C0[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C1[0x4];                                     // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0268(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_Disarmer_InitData                   K2Node_MakeStruct_S_Disarmer_InitData;             // 0x0278(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C2[0x8];                                     // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0320(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DisarmerGadget_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_1;                     // 0x0340(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_1;                    // 0x0348(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x03F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0408(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0418(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0428(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x0440(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x0458(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag;                       // 0x0468(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData;                      // 0x0470(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0520(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0530(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0540(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0550(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C3[0x7];                                     // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAT_PlayMontageAndWaitForEvent*       CallFunc_PlayMontageAndWaitForEvent_ReturnValue;   // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzAT_PlayMontageAndWaitForEvent*       CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1; // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0579(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x057A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer) == 0x000010, "Wrong alignment on GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer");
static_assert(sizeof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer) == 0x000580, "Wrong size on GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, EntryPoint) == 0x000000, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_GetOwningCharacter_ReturnValue) == 0x000008, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CustomEvent_Data) == 0x000010, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, Temp_struct_Variable) == 0x000048, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_ServerWaitForClientTargetData_ReturnValue) == 0x000070, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_ServerWaitForClientTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_GetHitResultFromTargetData_ReturnValue) == 0x000080, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_GetHitResultFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_bBlockingHit) == 0x000178, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_bInitialOverlap) == 0x000179, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_Time) == 0x00017C, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_Distance) == 0x000180, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_Location) == 0x000188, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_ImpactPoint) == 0x0001A0, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_Normal) == 0x0001B8, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_ImpactNormal) == 0x0001D0, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_PhysMat) == 0x0001E8, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_HitActor) == 0x0001F0, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_HitComponent) == 0x0001F8, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_HitBoneName) == 0x000200, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_BoneName) == 0x000208, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_HitItem) == 0x000210, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_ElementIndex) == 0x000214, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_FaceIndex) == 0x000218, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_TraceStart) == 0x000220, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BreakHitResult_TraceEnd) == 0x000238, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_SelectVector_ReturnValue) == 0x000250, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000268, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_MakeStruct_S_Disarmer_InitData) == 0x000278, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_MakeStruct_S_Disarmer_InitData' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_MakeTransform_ReturnValue) == 0x0002B0, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CustomEvent_NotifyName_3) == 0x000310, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000318, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CreateDelegate_OutputDelegate_2) == 0x000320, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_FinishSpawningActor_ReturnValue) == 0x000330, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CustomEvent_NotifyName_2) == 0x000338, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CustomEvent_EventTag_1) == 0x000340, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CustomEvent_EventTag_1' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CustomEvent_EventData_1) == 0x000348, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CustomEvent_EventData_1' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CreateDelegate_OutputDelegate_3) == 0x0003F8, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CreateDelegate_OutputDelegate_4) == 0x000408, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CreateDelegate_OutputDelegate_5) == 0x000418, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CreateDelegate_OutputDelegate_6) == 0x000428, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CustomEvent_NotifyName_1) == 0x000438, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CreateDelegate_OutputDelegate_7) == 0x000440, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CustomEvent_NotifyName) == 0x000450, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CreateDelegate_OutputDelegate_8) == 0x000458, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CustomEvent_EventTag) == 0x000468, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CustomEvent_EventData) == 0x000470, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CustomEvent_EventData' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CreateDelegate_OutputDelegate_9) == 0x000520, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CreateDelegate_OutputDelegate_10) == 0x000530, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CreateDelegate_OutputDelegate_11) == 0x000540, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, K2Node_CreateDelegate_OutputDelegate_12) == 0x000550, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_K2_HasAuthority_ReturnValue) == 0x000560, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_PlayMontageAndWaitForEvent_ReturnValue) == 0x000568, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_PlayMontageAndWaitForEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1) == 0x000570, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_IsValid_ReturnValue_1) == 0x000578, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_IsValid_ReturnValue_2) == 0x000579, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer, CallFunc_K2_CommitAbility_ReturnValue) == 0x00057A, "Member 'GA_Disarmer_C_ExecuteUbergraph_GA_Disarmer::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GA_Disarmer.GA_Disarmer_C.OnNotifyBegin_0D6FB611472FA98BE4A16DBF6A136D22
// 0x0008 (0x0008 - 0x0000)
struct GA_Disarmer_C_OnNotifyBegin_0D6FB611472FA98BE4A16DBF6A136D22 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Disarmer_C_OnNotifyBegin_0D6FB611472FA98BE4A16DBF6A136D22) == 0x000004, "Wrong alignment on GA_Disarmer_C_OnNotifyBegin_0D6FB611472FA98BE4A16DBF6A136D22");
static_assert(sizeof(GA_Disarmer_C_OnNotifyBegin_0D6FB611472FA98BE4A16DBF6A136D22) == 0x000008, "Wrong size on GA_Disarmer_C_OnNotifyBegin_0D6FB611472FA98BE4A16DBF6A136D22");
static_assert(offsetof(GA_Disarmer_C_OnNotifyBegin_0D6FB611472FA98BE4A16DBF6A136D22, NotifyName) == 0x000000, "Member 'GA_Disarmer_C_OnNotifyBegin_0D6FB611472FA98BE4A16DBF6A136D22::NotifyName' has a wrong offset!");

// Function GA_Disarmer.GA_Disarmer_C.OnNotifyBegin_B1854D9142AD02660393DB93A2FD092D
// 0x0008 (0x0008 - 0x0000)
struct GA_Disarmer_C_OnNotifyBegin_B1854D9142AD02660393DB93A2FD092D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Disarmer_C_OnNotifyBegin_B1854D9142AD02660393DB93A2FD092D) == 0x000004, "Wrong alignment on GA_Disarmer_C_OnNotifyBegin_B1854D9142AD02660393DB93A2FD092D");
static_assert(sizeof(GA_Disarmer_C_OnNotifyBegin_B1854D9142AD02660393DB93A2FD092D) == 0x000008, "Wrong size on GA_Disarmer_C_OnNotifyBegin_B1854D9142AD02660393DB93A2FD092D");
static_assert(offsetof(GA_Disarmer_C_OnNotifyBegin_B1854D9142AD02660393DB93A2FD092D, NotifyName) == 0x000000, "Member 'GA_Disarmer_C_OnNotifyBegin_B1854D9142AD02660393DB93A2FD092D::NotifyName' has a wrong offset!");

// Function GA_Disarmer.GA_Disarmer_C.OnNotifyEnd_0D6FB611472FA98BE4A16DBF6A136D22
// 0x0008 (0x0008 - 0x0000)
struct GA_Disarmer_C_OnNotifyEnd_0D6FB611472FA98BE4A16DBF6A136D22 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Disarmer_C_OnNotifyEnd_0D6FB611472FA98BE4A16DBF6A136D22) == 0x000004, "Wrong alignment on GA_Disarmer_C_OnNotifyEnd_0D6FB611472FA98BE4A16DBF6A136D22");
static_assert(sizeof(GA_Disarmer_C_OnNotifyEnd_0D6FB611472FA98BE4A16DBF6A136D22) == 0x000008, "Wrong size on GA_Disarmer_C_OnNotifyEnd_0D6FB611472FA98BE4A16DBF6A136D22");
static_assert(offsetof(GA_Disarmer_C_OnNotifyEnd_0D6FB611472FA98BE4A16DBF6A136D22, NotifyName) == 0x000000, "Member 'GA_Disarmer_C_OnNotifyEnd_0D6FB611472FA98BE4A16DBF6A136D22::NotifyName' has a wrong offset!");

// Function GA_Disarmer.GA_Disarmer_C.OnNotifyEnd_B1854D9142AD02660393DB93A2FD092D
// 0x0008 (0x0008 - 0x0000)
struct GA_Disarmer_C_OnNotifyEnd_B1854D9142AD02660393DB93A2FD092D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Disarmer_C_OnNotifyEnd_B1854D9142AD02660393DB93A2FD092D) == 0x000004, "Wrong alignment on GA_Disarmer_C_OnNotifyEnd_B1854D9142AD02660393DB93A2FD092D");
static_assert(sizeof(GA_Disarmer_C_OnNotifyEnd_B1854D9142AD02660393DB93A2FD092D) == 0x000008, "Wrong size on GA_Disarmer_C_OnNotifyEnd_B1854D9142AD02660393DB93A2FD092D");
static_assert(offsetof(GA_Disarmer_C_OnNotifyEnd_B1854D9142AD02660393DB93A2FD092D, NotifyName) == 0x000000, "Member 'GA_Disarmer_C_OnNotifyEnd_B1854D9142AD02660393DB93A2FD092D::NotifyName' has a wrong offset!");

// Function GA_Disarmer.GA_Disarmer_C.SendDirectionToServer
// 0x0418 (0x0418 - 0x0000)
struct GA_Disarmer_C_SendDirectionToServer final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x00F8)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromHitResult_ReturnValue; // 0x00F8(0x0028)()
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C4[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzCombatComponent*                     CallFunc_GetCombatComponent_ReturnValue;           // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_GetViewHitResult_ReturnValue;             // 0x0150(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C5[0x1];                                     // 0x024B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C6[0x4];                                     // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C7[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0320(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_Disarmer_C_SendDirectionToServer) == 0x000008, "Wrong alignment on GA_Disarmer_C_SendDirectionToServer");
static_assert(sizeof(GA_Disarmer_C_SendDirectionToServer) == 0x000418, "Wrong size on GA_Disarmer_C_SendDirectionToServer");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, HitResult) == 0x000000, "Member 'GA_Disarmer_C_SendDirectionToServer::HitResult' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_AbilityTargetDataFromHitResult_ReturnValue) == 0x0000F8, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_AbilityTargetDataFromHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_GetOwningCharacter_ReturnValue) == 0x000120, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_IsValid_ReturnValue) == 0x000128, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_IsValid_ReturnValue_1) == 0x000129, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_GetSocketLocation_ReturnValue) == 0x000130, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_GetCombatComponent_ReturnValue) == 0x000148, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_GetCombatComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_GetViewHitResult_ReturnValue) == 0x000150, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_GetViewHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_IsValid_ReturnValue_2) == 0x000248, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_bBlockingHit) == 0x000249, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_bInitialOverlap) == 0x00024A, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_Time) == 0x00024C, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_Distance) == 0x000250, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_Location) == 0x000258, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_ImpactPoint) == 0x000270, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_Normal) == 0x000288, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_ImpactNormal) == 0x0002A0, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_PhysMat) == 0x0002B8, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_HitActor) == 0x0002C0, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_HitComponent) == 0x0002C8, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_HitBoneName) == 0x0002D0, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_BoneName) == 0x0002D8, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_HitItem) == 0x0002E0, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_ElementIndex) == 0x0002E4, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_FaceIndex) == 0x0002E8, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_TraceStart) == 0x0002F0, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_BreakHitResult_TraceEnd) == 0x000308, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_Disarmer_C_SendDirectionToServer, CallFunc_MakeHitResult_ReturnValue) == 0x000320, "Member 'GA_Disarmer_C_SendDirectionToServer::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");

// Function GA_Disarmer.GA_Disarmer_C.ValidData_897421C742B563B1EFFB179E3DF40707
// 0x0028 (0x0028 - 0x0000)
struct GA_Disarmer_C_ValidData_897421C742B563B1EFFB179E3DF40707 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Disarmer_C_ValidData_897421C742B563B1EFFB179E3DF40707) == 0x000008, "Wrong alignment on GA_Disarmer_C_ValidData_897421C742B563B1EFFB179E3DF40707");
static_assert(sizeof(GA_Disarmer_C_ValidData_897421C742B563B1EFFB179E3DF40707) == 0x000028, "Wrong size on GA_Disarmer_C_ValidData_897421C742B563B1EFFB179E3DF40707");
static_assert(offsetof(GA_Disarmer_C_ValidData_897421C742B563B1EFFB179E3DF40707, Data) == 0x000000, "Member 'GA_Disarmer_C_ValidData_897421C742B563B1EFFB179E3DF40707::Data' has a wrong offset!");

}

