#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DomeShield

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DomeShield.GA_DomeShield_C
// 0x0028 (0x06A0 - 0x0678)
class UGA_DomeShield_C : public UGzGA_BaseLimbAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0678(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_DomeGadget_C*                       DomeGadget;                                        // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_DomeShieldComponent_C*              DomeShieldComponent;                               // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          DetonatedShield;                                   // 0x0690(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShieldActive;                                      // 0x0691(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6628[0x2];                                     // 0x0692(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DetonationHoldTime;                                // 0x0694(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DomeShield_BodyPartAbilityData_C*   DomeShieldBodyPartAbilityData;                     // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnRemoveAbility();
	void DetonateShield();
	void ExecuteUbergraph_GA_DomeShield(int32 EntryPoint);
	void InitAbilityComponent();
	void K2_ActivateAbility();
	void OnFinish_1DF5512242E7C95938B16494CEFF888F();
	void OnGadgetDestroyed(class AActor* DestroyedActor);
	void ReadAbilityConfig();
	void SpawnDomeGadget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_DomeShield_C">();
	}
	static class UGA_DomeShield_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DomeShield_C>();
	}
};
static_assert(alignof(UGA_DomeShield_C) == 0x000008, "Wrong alignment on UGA_DomeShield_C");
static_assert(sizeof(UGA_DomeShield_C) == 0x0006A0, "Wrong size on UGA_DomeShield_C");
static_assert(offsetof(UGA_DomeShield_C, UberGraphFrame) == 0x000678, "Member 'UGA_DomeShield_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_DomeShield_C, DomeGadget) == 0x000680, "Member 'UGA_DomeShield_C::DomeGadget' has a wrong offset!");
static_assert(offsetof(UGA_DomeShield_C, DomeShieldComponent) == 0x000688, "Member 'UGA_DomeShield_C::DomeShieldComponent' has a wrong offset!");
static_assert(offsetof(UGA_DomeShield_C, DetonatedShield) == 0x000690, "Member 'UGA_DomeShield_C::DetonatedShield' has a wrong offset!");
static_assert(offsetof(UGA_DomeShield_C, ShieldActive) == 0x000691, "Member 'UGA_DomeShield_C::ShieldActive' has a wrong offset!");
static_assert(offsetof(UGA_DomeShield_C, DetonationHoldTime) == 0x000694, "Member 'UGA_DomeShield_C::DetonationHoldTime' has a wrong offset!");
static_assert(offsetof(UGA_DomeShield_C, DomeShieldBodyPartAbilityData) == 0x000698, "Member 'UGA_DomeShield_C::DomeShieldBodyPartAbilityData' has a wrong offset!");

}

