#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DomeShield

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_DomeShield.GA_DomeShield_C.BP_OnRemoveAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_DomeShield_C_BP_OnRemoveAbility final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DomeShield_C_BP_OnRemoveAbility) == 0x000001, "Wrong alignment on GA_DomeShield_C_BP_OnRemoveAbility");
static_assert(sizeof(GA_DomeShield_C_BP_OnRemoveAbility) == 0x000001, "Wrong size on GA_DomeShield_C_BP_OnRemoveAbility");
static_assert(offsetof(GA_DomeShield_C_BP_OnRemoveAbility, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GA_DomeShield_C_BP_OnRemoveAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_DomeShield.GA_DomeShield_C.DetonateShield
// 0x0002 (0x0002 - 0x0000)
struct GA_DomeShield_C_DetonateShield final
{
public:
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DomeShield_C_DetonateShield) == 0x000001, "Wrong alignment on GA_DomeShield_C_DetonateShield");
static_assert(sizeof(GA_DomeShield_C_DetonateShield) == 0x000002, "Wrong size on GA_DomeShield_C_DetonateShield");
static_assert(offsetof(GA_DomeShield_C_DetonateShield, CallFunc_K2_CommitAbility_ReturnValue) == 0x000000, "Member 'GA_DomeShield_C_DetonateShield::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_DetonateShield, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'GA_DomeShield_C_DetonateShield::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_DomeShield.GA_DomeShield_C.ExecuteUbergraph_GA_DomeShield
// 0x0058 (0x0058 - 0x0000)
struct GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_1;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6629[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_662A[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzBodyPartAbilityData*                 CallFunc_BP_GetAbilityData_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DomeShield_BodyPartAbilityData_C*   K2Node_DynamicCast_AsBP_Dome_Shield_Body_Part_Ability_Data; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield) == 0x000008, "Wrong alignment on GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield");
static_assert(sizeof(GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield) == 0x000058, "Wrong size on GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield");
static_assert(offsetof(GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield, EntryPoint) == 0x000000, "Member 'GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield, Temp_delegate_Variable) == 0x000014, "Member 'GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield, CallFunc_PostEvent_ReturnValue) == 0x000024, "Member 'GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield, CallFunc_K2_HasAuthority_ReturnValue) == 0x000028, "Member 'GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield, CallFunc_K2_HasAuthority_ReturnValue_1) == 0x000029, "Member 'GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield::CallFunc_K2_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield, CallFunc_WaitDelay_ReturnValue) == 0x000030, "Member 'GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield, CallFunc_BP_GetAbilityData_ReturnValue) == 0x000040, "Member 'GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield::CallFunc_BP_GetAbilityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield, K2Node_DynamicCast_AsBP_Dome_Shield_Body_Part_Ability_Data) == 0x000048, "Member 'GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield::K2Node_DynamicCast_AsBP_Dome_Shield_Body_Part_Ability_Data' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GA_DomeShield_C_ExecuteUbergraph_GA_DomeShield::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_DomeShield.GA_DomeShield_C.InitAbilityComponent
// 0x0018 (0x0018 - 0x0000)
struct GA_DomeShield_C_InitAbilityComponent final
{
public:
	class UActorComponent*                        CallFunc_BP_GetAbilityComponent_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_DomeShieldComponent_C*              K2Node_DynamicCast_AsBP_Dome_Shield_Component;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DomeShield_C_InitAbilityComponent) == 0x000008, "Wrong alignment on GA_DomeShield_C_InitAbilityComponent");
static_assert(sizeof(GA_DomeShield_C_InitAbilityComponent) == 0x000018, "Wrong size on GA_DomeShield_C_InitAbilityComponent");
static_assert(offsetof(GA_DomeShield_C_InitAbilityComponent, CallFunc_BP_GetAbilityComponent_ReturnValue) == 0x000000, "Member 'GA_DomeShield_C_InitAbilityComponent::CallFunc_BP_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_InitAbilityComponent, K2Node_DynamicCast_AsBP_Dome_Shield_Component) == 0x000008, "Member 'GA_DomeShield_C_InitAbilityComponent::K2Node_DynamicCast_AsBP_Dome_Shield_Component' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_InitAbilityComponent, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GA_DomeShield_C_InitAbilityComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_DomeShield.GA_DomeShield_C.OnGadgetDestroyed
// 0x0010 (0x0010 - 0x0000)
struct GA_DomeShield_C_OnGadgetDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DomeShield_C_OnGadgetDestroyed) == 0x000008, "Wrong alignment on GA_DomeShield_C_OnGadgetDestroyed");
static_assert(sizeof(GA_DomeShield_C_OnGadgetDestroyed) == 0x000010, "Wrong size on GA_DomeShield_C_OnGadgetDestroyed");
static_assert(offsetof(GA_DomeShield_C_OnGadgetDestroyed, DestroyedActor) == 0x000000, "Member 'GA_DomeShield_C_OnGadgetDestroyed::DestroyedActor' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_OnGadgetDestroyed, CallFunc_K2_CommitAbility_ReturnValue) == 0x000008, "Member 'GA_DomeShield_C_OnGadgetDestroyed::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GA_DomeShield.GA_DomeShield_C.SpawnDomeGadget
// 0x0320 (0x0320 - 0x0000)
struct GA_DomeShield_C_SpawnDomeGadget final
{
public:
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00D8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_662B[0x1];                                     // 0x01D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_662C[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_662D[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_662E[0x8];                                     // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DomeGadget_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DomeShield_C_SpawnDomeGadget) == 0x000010, "Wrong alignment on GA_DomeShield_C_SpawnDomeGadget");
static_assert(sizeof(GA_DomeShield_C_SpawnDomeGadget) == 0x000320, "Wrong size on GA_DomeShield_C_SpawnDomeGadget");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, Temp_object_Variable) == 0x000000, "Member 'GA_DomeShield_C_SpawnDomeGadget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_DomeShield_C_SpawnDomeGadget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000020, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_GetOwningCharacter_ReturnValue) == 0x000038, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000040, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_GetOwningCharacter_ReturnValue_1) == 0x000058, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_GetOwningCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_GetActorUpVector_ReturnValue) == 0x000078, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000090, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000A8, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C0, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_LineTraceSingle_OutHit) == 0x0000D8, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_LineTraceSingle_ReturnValue) == 0x0001D0, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_bBlockingHit) == 0x0001D1, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001D2, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_Time) == 0x0001D4, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_Distance) == 0x0001D8, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_Location) == 0x0001E0, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_ImpactPoint) == 0x0001F8, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_Normal) == 0x000210, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_ImpactNormal) == 0x000228, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_PhysMat) == 0x000240, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_HitActor) == 0x000248, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_HitComponent) == 0x000250, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_HitBoneName) == 0x000258, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_BoneName) == 0x000260, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_HitItem) == 0x000268, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_ElementIndex) == 0x00026C, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_FaceIndex) == 0x000270, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_TraceStart) == 0x000278, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BreakHitResult_TraceEnd) == 0x000290, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_MakeTransform_ReturnValue) == 0x0002B0, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000310, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DomeShield_C_SpawnDomeGadget, CallFunc_FinishSpawningActor_ReturnValue) == 0x000318, "Member 'GA_DomeShield_C_SpawnDomeGadget::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

