#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Defiler

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Defiler.GA_Defiler_C.ExecuteUbergraph_GA_Defiler
// 0x0030 (0x0030 - 0x0000)
struct GA_Defiler_C_ExecuteUbergraph_GA_Defiler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6590[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6591[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_BP_GetAbilityComponent_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_Defiler_Component_C*                K2Node_DynamicCast_AsBP_Defiler_Component;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Defiler_C_ExecuteUbergraph_GA_Defiler) == 0x000008, "Wrong alignment on GA_Defiler_C_ExecuteUbergraph_GA_Defiler");
static_assert(sizeof(GA_Defiler_C_ExecuteUbergraph_GA_Defiler) == 0x000030, "Wrong size on GA_Defiler_C_ExecuteUbergraph_GA_Defiler");
static_assert(offsetof(GA_Defiler_C_ExecuteUbergraph_GA_Defiler, EntryPoint) == 0x000000, "Member 'GA_Defiler_C_ExecuteUbergraph_GA_Defiler::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Defiler_C_ExecuteUbergraph_GA_Defiler, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'GA_Defiler_C_ExecuteUbergraph_GA_Defiler::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_C_ExecuteUbergraph_GA_Defiler, CallFunc_K2_HasAuthority_ReturnValue) == 0x000005, "Member 'GA_Defiler_C_ExecuteUbergraph_GA_Defiler::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_C_ExecuteUbergraph_GA_Defiler, CallFunc_GetOwningCharacter_ReturnValue) == 0x000008, "Member 'GA_Defiler_C_ExecuteUbergraph_GA_Defiler::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_C_ExecuteUbergraph_GA_Defiler, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GA_Defiler_C_ExecuteUbergraph_GA_Defiler::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_C_ExecuteUbergraph_GA_Defiler, CallFunc_K2_CommitAbility_ReturnValue) == 0x000011, "Member 'GA_Defiler_C_ExecuteUbergraph_GA_Defiler::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_C_ExecuteUbergraph_GA_Defiler, CallFunc_BP_GetAbilityComponent_ReturnValue) == 0x000018, "Member 'GA_Defiler_C_ExecuteUbergraph_GA_Defiler::CallFunc_BP_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Defiler_C_ExecuteUbergraph_GA_Defiler, K2Node_DynamicCast_AsBP_Defiler_Component) == 0x000020, "Member 'GA_Defiler_C_ExecuteUbergraph_GA_Defiler::K2Node_DynamicCast_AsBP_Defiler_Component' has a wrong offset!");
static_assert(offsetof(GA_Defiler_C_ExecuteUbergraph_GA_Defiler, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GA_Defiler_C_ExecuteUbergraph_GA_Defiler::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

