#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Defiler_Shoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Defiler_Shoot.GA_Defiler_Shoot_C
// 0x0018 (0x0520 - 0x0508)
class UGA_Defiler_Shoot_C : public UGzGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           ShootMontage;                                      // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UActorComponent>            Defiler_Component_Class;                           // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Defiler_Shoot(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnBlendOut_40E409264C5F6718031AFDA7224A0EFD();
	void OnCancelled_40E409264C5F6718031AFDA7224A0EFD();
	void OnCompleted_40E409264C5F6718031AFDA7224A0EFD();
	void OnInterrupted_40E409264C5F6718031AFDA7224A0EFD();
	void SpawnTape();

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Defiler_Shoot_C">();
	}
	static class UGA_Defiler_Shoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Defiler_Shoot_C>();
	}
};
static_assert(alignof(UGA_Defiler_Shoot_C) == 0x000008, "Wrong alignment on UGA_Defiler_Shoot_C");
static_assert(sizeof(UGA_Defiler_Shoot_C) == 0x000520, "Wrong size on UGA_Defiler_Shoot_C");
static_assert(offsetof(UGA_Defiler_Shoot_C, UberGraphFrame) == 0x000508, "Member 'UGA_Defiler_Shoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Defiler_Shoot_C, ShootMontage) == 0x000510, "Member 'UGA_Defiler_Shoot_C::ShootMontage' has a wrong offset!");
static_assert(offsetof(UGA_Defiler_Shoot_C, Defiler_Component_Class) == 0x000518, "Member 'UGA_Defiler_Shoot_C::Defiler_Component_Class' has a wrong offset!");

}

