#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Disarmer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Disarmer.GA_Disarmer_C
// 0x0018 (0x0690 - 0x0678)
class UGA_Disarmer_C : public UGzGA_BaseLimbAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0678(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           Montage;                                           // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   ShootSocketName;                                   // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DestroyOldGadjet();
	void EventReceived_0D6FB611472FA98BE4A16DBF6A136D22(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void EventReceived_B1854D9142AD02660393DB93A2FD092D(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void ExecuteUbergraph_GA_Disarmer(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnBlendOut_0D6FB611472FA98BE4A16DBF6A136D22();
	void OnBlendOut_B1854D9142AD02660393DB93A2FD092D();
	void OnCompleted_0D6FB611472FA98BE4A16DBF6A136D22();
	void OnCompleted_B1854D9142AD02660393DB93A2FD092D();
	void OnInterrupted_0D6FB611472FA98BE4A16DBF6A136D22();
	void OnInterrupted_B1854D9142AD02660393DB93A2FD092D();
	void OnNotifyBegin_0D6FB611472FA98BE4A16DBF6A136D22(class FName NotifyName);
	void OnNotifyBegin_B1854D9142AD02660393DB93A2FD092D(class FName NotifyName);
	void OnNotifyEnd_0D6FB611472FA98BE4A16DBF6A136D22(class FName NotifyName);
	void OnNotifyEnd_B1854D9142AD02660393DB93A2FD092D(class FName NotifyName);
	void SendDirectionToServer();
	void ValidData_897421C742B563B1EFFB179E3DF40707(const struct FGameplayAbilityTargetDataHandle& Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Disarmer_C">();
	}
	static class UGA_Disarmer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Disarmer_C>();
	}
};
static_assert(alignof(UGA_Disarmer_C) == 0x000008, "Wrong alignment on UGA_Disarmer_C");
static_assert(sizeof(UGA_Disarmer_C) == 0x000690, "Wrong size on UGA_Disarmer_C");
static_assert(offsetof(UGA_Disarmer_C, UberGraphFrame) == 0x000678, "Member 'UGA_Disarmer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Disarmer_C, Montage) == 0x000680, "Member 'UGA_Disarmer_C::Montage' has a wrong offset!");
static_assert(offsetof(UGA_Disarmer_C, ShootSocketName) == 0x000688, "Member 'UGA_Disarmer_C::ShootSocketName' has a wrong offset!");

}

