#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_GorillaKnockback

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_GorillaKnockback.GA_GorillaKnockback_C.ExecuteUbergraph_GA_GorillaKnockback
// 0x0028 (0x0028 - 0x0000)
struct GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6070[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6071[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback) == 0x000008, "Wrong alignment on GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback");
static_assert(sizeof(GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback) == 0x000028, "Wrong size on GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback");
static_assert(offsetof(GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback, EntryPoint) == 0x000000, "Member 'GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback, K2Node_Event_bWasCancelled) == 0x000020, "Member 'GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000024, "Member 'GA_GorillaKnockback_C_ExecuteUbergraph_GA_GorillaKnockback::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function GA_GorillaKnockback.GA_GorillaKnockback_C.Get Random Gorilla Knockdown Anim
// 0x0018 (0x0018 - 0x0000)
struct GA_GorillaKnockback_C_Get_Random_Gorilla_Knockdown_Anim final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Random_OutItem;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_GorillaKnockback_C_Get_Random_Gorilla_Knockdown_Anim) == 0x000008, "Wrong alignment on GA_GorillaKnockback_C_Get_Random_Gorilla_Knockdown_Anim");
static_assert(sizeof(GA_GorillaKnockback_C_Get_Random_Gorilla_Knockdown_Anim) == 0x000018, "Wrong size on GA_GorillaKnockback_C_Get_Random_Gorilla_Knockdown_Anim");
static_assert(offsetof(GA_GorillaKnockback_C_Get_Random_Gorilla_Knockdown_Anim, ReturnValue) == 0x000000, "Member 'GA_GorillaKnockback_C_Get_Random_Gorilla_Knockdown_Anim::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GorillaKnockback_C_Get_Random_Gorilla_Knockdown_Anim, CallFunc_Array_Random_OutItem) == 0x000008, "Member 'GA_GorillaKnockback_C_Get_Random_Gorilla_Knockdown_Anim::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(GA_GorillaKnockback_C_Get_Random_Gorilla_Knockdown_Anim, CallFunc_Array_Random_OutIndex) == 0x000010, "Member 'GA_GorillaKnockback_C_Get_Random_Gorilla_Knockdown_Anim::CallFunc_Array_Random_OutIndex' has a wrong offset!");

// Function GA_GorillaKnockback.GA_GorillaKnockback_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_GorillaKnockback_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_GorillaKnockback_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_GorillaKnockback_C_K2_OnEndAbility");
static_assert(sizeof(GA_GorillaKnockback_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_GorillaKnockback_C_K2_OnEndAbility");
static_assert(offsetof(GA_GorillaKnockback_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_GorillaKnockback_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

