#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_GorillaArm

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_GorillaArm.GA_GorillaArm_C
// 0x0050 (0x08F0 - 0x08A0)
class UGA_GorillaArm_C : public UGzGA_GorillaArm
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FCameraAnimationHandle                 CameraAnimationHandle;                             // 0x08A8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          LeftShoulderCamPreCharge;                          // 0x08AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65FD[0x3];                                     // 0x08AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            NoMovementEffectHandle;                            // 0x08B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCameraAnimationSequence*               PunchSequence_Left;                                // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCameraAnimationSequence*               PunchSequence_Right;                               // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCameraAnimationSequence*               DashSequence_Left;                                 // 0x08C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCameraAnimationSequence*               DashSequence_Right;                                // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ThrusterMaterial;                                  // 0x08D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_GorillaArm_Component_C*             As_BP_Gorilla_Arm_Component;                       // 0x08E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            BlockEffectHandle;                                 // 0x08E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDashEnded();
	void BP_OnDashStarted(const struct FVector& Direction);
	void BP_OnMaxChargeReached();
	void BP_OnPunch(const struct FHitResult& HitResult);
	void ExecuteUbergraph_GA_GorillaArm(int32 EntryPoint);
	void GetDashCameraSequence(class UCameraAnimationSequence** CameraSequence);
	void GetHandSocketLocation(struct FVector* HandSocketLocation);
	void GetPunchCameraSequence(class UCameraAnimationSequence** CameraSequence);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_0D45319E45A4E75C13ABCA9396A526E6();
	void OnCancelled_0D45319E45A4E75C13ABCA9396A526E6();
	void OnCompleted_0D45319E45A4E75C13ABCA9396A526E6();
	void OnInterrupted_0D45319E45A4E75C13ABCA9396A526E6();
	void PlayChargeCameraShake();
	void PlayChargeFX();
	void PlayEnvironmentImpactCue();
	void PlayPunchFX(const struct FHitResult& PunchHit);
	void StartCameraSequence(class UCameraAnimationSequence* Sequence, double PlayRate);
	void StopCameraSequence();
	void StopChargeCameraShake();
	void StopChargeFX();
	void SwitchChargeCameraShoulder();
	void SwitchPunchCameraShoulder();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_GorillaArm_C">();
	}
	static class UGA_GorillaArm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_GorillaArm_C>();
	}
};
static_assert(alignof(UGA_GorillaArm_C) == 0x000008, "Wrong alignment on UGA_GorillaArm_C");
static_assert(sizeof(UGA_GorillaArm_C) == 0x0008F0, "Wrong size on UGA_GorillaArm_C");
static_assert(offsetof(UGA_GorillaArm_C, UberGraphFrame) == 0x0008A0, "Member 'UGA_GorillaArm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_GorillaArm_C, CameraAnimationHandle) == 0x0008A8, "Member 'UGA_GorillaArm_C::CameraAnimationHandle' has a wrong offset!");
static_assert(offsetof(UGA_GorillaArm_C, LeftShoulderCamPreCharge) == 0x0008AC, "Member 'UGA_GorillaArm_C::LeftShoulderCamPreCharge' has a wrong offset!");
static_assert(offsetof(UGA_GorillaArm_C, NoMovementEffectHandle) == 0x0008B0, "Member 'UGA_GorillaArm_C::NoMovementEffectHandle' has a wrong offset!");
static_assert(offsetof(UGA_GorillaArm_C, PunchSequence_Left) == 0x0008B8, "Member 'UGA_GorillaArm_C::PunchSequence_Left' has a wrong offset!");
static_assert(offsetof(UGA_GorillaArm_C, PunchSequence_Right) == 0x0008C0, "Member 'UGA_GorillaArm_C::PunchSequence_Right' has a wrong offset!");
static_assert(offsetof(UGA_GorillaArm_C, DashSequence_Left) == 0x0008C8, "Member 'UGA_GorillaArm_C::DashSequence_Left' has a wrong offset!");
static_assert(offsetof(UGA_GorillaArm_C, DashSequence_Right) == 0x0008D0, "Member 'UGA_GorillaArm_C::DashSequence_Right' has a wrong offset!");
static_assert(offsetof(UGA_GorillaArm_C, ThrusterMaterial) == 0x0008D8, "Member 'UGA_GorillaArm_C::ThrusterMaterial' has a wrong offset!");
static_assert(offsetof(UGA_GorillaArm_C, As_BP_Gorilla_Arm_Component) == 0x0008E0, "Member 'UGA_GorillaArm_C::As_BP_Gorilla_Arm_Component' has a wrong offset!");
static_assert(offsetof(UGA_GorillaArm_C, BlockEffectHandle) == 0x0008E8, "Member 'UGA_GorillaArm_C::BlockEffectHandle' has a wrong offset!");

}

