#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_GrappleHookEnemy

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_GrappleHookEnemy.GA_GrappleHookEnemy_C.ExecuteUbergraph_GA_GrappleHookEnemy
// 0x0018 (0x0018 - 0x0000)
struct GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6058[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy) == 0x000008, "Wrong alignment on GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy");
static_assert(sizeof(GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy) == 0x000018, "Wrong size on GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy");
static_assert(offsetof(GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy, EntryPoint) == 0x000000, "Member 'GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy, K2Node_Event_bWasCancelled) == 0x000004, "Member 'GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy, CallFunc_IsLocallyControlled_ReturnValue) == 0x000005, "Member 'GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000006, "Member 'GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy, CallFunc_GetPlayerController_ReturnValue_1) == 0x000010, "Member 'GA_GrappleHookEnemy_C_ExecuteUbergraph_GA_GrappleHookEnemy::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");

// Function GA_GrappleHookEnemy.GA_GrappleHookEnemy_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_GrappleHookEnemy_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_GrappleHookEnemy_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_GrappleHookEnemy_C_K2_OnEndAbility");
static_assert(sizeof(GA_GrappleHookEnemy_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_GrappleHookEnemy_C_K2_OnEndAbility");
static_assert(offsetof(GA_GrappleHookEnemy_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_GrappleHookEnemy_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

