#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_GorillaKnockback

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_GorillaKnockback.GA_GorillaKnockback_C
// 0x0030 (0x0558 - 0x0528)
class UGA_GorillaKnockback_C final : public UGzGA_Passive
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EGzLimbType                                   LimbSlot;                                          // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_606F[0x7];                                     // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimMontage*>                   AnimArray;                                         // 0x0538(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UGzPostProcessFX*                       Breaking_Glass_PP;                                 // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TimeToEndAbility;                                  // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_GorillaKnockback(int32 EntryPoint);
	class UAnimMontage* Get_Random_Gorilla_Knockdown_Anim();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void WaitToEndAfterTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_GorillaKnockback_C">();
	}
	static class UGA_GorillaKnockback_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_GorillaKnockback_C>();
	}
};
static_assert(alignof(UGA_GorillaKnockback_C) == 0x000008, "Wrong alignment on UGA_GorillaKnockback_C");
static_assert(sizeof(UGA_GorillaKnockback_C) == 0x000558, "Wrong size on UGA_GorillaKnockback_C");
static_assert(offsetof(UGA_GorillaKnockback_C, UberGraphFrame) == 0x000528, "Member 'UGA_GorillaKnockback_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_GorillaKnockback_C, LimbSlot) == 0x000530, "Member 'UGA_GorillaKnockback_C::LimbSlot' has a wrong offset!");
static_assert(offsetof(UGA_GorillaKnockback_C, AnimArray) == 0x000538, "Member 'UGA_GorillaKnockback_C::AnimArray' has a wrong offset!");
static_assert(offsetof(UGA_GorillaKnockback_C, Breaking_Glass_PP) == 0x000548, "Member 'UGA_GorillaKnockback_C::Breaking_Glass_PP' has a wrong offset!");
static_assert(offsetof(UGA_GorillaKnockback_C, TimeToEndAbility) == 0x000550, "Member 'UGA_GorillaKnockback_C::TimeToEndAbility' has a wrong offset!");

}

