#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_KillSelf

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_KillSelf.GA_KillSelf_C
// 0x0030 (0x0538 - 0x0508)
class UGA_KillSelf_C final : public UGzGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class UGameplayEffect>            KillEffect;                                        // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            NoMovementEffect;                                  // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        HoldTime;                                          // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x0528(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ButtonDown;                                        // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_KillSelf(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void KillSelf();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_KillSelf_C">();
	}
	static class UGA_KillSelf_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_KillSelf_C>();
	}
};
static_assert(alignof(UGA_KillSelf_C) == 0x000008, "Wrong alignment on UGA_KillSelf_C");
static_assert(sizeof(UGA_KillSelf_C) == 0x000538, "Wrong size on UGA_KillSelf_C");
static_assert(offsetof(UGA_KillSelf_C, UberGraphFrame) == 0x000508, "Member 'UGA_KillSelf_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_KillSelf_C, KillEffect) == 0x000510, "Member 'UGA_KillSelf_C::KillEffect' has a wrong offset!");
static_assert(offsetof(UGA_KillSelf_C, NoMovementEffect) == 0x000518, "Member 'UGA_KillSelf_C::NoMovementEffect' has a wrong offset!");
static_assert(offsetof(UGA_KillSelf_C, HoldTime) == 0x000520, "Member 'UGA_KillSelf_C::HoldTime' has a wrong offset!");
static_assert(offsetof(UGA_KillSelf_C, Timer) == 0x000528, "Member 'UGA_KillSelf_C::Timer' has a wrong offset!");
static_assert(offsetof(UGA_KillSelf_C, ButtonDown) == 0x000530, "Member 'UGA_KillSelf_C::ButtonDown' has a wrong offset!");

}

