#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_LimbRechargerBackpack

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_LimbRechargerBackpack.GA_LimbRechargerBackpack_C.ExecuteUbergraph_GA_LimbRechargerBackpack
// 0x0014 (0x0014 - 0x0000)
struct GA_LimbRechargerBackpack_C_ExecuteUbergraph_GA_LimbRechargerBackpack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D86[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_LimbRechargerBackpack_C_ExecuteUbergraph_GA_LimbRechargerBackpack) == 0x000004, "Wrong alignment on GA_LimbRechargerBackpack_C_ExecuteUbergraph_GA_LimbRechargerBackpack");
static_assert(sizeof(GA_LimbRechargerBackpack_C_ExecuteUbergraph_GA_LimbRechargerBackpack) == 0x000014, "Wrong size on GA_LimbRechargerBackpack_C_ExecuteUbergraph_GA_LimbRechargerBackpack");
static_assert(offsetof(GA_LimbRechargerBackpack_C_ExecuteUbergraph_GA_LimbRechargerBackpack, EntryPoint) == 0x000000, "Member 'GA_LimbRechargerBackpack_C_ExecuteUbergraph_GA_LimbRechargerBackpack::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_LimbRechargerBackpack_C_ExecuteUbergraph_GA_LimbRechargerBackpack, K2Node_Event_bWasCancelled) == 0x000004, "Member 'GA_LimbRechargerBackpack_C_ExecuteUbergraph_GA_LimbRechargerBackpack::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_LimbRechargerBackpack_C_ExecuteUbergraph_GA_LimbRechargerBackpack, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000008, "Member 'GA_LimbRechargerBackpack_C_ExecuteUbergraph_GA_LimbRechargerBackpack::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_LimbRechargerBackpack_C_ExecuteUbergraph_GA_LimbRechargerBackpack, CallFunc_K2_HasAuthority_ReturnValue) == 0x000010, "Member 'GA_LimbRechargerBackpack_C_ExecuteUbergraph_GA_LimbRechargerBackpack::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");

// Function GA_LimbRechargerBackpack.GA_LimbRechargerBackpack_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_LimbRechargerBackpack_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_LimbRechargerBackpack_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_LimbRechargerBackpack_C_K2_OnEndAbility");
static_assert(sizeof(GA_LimbRechargerBackpack_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_LimbRechargerBackpack_C_K2_OnEndAbility");
static_assert(offsetof(GA_LimbRechargerBackpack_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_LimbRechargerBackpack_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

