#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_MissionMinigame

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_MissionMinigame.GA_MissionMinigame_C.ExecuteUbergraph_GA_MissionMinigame
// 0x0008 (0x0008 - 0x0000)
struct GA_MissionMinigame_C_ExecuteUbergraph_GA_MissionMinigame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MissionMinigame_C_ExecuteUbergraph_GA_MissionMinigame) == 0x000004, "Wrong alignment on GA_MissionMinigame_C_ExecuteUbergraph_GA_MissionMinigame");
static_assert(sizeof(GA_MissionMinigame_C_ExecuteUbergraph_GA_MissionMinigame) == 0x000008, "Wrong size on GA_MissionMinigame_C_ExecuteUbergraph_GA_MissionMinigame");
static_assert(offsetof(GA_MissionMinigame_C_ExecuteUbergraph_GA_MissionMinigame, EntryPoint) == 0x000000, "Member 'GA_MissionMinigame_C_ExecuteUbergraph_GA_MissionMinigame::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_MissionMinigame_C_ExecuteUbergraph_GA_MissionMinigame, K2Node_Event_bWasCancelled) == 0x000004, "Member 'GA_MissionMinigame_C_ExecuteUbergraph_GA_MissionMinigame::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function GA_MissionMinigame.GA_MissionMinigame_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_MissionMinigame_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MissionMinigame_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_MissionMinigame_C_K2_OnEndAbility");
static_assert(sizeof(GA_MissionMinigame_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_MissionMinigame_C_K2_OnEndAbility");
static_assert(offsetof(GA_MissionMinigame_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_MissionMinigame_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

