#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PassengerState

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function GA_PassengerState.GA_PassengerState_C.OnSeatChanged
// 0x0010 (0x0010 - 0x0000)
struct GA_PassengerState_C_OnSeatChanged final
{
public:
	class AGzCharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzVehicleSeatType                            NewSeat;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzVehicleSeatType                            OldSeat;                                           // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PassengerState_C_OnSeatChanged) == 0x000008, "Wrong alignment on GA_PassengerState_C_OnSeatChanged");
static_assert(sizeof(GA_PassengerState_C_OnSeatChanged) == 0x000010, "Wrong size on GA_PassengerState_C_OnSeatChanged");
static_assert(offsetof(GA_PassengerState_C_OnSeatChanged, Character) == 0x000000, "Member 'GA_PassengerState_C_OnSeatChanged::Character' has a wrong offset!");
static_assert(offsetof(GA_PassengerState_C_OnSeatChanged, NewSeat) == 0x000008, "Member 'GA_PassengerState_C_OnSeatChanged::NewSeat' has a wrong offset!");
static_assert(offsetof(GA_PassengerState_C_OnSeatChanged, OldSeat) == 0x000009, "Member 'GA_PassengerState_C_OnSeatChanged::OldSeat' has a wrong offset!");

// Function GA_PassengerState.GA_PassengerState_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_PassengerState_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_PassengerState_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_PassengerState_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_PassengerState_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_PassengerState_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_PassengerState_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_PassengerState_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_PassengerState.GA_PassengerState_C.ExecuteUbergraph_GA_PassengerState
// 0x00F0 (0x00F0 - 0x0000)
struct GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6100[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	class AGzCharacter*                           K2Node_CustomEvent_Character;                      // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzVehicleSeatType                            K2Node_CustomEvent_NewSeat;                        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzVehicleSeatType                            K2Node_CustomEvent_OldSeat;                        // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6101[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzCharacter* Character, EGzVehicleSeatType NewSeat, EGzVehicleSeatType OldSeat)> K2Node_CreateDelegate_OutputDelegate;              // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6102[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue_1;         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState) == 0x000008, "Wrong alignment on GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState");
static_assert(sizeof(GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState) == 0x0000F0, "Wrong size on GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState");
static_assert(offsetof(GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState, EntryPoint) == 0x000000, "Member 'GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState, K2Node_Event_EventData) == 0x000008, "Member 'GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState, K2Node_CustomEvent_Character) == 0x0000B8, "Member 'GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState, K2Node_CustomEvent_NewSeat) == 0x0000C0, "Member 'GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState::K2Node_CustomEvent_NewSeat' has a wrong offset!");
static_assert(offsetof(GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState, K2Node_CustomEvent_OldSeat) == 0x0000C1, "Member 'GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState::K2Node_CustomEvent_OldSeat' has a wrong offset!");
static_assert(offsetof(GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState, CallFunc_GetOwningCharacter_ReturnValue) == 0x0000C8, "Member 'GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState, K2Node_CreateDelegate_OutputDelegate) == 0x0000D0, "Member 'GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000E0, "Member 'GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState, CallFunc_K2_HasAuthority_ReturnValue) == 0x0000E1, "Member 'GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState, CallFunc_GetOwningCharacter_ReturnValue_1) == 0x0000E8, "Member 'GA_PassengerState_C_ExecuteUbergraph_GA_PassengerState::CallFunc_GetOwningCharacter_ReturnValue_1' has a wrong offset!");

}

