#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Phosphorous_Dart

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Phosphorous_Dart.GA_Phosphorous_Dart_C.CalculateLaunchParams
// 0x0280 (0x0280 - 0x0000)
struct GA_Phosphorous_Dart_C_CalculateLaunchParams final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                LaunchLocation;                                    // 0x00F8(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LaunchDirection;                                   // 0x0110(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LaunchSpeed;                                       // 0x0128(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GravityScale;                                      // 0x0130(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Param_SpawnRightOffset;                            // 0x0138(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetingLocationInfo  CallFunc_MakeTargetLocationInfoFromOwnerActor_ReturnValue; // 0x0150(0x00A0)(ContainsInstancedReference)
	struct FVector                                CallFunc_GetMissileDirection_ReturnValue;          // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6236[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Phosphorous_Dart_C_CalculateLaunchParams) == 0x000010, "Wrong alignment on GA_Phosphorous_Dart_C_CalculateLaunchParams");
static_assert(sizeof(GA_Phosphorous_Dart_C_CalculateLaunchParams) == 0x000280, "Wrong size on GA_Phosphorous_Dart_C_CalculateLaunchParams");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, Hit) == 0x000000, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::Hit' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, LaunchLocation) == 0x0000F8, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::LaunchLocation' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, LaunchDirection) == 0x000110, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::LaunchDirection' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, LaunchSpeed) == 0x000128, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::LaunchSpeed' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, GravityScale) == 0x000130, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::GravityScale' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, Param_SpawnRightOffset) == 0x000138, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::Param_SpawnRightOffset' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, CallFunc_MakeTargetLocationInfoFromOwnerActor_ReturnValue) == 0x000150, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::CallFunc_MakeTargetLocationInfoFromOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, CallFunc_GetMissileDirection_ReturnValue) == 0x0001F0, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::CallFunc_GetMissileDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, CallFunc_BreakTransform_Location) == 0x000208, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, CallFunc_BreakTransform_Rotation) == 0x000220, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, CallFunc_BreakTransform_Scale) == 0x000238, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, CallFunc_IsValid_ReturnValue) == 0x000250, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000258, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, CallFunc_Lerp_ReturnValue) == 0x000270, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_CalculateLaunchParams, CallFunc_Lerp_ReturnValue_1) == 0x000278, "Member 'GA_Phosphorous_Dart_C_CalculateLaunchParams::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");

// Function GA_Phosphorous_Dart.GA_Phosphorous_Dart_C.ClientCharge
// 0x0001 (0x0001 - 0x0000)
struct GA_Phosphorous_Dart_C_ClientCharge final
{
public:
	bool                                          CallFunc_IsLocal_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Phosphorous_Dart_C_ClientCharge) == 0x000001, "Wrong alignment on GA_Phosphorous_Dart_C_ClientCharge");
static_assert(sizeof(GA_Phosphorous_Dart_C_ClientCharge) == 0x000001, "Wrong size on GA_Phosphorous_Dart_C_ClientCharge");
static_assert(offsetof(GA_Phosphorous_Dart_C_ClientCharge, CallFunc_IsLocal_ReturnValue) == 0x000000, "Member 'GA_Phosphorous_Dart_C_ClientCharge::CallFunc_IsLocal_ReturnValue' has a wrong offset!");

// Function GA_Phosphorous_Dart.GA_Phosphorous_Dart_C.DetonateDartIfDamagedArm
// 0x0090 (0x0090 - 0x0000)
struct GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm final
{
public:
	double                                        NewHealthValue;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6237[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_CurrentLimbDamage_ImplicitCast; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm) == 0x000008, "Wrong alignment on GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm");
static_assert(sizeof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm) == 0x000090, "Wrong size on GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm");
static_assert(offsetof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm, NewHealthValue) == 0x000000, "Member 'GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm::NewHealthValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000008, "Member 'GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000028, "Member 'GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000038, "Member 'GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm, CallFunc_Conv_BoolToString_ReturnValue) == 0x000040, "Member 'GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000050, "Member 'GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000060, "Member 'GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000068, "Member 'GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000078, "Member 'GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm, K2Node_VariableSet_CurrentLimbDamage_ImplicitCast) == 0x000088, "Member 'GA_Phosphorous_Dart_C_DetonateDartIfDamagedArm::K2Node_VariableSet_CurrentLimbDamage_ImplicitCast' has a wrong offset!");

// Function GA_Phosphorous_Dart.GA_Phosphorous_Dart_C.ExecuteUbergraph_GA_Phosphorous_Dart
// 0x04B0 (0x04B0 - 0x0000)
struct GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6238[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float Time)>                   K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Time_1;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzAT_WaitCustomInputRelease*           CallFunc_WaitCustomInputRelease_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6239[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_623A[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_623B[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data_1;                         // 0x0060(0x0028)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0088(0x0028)()
	class UGzAT_ServerWaitForTargetData*          CallFunc_ServerWaitForClientTargetData_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_623C[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_GetHitResultFromTargetData_ReturnValue;   // 0x00C0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue_1;                // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_623D[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x01E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_623E[0x4];                                     // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data;                           // 0x01F8(0x0028)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0220(0x0028)()
	class UGzAT_ServerWaitForTargetData*          CallFunc_ServerWaitForClientTargetData_ReturnValue_1; // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_623F[0x3];                                     // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Time;                           // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Time)>                   K2Node_CreateDelegate_OutputDelegate_6;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6240[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAT_WaitCustomInputPress*             CallFunc_WaitCustomInputPress_ReturnValue;         // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_1;            // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6241[0x2];                                     // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentCharges_ReturnValue;            // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_2;            // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6242[0x2];                                     // 0x0282(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0284(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_3;            // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6243[0x3];                                     // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x029C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6244[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue_2;                // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_4;            // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_5;            // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_6;            // 0x02C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_7;            // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6245[0x3];                                     // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x02C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_8;            // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x02DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6246[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_GetHitResultFromTargetData_ReturnValue_1; // 0x02E0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_CalculateLaunchParams_LaunchLocation;     // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalculateLaunchParams_LaunchDirection;    // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CalculateLaunchParams_LaunchSpeed;        // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CalculateLaunchParams_GravityScale;       // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_9;            // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6247[0x3];                                     // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x041C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0424(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0434(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6248[0x4];                                     // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6249[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMultiPartCharacter*                  K2Node_DynamicCast_AsGz_Multi_Part_Character;      // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_10;           // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_624A[0x6];                                     // 0x046A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue_3;                // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_11;           // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_624B[0x2];                                     // 0x047A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x047C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x048C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_624C[0x3];                                     // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue_4;                // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x04AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_624D[0x1];                                     // 0x04AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_LaunchDart_Speed_ImplicitCast;            // 0x04AC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart) == 0x000008, "Wrong alignment on GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart");
static_assert(sizeof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart) == 0x0004B0, "Wrong size on GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, EntryPoint) == 0x000000, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_K2_HasAuthority_ReturnValue) == 0x000004, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CustomEvent_Time_1) == 0x000018, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CustomEvent_Time_1' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, Temp_real_Variable) == 0x00001C, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_WaitCustomInputRelease_ReturnValue) == 0x000020, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_WaitCustomInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_WaitNetSync_ReturnValue) == 0x000040, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CreateDelegate_OutputDelegate_2) == 0x000048, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CustomEvent_Data_1) == 0x000060, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CustomEvent_Data_1' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, Temp_struct_Variable) == 0x000088, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_ServerWaitForClientTargetData_ReturnValue) == 0x0000B0, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_ServerWaitForClientTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_IsValid_ReturnValue_2) == 0x0000B8, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_GetHitResultFromTargetData_ReturnValue) == 0x0000C0, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_GetHitResultFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001B8, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_WaitNetSync_ReturnValue_1) == 0x0001C8, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_WaitNetSync_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001D0, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_IsValid_ReturnValue_3) == 0x0001E0, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001E4, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CustomEvent_Data) == 0x0001F8, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, Temp_struct_Variable_1) == 0x000220, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_ServerWaitForClientTargetData_ReturnValue_1) == 0x000248, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_ServerWaitForClientTargetData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_IsValid_ReturnValue_4) == 0x000250, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CustomEvent_Time) == 0x000254, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CreateDelegate_OutputDelegate_6) == 0x000258, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, Temp_real_Variable_1) == 0x000268, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_WaitCustomInputPress_ReturnValue) == 0x000270, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_WaitCustomInputPress_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_IsValid_ReturnValue_5) == 0x000278, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_K2_HasAuthority_ReturnValue_1) == 0x000279, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_K2_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_GetCurrentCharges_ReturnValue) == 0x00027C, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_GetCurrentCharges_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_K2_HasAuthority_ReturnValue_2) == 0x000280, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_K2_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000281, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, Temp_delegate_Variable) == 0x000284, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_PostEvent_ReturnValue) == 0x000294, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_K2_HasAuthority_ReturnValue_3) == 0x000298, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_K2_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CreateDelegate_OutputDelegate_7) == 0x00029C, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_WaitNetSync_ReturnValue_2) == 0x0002B0, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_WaitNetSync_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002B8, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_IsValid_ReturnValue_6) == 0x0002C0, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_K2_HasAuthority_ReturnValue_4) == 0x0002C1, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_K2_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_K2_HasAuthority_ReturnValue_5) == 0x0002C2, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_K2_HasAuthority_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_K2_HasAuthority_ReturnValue_6) == 0x0002C3, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_K2_HasAuthority_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_K2_HasAuthority_ReturnValue_7) == 0x0002C4, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_K2_HasAuthority_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CreateDelegate_OutputDelegate_8) == 0x0002C8, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_Event_bWasCancelled) == 0x0002D8, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_K2_HasAuthority_ReturnValue_8) == 0x0002D9, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_K2_HasAuthority_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_IsValid_ReturnValue_7) == 0x0002DA, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_K2_CommitAbility_ReturnValue) == 0x0002DB, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_GetHitResultFromTargetData_ReturnValue_1) == 0x0002E0, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_GetHitResultFromTargetData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_CalculateLaunchParams_LaunchLocation) == 0x0003D8, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_CalculateLaunchParams_LaunchLocation' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_CalculateLaunchParams_LaunchDirection) == 0x0003F0, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_CalculateLaunchParams_LaunchDirection' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_CalculateLaunchParams_LaunchSpeed) == 0x000408, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_CalculateLaunchParams_LaunchSpeed' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_CalculateLaunchParams_GravityScale) == 0x000410, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_CalculateLaunchParams_GravityScale' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_K2_HasAuthority_ReturnValue_9) == 0x000418, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_K2_HasAuthority_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00041C, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CreateDelegate_OutputDelegate_9) == 0x000424, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CreateDelegate_OutputDelegate_10) == 0x000434, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_GetOwningCharacter_ReturnValue) == 0x000448, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_DynamicCast_AsGz_Player_Character) == 0x000450, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_DynamicCast_bSuccess) == 0x000458, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_DynamicCast_AsGz_Multi_Part_Character) == 0x000460, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_DynamicCast_AsGz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_DynamicCast_bSuccess_1) == 0x000468, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_K2_HasAuthority_ReturnValue_10) == 0x000469, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_K2_HasAuthority_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_WaitNetSync_ReturnValue_3) == 0x000470, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_WaitNetSync_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_IsValid_ReturnValue_8) == 0x000478, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_K2_HasAuthority_ReturnValue_11) == 0x000479, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_K2_HasAuthority_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CreateDelegate_OutputDelegate_11) == 0x00047C, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, K2Node_CreateDelegate_OutputDelegate_12) == 0x00048C, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_IsValid_ReturnValue_9) == 0x00049C, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_WaitNetSync_ReturnValue_4) == 0x0004A0, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_WaitNetSync_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_IsValid_ReturnValue_10) == 0x0004A8, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_IsValid_ReturnValue_11) == 0x0004A9, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_IsValid_ReturnValue_12) == 0x0004AA, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart, CallFunc_LaunchDart_Speed_ImplicitCast) == 0x0004AC, "Member 'GA_Phosphorous_Dart_C_ExecuteUbergraph_GA_Phosphorous_Dart::CallFunc_LaunchDart_Speed_ImplicitCast' has a wrong offset!");

// Function GA_Phosphorous_Dart.GA_Phosphorous_Dart_C.FireMissile
// 0x0028 (0x0028 - 0x0000)
struct GA_Phosphorous_Dart_C_FireMissile final
{
public:
	struct FGameplayAbilityTargetDataHandle       HitResult;                                         // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Phosphorous_Dart_C_FireMissile) == 0x000008, "Wrong alignment on GA_Phosphorous_Dart_C_FireMissile");
static_assert(sizeof(GA_Phosphorous_Dart_C_FireMissile) == 0x000028, "Wrong size on GA_Phosphorous_Dart_C_FireMissile");
static_assert(offsetof(GA_Phosphorous_Dart_C_FireMissile, HitResult) == 0x000000, "Member 'GA_Phosphorous_Dart_C_FireMissile::HitResult' has a wrong offset!");

// Function GA_Phosphorous_Dart.GA_Phosphorous_Dart_C.Get Sockets
// 0x0190 (0x0190 - 0x0000)
struct GA_Phosphorous_Dart_C_Get_Sockets final
{
public:
	EGzLimbType                                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_624E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMultiPartCharacter*                  Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   SocketName;                                        // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_624F[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Temp_struct_Variable_1;                            // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Temp_byte_Variable_1;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6250[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6251[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzLimbComponent*                       CallFunc_GetLimbComponent_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable_2;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6252[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6253[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue_1;          // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Select_Default_1;                           // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_2;                           // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Phosphorous_Dart_C_Get_Sockets) == 0x000008, "Wrong alignment on GA_Phosphorous_Dart_C_Get_Sockets");
static_assert(sizeof(GA_Phosphorous_Dart_C_Get_Sockets) == 0x000190, "Wrong size on GA_Phosphorous_Dart_C_Get_Sockets");
static_assert(offsetof(GA_Phosphorous_Dart_C_Get_Sockets, Type) == 0x000000, "Member 'GA_Phosphorous_Dart_C_Get_Sockets::Type' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_Get_Sockets, Target) == 0x000008, "Member 'GA_Phosphorous_Dart_C_Get_Sockets::Target' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_Get_Sockets, Location) == 0x000010, "Member 'GA_Phosphorous_Dart_C_Get_Sockets::Location' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_Get_Sockets, Rotation) == 0x000028, "Member 'GA_Phosphorous_Dart_C_Get_Sockets::Rotation' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_Get_Sockets, SocketName) == 0x000040, "Member 'GA_Phosphorous_Dart_C_Get_Sockets::SocketName' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_Get_Sockets, Temp_struct_Variable) == 0x000048, "Member 'GA_Phosphorous_Dart_C_Get_Sockets::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_Get_Sockets, Temp_byte_Variable) == 0x000060, "Member 'GA_Phosphorous_Dart_C_Get_Sockets::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_Get_Sockets, Temp_struct_Variable_1) == 0x000068, "Member 'GA_Phosphorous_Dart_C_Get_Sockets::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Phosphorous_Dart_C_Get_Sockets, Temp_byte_Variable_1) == 0x000080, "Member 'GA_Phosphorous_Dart_C_Get_Sockets::Temp_byte_Variable_1' has a wrong offset!");
