#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Passive_CancelJetpack

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Passive_CancelJetpack.GA_Passive_CancelJetpack_C.Cancel
// 0x0010 (0x0010 - 0x0000)
struct GA_Passive_CancelJetpack_C_Cancel final
{
public:
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Passive_CancelJetpack_C_Cancel) == 0x000008, "Wrong alignment on GA_Passive_CancelJetpack_C_Cancel");
static_assert(sizeof(GA_Passive_CancelJetpack_C_Cancel) == 0x000010, "Wrong size on GA_Passive_CancelJetpack_C_Cancel");
static_assert(offsetof(GA_Passive_CancelJetpack_C_Cancel, CallFunc_GetOwningCharacter_ReturnValue) == 0x000000, "Member 'GA_Passive_CancelJetpack_C_Cancel::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CancelJetpack_C_Cancel, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'GA_Passive_CancelJetpack_C_Cancel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CancelJetpack_C_Cancel, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'GA_Passive_CancelJetpack_C_Cancel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GA_Passive_CancelJetpack.GA_Passive_CancelJetpack_C.ExecuteUbergraph_GA_Passive_CancelJetpack
// 0x0030 (0x0030 - 0x0000)
struct GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6543[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzAICharacter*                         K2Node_DynamicCast_AsGz_AICharacter;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6544[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CyberlimbsDummyPlayerDummy_C*       K2Node_DynamicCast_AsBP_Cyberlimbs_Dummy_Player_Dummy; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack) == 0x000008, "Wrong alignment on GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack");
static_assert(sizeof(GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack) == 0x000030, "Wrong size on GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack");
static_assert(offsetof(GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack, EntryPoint) == 0x000000, "Member 'GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack, CallFunc_GetOwningCharacter_ReturnValue) == 0x000008, "Member 'GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack, K2Node_DynamicCast_AsGz_AICharacter) == 0x000010, "Member 'GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack::K2Node_DynamicCast_AsGz_AICharacter' has a wrong offset!");
static_assert(offsetof(GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack, K2Node_DynamicCast_AsBP_Cyberlimbs_Dummy_Player_Dummy) == 0x000020, "Member 'GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack::K2Node_DynamicCast_AsBP_Cyberlimbs_Dummy_Player_Dummy' has a wrong offset!");
static_assert(offsetof(GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'GA_Passive_CancelJetpack_C_ExecuteUbergraph_GA_Passive_CancelJetpack::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

