#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_RetriggerSprint

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_RetriggerSprint.GA_RetriggerSprint_C.ExecuteUbergraph_GA_RetriggerSprint
// 0x00E8 (0x00E8 - 0x0000)
struct GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5916[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5917[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5918[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue_2;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5919[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591A[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591B[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryPressAbilityInputByTag_ReturnValue;    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591C[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591D[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591E[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue_3; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryPressAbilityInputByTag_ReturnValue_1;  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint) == 0x000008, "Wrong alignment on GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint");
static_assert(sizeof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint) == 0x0000E8, "Wrong size on GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, EntryPoint) == 0x000000, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000008, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_WaitGameplayTagRemove_ReturnValue_1) == 0x000028, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_WaitGameplayTagRemove_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_WaitGameplayTagRemove_ReturnValue_2) == 0x000048, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_WaitGameplayTagRemove_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, K2Node_CreateDelegate_OutputDelegate_2) == 0x000050, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_WaitDelay_ReturnValue) == 0x000068, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_IsValid_ReturnValue_3) == 0x000070, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, K2Node_CreateDelegate_OutputDelegate_3) == 0x000074, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000088, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_TryPressAbilityInputByTag_ReturnValue) == 0x000090, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_TryPressAbilityInputByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000098, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0000A0, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000B0, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue_2) == 0x0000B8, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x0000C0, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x0000D0, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue_3) == 0x0000D8, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_BooleanOR_ReturnValue) == 0x0000E0, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint, CallFunc_TryPressAbilityInputByTag_ReturnValue_1) == 0x0000E1, "Member 'GA_RetriggerSprint_C_ExecuteUbergraph_GA_RetriggerSprint::CallFunc_TryPressAbilityInputByTag_ReturnValue_1' has a wrong offset!");

}

