#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ReconDrone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ReconDrone.GA_ReconDrone_C
// 0x0148 (0x07C0 - 0x0678)
class UGA_ReconDrone_C : public UGzGA_BaseLimbAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0678(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           Montage;                                           // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGzMultiPartCharacter*                  As_Gz_Multi_Part_Character;                        // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0690(0x00F8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        MaxFlyDist;                                        // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetPositionBufferArrea;                         // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HandBoneName;                                      // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Actors_to_Ignore;                                  // 0x07A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      Object_Types;                                      // 0x07B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void EventReceived_B23032424C57984E1A685E8919B86C75(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void ExecuteUbergraph_GA_ReconDrone(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnBlendOut_B23032424C57984E1A685E8919B86C75();
	void OnCompleted_B23032424C57984E1A685E8919B86C75();
	void OnInterrupted_B23032424C57984E1A685E8919B86C75();
	void OnNotifyBegin_B23032424C57984E1A685E8919B86C75(class FName NotifyName);
	void OnNotifyEnd_B23032424C57984E1A685E8919B86C75(class FName NotifyName);
	void SendData(const struct FVector& _0__Location);
	void SpawnDroneEvent(const struct FGameplayAbilityTargetDataHandle& HitResult);
	void ValidData_9DABEAAC4126357C7F42FB9D5495B51D(const struct FGameplayAbilityTargetDataHandle& Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_ReconDrone_C">();
	}
	static class UGA_ReconDrone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ReconDrone_C>();
	}
};
static_assert(alignof(UGA_ReconDrone_C) == 0x000008, "Wrong alignment on UGA_ReconDrone_C");
static_assert(sizeof(UGA_ReconDrone_C) == 0x0007C0, "Wrong size on UGA_ReconDrone_C");
static_assert(offsetof(UGA_ReconDrone_C, UberGraphFrame) == 0x000678, "Member 'UGA_ReconDrone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_ReconDrone_C, Montage) == 0x000680, "Member 'UGA_ReconDrone_C::Montage' has a wrong offset!");
static_assert(offsetof(UGA_ReconDrone_C, As_Gz_Multi_Part_Character) == 0x000688, "Member 'UGA_ReconDrone_C::As_Gz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(UGA_ReconDrone_C, Hit) == 0x000690, "Member 'UGA_ReconDrone_C::Hit' has a wrong offset!");
static_assert(offsetof(UGA_ReconDrone_C, MaxFlyDist) == 0x000788, "Member 'UGA_ReconDrone_C::MaxFlyDist' has a wrong offset!");
static_assert(offsetof(UGA_ReconDrone_C, TargetPositionBufferArrea) == 0x000790, "Member 'UGA_ReconDrone_C::TargetPositionBufferArrea' has a wrong offset!");
static_assert(offsetof(UGA_ReconDrone_C, HandBoneName) == 0x000798, "Member 'UGA_ReconDrone_C::HandBoneName' has a wrong offset!");
static_assert(offsetof(UGA_ReconDrone_C, Actors_to_Ignore) == 0x0007A0, "Member 'UGA_ReconDrone_C::Actors_to_Ignore' has a wrong offset!");
static_assert(offsetof(UGA_ReconDrone_C, Object_Types) == 0x0007B0, "Member 'UGA_ReconDrone_C::Object_Types' has a wrong offset!");

}

