#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SelfRevive

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_SelfRevive.GA_SelfRevive_C.EventReceived_90D402304EFC08E071ACCD8C5CC64D7C
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SelfRevive_C_EventReceived_90D402304EFC08E071ACCD8C5CC64D7C final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SelfRevive_C_EventReceived_90D402304EFC08E071ACCD8C5CC64D7C) == 0x000008, "Wrong alignment on GA_SelfRevive_C_EventReceived_90D402304EFC08E071ACCD8C5CC64D7C");
static_assert(sizeof(GA_SelfRevive_C_EventReceived_90D402304EFC08E071ACCD8C5CC64D7C) == 0x0000B8, "Wrong size on GA_SelfRevive_C_EventReceived_90D402304EFC08E071ACCD8C5CC64D7C");
static_assert(offsetof(GA_SelfRevive_C_EventReceived_90D402304EFC08E071ACCD8C5CC64D7C, EventTag) == 0x000000, "Member 'GA_SelfRevive_C_EventReceived_90D402304EFC08E071ACCD8C5CC64D7C::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_EventReceived_90D402304EFC08E071ACCD8C5CC64D7C, EventData) == 0x000008, "Member 'GA_SelfRevive_C_EventReceived_90D402304EFC08E071ACCD8C5CC64D7C::EventData' has a wrong offset!");

// Function GA_SelfRevive.GA_SelfRevive_C.ExecuteUbergraph_GA_SelfRevive
// 0x0168 (0x0168 - 0x0000)
struct GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E70[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_Array_Random_OutItem;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E71[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAT_PlayMontageAndWaitForEvent*       CallFunc_PlayMontageAndWaitForEvent_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E72[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag;                       // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E73[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_EventData;                      // 0x0050(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E74[0x2];                                     // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0144(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E75[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive) == 0x000008, "Wrong alignment on GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive");
static_assert(sizeof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive) == 0x000168, "Wrong size on GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, EntryPoint) == 0x000000, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, K2Node_CustomEvent_NotifyName_1) == 0x000004, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, CallFunc_Array_Random_OutItem) == 0x000010, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, CallFunc_Array_Random_OutIndex) == 0x000018, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, CallFunc_PlayMontageAndWaitForEvent_ReturnValue) == 0x000020, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::CallFunc_PlayMontageAndWaitForEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, K2Node_CustomEvent_NotifyName) == 0x00003C, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, K2Node_CustomEvent_EventTag) == 0x000044, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, K2Node_CustomEvent_EventData) == 0x000050, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::K2Node_CustomEvent_EventData' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, K2Node_CreateDelegate_OutputDelegate_1) == 0x000100, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, K2Node_CreateDelegate_OutputDelegate_2) == 0x000110, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, K2Node_CreateDelegate_OutputDelegate_3) == 0x000120, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, K2Node_CreateDelegate_OutputDelegate_4) == 0x000130, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, K2Node_Event_bWasCancelled) == 0x000140, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, CallFunc_Not_PreBool_ReturnValue) == 0x000141, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000144, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, CallFunc_K2_HasAuthority_ReturnValue) == 0x00014C, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000150, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive, K2Node_CreateDelegate_OutputDelegate_5) == 0x000158, "Member 'GA_SelfRevive_C_ExecuteUbergraph_GA_SelfRevive::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");

// Function GA_SelfRevive.GA_SelfRevive_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_SelfRevive_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SelfRevive_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_SelfRevive_C_K2_OnEndAbility");
static_assert(sizeof(GA_SelfRevive_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_SelfRevive_C_K2_OnEndAbility");
static_assert(offsetof(GA_SelfRevive_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_SelfRevive_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_SelfRevive.GA_SelfRevive_C.OnNotifyBegin_90D402304EFC08E071ACCD8C5CC64D7C
// 0x0008 (0x0008 - 0x0000)
struct GA_SelfRevive_C_OnNotifyBegin_90D402304EFC08E071ACCD8C5CC64D7C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SelfRevive_C_OnNotifyBegin_90D402304EFC08E071ACCD8C5CC64D7C) == 0x000004, "Wrong alignment on GA_SelfRevive_C_OnNotifyBegin_90D402304EFC08E071ACCD8C5CC64D7C");
static_assert(sizeof(GA_SelfRevive_C_OnNotifyBegin_90D402304EFC08E071ACCD8C5CC64D7C) == 0x000008, "Wrong size on GA_SelfRevive_C_OnNotifyBegin_90D402304EFC08E071ACCD8C5CC64D7C");
static_assert(offsetof(GA_SelfRevive_C_OnNotifyBegin_90D402304EFC08E071ACCD8C5CC64D7C, NotifyName) == 0x000000, "Member 'GA_SelfRevive_C_OnNotifyBegin_90D402304EFC08E071ACCD8C5CC64D7C::NotifyName' has a wrong offset!");

// Function GA_SelfRevive.GA_SelfRevive_C.OnNotifyEnd_90D402304EFC08E071ACCD8C5CC64D7C
// 0x0008 (0x0008 - 0x0000)
struct GA_SelfRevive_C_OnNotifyEnd_90D402304EFC08E071ACCD8C5CC64D7C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SelfRevive_C_OnNotifyEnd_90D402304EFC08E071ACCD8C5CC64D7C) == 0x000004, "Wrong alignment on GA_SelfRevive_C_OnNotifyEnd_90D402304EFC08E071ACCD8C5CC64D7C");
static_assert(sizeof(GA_SelfRevive_C_OnNotifyEnd_90D402304EFC08E071ACCD8C5CC64D7C) == 0x000008, "Wrong size on GA_SelfRevive_C_OnNotifyEnd_90D402304EFC08E071ACCD8C5CC64D7C");
static_assert(offsetof(GA_SelfRevive_C_OnNotifyEnd_90D402304EFC08E071ACCD8C5CC64D7C, NotifyName) == 0x000000, "Member 'GA_SelfRevive_C_OnNotifyEnd_90D402304EFC08E071ACCD8C5CC64D7C::NotifyName' has a wrong offset!");

// Function GA_SelfRevive.GA_SelfRevive_C.Post Revived Message
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SelfRevive_C_Post_Revived_Message final
{
public:
	class UGzPlayerRevivedMessage*                Message;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzGameMessageSubsystem*                MessageSubsystem;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         PlayerState;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UGzPlayerRevivedMessage*                CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzTeam*                                CallFunc_GetTeam_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E76[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzGameModeSubsystem*                   CallFunc_GetSubsystem_OutSubsystem;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzGetSubsystemResult                         CallFunc_GetSubsystem_OutExecNodes;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E77[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerId_ReturnValue;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E78[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzAdvancedIdType                      K2Node_MakeStruct_GzAdvancedIdType;                // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E79[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzGameMessageSubsystem*                K2Node_DynamicCast_AsGz_Game_Message_Subsystem;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E7A[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0060(0x0048)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E7B[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetPlayerStateFromContext_ReturnValue;    // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SelfRevive_C_Post_Revived_Message) == 0x000008, "Wrong alignment on GA_SelfRevive_C_Post_Revived_Message");
static_assert(sizeof(GA_SelfRevive_C_Post_Revived_Message) == 0x0000B8, "Wrong size on GA_SelfRevive_C_Post_Revived_Message");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, Message) == 0x000000, "Member 'GA_SelfRevive_C_Post_Revived_Message::Message' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, MessageSubsystem) == 0x000008, "Member 'GA_SelfRevive_C_Post_Revived_Message::MessageSubsystem' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, PlayerState) == 0x000010, "Member 'GA_SelfRevive_C_Post_Revived_Message::PlayerState' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'GA_SelfRevive_C_Post_Revived_Message::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, CallFunc_GetTeam_ReturnValue) == 0x000020, "Member 'GA_SelfRevive_C_Post_Revived_Message::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GA_SelfRevive_C_Post_Revived_Message::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, CallFunc_GetSubsystem_OutSubsystem) == 0x000030, "Member 'GA_SelfRevive_C_Post_Revived_Message::CallFunc_GetSubsystem_OutSubsystem' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, CallFunc_GetSubsystem_OutExecNodes) == 0x000038, "Member 'GA_SelfRevive_C_Post_Revived_Message::CallFunc_GetSubsystem_OutExecNodes' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, CallFunc_GetPlayerId_ReturnValue) == 0x00003C, "Member 'GA_SelfRevive_C_Post_Revived_Message::CallFunc_GetPlayerId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'GA_SelfRevive_C_Post_Revived_Message::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, K2Node_MakeStruct_GzAdvancedIdType) == 0x000044, "Member 'GA_SelfRevive_C_Post_Revived_Message::K2Node_MakeStruct_GzAdvancedIdType' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, K2Node_DynamicCast_AsGz_Game_Message_Subsystem) == 0x000050, "Member 'GA_SelfRevive_C_Post_Revived_Message::K2Node_DynamicCast_AsGz_Game_Message_Subsystem' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GA_SelfRevive_C_Post_Revived_Message::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, CallFunc_GetActorInfo_ReturnValue) == 0x000060, "Member 'GA_SelfRevive_C_Post_Revived_Message::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'GA_SelfRevive_C_Post_Revived_Message::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, CallFunc_IsValid_ReturnValue_2) == 0x0000A9, "Member 'GA_SelfRevive_C_Post_Revived_Message::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_SelfRevive_C_Post_Revived_Message, CallFunc_GetPlayerStateFromContext_ReturnValue) == 0x0000B0, "Member 'GA_SelfRevive_C_Post_Revived_Message::CallFunc_GetPlayerStateFromContext_ReturnValue' has a wrong offset!");

}

