#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SmashLandingLegs

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SmashLandingLegs.GA_SmashLandingLegs_C
// 0x0018 (0x0990 - 0x0978)
class UGA_SmashLandingLegs_C final : public UGzGA_SmashLanding
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0978(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            LandingEffectHandle;                               // 0x0980(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      HoverVfx;                                          // 0x0988(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDashEnded();
	void BP_OnDashStarted();
	void BP_OnFalling();
	void BP_OnJumpStarted();
	void BP_OnLanding();
	void BP_OnSmashLanding(const struct FHitResult& HitResult);
	void BP_OnTargetChanged(bool bIsOutOfRange);
	void BP_OnTargetingEnded();
	void BP_OnTargetingStarted();
	void ExecuteUbergraph_GA_SmashLandingLegs(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SmashLandingLegs_C">();
	}
	static class UGA_SmashLandingLegs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SmashLandingLegs_C>();
	}
};
static_assert(alignof(UGA_SmashLandingLegs_C) == 0x000008, "Wrong alignment on UGA_SmashLandingLegs_C");
static_assert(sizeof(UGA_SmashLandingLegs_C) == 0x000990, "Wrong size on UGA_SmashLandingLegs_C");
static_assert(offsetof(UGA_SmashLandingLegs_C, UberGraphFrame) == 0x000978, "Member 'UGA_SmashLandingLegs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_SmashLandingLegs_C, LandingEffectHandle) == 0x000980, "Member 'UGA_SmashLandingLegs_C::LandingEffectHandle' has a wrong offset!");
static_assert(offsetof(UGA_SmashLandingLegs_C, HoverVfx) == 0x000988, "Member 'UGA_SmashLandingLegs_C::HoverVfx' has a wrong offset!");

}

