#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SelfRevive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SelfRevive.GA_SelfRevive_C
// 0x0028 (0x0588 - 0x0560)
class UGA_SelfRevive_C final : public UGzGA_ConsumeHold
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class UGameplayEffect>            ReviveEffect;                                      // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            NoMovementEffect;                                  // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   SelfReviveAnimMontages;                            // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void EventReceived_90D402304EFC08E071ACCD8C5CC64D7C(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void ExecuteUbergraph_GA_SelfRevive(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_90D402304EFC08E071ACCD8C5CC64D7C();
	void OnCompleted_90D402304EFC08E071ACCD8C5CC64D7C();
	void OnInterrupted_90D402304EFC08E071ACCD8C5CC64D7C();
	void OnNotifyBegin_90D402304EFC08E071ACCD8C5CC64D7C(class FName NotifyName);
	void OnNotifyEnd_90D402304EFC08E071ACCD8C5CC64D7C(class FName NotifyName);
	void Post_Revived_Message();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SelfRevive_C">();
	}
	static class UGA_SelfRevive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SelfRevive_C>();
	}
};
static_assert(alignof(UGA_SelfRevive_C) == 0x000008, "Wrong alignment on UGA_SelfRevive_C");
static_assert(sizeof(UGA_SelfRevive_C) == 0x000588, "Wrong size on UGA_SelfRevive_C");
static_assert(offsetof(UGA_SelfRevive_C, UberGraphFrame) == 0x000560, "Member 'UGA_SelfRevive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_SelfRevive_C, ReviveEffect) == 0x000568, "Member 'UGA_SelfRevive_C::ReviveEffect' has a wrong offset!");
static_assert(offsetof(UGA_SelfRevive_C, NoMovementEffect) == 0x000570, "Member 'UGA_SelfRevive_C::NoMovementEffect' has a wrong offset!");
static_assert(offsetof(UGA_SelfRevive_C, SelfReviveAnimMontages) == 0x000578, "Member 'UGA_SelfRevive_C::SelfReviveAnimMontages' has a wrong offset!");

}

