#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SwapLimb

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_SwapLimb.GA_SwapLimb_C.ExecuteUbergraph_GA_SwapLimb
// 0x0130 (0x0130 - 0x0000)
struct GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639F[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0028(0x0048)(ContainsInstancedReference)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue_1;               // 0x0070(0x0048)(ContainsInstancedReference)
	class ABP_PlayerCharacter_C*                  K2Node_DynamicCast_AsBP_Player_Character;          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A0[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  K2Node_DynamicCast_AsBP_Player_Character_1;        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A1[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue_2;               // 0x00D8(0x0048)(ContainsInstancedReference)
	class ABP_PlayerCharacter_C*                  K2Node_DynamicCast_AsBP_Player_Character_2;        // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb) == 0x000008, "Wrong alignment on GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb");
static_assert(sizeof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb) == 0x000130, "Wrong size on GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb");
static_assert(offsetof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb, EntryPoint) == 0x000000, "Member 'GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb, K2Node_Event_bWasCancelled) == 0x000024, "Member 'GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb, CallFunc_GetActorInfo_ReturnValue) == 0x000028, "Member 'GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb, CallFunc_GetActorInfo_ReturnValue_1) == 0x000070, "Member 'GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb::CallFunc_GetActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb, K2Node_DynamicCast_AsBP_Player_Character) == 0x0000B8, "Member 'GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb::K2Node_DynamicCast_AsBP_Player_Character' has a wrong offset!");
static_assert(offsetof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb, K2Node_DynamicCast_AsBP_Player_Character_1) == 0x0000C8, "Member 'GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb::K2Node_DynamicCast_AsBP_Player_Character_1' has a wrong offset!");
static_assert(offsetof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb, CallFunc_GetActorInfo_ReturnValue_2) == 0x0000D8, "Member 'GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb::CallFunc_GetActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb, K2Node_DynamicCast_AsBP_Player_Character_2) == 0x000120, "Member 'GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb::K2Node_DynamicCast_AsBP_Player_Character_2' has a wrong offset!");
static_assert(offsetof(GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'GA_SwapLimb_C_ExecuteUbergraph_GA_SwapLimb::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function GA_SwapLimb.GA_SwapLimb_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_SwapLimb_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SwapLimb_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_SwapLimb_C_K2_OnEndAbility");
static_assert(sizeof(GA_SwapLimb_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_SwapLimb_C_K2_OnEndAbility");
static_assert(offsetof(GA_SwapLimb_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_SwapLimb_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

