#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SmashLandingLegs

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_SmashLandingLegs.GA_SmashLandingLegs_C.BP_OnSmashLanding
// 0x00F8 (0x00F8 - 0x0000)
struct GA_SmashLandingLegs_C_BP_OnSmashLanding final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_SmashLandingLegs_C_BP_OnSmashLanding) == 0x000008, "Wrong alignment on GA_SmashLandingLegs_C_BP_OnSmashLanding");
static_assert(sizeof(GA_SmashLandingLegs_C_BP_OnSmashLanding) == 0x0000F8, "Wrong size on GA_SmashLandingLegs_C_BP_OnSmashLanding");
static_assert(offsetof(GA_SmashLandingLegs_C_BP_OnSmashLanding, HitResult) == 0x000000, "Member 'GA_SmashLandingLegs_C_BP_OnSmashLanding::HitResult' has a wrong offset!");

// Function GA_SmashLandingLegs.GA_SmashLandingLegs_C.BP_OnTargetChanged
// 0x0001 (0x0001 - 0x0000)
struct GA_SmashLandingLegs_C_BP_OnTargetChanged final
{
public:
	bool                                          bIsOutOfRange;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SmashLandingLegs_C_BP_OnTargetChanged) == 0x000001, "Wrong alignment on GA_SmashLandingLegs_C_BP_OnTargetChanged");
static_assert(sizeof(GA_SmashLandingLegs_C_BP_OnTargetChanged) == 0x000001, "Wrong size on GA_SmashLandingLegs_C_BP_OnTargetChanged");
static_assert(offsetof(GA_SmashLandingLegs_C_BP_OnTargetChanged, bIsOutOfRange) == 0x000000, "Member 'GA_SmashLandingLegs_C_BP_OnTargetChanged::bIsOutOfRange' has a wrong offset!");

// Function GA_SmashLandingLegs.GA_SmashLandingLegs_C.ExecuteUbergraph_GA_SmashLandingLegs
// 0x0348 (0x0348 - 0x0000)
struct GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58FD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           CallFunc_GetOwningCharacter_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0028(0x0018)()
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58FE[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58FF[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5900[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0070(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue; // 0x0168(0x00D8)(ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue_1; // 0x0240(0x00D8)(ContainsInstancedReference)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsOutOfRange;                        // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5901[0x6];                                     // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SmashGroundTargetPreview_C*         K2Node_DynamicCast_AsBP_Smash_Ground_Target_Preview; // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5902[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5903[0x3];                                     // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x033C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_1;            // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs) == 0x000008, "Wrong alignment on GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs");
static_assert(sizeof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs) == 0x000348, "Wrong size on GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, EntryPoint) == 0x000000, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_GetOwningCharacter_ReturnValue) == 0x000008, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_GetGzAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_GetGzAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_GetOwningCharacter_ReturnValue_1) == 0x000018, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_GetOwningCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000020, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_MakeEffectContext_ReturnValue) == 0x000028, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_K2_HasAuthority_ReturnValue) == 0x000040, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000048, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_GetGzAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000058, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000068, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, K2Node_Event_HitResult) == 0x000070, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue) == 0x000168, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue_1) == 0x000240, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, K2Node_Event_bWasCancelled) == 0x000318, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, K2Node_Event_bIsOutOfRange) == 0x000319, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::K2Node_Event_bIsOutOfRange' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, K2Node_DynamicCast_AsBP_Smash_Ground_Target_Preview) == 0x000320, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::K2Node_DynamicCast_AsBP_Smash_Ground_Target_Preview' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, K2Node_DynamicCast_bSuccess) == 0x000328, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_GetPlayerController_ReturnValue) == 0x000330, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_IsLocallyControlled_ReturnValue) == 0x000338, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00033C, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs, CallFunc_K2_HasAuthority_ReturnValue_1) == 0x000344, "Member 'GA_SmashLandingLegs_C_ExecuteUbergraph_GA_SmashLandingLegs::CallFunc_K2_HasAuthority_ReturnValue_1' has a wrong offset!");

// Function GA_SmashLandingLegs.GA_SmashLandingLegs_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_SmashLandingLegs_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SmashLandingLegs_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_SmashLandingLegs_C_K2_OnEndAbility");
static_assert(sizeof(GA_SmashLandingLegs_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_SmashLandingLegs_C_K2_OnEndAbility");
static_assert(offsetof(GA_SmashLandingLegs_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_SmashLandingLegs_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

