#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Tether

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "G01_structs.hpp"
#include "E_TetherLimbState_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Tether.GA_Tether_C.AttachTetherEnd
// 0x0018 (0x0018 - 0x0000)
struct GA_Tether_C_AttachTetherEnd final
{
public:
	class ABP_TetherEnd_C*                        TetherEnd;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 NewParentActor;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Tether_C_AttachTetherEnd) == 0x000008, "Wrong alignment on GA_Tether_C_AttachTetherEnd");
static_assert(sizeof(GA_Tether_C_AttachTetherEnd) == 0x000018, "Wrong size on GA_Tether_C_AttachTetherEnd");
static_assert(offsetof(GA_Tether_C_AttachTetherEnd, TetherEnd) == 0x000000, "Member 'GA_Tether_C_AttachTetherEnd::TetherEnd' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_AttachTetherEnd, NewParentActor) == 0x000008, "Member 'GA_Tether_C_AttachTetherEnd::NewParentActor' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_AttachTetherEnd, CallFunc_K2_AttachToActor_ReturnValue) == 0x000010, "Member 'GA_Tether_C_AttachTetherEnd::CallFunc_K2_AttachToActor_ReturnValue' has a wrong offset!");

// Function GA_Tether.GA_Tether_C.Cleanup
// 0x001C (0x001C - 0x0000)
struct GA_Tether_C_Cleanup final
{
public:
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6431[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Tether_C_Cleanup) == 0x000004, "Wrong alignment on GA_Tether_C_Cleanup");
static_assert(sizeof(GA_Tether_C_Cleanup) == 0x00001C, "Wrong size on GA_Tether_C_Cleanup");
static_assert(offsetof(GA_Tether_C_Cleanup, CallFunc_K2_HasAuthority_ReturnValue) == 0x000000, "Member 'GA_Tether_C_Cleanup::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_Cleanup, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Tether_C_Cleanup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_Cleanup, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'GA_Tether_C_Cleanup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_Cleanup, CallFunc_IsValid_ReturnValue_1) == 0x000015, "Member 'GA_Tether_C_Cleanup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_Cleanup, CallFunc_IsValid_ReturnValue_2) == 0x000016, "Member 'GA_Tether_C_Cleanup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_Cleanup, CallFunc_Not_PreBool_ReturnValue) == 0x000017, "Member 'GA_Tether_C_Cleanup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_Cleanup, CallFunc_BooleanAND_ReturnValue) == 0x000018, "Member 'GA_Tether_C_Cleanup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GA_Tether.GA_Tether_C.ExecuteUbergraph_GA_Tether
// 0x0A20 (0x0A20 - 0x0000)
struct GA_Tether_C_ExecuteUbergraph_GA_Tether final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6432[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Time)>                   K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6433[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Time_1;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6434[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAT_WaitCustomInputPress*             CallFunc_WaitCustomInputPress_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6435[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6436[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data_1;                         // 0x0050(0x0028)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0078(0x0028)()
	class UGzAT_ServerWaitForTargetData*          CallFunc_ServerWaitForClientTargetData_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6437[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_GetHitResultFromTargetData_ReturnValue;   // 0x00B0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data;                           // 0x01A8(0x0028)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x01E0(0x0028)()
	class UGzAT_ServerWaitForTargetData*          CallFunc_ServerWaitForClientTargetData_ReturnValue_1; // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6438[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_GetHitResultFromTargetData_ReturnValue_1; // 0x0218(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_CustomEvent_Time;                           // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Time)>                   K2Node_CreateDelegate_OutputDelegate_3;            // 0x0314(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzAT_WaitCustomInputPress*             CallFunc_WaitCustomInputPress_ReturnValue_1;       // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6439[0x3];                                     // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0334(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_643A[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue_1;                // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateData_IsValid;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_643B[0x2];                                     // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0354(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_643C[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue_2;                // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     K2Node_MakeArray_Array;                            // 0x0370(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeGameplayAbilityTargetDataHandleFromHitResults_ReturnValue; // 0x0380(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_643D[0x3];                                     // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x03AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_643E[0x4];                                     // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue_3;                // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     K2Node_MakeArray_Array_1;                          // 0x03C8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeGameplayAbilityTargetDataHandleFromHitResults_ReturnValue_1; // 0x03D8(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateData_IsValid_1;                   // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_643F[0x2];                                     // 0x0402(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0404(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6440[0x4];                                     // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue_4;                // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0420(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6441[0x7];                                     // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo_1;    // 0x0438(0x0028)(ConstParm)
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo;      // 0x0460(0x0028)(ConstParm)
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0488(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectRemovalInfo             Temp_struct_Variable_2;                            // 0x0498(0x0028)()
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_1;            // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x04C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Ready_for_Activation_IsReady;          // 0x04C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6442[0x4];                                     // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue; // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputPress*            CallFunc_WaitInputPress_ReturnValue;               // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6443[0x3];                                     // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_2;                              // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_2;            // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_3;            // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6444[0x2];                                     // 0x04EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_TimeWaited;                     // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SpawnTetherLink_ReturnValue;              // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6445[0x7];                                     // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_GetFirstLocationData_LocationData;        // 0x04F8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(float TimeWaited)>             K2Node_CreateDelegate_OutputDelegate_10;           // 0x05F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0601(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6446[0x2];                                     // 0x0602(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6447[0x4];                                     // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0610(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0628(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0640(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0658(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0678(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0680(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6448[0x4];                                     // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x06A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x06C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_GetSecondLocationData_LocationData;       // 0x06D8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x07D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6449[0x2];                                     // 0x07D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x07D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644A[0x4];                                     // 0x07DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x07E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x07F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0810(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0828(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0840(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0848(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0850(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0868(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x086C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644B[0x4];                                     // 0x0874(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0878(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0890(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x08A8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x09A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_4;            // 0x09B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x09B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644C[0x6];                                     // 0x09B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x09B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x09C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_5;            // 0x09C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x09CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_6;            // 0x09CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644D[0x4];                                     // 0x09CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue_5;                // 0x09D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x09D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644E[0x3];                                     // 0x09D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_EffectHandle;                   // 0x09DC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_7;            // 0x09E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644F[0x3];                                     // 0x09E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEffectRemoved* CallFunc_WaitForGameplayEffectRemoved_ReturnValue; // 0x09E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x09F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6450[0x7];                                     // 0x09F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_BP_GetAbilityComponent_ReturnValue;       // 0x09F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_TetherPreviewComponent_C*           K2Node_DynamicCast_AsBP_Tether_Preview_Component;  // 0x0A00(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0A08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0A09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6451[0x2];                                     // 0x0A0A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0A0C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Tether_C_ExecuteUbergraph_GA_Tether) == 0x000008, "Wrong alignment on GA_Tether_C_ExecuteUbergraph_GA_Tether");
static_assert(sizeof(GA_Tether_C_ExecuteUbergraph_GA_Tether) == 0x000A20, "Wrong size on GA_Tether_C_ExecuteUbergraph_GA_Tether");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, EntryPoint) == 0x000000, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_WaitNetSync_ReturnValue) == 0x000008, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CustomEvent_Time_1) == 0x000024, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CustomEvent_Time_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, Temp_real_Variable) == 0x000028, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_WaitCustomInputPress_ReturnValue) == 0x000030, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_WaitCustomInputPress_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CustomEvent_Data_1) == 0x000050, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CustomEvent_Data_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, Temp_struct_Variable) == 0x000078, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_ServerWaitForClientTargetData_ReturnValue) == 0x0000A0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_ServerWaitForClientTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_IsValid_ReturnValue_2) == 0x0000A8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_GetHitResultFromTargetData_ReturnValue) == 0x0000B0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_GetHitResultFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CustomEvent_Data) == 0x0001A8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001D0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, Temp_struct_Variable_1) == 0x0001E0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_ServerWaitForClientTargetData_ReturnValue_1) == 0x000208, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_ServerWaitForClientTargetData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_IsValid_ReturnValue_3) == 0x000210, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_GetHitResultFromTargetData_ReturnValue_1) == 0x000218, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_GetHitResultFromTargetData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CustomEvent_Time) == 0x000310, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CreateDelegate_OutputDelegate_3) == 0x000314, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, Temp_real_Variable_1) == 0x000324, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_WaitCustomInputPress_ReturnValue_1) == 0x000328, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_WaitCustomInputPress_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_IsValid_ReturnValue_4) == 0x000330, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CreateDelegate_OutputDelegate_4) == 0x000334, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_WaitNetSync_ReturnValue_1) == 0x000348, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_WaitNetSync_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_ValidateData_IsValid) == 0x000350, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_ValidateData_IsValid' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_IsValid_ReturnValue_5) == 0x000351, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CreateDelegate_OutputDelegate_5) == 0x000354, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_WaitNetSync_ReturnValue_2) == 0x000368, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_WaitNetSync_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_MakeArray_Array) == 0x000370, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_MakeGameplayAbilityTargetDataHandleFromHitResults_ReturnValue) == 0x000380, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_MakeGameplayAbilityTargetDataHandleFromHitResults_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_IsValid_ReturnValue_6) == 0x0003A8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CreateDelegate_OutputDelegate_6) == 0x0003AC, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_WaitNetSync_ReturnValue_3) == 0x0003C0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_WaitNetSync_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_MakeArray_Array_1) == 0x0003C8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_MakeGameplayAbilityTargetDataHandleFromHitResults_ReturnValue_1) == 0x0003D8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_MakeGameplayAbilityTargetDataHandleFromHitResults_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_IsValid_ReturnValue_7) == 0x000400, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_ValidateData_IsValid_1) == 0x000401, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_ValidateData_IsValid_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CreateDelegate_OutputDelegate_7) == 0x000404, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_WaitNetSync_ReturnValue_4) == 0x000418, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_WaitNetSync_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CreateDelegate_OutputDelegate_8) == 0x000420, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_IsValid_ReturnValue_8) == 0x000430, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CustomEvent_GameplayEffectRemovalInfo_1) == 0x000438, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CustomEvent_GameplayEffectRemovalInfo_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CustomEvent_GameplayEffectRemovalInfo) == 0x000460, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CustomEvent_GameplayEffectRemovalInfo' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CreateDelegate_OutputDelegate_9) == 0x000488, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, Temp_struct_Variable_2) == 0x000498, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_K2_HasAuthority_ReturnValue) == 0x0004C0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_K2_HasAuthority_ReturnValue_1) == 0x0004C1, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_K2_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_K2_CommitAbility_ReturnValue) == 0x0004C2, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_Is_Ready_for_Activation_IsReady) == 0x0004C3, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_Is_Ready_for_Activation_IsReady' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0004C8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_WaitInputPress_ReturnValue) == 0x0004D0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_WaitInputPress_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CustomEvent_Actor) == 0x0004D8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_IsValid_ReturnValue_9) == 0x0004E0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, Temp_real_Variable_2) == 0x0004E4, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_K2_HasAuthority_ReturnValue_2) == 0x0004E8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_K2_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_K2_HasAuthority_ReturnValue_3) == 0x0004E9, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_K2_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CustomEvent_TimeWaited) == 0x0004EC, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CustomEvent_TimeWaited' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_SpawnTetherLink_ReturnValue) == 0x0004F0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_SpawnTetherLink_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_GetFirstLocationData_LocationData) == 0x0004F8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_GetFirstLocationData_LocationData' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CreateDelegate_OutputDelegate_10) == 0x0005F0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_bBlockingHit) == 0x000600, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_bInitialOverlap) == 0x000601, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_Time) == 0x000604, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_Distance) == 0x000608, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_Location) == 0x000610, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_ImpactPoint) == 0x000628, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_Normal) == 0x000640, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_ImpactNormal) == 0x000658, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_PhysMat) == 0x000670, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_HitActor) == 0x000678, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_HitComponent) == 0x000680, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_HitBoneName) == 0x000688, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_BoneName) == 0x000690, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_HitItem) == 0x000698, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_ElementIndex) == 0x00069C, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_FaceIndex) == 0x0006A0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_TraceStart) == 0x0006A8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_TraceEnd) == 0x0006C0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_GetSecondLocationData_LocationData) == 0x0006D8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_GetSecondLocationData_LocationData' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0007D0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0007D1, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_Time_1) == 0x0007D4, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_Distance_1) == 0x0007D8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_Location_1) == 0x0007E0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0007F8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_Normal_1) == 0x000810, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000828, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_PhysMat_1) == 0x000840, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_HitActor_1) == 0x000848, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_HitComponent_1) == 0x000850, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_HitBoneName_1) == 0x000858, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_BoneName_1) == 0x000860, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_HitItem_1) == 0x000868, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_ElementIndex_1) == 0x00086C, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_FaceIndex_1) == 0x000870, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_TraceStart_1) == 0x000878, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BreakHitResult_TraceEnd_1) == 0x000890, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_MakeHitResult_ReturnValue) == 0x0008A8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CreateDelegate_OutputDelegate_11) == 0x0009A0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_K2_HasAuthority_ReturnValue_4) == 0x0009B0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_K2_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_Event_bWasCancelled) == 0x0009B1, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0009B8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0009C8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_K2_HasAuthority_ReturnValue_5) == 0x0009C9, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_K2_HasAuthority_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_Not_PreBool_ReturnValue) == 0x0009CA, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_K2_HasAuthority_ReturnValue_6) == 0x0009CB, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_K2_HasAuthority_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_WaitNetSync_ReturnValue_5) == 0x0009D0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_WaitNetSync_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_IsValid_ReturnValue_10) == 0x0009D8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CustomEvent_EffectHandle) == 0x0009DC, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CustomEvent_EffectHandle' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_K2_HasAuthority_ReturnValue_7) == 0x0009E4, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_K2_HasAuthority_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_WaitForGameplayEffectRemoved_ReturnValue) == 0x0009E8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_WaitForGameplayEffectRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_IsValid_ReturnValue_11) == 0x0009F0, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_BP_GetAbilityComponent_ReturnValue) == 0x0009F8, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_BP_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_DynamicCast_AsBP_Tether_Preview_Component) == 0x000A00, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_DynamicCast_AsBP_Tether_Preview_Component' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_DynamicCast_bSuccess) == 0x000A08, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, CallFunc_IsValid_ReturnValue_12) == 0x000A09, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(GA_Tether_C_ExecuteUbergraph_GA_Tether, K2Node_CreateDelegate_OutputDelegate_12) == 0x000A0C, "Member 'GA_Tether_C_ExecuteUbergraph_GA_Tether::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");

// Function GA_Tether.GA_Tether_C.InvalidHandle_44ECFADA4796A39F7F5D51BD0EC565A3
// 0x0028 (0x0028 - 0x0000)
struct GA_Tether_C_InvalidHandle_44ECFADA4796A39F7F5D51BD0EC565A3 final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Tether_C_InvalidHandle_44ECFADA4796A39F7F5D51BD0EC565A3) == 0x000008, "Wrong alignment on GA_Tether_C_InvalidHandle_44ECFADA4796A39F7F5D51BD0EC565A3");
static_assert(sizeof(GA_Tether_C_InvalidHandle_44ECFADA4796A39F7F5D51BD0EC565A3) == 0x000028, "Wrong size on GA_Tether_C_InvalidHandle_44ECFADA4796A39F7F5D51BD0EC565A3");
static_assert(offsetof(GA_Tether_C_InvalidHandle_44ECFADA4796A39F7F5D51BD0EC565A3, GameplayEffectRemovalInfo) == 0x000000, "Member 'GA_Tether_C_InvalidHandle_44ECFADA4796A39F7F5D51BD0EC565A3::GameplayEffectRemovalInfo' has a wrong offset!");

// Function GA_Tether.GA_Tether_C.Is Ready for Activation
// 0x0058 (0x0058 - 0x0000)
struct GA_Tether_C_Is_Ready_for_Activation final
{
public:
	bool                                          IsReady;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6452[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
