#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Wingsuit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Wingsuit.GA_Wingsuit_C
// 0x0020 (0x06D0 - 0x06B0)
class UGA_Wingsuit_C final : public UGzGA_Wingsuit
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstance*                      WingsuitPostProcessEffect;                         // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  PlayerPawn;                                        // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGzPostProcessFX*                       PostProcessFX;                                     // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_DeactivateJetpack(const bool bWasCancelled);
	void ExecuteUbergraph_GA_Wingsuit(int32 EntryPoint);
	void K2_ActivateAbility();

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Wingsuit_C">();
	}
	static class UGA_Wingsuit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Wingsuit_C>();
	}
};
static_assert(alignof(UGA_Wingsuit_C) == 0x000008, "Wrong alignment on UGA_Wingsuit_C");
static_assert(sizeof(UGA_Wingsuit_C) == 0x0006D0, "Wrong size on UGA_Wingsuit_C");
static_assert(offsetof(UGA_Wingsuit_C, UberGraphFrame) == 0x0006B0, "Member 'UGA_Wingsuit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Wingsuit_C, WingsuitPostProcessEffect) == 0x0006B8, "Member 'UGA_Wingsuit_C::WingsuitPostProcessEffect' has a wrong offset!");
static_assert(offsetof(UGA_Wingsuit_C, PlayerPawn) == 0x0006C0, "Member 'UGA_Wingsuit_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Wingsuit_C, PostProcessFX) == 0x0006C8, "Member 'UGA_Wingsuit_C::PostProcessFX' has a wrong offset!");

}

