#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_WeaponReload

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_WeaponReload.GA_WeaponReload_C
// 0x0038 (0x05A8 - 0x0570)
class UGA_WeaponReload_C final : public UGzGA_WeaponReload
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UObject*                                WidgetRef;                                         // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ScopeStartTime;                                    // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReloadStartTime;                                   // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCameraAnimationHandle                 CameraAnimationHandle;                             // 0x0590(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AnimationPlaying;                                  // 0x0594(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6392[0x3];                                     // 0x0595(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraAnimationSequence*               SelectedCameraSequence;                            // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            LeglessReloadEffect;                               // 0x05A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Added_A45E95F847134FF3E832959C946339A8();
	void Added_CDE7B94B4D8838F26DD6B2890686A3DE();
	void ExecuteUbergraph_GA_WeaponReload(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void Removed_C752CE6848B178C8D0C99AA66EB8AC74();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_WeaponReload_C">();
	}
	static class UGA_WeaponReload_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_WeaponReload_C>();
	}
};
static_assert(alignof(UGA_WeaponReload_C) == 0x000008, "Wrong alignment on UGA_WeaponReload_C");
static_assert(sizeof(UGA_WeaponReload_C) == 0x0005A8, "Wrong size on UGA_WeaponReload_C");
static_assert(offsetof(UGA_WeaponReload_C, UberGraphFrame) == 0x000570, "Member 'UGA_WeaponReload_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_WeaponReload_C, WidgetRef) == 0x000578, "Member 'UGA_WeaponReload_C::WidgetRef' has a wrong offset!");
static_assert(offsetof(UGA_WeaponReload_C, ScopeStartTime) == 0x000580, "Member 'UGA_WeaponReload_C::ScopeStartTime' has a wrong offset!");
static_assert(offsetof(UGA_WeaponReload_C, ReloadStartTime) == 0x000588, "Member 'UGA_WeaponReload_C::ReloadStartTime' has a wrong offset!");
static_assert(offsetof(UGA_WeaponReload_C, CameraAnimationHandle) == 0x000590, "Member 'UGA_WeaponReload_C::CameraAnimationHandle' has a wrong offset!");
static_assert(offsetof(UGA_WeaponReload_C, AnimationPlaying) == 0x000594, "Member 'UGA_WeaponReload_C::AnimationPlaying' has a wrong offset!");
static_assert(offsetof(UGA_WeaponReload_C, SelectedCameraSequence) == 0x000598, "Member 'UGA_WeaponReload_C::SelectedCameraSequence' has a wrong offset!");
static_assert(offsetof(UGA_WeaponReload_C, LeglessReloadEffect) == 0x0005A0, "Member 'UGA_WeaponReload_C::LeglessReloadEffect' has a wrong offset!");

}

