#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_GrappleHookDetach

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function GC_GrappleHookDetach.GC_GrappleHookDetach_C.OnExecute
// 0x00F8 (0x00F8 - 0x0000)
struct GC_GrappleHookDetach_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9E[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x00E4(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_GrappleHookDetach_C_OnExecute) == 0x000008, "Wrong alignment on GC_GrappleHookDetach_C_OnExecute");
static_assert(sizeof(GC_GrappleHookDetach_C_OnExecute) == 0x0000F8, "Wrong size on GC_GrappleHookDetach_C_OnExecute");
static_assert(offsetof(GC_GrappleHookDetach_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_GrappleHookDetach_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_GrappleHookDetach_C_OnExecute, Parameters) == 0x000008, "Member 'GC_GrappleHookDetach_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_GrappleHookDetach_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_GrappleHookDetach_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_GrappleHookDetach_C_OnExecute, Temp_delegate_Variable) == 0x0000E4, "Member 'GC_GrappleHookDetach_C_OnExecute::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_GrappleHookDetach_C_OnExecute, CallFunc_PostEvent_ReturnValue) == 0x0000F4, "Member 'GC_GrappleHookDetach_C_OnExecute::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

}

