#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_GorillaPassive_RightThruster

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "G01_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_GorillaPassive_RightThruster.GC_GorillaPassive_RightThruster_C.ExecuteUbergraph_GC_GorillaPassive_RightThruster
// 0x0398 (0x0398 - 0x0000)
struct GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0010(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults_1;                       // 0x00E8(0x0058)(ConstParm, ContainsInstancedReference)
	EGzLimbType                                   Temp_byte_Variable;                                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable_1;                              // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable_2;                              // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C0A[0x5];                                     // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0150(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x0228(0x0058)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0288(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x02A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x02A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x02B0(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x02D0(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C0B[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HideoutPlayerCharacter_C*           K2Node_DynamicCast_AsBP_Hideout_Player_Character;  // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   K2Node_Select_Default;                             // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C0C[0x6];                                     // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMultiPartCharacter*                  K2Node_DynamicCast_AsGz_Multi_Part_Character;      // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C0D[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzLimbComponent*                       CallFunc_GetLimbComponent_ReturnValue;             // 0x0378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterialByName_ReturnValue;            // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster) == 0x000008, "Wrong alignment on GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster");
static_assert(sizeof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster) == 0x000398, "Wrong size on GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, EntryPoint) == 0x000000, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, Temp_int_Variable) == 0x000004, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, K2Node_Event_Target_1) == 0x000008, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, K2Node_Event_Parameters_1) == 0x000010, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, K2Node_Event_SpawnResults_1) == 0x0000E8, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, Temp_byte_Variable) == 0x000140, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, Temp_byte_Variable_1) == 0x000141, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, Temp_byte_Variable_2) == 0x000142, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, K2Node_Event_Target) == 0x000148, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, K2Node_Event_Parameters) == 0x000150, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, K2Node_Event_SpawnResults) == 0x000228, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000280, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000284, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000288, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0002A0, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0002A8, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0002B0, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0002D0, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_Location) == 0x0002F0, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_Normal) == 0x000308, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000320, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000328, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000330, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000338, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000340, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x000344, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000348, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000350, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, K2Node_DynamicCast_AsBP_Hideout_Player_Character) == 0x000358, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::K2Node_DynamicCast_AsBP_Hideout_Player_Character' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, K2Node_DynamicCast_bSuccess) == 0x000360, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, K2Node_Select_Default) == 0x000361, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, K2Node_DynamicCast_AsGz_Multi_Part_Character) == 0x000368, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::K2Node_DynamicCast_AsGz_Multi_Part_Character' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, K2Node_DynamicCast_bSuccess_1) == 0x000370, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_GetLimbComponent_ReturnValue) == 0x000378, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_GetLimbComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000380, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_GetMaterialByName_ReturnValue) == 0x000388, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_GetMaterialByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000390, "Member 'GC_GorillaPassive_RightThruster_C_ExecuteUbergraph_GC_GorillaPassive_RightThruster::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function GC_GorillaPassive_RightThruster.GC_GorillaPassive_RightThruster_C.OnApplication
// 0x0138 (0x0138 - 0x0000)
struct GC_GorillaPassive_RightThruster_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_GorillaPassive_RightThruster_C_OnApplication) == 0x000008, "Wrong alignment on GC_GorillaPassive_RightThruster_C_OnApplication");
static_assert(sizeof(GC_GorillaPassive_RightThruster_C_OnApplication) == 0x000138, "Wrong size on GC_GorillaPassive_RightThruster_C_OnApplication");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_OnApplication, Target) == 0x000000, "Member 'GC_GorillaPassive_RightThruster_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_OnApplication, Parameters) == 0x000008, "Member 'GC_GorillaPassive_RightThruster_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_OnApplication, SpawnResults) == 0x0000E0, "Member 'GC_GorillaPassive_RightThruster_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_GorillaPassive_RightThruster.GC_GorillaPassive_RightThruster_C.OnRemoval
// 0x0138 (0x0138 - 0x0000)
struct GC_GorillaPassive_RightThruster_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_GorillaPassive_RightThruster_C_OnRemoval) == 0x000008, "Wrong alignment on GC_GorillaPassive_RightThruster_C_OnRemoval");
static_assert(sizeof(GC_GorillaPassive_RightThruster_C_OnRemoval) == 0x000138, "Wrong size on GC_GorillaPassive_RightThruster_C_OnRemoval");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_OnRemoval, Target) == 0x000000, "Member 'GC_GorillaPassive_RightThruster_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_OnRemoval, Parameters) == 0x000008, "Member 'GC_GorillaPassive_RightThruster_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GC_GorillaPassive_RightThruster_C_OnRemoval, SpawnResults) == 0x0000E0, "Member 'GC_GorillaPassive_RightThruster_C_OnRemoval::SpawnResults' has a wrong offset!");

}

