#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SmashLanding

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_SmashLanding.GC_SmashLanding_C
// 0x0018 (0x0058 - 0x0040)
class UGC_SmashLanding_C final : public UGameplayCueNotify_Static
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Actor;                                             // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          LandingAkEvent;                                    // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_SmashLanding(int32 EntryPoint);

	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_SmashLanding_C">();
	}
	static class UGC_SmashLanding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGC_SmashLanding_C>();
	}
};
static_assert(alignof(UGC_SmashLanding_C) == 0x000008, "Wrong alignment on UGC_SmashLanding_C");
static_assert(sizeof(UGC_SmashLanding_C) == 0x000058, "Wrong size on UGC_SmashLanding_C");
static_assert(offsetof(UGC_SmashLanding_C, UberGraphFrame) == 0x000040, "Member 'UGC_SmashLanding_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGC_SmashLanding_C, Actor) == 0x000048, "Member 'UGC_SmashLanding_C::Actor' has a wrong offset!");
static_assert(offsetof(UGC_SmashLanding_C, LandingAkEvent) == 0x000050, "Member 'UGC_SmashLanding_C::LandingAkEvent' has a wrong offset!");

}

