#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_ToxicSmoke_Shooting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GC_ToxicSmoke_Shooting.GC_ToxicSmoke_Shooting_C.OnBurst
// 0x0230 (0x0230 - 0x0000)
struct GC_ToxicSmoke_Shooting_C_OnBurst final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0140(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0168(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0188(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B3[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_ToxicSmoke_Shooting_C_OnBurst) == 0x000008, "Wrong alignment on GC_ToxicSmoke_Shooting_C_OnBurst");
static_assert(sizeof(GC_ToxicSmoke_Shooting_C_OnBurst) == 0x000230, "Wrong size on GC_ToxicSmoke_Shooting_C_OnBurst");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, Target) == 0x000000, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::Target' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, Parameters) == 0x000008, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, SpawnResults) == 0x0000E0, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000138, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00013C, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000140, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000158, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000160, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000168, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000188, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location) == 0x0001A8, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001C0, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001D8, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001E0, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001E8, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001F0, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001F8, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001FC, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000200, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000208, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_MakeRotFromX_ReturnValue) == 0x000210, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ToxicSmoke_Shooting_C_OnBurst, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000228, "Member 'GC_ToxicSmoke_Shooting_C_OnBurst::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

}

