#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gun_cs

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Gun_cs.Gun_cs_C
// 0x0030 (0x02D0 - 0x02A0)
class AGun_cs_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_AT_MR02_S02_STK;                                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AT_MR02_S02_BRL;                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AT_MR02_S02_GRP;                                // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AT_MR02_MAG;                                    // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_WPN_MR02;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Gun_cs_C">();
	}
	static class AGun_cs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGun_cs_C>();
	}
};
static_assert(alignof(AGun_cs_C) == 0x000008, "Wrong alignment on AGun_cs_C");
static_assert(sizeof(AGun_cs_C) == 0x0002D0, "Wrong size on AGun_cs_C");
static_assert(offsetof(AGun_cs_C, SM_AT_MR02_S02_STK) == 0x0002A0, "Member 'AGun_cs_C::SM_AT_MR02_S02_STK' has a wrong offset!");
static_assert(offsetof(AGun_cs_C, SM_AT_MR02_S02_BRL) == 0x0002A8, "Member 'AGun_cs_C::SM_AT_MR02_S02_BRL' has a wrong offset!");
static_assert(offsetof(AGun_cs_C, SM_AT_MR02_S02_GRP) == 0x0002B0, "Member 'AGun_cs_C::SM_AT_MR02_S02_GRP' has a wrong offset!");
static_assert(offsetof(AGun_cs_C, SM_AT_MR02_MAG) == 0x0002B8, "Member 'AGun_cs_C::SM_AT_MR02_MAG' has a wrong offset!");
static_assert(offsetof(AGun_cs_C, SK_WPN_MR02) == 0x0002C0, "Member 'AGun_cs_C::SK_WPN_MR02' has a wrong offset!");
static_assert(offsetof(AGun_cs_C, DefaultSceneRoot) == 0x0002C8, "Member 'AGun_cs_C::DefaultSceneRoot' has a wrong offset!");

}

