#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GzPaymentBrowser

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "UMG_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GzPaymentBrowser.GzPaymentBrowserContainer
// 0x0010 (0x02F0 - 0x02E0)
class UGzPaymentBrowserContainer : public UUserWidget
{
public:
	uint8                                         Pad_1B34[0x10];                                    // 0x02E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OpenUrlRequested(const class FString& NewURL);

	void ExecuteBrowserClosed(bool bIsManually) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GzPaymentBrowserContainer">();
	}
	static class UGzPaymentBrowserContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGzPaymentBrowserContainer>();
	}
};
static_assert(alignof(UGzPaymentBrowserContainer) == 0x000008, "Wrong alignment on UGzPaymentBrowserContainer");
static_assert(sizeof(UGzPaymentBrowserContainer) == 0x0002F0, "Wrong size on UGzPaymentBrowserContainer");

// Class GzPaymentBrowser.GzPaymentBrowserSettings
// 0x0008 (0x0040 - 0x0038)
class UGzPaymentBrowserSettings final : public UDeveloperSettings
{
public:
	TSubclassOf<class UUserWidget>                BrowserWidgetClass;                                // 0x0038(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GzPaymentBrowserSettings">();
	}
	static class UGzPaymentBrowserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGzPaymentBrowserSettings>();
	}
};
static_assert(alignof(UGzPaymentBrowserSettings) == 0x000008, "Wrong alignment on UGzPaymentBrowserSettings");
static_assert(sizeof(UGzPaymentBrowserSettings) == 0x000040, "Wrong size on UGzPaymentBrowserSettings");
static_assert(offsetof(UGzPaymentBrowserSettings, BrowserWidgetClass) == 0x000038, "Member 'UGzPaymentBrowserSettings::BrowserWidgetClass' has a wrong offset!");

// Class GzPaymentBrowser.GzPaymentBrowserSubsystem
// 0x0008 (0x0038 - 0x0030)
class UGzPaymentBrowserSubsystem final : public UGameInstanceSubsystem
{
public:
	class UGzPaymentBrowserContainer*             Browser;                                           // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GzPaymentBrowserSubsystem">();
	}
	static class UGzPaymentBrowserSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGzPaymentBrowserSubsystem>();
	}
};
static_assert(alignof(UGzPaymentBrowserSubsystem) == 0x000008, "Wrong alignment on UGzPaymentBrowserSubsystem");
static_assert(sizeof(UGzPaymentBrowserSubsystem) == 0x000038, "Wrong size on UGzPaymentBrowserSubsystem");
static_assert(offsetof(UGzPaymentBrowserSubsystem, Browser) == 0x000030, "Member 'UGzPaymentBrowserSubsystem::Browser' has a wrong offset!");

}

