#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_GadgetValidAttachment

#include "Basic.hpp"


namespace SDK::Params
{

// Function I_GadgetValidAttachment.I_GadgetValidAttachment_C.CanAttachTo
// 0x0010 (0x0010 - 0x0000)
struct I_GadgetValidAttachment_C_CanAttachTo final
{
public:
	class AActor*                                 AttachToActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bCan;                                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_GadgetValidAttachment_C_CanAttachTo) == 0x000008, "Wrong alignment on I_GadgetValidAttachment_C_CanAttachTo");
static_assert(sizeof(I_GadgetValidAttachment_C_CanAttachTo) == 0x000010, "Wrong size on I_GadgetValidAttachment_C_CanAttachTo");
static_assert(offsetof(I_GadgetValidAttachment_C_CanAttachTo, AttachToActor) == 0x000000, "Member 'I_GadgetValidAttachment_C_CanAttachTo::AttachToActor' has a wrong offset!");
static_assert(offsetof(I_GadgetValidAttachment_C_CanAttachTo, bCan) == 0x000008, "Member 'I_GadgetValidAttachment_C_CanAttachTo::bCan' has a wrong offset!");

// Function I_GadgetValidAttachment.I_GadgetValidAttachment_C.IsValidAttachment
// 0x0001 (0x0001 - 0x0000)
struct I_GadgetValidAttachment_C_IsValidAttachment final
{
public:
	bool                                          bValid;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_GadgetValidAttachment_C_IsValidAttachment) == 0x000001, "Wrong alignment on I_GadgetValidAttachment_C_IsValidAttachment");
static_assert(sizeof(I_GadgetValidAttachment_C_IsValidAttachment) == 0x000001, "Wrong size on I_GadgetValidAttachment_C_IsValidAttachment");
static_assert(offsetof(I_GadgetValidAttachment_C_IsValidAttachment, bValid) == 0x000000, "Member 'I_GadgetValidAttachment_C_IsValidAttachment::bValid' has a wrong offset!");

}

