#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MakeNoiseComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MakeNoiseComponent.MakeNoiseComponent_C.ActorMakeNoise
// 0x0070 (0x0070 - 0x0000)
struct MakeNoiseComponent_C_ActorMakeNoise final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5706[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5707[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ReportNoiseEvent_Loudness_ImplicitCast;   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MakeNoiseComponent_C_ActorMakeNoise) == 0x000008, "Wrong alignment on MakeNoiseComponent_C_ActorMakeNoise");
static_assert(sizeof(MakeNoiseComponent_C_ActorMakeNoise) == 0x000070, "Wrong size on MakeNoiseComponent_C_ActorMakeNoise");
static_assert(offsetof(MakeNoiseComponent_C_ActorMakeNoise, Temp_bool_Variable) == 0x000000, "Member 'MakeNoiseComponent_C_ActorMakeNoise::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ActorMakeNoise, Temp_real_Variable) == 0x000008, "Member 'MakeNoiseComponent_C_ActorMakeNoise::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ActorMakeNoise, Temp_real_Variable_1) == 0x000010, "Member 'MakeNoiseComponent_C_ActorMakeNoise::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ActorMakeNoise, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'MakeNoiseComponent_C_ActorMakeNoise::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ActorMakeNoise, CallFunc_GetVelocity_ReturnValue) == 0x000020, "Member 'MakeNoiseComponent_C_ActorMakeNoise::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ActorMakeNoise, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'MakeNoiseComponent_C_ActorMakeNoise::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ActorMakeNoise, CallFunc_VSize_ReturnValue) == 0x000050, "Member 'MakeNoiseComponent_C_ActorMakeNoise::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ActorMakeNoise, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000058, "Member 'MakeNoiseComponent_C_ActorMakeNoise::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ActorMakeNoise, K2Node_Select_Default) == 0x000060, "Member 'MakeNoiseComponent_C_ActorMakeNoise::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ActorMakeNoise, CallFunc_ReportNoiseEvent_Loudness_ImplicitCast) == 0x000068, "Member 'MakeNoiseComponent_C_ActorMakeNoise::CallFunc_ReportNoiseEvent_Loudness_ImplicitCast' has a wrong offset!");

// Function MakeNoiseComponent.MakeNoiseComponent_C.CharacterMakeNoise
// 0x0088 (0x0088 - 0x0000)
struct MakeNoiseComponent_C_CharacterMakeNoise final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5708[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5709[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_570A[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ReportNoiseEvent_Loudness_ImplicitCast;   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MakeNoiseComponent_C_CharacterMakeNoise) == 0x000008, "Wrong alignment on MakeNoiseComponent_C_CharacterMakeNoise");
static_assert(sizeof(MakeNoiseComponent_C_CharacterMakeNoise) == 0x000088, "Wrong size on MakeNoiseComponent_C_CharacterMakeNoise");
static_assert(offsetof(MakeNoiseComponent_C_CharacterMakeNoise, Temp_bool_Variable) == 0x000000, "Member 'MakeNoiseComponent_C_CharacterMakeNoise::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_CharacterMakeNoise, Temp_real_Variable) == 0x000008, "Member 'MakeNoiseComponent_C_CharacterMakeNoise::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_CharacterMakeNoise, Temp_real_Variable_1) == 0x000010, "Member 'MakeNoiseComponent_C_CharacterMakeNoise::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_CharacterMakeNoise, Temp_bool_Variable_1) == 0x000018, "Member 'MakeNoiseComponent_C_CharacterMakeNoise::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_CharacterMakeNoise, Temp_real_Variable_2) == 0x000020, "Member 'MakeNoiseComponent_C_CharacterMakeNoise::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_CharacterMakeNoise, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'MakeNoiseComponent_C_CharacterMakeNoise::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_CharacterMakeNoise, CallFunc_GetVelocity_ReturnValue) == 0x000030, "Member 'MakeNoiseComponent_C_CharacterMakeNoise::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_CharacterMakeNoise, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'MakeNoiseComponent_C_CharacterMakeNoise::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_CharacterMakeNoise, CallFunc_VSize_ReturnValue) == 0x000060, "Member 'MakeNoiseComponent_C_CharacterMakeNoise::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_CharacterMakeNoise, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000068, "Member 'MakeNoiseComponent_C_CharacterMakeNoise::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_CharacterMakeNoise, K2Node_Select_Default) == 0x000070, "Member 'MakeNoiseComponent_C_CharacterMakeNoise::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_CharacterMakeNoise, K2Node_Select_Default_1) == 0x000078, "Member 'MakeNoiseComponent_C_CharacterMakeNoise::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_CharacterMakeNoise, CallFunc_ReportNoiseEvent_Loudness_ImplicitCast) == 0x000080, "Member 'MakeNoiseComponent_C_CharacterMakeNoise::CallFunc_ReportNoiseEvent_Loudness_ImplicitCast' has a wrong offset!");

// Function MakeNoiseComponent.MakeNoiseComponent_C.ExecuteUbergraph_MakeNoiseComponent
// 0x0040 (0x0040 - 0x0000)
struct MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_570B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_570C[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_570D[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast_1;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent) == 0x000008, "Wrong alignment on MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent");
static_assert(sizeof(MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent) == 0x000040, "Wrong size on MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent");
static_assert(offsetof(MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent, EntryPoint) == 0x000000, "Member 'MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent, K2Node_Event_EndPlayReason) == 0x000018, "Member 'MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent, K2Node_DynamicCast_AsGz_Character) == 0x000020, "Member 'MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000030, "Member 'MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000038, "Member 'MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent, CallFunc_K2_SetTimer_Time_ImplicitCast_1) == 0x00003C, "Member 'MakeNoiseComponent_C_ExecuteUbergraph_MakeNoiseComponent::CallFunc_K2_SetTimer_Time_ImplicitCast_1' has a wrong offset!");

// Function MakeNoiseComponent.MakeNoiseComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct MakeNoiseComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MakeNoiseComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on MakeNoiseComponent_C_ReceiveEndPlay");
static_assert(sizeof(MakeNoiseComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on MakeNoiseComponent_C_ReceiveEndPlay");
static_assert(offsetof(MakeNoiseComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'MakeNoiseComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

