#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MAP_TearDrop

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MAP_TearDrop.MAP_TearDrop_C.ExecuteUbergraph_MAP_TearDrop
// 0x0028 (0x0028 - 0x0000)
struct MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataLayerSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActorDataLayer                        CallFunc_Array_Get_Item;                           // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop) == 0x000008, "Wrong alignment on MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop");
static_assert(sizeof(MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop) == 0x000028, "Wrong size on MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop");
static_assert(offsetof(MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop, EntryPoint) == 0x000000, "Member 'MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop::EntryPoint' has a wrong offset!");
static_assert(offsetof(MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop, Temp_int_Array_Index_Variable) == 0x000004, "Member 'MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000010, "Member 'MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop, CallFunc_Array_Get_Item) == 0x00001C, "Member 'MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'MAP_TearDrop_C_ExecuteUbergraph_MAP_TearDrop::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

