#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickableEffectsStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct PickableEffectsStruct.PickableEffectsStruct
// 0x0018 (0x0018 - 0x0000)
struct FPickableEffectsStruct final
{
public:
	class UClass*                                 BeamMeshClass_4_4E6CDB54439E1074B7BF7F882B24A9B7;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NiagaraSystem_13_1370A81847748B5F73FA83B879A81F90; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AudioEvent_9_B02891F746E70A275C45CAA7E1612187;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPickableEffectsStruct) == 0x000008, "Wrong alignment on FPickableEffectsStruct");
static_assert(sizeof(FPickableEffectsStruct) == 0x000018, "Wrong size on FPickableEffectsStruct");
static_assert(offsetof(FPickableEffectsStruct, BeamMeshClass_4_4E6CDB54439E1074B7BF7F882B24A9B7) == 0x000000, "Member 'FPickableEffectsStruct::BeamMeshClass_4_4E6CDB54439E1074B7BF7F882B24A9B7' has a wrong offset!");
static_assert(offsetof(FPickableEffectsStruct, NiagaraSystem_13_1370A81847748B5F73FA83B879A81F90) == 0x000008, "Member 'FPickableEffectsStruct::NiagaraSystem_13_1370A81847748B5F73FA83B879A81F90' has a wrong offset!");
static_assert(offsetof(FPickableEffectsStruct, AudioEvent_9_B02891F746E70A275C45CAA7E1612187) == 0x000010, "Member 'FPickableEffectsStruct::AudioEvent_9_B02891F746E70A275C45CAA7E1612187' has a wrong offset!");

}

