#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PixelStreamingInput

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class PixelStreamingInput.PixelStreamingSettings
// 0x0068 (0x00A0 - 0x0038)
class UPixelStreamingSettings final : public UDeveloperSettings
{
public:
	struct FSoftClassPath                         DefaultCursorClassName;                            // 0x0038(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         TextEditBeamCursorClassName;                       // 0x0058(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         HiddenCursorClassName;                             // 0x0078(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMouseAlwaysAttached;                              // 0x0098(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4812[0x7];                                     // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PixelStreamingSettings">();
	}
	static class UPixelStreamingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPixelStreamingSettings>();
	}
};
static_assert(alignof(UPixelStreamingSettings) == 0x000008, "Wrong alignment on UPixelStreamingSettings");
static_assert(sizeof(UPixelStreamingSettings) == 0x0000A0, "Wrong size on UPixelStreamingSettings");
static_assert(offsetof(UPixelStreamingSettings, DefaultCursorClassName) == 0x000038, "Member 'UPixelStreamingSettings::DefaultCursorClassName' has a wrong offset!");
static_assert(offsetof(UPixelStreamingSettings, TextEditBeamCursorClassName) == 0x000058, "Member 'UPixelStreamingSettings::TextEditBeamCursorClassName' has a wrong offset!");
static_assert(offsetof(UPixelStreamingSettings, HiddenCursorClassName) == 0x000078, "Member 'UPixelStreamingSettings::HiddenCursorClassName' has a wrong offset!");
static_assert(offsetof(UPixelStreamingSettings, bMouseAlwaysAttached) == 0x000098, "Member 'UPixelStreamingSettings::bMouseAlwaysAttached' has a wrong offset!");

}

