#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoteSession

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "MediaIOCore_classes.hpp"


namespace SDK
{

// Class RemoteSession.RemoteSessionSettings
// 0x0040 (0x0068 - 0x0028)
class URemoteSessionSettings final : public UObject
{
public:
	int32                                         HostPort;                                          // 0x0028(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConnectionTimeout;                                 // 0x002C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConnectionTimeoutWhenDebugging;                    // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PingTime;                                          // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInShipping;                                  // 0x0038(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoHostWithPIE;                                  // 0x0039(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoHostWithGame;                                 // 0x003A(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4670[0x1];                                     // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ImageQuality;                                      // 0x003C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameRate;                                         // 0x0040(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4671[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         AllowedChannels;                                   // 0x0048(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         DeniedChannels;                                    // 0x0058(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoteSessionSettings">();
	}
	static class URemoteSessionSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoteSessionSettings>();
	}
};
static_assert(alignof(URemoteSessionSettings) == 0x000008, "Wrong alignment on URemoteSessionSettings");
static_assert(sizeof(URemoteSessionSettings) == 0x000068, "Wrong size on URemoteSessionSettings");
static_assert(offsetof(URemoteSessionSettings, HostPort) == 0x000028, "Member 'URemoteSessionSettings::HostPort' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, ConnectionTimeout) == 0x00002C, "Member 'URemoteSessionSettings::ConnectionTimeout' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, ConnectionTimeoutWhenDebugging) == 0x000030, "Member 'URemoteSessionSettings::ConnectionTimeoutWhenDebugging' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, PingTime) == 0x000034, "Member 'URemoteSessionSettings::PingTime' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, bAllowInShipping) == 0x000038, "Member 'URemoteSessionSettings::bAllowInShipping' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, bAutoHostWithPIE) == 0x000039, "Member 'URemoteSessionSettings::bAutoHostWithPIE' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, bAutoHostWithGame) == 0x00003A, "Member 'URemoteSessionSettings::bAutoHostWithGame' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, ImageQuality) == 0x00003C, "Member 'URemoteSessionSettings::ImageQuality' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, FrameRate) == 0x000040, "Member 'URemoteSessionSettings::FrameRate' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, AllowedChannels) == 0x000048, "Member 'URemoteSessionSettings::AllowedChannels' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, DeniedChannels) == 0x000058, "Member 'URemoteSessionSettings::DeniedChannels' has a wrong offset!");

// Class RemoteSession.RemoteSessionMediaOutput
// 0x0010 (0x0040 - 0x0030)
class URemoteSessionMediaOutput final : public UMediaOutput
{
public:
	uint8                                         Pad_4672[0x10];                                    // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoteSessionMediaOutput">();
	}
	static class URemoteSessionMediaOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoteSessionMediaOutput>();
	}
};
static_assert(alignof(URemoteSessionMediaOutput) == 0x000008, "Wrong alignment on URemoteSessionMediaOutput");
static_assert(sizeof(URemoteSessionMediaOutput) == 0x000040, "Wrong size on URemoteSessionMediaOutput");

// Class RemoteSession.RemoteSessionMediaCapture
// 0x0010 (0x02B0 - 0x02A0)
class URemoteSessionMediaCapture final : public UMediaCapture
{
public:
	uint8                                         Pad_4673[0x10];                                    // 0x02A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoteSessionMediaCapture">();
	}
	static class URemoteSessionMediaCapture* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoteSessionMediaCapture>();
	}
};
static_assert(alignof(URemoteSessionMediaCapture) == 0x000008, "Wrong alignment on URemoteSessionMediaCapture");
static_assert(sizeof(URemoteSessionMediaCapture) == 0x0002B0, "Wrong size on URemoteSessionMediaCapture");

}

