#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RigLogicModule

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class RigLogicModule.DNAIndexMapping
// 0x0000 (0x0028 - 0x0028)
class UDNAIndexMapping final : public UAssetUserData
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DNAIndexMapping">();
	}
	static class UDNAIndexMapping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDNAIndexMapping>();
	}
};
static_assert(alignof(UDNAIndexMapping) == 0x000008, "Wrong alignment on UDNAIndexMapping");
static_assert(sizeof(UDNAIndexMapping) == 0x000028, "Wrong size on UDNAIndexMapping");

// Class RigLogicModule.DNAAsset
// 0x0100 (0x0128 - 0x0028)
class UDNAAsset final : public UAssetUserData
{
public:
	class FString                                 DnaFileName;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepDNAAfterInitialization;                       // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E50[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            MetaData;                                          // 0x0040(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E51[0x98];                                    // 0x0090(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DNAAsset">();
	}
	static class UDNAAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDNAAsset>();
	}
};
static_assert(alignof(UDNAAsset) == 0x000008, "Wrong alignment on UDNAAsset");
static_assert(sizeof(UDNAAsset) == 0x000128, "Wrong size on UDNAAsset");
static_assert(offsetof(UDNAAsset, DnaFileName) == 0x000028, "Member 'UDNAAsset::DnaFileName' has a wrong offset!");
static_assert(offsetof(UDNAAsset, bKeepDNAAfterInitialization) == 0x000038, "Member 'UDNAAsset::bKeepDNAAfterInitialization' has a wrong offset!");
static_assert(offsetof(UDNAAsset, MetaData) == 0x000040, "Member 'UDNAAsset::MetaData' has a wrong offset!");

// Class RigLogicModule.SkelMeshDNAUtils
// 0x0000 (0x0028 - 0x0028)
class USkelMeshDNAUtils final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkelMeshDNAUtils">();
	}
	static class USkelMeshDNAUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkelMeshDNAUtils>();
	}
};
static_assert(alignof(USkelMeshDNAUtils) == 0x000008, "Wrong alignment on USkelMeshDNAUtils");
static_assert(sizeof(USkelMeshDNAUtils) == 0x000028, "Wrong size on USkelMeshDNAUtils");

}

