#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Ambient_Emissive_Settings

#include "Basic.hpp"

#include "E_Ambient_Light_Source_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Ambient_Emissive_Settings.S_Ambient_Emissive_Settings
// 0x00A0 (0x00A0 - 0x0000)
struct FS_Ambient_Emissive_Settings final
{
public:
	class UStaticMesh*                            EmissiveMesh_2_77E672D9425CBD0A3A5954A4DEFB96F9;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_Ambient_Light_Source                        LightSource_11_1E31E04A4B9AC97D294D699A6EA104A7;   // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideMesh_8_A1AB52E045319E34C9701F9817DC3D19;       // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6159[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             MeshTransform_13_B756D93644CF245158A7E4904870E09F; // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IntensityBlend_15_B6121DB048F415062C114FA87942B1B5; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EmissiveIntensityParameterName_23_3A572BFA43E3B4B00B7E3F9149686706; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EmissiveColourParameterName_24_755581344B0DE8F3DA24BCA10F0D6403; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EmissiveTintParameterName_26_C1A3A1EF4FFB960C9729F0A90F6CA59D; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunction*                      MaterialLayerFunction_18_D9399F5549347DAA0FF4EC96A2028690; // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Ambient_Emissive_Settings) == 0x000010, "Wrong alignment on FS_Ambient_Emissive_Settings");
static_assert(sizeof(FS_Ambient_Emissive_Settings) == 0x0000A0, "Wrong size on FS_Ambient_Emissive_Settings");
static_assert(offsetof(FS_Ambient_Emissive_Settings, EmissiveMesh_2_77E672D9425CBD0A3A5954A4DEFB96F9) == 0x000000, "Member 'FS_Ambient_Emissive_Settings::EmissiveMesh_2_77E672D9425CBD0A3A5954A4DEFB96F9' has a wrong offset!");
static_assert(offsetof(FS_Ambient_Emissive_Settings, LightSource_11_1E31E04A4B9AC97D294D699A6EA104A7) == 0x000008, "Member 'FS_Ambient_Emissive_Settings::LightSource_11_1E31E04A4B9AC97D294D699A6EA104A7' has a wrong offset!");
static_assert(offsetof(FS_Ambient_Emissive_Settings, HideMesh_8_A1AB52E045319E34C9701F9817DC3D19) == 0x000009, "Member 'FS_Ambient_Emissive_Settings::HideMesh_8_A1AB52E045319E34C9701F9817DC3D19' has a wrong offset!");
static_assert(offsetof(FS_Ambient_Emissive_Settings, MeshTransform_13_B756D93644CF245158A7E4904870E09F) == 0x000010, "Member 'FS_Ambient_Emissive_Settings::MeshTransform_13_B756D93644CF245158A7E4904870E09F' has a wrong offset!");
static_assert(offsetof(FS_Ambient_Emissive_Settings, IntensityBlend_15_B6121DB048F415062C114FA87942B1B5) == 0x000070, "Member 'FS_Ambient_Emissive_Settings::IntensityBlend_15_B6121DB048F415062C114FA87942B1B5' has a wrong offset!");
static_assert(offsetof(FS_Ambient_Emissive_Settings, EmissiveIntensityParameterName_23_3A572BFA43E3B4B00B7E3F9149686706) == 0x000078, "Member 'FS_Ambient_Emissive_Settings::EmissiveIntensityParameterName_23_3A572BFA43E3B4B00B7E3F9149686706' has a wrong offset!");
static_assert(offsetof(FS_Ambient_Emissive_Settings, EmissiveColourParameterName_24_755581344B0DE8F3DA24BCA10F0D6403) == 0x000080, "Member 'FS_Ambient_Emissive_Settings::EmissiveColourParameterName_24_755581344B0DE8F3DA24BCA10F0D6403' has a wrong offset!");
static_assert(offsetof(FS_Ambient_Emissive_Settings, EmissiveTintParameterName_26_C1A3A1EF4FFB960C9729F0A90F6CA59D) == 0x000088, "Member 'FS_Ambient_Emissive_Settings::EmissiveTintParameterName_26_C1A3A1EF4FFB960C9729F0A90F6CA59D' has a wrong offset!");
static_assert(offsetof(FS_Ambient_Emissive_Settings, MaterialLayerFunction_18_D9399F5549347DAA0FF4EC96A2028690) == 0x000090, "Member 'FS_Ambient_Emissive_Settings::MaterialLayerFunction_18_D9399F5549347DAA0FF4EC96A2028690' has a wrong offset!");

}

