#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Bulb_Light_01_Settings

#include "Basic.hpp"

#include "E_Light_Type_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Bulb_Light_01_Settings.S_Bulb_Light_01_Settings
// 0x0140 (0x0140 - 0x0000)
struct FS_Bulb_Light_01_Settings final
{
public:
	bool                                          OverridePresetOnOff_100_EAD49D3C49F48EC045AC36ADD8B391FA; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Light_Type                                  LightType_82_16353D654B0952BAE871DD91740995FA;     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverridePresetIntensity_92_21E1B60E4017D683FBEB76AF3AF21E09; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6135[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Intensity_40_15880B874D21B9BFB0F0459746D527E5;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverridePresetColour_93_F94CF852449630BC7FD11B8467895216; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6136[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color_41_8D43392B4287350181B61CAF932BC151;         // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6137[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AttenuationRadius_42_7A239FBA4994356B0DB365B9A115F639; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InnerConeAngleSpot_71_420522FA44C3DBD6F59CA29396C04B79; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OuterConeAngleSpot_72_B253821B4B814F91E15D4AA8B6AFA90E; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShadowCastingStartDistance_116_254EE83C4FFA5F577DB91BB4C8424DFB; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceRadius_43_B0879E0047D0593BB982879A73C1CD27;  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SoftSourceRadius_44_B3A1AFC54B99E30FC8FF3D8A4DC71952; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceLength_45_7B4A79A944A24094A57F0C831F928C13;  // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceWidthRect_73_6CD832CD4AB37056B6B6458EC52BAED6; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceHeightRect_74_11A045754DE2B44FE7C64D9AA8EFDCF9; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BarnDoorAngleRect_75_8F25C00D448EA5AC02E5AFA2D553CD18; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BarnDoorLengthRect_76_B12989D34783B84E9C4B6894C03EA74B; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               SourceTextureRect_77_EE0C1687438497F66109CAB299838CF5; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTemperature_46_AA9512F5486D97C5270D20AC02C4F476; // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6138[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temperature_47_554E7E214A36F1585A016582DEDED83B;   // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CastShadows_48_D24879424C17CB35B259D5A7C0B7FCC3;   // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6139[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IndirectLightingIntensity_49_53173332473432CA040E78BAE4404B88; // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VolumetricScatteringIntensity_50_83AE337C444E66EDBE19F1B43426FE25; // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseInverseSquaredFalloff_108_1D566C11474FC80322F862AC422AE7B6; // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_613A[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LightFalloffExponent_109_76828B384C36A0952C6B40B01D9D9F91; // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InverseExposureBlend_110_A5A6A00041EDD77A3E80F196B080ED88; // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpecularScale_111_5B3463F447D1B93F93E40BAA7D2F98DC; // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShadowBias_112_B3D0E7AE470D373D678B919BF8370CF0;   // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShadowSlopeBias_113_BE4C49B24B524A0E057E43B81EF48F21; // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightingChannel0_51_CA9410E542C3BF656FA6B39C3C1710E8; // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightingChannel1_52_ADF8C606430F042C7F499482E81EFBBC; // 0x00E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightingChannel2_53_F23BFA43474A336E03CA81B1C370403C; // 0x00E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CastVolumetricShadows_54_269447C94BFB2B7B5D42909FA46DA017; // 0x00E3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_613B[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxDrawDistance_121_137E50AA49DD2A98995711AF35299128; // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDistanceFadeRange_123_F8D113B9444AE991073C349EF37B3496; // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     LightFunctionMaterial_55_76E9EEAA4A5E5CE9C45FC4BDDA926C29; // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LightFunctionScale_56_2225B092486847C7DAFC14A80B12A4E4; // 0x0100(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightFunctionFadeDistance_57_B9D9A2ED480B7DB5A1AE7BBF00CBDD7E; // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DisabledBrightness_58_DEE5BAAE436EB3430D8008B7EC3F21E0; // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureLightProfile*                   IESTexture_59_C72DFCAB4615E4534BB6D29A1D13F9BC;    // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UseIESIntensity_60_E7347B2F436E1BE339AE39B84532BC68; // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_613C[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IESIntensityScale_61_1565EE0A49027805805282A01037517D; // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Bulb_Light_01_Settings) == 0x000008, "Wrong alignment on FS_Bulb_Light_01_Settings");
static_assert(sizeof(FS_Bulb_Light_01_Settings) == 0x000140, "Wrong size on FS_Bulb_Light_01_Settings");
static_assert(offsetof(FS_Bulb_Light_01_Settings, OverridePresetOnOff_100_EAD49D3C49F48EC045AC36ADD8B391FA) == 0x000000, "Member 'FS_Bulb_Light_01_Settings::OverridePresetOnOff_100_EAD49D3C49F48EC045AC36ADD8B391FA' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, LightType_82_16353D654B0952BAE871DD91740995FA) == 0x000001, "Member 'FS_Bulb_Light_01_Settings::LightType_82_16353D654B0952BAE871DD91740995FA' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, OverridePresetIntensity_92_21E1B60E4017D683FBEB76AF3AF21E09) == 0x000002, "Member 'FS_Bulb_Light_01_Settings::OverridePresetIntensity_92_21E1B60E4017D683FBEB76AF3AF21E09' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, Intensity_40_15880B874D21B9BFB0F0459746D527E5) == 0x000008, "Member 'FS_Bulb_Light_01_Settings::Intensity_40_15880B874D21B9BFB0F0459746D527E5' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, OverridePresetColour_93_F94CF852449630BC7FD11B8467895216) == 0x000010, "Member 'FS_Bulb_Light_01_Settings::OverridePresetColour_93_F94CF852449630BC7FD11B8467895216' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, Color_41_8D43392B4287350181B61CAF932BC151) == 0x000014, "Member 'FS_Bulb_Light_01_Settings::Color_41_8D43392B4287350181B61CAF932BC151' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, AttenuationRadius_42_7A239FBA4994356B0DB365B9A115F639) == 0x000028, "Member 'FS_Bulb_Light_01_Settings::AttenuationRadius_42_7A239FBA4994356B0DB365B9A115F639' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, InnerConeAngleSpot_71_420522FA44C3DBD6F59CA29396C04B79) == 0x000030, "Member 'FS_Bulb_Light_01_Settings::InnerConeAngleSpot_71_420522FA44C3DBD6F59CA29396C04B79' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, OuterConeAngleSpot_72_B253821B4B814F91E15D4AA8B6AFA90E) == 0x000038, "Member 'FS_Bulb_Light_01_Settings::OuterConeAngleSpot_72_B253821B4B814F91E15D4AA8B6AFA90E' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, ShadowCastingStartDistance_116_254EE83C4FFA5F577DB91BB4C8424DFB) == 0x000040, "Member 'FS_Bulb_Light_01_Settings::ShadowCastingStartDistance_116_254EE83C4FFA5F577DB91BB4C8424DFB' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, SourceRadius_43_B0879E0047D0593BB982879A73C1CD27) == 0x000048, "Member 'FS_Bulb_Light_01_Settings::SourceRadius_43_B0879E0047D0593BB982879A73C1CD27' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, SoftSourceRadius_44_B3A1AFC54B99E30FC8FF3D8A4DC71952) == 0x000050, "Member 'FS_Bulb_Light_01_Settings::SoftSourceRadius_44_B3A1AFC54B99E30FC8FF3D8A4DC71952' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, SourceLength_45_7B4A79A944A24094A57F0C831F928C13) == 0x000058, "Member 'FS_Bulb_Light_01_Settings::SourceLength_45_7B4A79A944A24094A57F0C831F928C13' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, SourceWidthRect_73_6CD832CD4AB37056B6B6458EC52BAED6) == 0x000060, "Member 'FS_Bulb_Light_01_Settings::SourceWidthRect_73_6CD832CD4AB37056B6B6458EC52BAED6' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, SourceHeightRect_74_11A045754DE2B44FE7C64D9AA8EFDCF9) == 0x000068, "Member 'FS_Bulb_Light_01_Settings::SourceHeightRect_74_11A045754DE2B44FE7C64D9AA8EFDCF9' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, BarnDoorAngleRect_75_8F25C00D448EA5AC02E5AFA2D553CD18) == 0x000070, "Member 'FS_Bulb_Light_01_Settings::BarnDoorAngleRect_75_8F25C00D448EA5AC02E5AFA2D553CD18' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, BarnDoorLengthRect_76_B12989D34783B84E9C4B6894C03EA74B) == 0x000078, "Member 'FS_Bulb_Light_01_Settings::BarnDoorLengthRect_76_B12989D34783B84E9C4B6894C03EA74B' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, SourceTextureRect_77_EE0C1687438497F66109CAB299838CF5) == 0x000080, "Member 'FS_Bulb_Light_01_Settings::SourceTextureRect_77_EE0C1687438497F66109CAB299838CF5' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, UseTemperature_46_AA9512F5486D97C5270D20AC02C4F476) == 0x000088, "Member 'FS_Bulb_Light_01_Settings::UseTemperature_46_AA9512F5486D97C5270D20AC02C4F476' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, Temperature_47_554E7E214A36F1585A016582DEDED83B) == 0x000090, "Member 'FS_Bulb_Light_01_Settings::Temperature_47_554E7E214A36F1585A016582DEDED83B' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, CastShadows_48_D24879424C17CB35B259D5A7C0B7FCC3) == 0x000098, "Member 'FS_Bulb_Light_01_Settings::CastShadows_48_D24879424C17CB35B259D5A7C0B7FCC3' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, IndirectLightingIntensity_49_53173332473432CA040E78BAE4404B88) == 0x0000A0, "Member 'FS_Bulb_Light_01_Settings::IndirectLightingIntensity_49_53173332473432CA040E78BAE4404B88' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, VolumetricScatteringIntensity_50_83AE337C444E66EDBE19F1B43426FE25) == 0x0000A8, "Member 'FS_Bulb_Light_01_Settings::VolumetricScatteringIntensity_50_83AE337C444E66EDBE19F1B43426FE25' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, UseInverseSquaredFalloff_108_1D566C11474FC80322F862AC422AE7B6) == 0x0000B0, "Member 'FS_Bulb_Light_01_Settings::UseInverseSquaredFalloff_108_1D566C11474FC80322F862AC422AE7B6' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, LightFalloffExponent_109_76828B384C36A0952C6B40B01D9D9F91) == 0x0000B8, "Member 'FS_Bulb_Light_01_Settings::LightFalloffExponent_109_76828B384C36A0952C6B40B01D9D9F91' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, InverseExposureBlend_110_A5A6A00041EDD77A3E80F196B080ED88) == 0x0000C0, "Member 'FS_Bulb_Light_01_Settings::InverseExposureBlend_110_A5A6A00041EDD77A3E80F196B080ED88' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, SpecularScale_111_5B3463F447D1B93F93E40BAA7D2F98DC) == 0x0000C8, "Member 'FS_Bulb_Light_01_Settings::SpecularScale_111_5B3463F447D1B93F93E40BAA7D2F98DC' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, ShadowBias_112_B3D0E7AE470D373D678B919BF8370CF0) == 0x0000D0, "Member 'FS_Bulb_Light_01_Settings::ShadowBias_112_B3D0E7AE470D373D678B919BF8370CF0' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, ShadowSlopeBias_113_BE4C49B24B524A0E057E43B81EF48F21) == 0x0000D8, "Member 'FS_Bulb_Light_01_Settings::ShadowSlopeBias_113_BE4C49B24B524A0E057E43B81EF48F21' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, LightingChannel0_51_CA9410E542C3BF656FA6B39C3C1710E8) == 0x0000E0, "Member 'FS_Bulb_Light_01_Settings::LightingChannel0_51_CA9410E542C3BF656FA6B39C3C1710E8' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, LightingChannel1_52_ADF8C606430F042C7F499482E81EFBBC) == 0x0000E1, "Member 'FS_Bulb_Light_01_Settings::LightingChannel1_52_ADF8C606430F042C7F499482E81EFBBC' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, LightingChannel2_53_F23BFA43474A336E03CA81B1C370403C) == 0x0000E2, "Member 'FS_Bulb_Light_01_Settings::LightingChannel2_53_F23BFA43474A336E03CA81B1C370403C' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, CastVolumetricShadows_54_269447C94BFB2B7B5D42909FA46DA017) == 0x0000E3, "Member 'FS_Bulb_Light_01_Settings::CastVolumetricShadows_54_269447C94BFB2B7B5D42909FA46DA017' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, MaxDrawDistance_121_137E50AA49DD2A98995711AF35299128) == 0x0000E8, "Member 'FS_Bulb_Light_01_Settings::MaxDrawDistance_121_137E50AA49DD2A98995711AF35299128' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, MaxDistanceFadeRange_123_F8D113B9444AE991073C349EF37B3496) == 0x0000F0, "Member 'FS_Bulb_Light_01_Settings::MaxDistanceFadeRange_123_F8D113B9444AE991073C349EF37B3496' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, LightFunctionMaterial_55_76E9EEAA4A5E5CE9C45FC4BDDA926C29) == 0x0000F8, "Member 'FS_Bulb_Light_01_Settings::LightFunctionMaterial_55_76E9EEAA4A5E5CE9C45FC4BDDA926C29' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, LightFunctionScale_56_2225B092486847C7DAFC14A80B12A4E4) == 0x000100, "Member 'FS_Bulb_Light_01_Settings::LightFunctionScale_56_2225B092486847C7DAFC14A80B12A4E4' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, LightFunctionFadeDistance_57_B9D9A2ED480B7DB5A1AE7BBF00CBDD7E) == 0x000118, "Member 'FS_Bulb_Light_01_Settings::LightFunctionFadeDistance_57_B9D9A2ED480B7DB5A1AE7BBF00CBDD7E' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, DisabledBrightness_58_DEE5BAAE436EB3430D8008B7EC3F21E0) == 0x000120, "Member 'FS_Bulb_Light_01_Settings::DisabledBrightness_58_DEE5BAAE436EB3430D8008B7EC3F21E0' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, IESTexture_59_C72DFCAB4615E4534BB6D29A1D13F9BC) == 0x000128, "Member 'FS_Bulb_Light_01_Settings::IESTexture_59_C72DFCAB4615E4534BB6D29A1D13F9BC' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, UseIESIntensity_60_E7347B2F436E1BE339AE39B84532BC68) == 0x000130, "Member 'FS_Bulb_Light_01_Settings::UseIESIntensity_60_E7347B2F436E1BE339AE39B84532BC68' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_01_Settings, IESIntensityScale_61_1565EE0A49027805805282A01037517D) == 0x000138, "Member 'FS_Bulb_Light_01_Settings::IESIntensityScale_61_1565EE0A49027805805282A01037517D' has a wrong offset!");

}

