#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Bulb_04_Setting

#include "Basic.hpp"

#include "E_Bulb_Type_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Bulb_04_Setting.S_Bulb_04_Setting
// 0x00F0 (0x00F0 - 0x0000)
struct FS_Bulb_04_Setting final
{
public:
	E_Bulb_Type                                   BulbType_28_C707CDF44C7DAA3A46630DAFBEE4FD77;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A22[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            BulbMesh_13_B422D08044B1B8C08DBF839902F71EAF;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             BulbLightTransform_31_97343220434EC92EA97054BFF093878C; // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BulbLightLocation_23_4769F70540BDFB218E7B4EAE2F862958; // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               BulbLightRotation_24_507348C84025ACD786782D99267ED1BF; // 0x0088(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                BulbMeshOffset_14_108A544D4480EAAD868BB18FAA95D741; // 0x00A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               BulbMeshRotationOffset_15_0BE81C9A4A9EBC01082F9AB4E75D103E; // 0x00B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                BulbMeshScale_18_42A96910422363D50003FE94672FDDCE; // 0x00D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Bulb_04_Setting) == 0x000010, "Wrong alignment on FS_Bulb_04_Setting");
static_assert(sizeof(FS_Bulb_04_Setting) == 0x0000F0, "Wrong size on FS_Bulb_04_Setting");
static_assert(offsetof(FS_Bulb_04_Setting, BulbType_28_C707CDF44C7DAA3A46630DAFBEE4FD77) == 0x000000, "Member 'FS_Bulb_04_Setting::BulbType_28_C707CDF44C7DAA3A46630DAFBEE4FD77' has a wrong offset!");
static_assert(offsetof(FS_Bulb_04_Setting, BulbMesh_13_B422D08044B1B8C08DBF839902F71EAF) == 0x000008, "Member 'FS_Bulb_04_Setting::BulbMesh_13_B422D08044B1B8C08DBF839902F71EAF' has a wrong offset!");
static_assert(offsetof(FS_Bulb_04_Setting, BulbLightTransform_31_97343220434EC92EA97054BFF093878C) == 0x000010, "Member 'FS_Bulb_04_Setting::BulbLightTransform_31_97343220434EC92EA97054BFF093878C' has a wrong offset!");
static_assert(offsetof(FS_Bulb_04_Setting, BulbLightLocation_23_4769F70540BDFB218E7B4EAE2F862958) == 0x000070, "Member 'FS_Bulb_04_Setting::BulbLightLocation_23_4769F70540BDFB218E7B4EAE2F862958' has a wrong offset!");
static_assert(offsetof(FS_Bulb_04_Setting, BulbLightRotation_24_507348C84025ACD786782D99267ED1BF) == 0x000088, "Member 'FS_Bulb_04_Setting::BulbLightRotation_24_507348C84025ACD786782D99267ED1BF' has a wrong offset!");
static_assert(offsetof(FS_Bulb_04_Setting, BulbMeshOffset_14_108A544D4480EAAD868BB18FAA95D741) == 0x0000A0, "Member 'FS_Bulb_04_Setting::BulbMeshOffset_14_108A544D4480EAAD868BB18FAA95D741' has a wrong offset!");
static_assert(offsetof(FS_Bulb_04_Setting, BulbMeshRotationOffset_15_0BE81C9A4A9EBC01082F9AB4E75D103E) == 0x0000B8, "Member 'FS_Bulb_04_Setting::BulbMeshRotationOffset_15_0BE81C9A4A9EBC01082F9AB4E75D103E' has a wrong offset!");
static_assert(offsetof(FS_Bulb_04_Setting, BulbMeshScale_18_42A96910422363D50003FE94672FDDCE) == 0x0000D0, "Member 'FS_Bulb_04_Setting::BulbMeshScale_18_42A96910422363D50003FE94672FDDCE' has a wrong offset!");

}

