#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Bulb_Light_02_Emissive_Settings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_Bulb_Light_02_Emissive_Settings.S_Bulb_Light_02_Emissive_Settings
// 0x0020 (0x0020 - 0x0000)
struct FS_Bulb_Light_02_Emissive_Settings final
{
public:
	double                                        EmissiveIntensityDivision_21_38EB7D1F4DE378C024D163BBA23D719C; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetCustomLumenEmissiveIntensity_25_A5E268294C57B6584A9DDDADE44356A1; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26B8[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EmissiveLumenIntensity_26_F032C3454EB92F2A30814DA28EC433F2; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EmissiveOnlyNoLightComponent_13_CA050C1948AC09A78D3A1CAFDD1517FD; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Bulb_Light_02_Emissive_Settings) == 0x000008, "Wrong alignment on FS_Bulb_Light_02_Emissive_Settings");
static_assert(sizeof(FS_Bulb_Light_02_Emissive_Settings) == 0x000020, "Wrong size on FS_Bulb_Light_02_Emissive_Settings");
static_assert(offsetof(FS_Bulb_Light_02_Emissive_Settings, EmissiveIntensityDivision_21_38EB7D1F4DE378C024D163BBA23D719C) == 0x000000, "Member 'FS_Bulb_Light_02_Emissive_Settings::EmissiveIntensityDivision_21_38EB7D1F4DE378C024D163BBA23D719C' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_02_Emissive_Settings, SetCustomLumenEmissiveIntensity_25_A5E268294C57B6584A9DDDADE44356A1) == 0x000008, "Member 'FS_Bulb_Light_02_Emissive_Settings::SetCustomLumenEmissiveIntensity_25_A5E268294C57B6584A9DDDADE44356A1' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_02_Emissive_Settings, EmissiveLumenIntensity_26_F032C3454EB92F2A30814DA28EC433F2) == 0x000010, "Member 'FS_Bulb_Light_02_Emissive_Settings::EmissiveLumenIntensity_26_F032C3454EB92F2A30814DA28EC433F2' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_02_Emissive_Settings, EmissiveOnlyNoLightComponent_13_CA050C1948AC09A78D3A1CAFDD1517FD) == 0x000018, "Member 'FS_Bulb_Light_02_Emissive_Settings::EmissiveOnlyNoLightComponent_13_CA050C1948AC09A78D3A1CAFDD1517FD' has a wrong offset!");

}

