#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Bulb_Light_04_Emissive_Settings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_Bulb_Light_04_Emissive_Settings.S_Bulb_Light_04_Emissive_Settings
// 0x0020 (0x0020 - 0x0000)
struct FS_Bulb_Light_04_Emissive_Settings final
{
public:
	double                                        EmissiveIntensityDivision_20_120591D04AD4D40C18D2A0A19EC2ACAD; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetCustomLumenEmissiveIntensity_24_AC6C873740E5E45462213682805387D5; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581C[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EmissiveLumenIntensity_26_0082B7C84D185244E96DAD87478A35F0; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EmissiveOnlyNoLightComponent_13_AE2A332149FF1D464D17ECBF81A2FF0B; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Bulb_Light_04_Emissive_Settings) == 0x000008, "Wrong alignment on FS_Bulb_Light_04_Emissive_Settings");
static_assert(sizeof(FS_Bulb_Light_04_Emissive_Settings) == 0x000020, "Wrong size on FS_Bulb_Light_04_Emissive_Settings");
static_assert(offsetof(FS_Bulb_Light_04_Emissive_Settings, EmissiveIntensityDivision_20_120591D04AD4D40C18D2A0A19EC2ACAD) == 0x000000, "Member 'FS_Bulb_Light_04_Emissive_Settings::EmissiveIntensityDivision_20_120591D04AD4D40C18D2A0A19EC2ACAD' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_04_Emissive_Settings, SetCustomLumenEmissiveIntensity_24_AC6C873740E5E45462213682805387D5) == 0x000008, "Member 'FS_Bulb_Light_04_Emissive_Settings::SetCustomLumenEmissiveIntensity_24_AC6C873740E5E45462213682805387D5' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_04_Emissive_Settings, EmissiveLumenIntensity_26_0082B7C84D185244E96DAD87478A35F0) == 0x000010, "Member 'FS_Bulb_Light_04_Emissive_Settings::EmissiveLumenIntensity_26_0082B7C84D185244E96DAD87478A35F0' has a wrong offset!");
static_assert(offsetof(FS_Bulb_Light_04_Emissive_Settings, EmissiveOnlyNoLightComponent_13_AE2A332149FF1D464D17ECBF81A2FF0B) == 0x000018, "Member 'FS_Bulb_Light_04_Emissive_Settings::EmissiveOnlyNoLightComponent_13_AE2A332149FF1D464D17ECBF81A2FF0B' has a wrong offset!");

}

