#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Bulb_01_Settings

#include "Basic.hpp"

#include "E_Bulb_Type_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Bulb_01_Settings.S_Bulb_01_Settings
// 0x00F0 (0x00F0 - 0x0000)
struct FS_Bulb_01_Settings final
{
public:
	E_Bulb_Type                                   BulbType_34_54DFCCC8448F2C7B617AF298F3B2AC5C;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            BulbMesh_13_B422D08044B1B8C08DBF839902F71EAF;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             BulbLightTransform_38_CBD2F7314F164F6CD77457B5CEB8CA7D; // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BulbLightLocation_30_019FDAA04D4246E756B72D829A703413; // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               BulbLightRotation_31_71C5D9EF499E585C2A218196D5AB3A9B; // 0x0088(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                BulbMeshOffset_14_108A544D4480EAAD868BB18FAA95D741; // 0x00A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               BulbMeshRotationOffset_15_0BE81C9A4A9EBC01082F9AB4E75D103E; // 0x00B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                BulbMeshScale_25_B0B5F2F94C55F5DDA1503791BB0ED9CD; // 0x00D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Bulb_01_Settings) == 0x000010, "Wrong alignment on FS_Bulb_01_Settings");
static_assert(sizeof(FS_Bulb_01_Settings) == 0x0000F0, "Wrong size on FS_Bulb_01_Settings");
static_assert(offsetof(FS_Bulb_01_Settings, BulbType_34_54DFCCC8448F2C7B617AF298F3B2AC5C) == 0x000000, "Member 'FS_Bulb_01_Settings::BulbType_34_54DFCCC8448F2C7B617AF298F3B2AC5C' has a wrong offset!");
static_assert(offsetof(FS_Bulb_01_Settings, BulbMesh_13_B422D08044B1B8C08DBF839902F71EAF) == 0x000008, "Member 'FS_Bulb_01_Settings::BulbMesh_13_B422D08044B1B8C08DBF839902F71EAF' has a wrong offset!");
static_assert(offsetof(FS_Bulb_01_Settings, BulbLightTransform_38_CBD2F7314F164F6CD77457B5CEB8CA7D) == 0x000010, "Member 'FS_Bulb_01_Settings::BulbLightTransform_38_CBD2F7314F164F6CD77457B5CEB8CA7D' has a wrong offset!");
static_assert(offsetof(FS_Bulb_01_Settings, BulbLightLocation_30_019FDAA04D4246E756B72D829A703413) == 0x000070, "Member 'FS_Bulb_01_Settings::BulbLightLocation_30_019FDAA04D4246E756B72D829A703413' has a wrong offset!");
static_assert(offsetof(FS_Bulb_01_Settings, BulbLightRotation_31_71C5D9EF499E585C2A218196D5AB3A9B) == 0x000088, "Member 'FS_Bulb_01_Settings::BulbLightRotation_31_71C5D9EF499E585C2A218196D5AB3A9B' has a wrong offset!");
static_assert(offsetof(FS_Bulb_01_Settings, BulbMeshOffset_14_108A544D4480EAAD868BB18FAA95D741) == 0x0000A0, "Member 'FS_Bulb_01_Settings::BulbMeshOffset_14_108A544D4480EAAD868BB18FAA95D741' has a wrong offset!");
static_assert(offsetof(FS_Bulb_01_Settings, BulbMeshRotationOffset_15_0BE81C9A4A9EBC01082F9AB4E75D103E) == 0x0000B8, "Member 'FS_Bulb_01_Settings::BulbMeshRotationOffset_15_0BE81C9A4A9EBC01082F9AB4E75D103E' has a wrong offset!");
static_assert(offsetof(FS_Bulb_01_Settings, BulbMeshScale_25_B0B5F2F94C55F5DDA1503791BB0ED9CD) == 0x0000D0, "Member 'FS_Bulb_01_Settings::BulbMeshScale_25_B0B5F2F94C55F5DDA1503791BB0ED9CD' has a wrong offset!");

}

