#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Defiler_VisionComponent_ReplicatedData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Defiler_VisionComponent_ReplicatedData.S_Defiler_VisionComponent_ReplicatedData
// 0x0030 (0x0030 - 0x0000)
struct FS_Defiler_VisionComponent_ReplicatedData final
{
public:
	bool                                          bEnable_2_E259483F484C7DE993B08584578AF423;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B2F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                StartLocation_8_F2E82F2E4D5021B1141E5F895CD9AC0A;  // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius_9_93284E4B488B9314752FA99C137ABE42;         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartTime_11_324E9A82436F58D1171140A5A73D84E9;     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Defiler_VisionComponent_ReplicatedData) == 0x000008, "Wrong alignment on FS_Defiler_VisionComponent_ReplicatedData");
static_assert(sizeof(FS_Defiler_VisionComponent_ReplicatedData) == 0x000030, "Wrong size on FS_Defiler_VisionComponent_ReplicatedData");
static_assert(offsetof(FS_Defiler_VisionComponent_ReplicatedData, bEnable_2_E259483F484C7DE993B08584578AF423) == 0x000000, "Member 'FS_Defiler_VisionComponent_ReplicatedData::bEnable_2_E259483F484C7DE993B08584578AF423' has a wrong offset!");
static_assert(offsetof(FS_Defiler_VisionComponent_ReplicatedData, StartLocation_8_F2E82F2E4D5021B1141E5F895CD9AC0A) == 0x000008, "Member 'FS_Defiler_VisionComponent_ReplicatedData::StartLocation_8_F2E82F2E4D5021B1141E5F895CD9AC0A' has a wrong offset!");
static_assert(offsetof(FS_Defiler_VisionComponent_ReplicatedData, Radius_9_93284E4B488B9314752FA99C137ABE42) == 0x000020, "Member 'FS_Defiler_VisionComponent_ReplicatedData::Radius_9_93284E4B488B9314752FA99C137ABE42' has a wrong offset!");
static_assert(offsetof(FS_Defiler_VisionComponent_ReplicatedData, StartTime_11_324E9A82436F58D1171140A5A73D84E9) == 0x000028, "Member 'FS_Defiler_VisionComponent_ReplicatedData::StartTime_11_324E9A82436F58D1171140A5A73D84E9' has a wrong offset!");

}

