#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_GadgetMovementComponentData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_GadgetMovementState_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_GadgetMovementComponentData.S_GadgetMovementComponentData
// 0x00A0 (0x00A0 - 0x0000)
struct FS_GadgetMovementComponentData final
{
public:
	struct FVector                                Speed_4_B21B8A4E4D0EF8CD7E67098D470832A0;          // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FlyTime_6_9A1DF7BF4229A239E17FDC9A23F321DE;        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        MoveComponent_8_90B7309D464B0ABC55AB0F872F8E3361;  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591F[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform_11_449A390D4ACDD416A346F69E63431959;     // 0x0030(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GadgetMovementState                         State_14_DB4E4C2C4036FBF4563FB693B87678E1;         // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNeedAttach_16_3A1DF4CE4E412AB90CA821BE3D0EDDE6;   // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_GadgetMovementComponentData) == 0x000010, "Wrong alignment on FS_GadgetMovementComponentData");
static_assert(sizeof(FS_GadgetMovementComponentData) == 0x0000A0, "Wrong size on FS_GadgetMovementComponentData");
static_assert(offsetof(FS_GadgetMovementComponentData, Speed_4_B21B8A4E4D0EF8CD7E67098D470832A0) == 0x000000, "Member 'FS_GadgetMovementComponentData::Speed_4_B21B8A4E4D0EF8CD7E67098D470832A0' has a wrong offset!");
static_assert(offsetof(FS_GadgetMovementComponentData, FlyTime_6_9A1DF7BF4229A239E17FDC9A23F321DE) == 0x000018, "Member 'FS_GadgetMovementComponentData::FlyTime_6_9A1DF7BF4229A239E17FDC9A23F321DE' has a wrong offset!");
static_assert(offsetof(FS_GadgetMovementComponentData, MoveComponent_8_90B7309D464B0ABC55AB0F872F8E3361) == 0x000020, "Member 'FS_GadgetMovementComponentData::MoveComponent_8_90B7309D464B0ABC55AB0F872F8E3361' has a wrong offset!");
static_assert(offsetof(FS_GadgetMovementComponentData, Transform_11_449A390D4ACDD416A346F69E63431959) == 0x000030, "Member 'FS_GadgetMovementComponentData::Transform_11_449A390D4ACDD416A346F69E63431959' has a wrong offset!");
static_assert(offsetof(FS_GadgetMovementComponentData, State_14_DB4E4C2C4036FBF4563FB693B87678E1) == 0x000090, "Member 'FS_GadgetMovementComponentData::State_14_DB4E4C2C4036FBF4563FB693B87678E1' has a wrong offset!");
static_assert(offsetof(FS_GadgetMovementComponentData, bNeedAttach_16_3A1DF4CE4E412AB90CA821BE3D0EDDE6) == 0x000091, "Member 'FS_GadgetMovementComponentData::bNeedAttach_16_3A1DF4CE4E412AB90CA821BE3D0EDDE6' has a wrong offset!");

}

