#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LED_Diode_03

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_LED_Diode_03.S_LED_Diode_03
// 0x0070 (0x0070 - 0x0000)
struct FS_LED_Diode_03 final
{
public:
	class UStaticMesh*                            LEDDiodeMesh_12_7377AE8F43D618459761D6B4A89426C7;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location_24_C681F3C8421DFC88B45E8981DE3968B3;      // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_25_660E43FB4CDDA445546451AA24339693;      // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Scale_26_5C61ABE94F903A6187CF738BB0472D86;         // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberofXDuplications_13_3CB2366F41AFBA877DF02FA355C9FFCF; // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1399[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        XSpacing_27_E7ED3BA4442E594A0A4383B3F59BA1EA;      // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberofYDuplications_15_90D80D3E4E271D59BE397597B4B00ECA; // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139A[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        YSpacing_28_02B97DC3483ACB67A4541BA57DDC1D09;      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_LED_Diode_03) == 0x000008, "Wrong alignment on FS_LED_Diode_03");
static_assert(sizeof(FS_LED_Diode_03) == 0x000070, "Wrong size on FS_LED_Diode_03");
static_assert(offsetof(FS_LED_Diode_03, LEDDiodeMesh_12_7377AE8F43D618459761D6B4A89426C7) == 0x000000, "Member 'FS_LED_Diode_03::LEDDiodeMesh_12_7377AE8F43D618459761D6B4A89426C7' has a wrong offset!");
static_assert(offsetof(FS_LED_Diode_03, Location_24_C681F3C8421DFC88B45E8981DE3968B3) == 0x000008, "Member 'FS_LED_Diode_03::Location_24_C681F3C8421DFC88B45E8981DE3968B3' has a wrong offset!");
static_assert(offsetof(FS_LED_Diode_03, Rotation_25_660E43FB4CDDA445546451AA24339693) == 0x000020, "Member 'FS_LED_Diode_03::Rotation_25_660E43FB4CDDA445546451AA24339693' has a wrong offset!");
static_assert(offsetof(FS_LED_Diode_03, Scale_26_5C61ABE94F903A6187CF738BB0472D86) == 0x000038, "Member 'FS_LED_Diode_03::Scale_26_5C61ABE94F903A6187CF738BB0472D86' has a wrong offset!");
static_assert(offsetof(FS_LED_Diode_03, NumberofXDuplications_13_3CB2366F41AFBA877DF02FA355C9FFCF) == 0x000050, "Member 'FS_LED_Diode_03::NumberofXDuplications_13_3CB2366F41AFBA877DF02FA355C9FFCF' has a wrong offset!");
static_assert(offsetof(FS_LED_Diode_03, XSpacing_27_E7ED3BA4442E594A0A4383B3F59BA1EA) == 0x000058, "Member 'FS_LED_Diode_03::XSpacing_27_E7ED3BA4442E594A0A4383B3F59BA1EA' has a wrong offset!");
static_assert(offsetof(FS_LED_Diode_03, NumberofYDuplications_15_90D80D3E4E271D59BE397597B4B00ECA) == 0x000060, "Member 'FS_LED_Diode_03::NumberofYDuplications_15_90D80D3E4E271D59BE397597B4B00ECA' has a wrong offset!");
static_assert(offsetof(FS_LED_Diode_03, YSpacing_28_02B97DC3483ACB67A4541BA57DDC1D09) == 0x000068, "Member 'FS_LED_Diode_03::YSpacing_28_02B97DC3483ACB67A4541BA57DDC1D09' has a wrong offset!");

}

