#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Light_02_Settings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_Light_Type_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Light_02_Settings.S_Light_02_Settings
// 0x0178 (0x0178 - 0x0000)
struct FS_Light_02_Settings final
{
public:
	bool                                          OverridePresetOnOff_98_6A7AC4B24DBBF1B2B58A299CDABA5FD2; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A7D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LightLocation_119_03A3F2884ACD0C1928D6EBB348D8EDFB; // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LightRotation_120_D64B6FC446D0C43545E7C0A1E07B2A9D; // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_Light_Type                                  LightType_85_72A6005747AD6E64C22533AC028C0A16;     // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverridePresetIntensity_95_5B474DFF4A5095FEE61DA3ADA7E19670; // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A7E[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Intensity_40_15880B874D21B9BFB0F0459746D527E5;     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverridePresetColour_96_D35C395949D65E38361A539468E04F62; // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A7F[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color_41_8D43392B4287350181B61CAF932BC151;         // 0x004C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverridePresetAttenuationRadius_97_72E273924D694AA490CA06BF6FE46D00; // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A80[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AttenuationRadius_42_7A239FBA4994356B0DB365B9A115F639; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InnerConeAngleSpot_71_420522FA44C3DBD6F59CA29396C04B79; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OuterConeAngleSpot_72_B253821B4B814F91E15D4AA8B6AFA90E; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShadowCastingStartDistance_114_11190D274A4E819B9734D7A5171C6E27; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceRadius_43_B0879E0047D0593BB982879A73C1CD27;  // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SoftSourceRadius_44_B3A1AFC54B99E30FC8FF3D8A4DC71952; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceLength_45_7B4A79A944A24094A57F0C831F928C13;  // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceWidthRect_73_6CD832CD4AB37056B6B6458EC52BAED6; // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceHeightRect_74_11A045754DE2B44FE7C64D9AA8EFDCF9; // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BarnDoorAngleRect_75_8F25C00D448EA5AC02E5AFA2D553CD18; // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BarnDoorLengthRect_76_B12989D34783B84E9C4B6894C03EA74B; // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               SourceTextureRect_77_EE0C1687438497F66109CAB299838CF5; // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTemperature_46_AA9512F5486D97C5270D20AC02C4F476; // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A81[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temperature_47_554E7E214A36F1585A016582DEDED83B;   // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CastShadows_48_D24879424C17CB35B259D5A7C0B7FCC3;   // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A82[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IndirectLightingIntensity_49_53173332473432CA040E78BAE4404B88; // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VolumetricScatteringIntensity_50_83AE337C444E66EDBE19F1B43426FE25; // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseInverseSquaredFalloff_106_C012324D40A87F9202ADE2BE93E3195E; // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A83[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LightFalloffExponent_107_33D0F06E4B0DE2AA3717B3B5E026479F; // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InverseExposureBlend_108_44253CFD46C22547D4E6E2A98DC224E4; // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpecularScale_109_0A69622D4D8A6A1B1197CF808C0EA061; // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShadowBias_110_200DED814D606CC491594FBB88EAD9E9;   // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShadowSlopeBias_111_43DA33074351B5489DCC80962E0B8CA8; // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightingChannel0_51_CA9410E542C3BF656FA6B39C3C1710E8; // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightingChannel1_52_ADF8C606430F042C7F499482E81EFBBC; // 0x0119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightingChannel2_53_F23BFA43474A336E03CA81B1C370403C; // 0x011A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CastVolumetricShadows_54_269447C94BFB2B7B5D42909FA46DA017; // 0x011B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A84[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxDrawDistance_125_8EDA51824DD8BC9CA9DBD99ACAA172D8; // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDistanceFadeRange_126_714A68F24118D7320743D8B9C9528DE0; // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     LightFunctionMaterial_55_76E9EEAA4A5E5CE9C45FC4BDDA926C29; // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LightFunctionScale_56_2225B092486847C7DAFC14A80B12A4E4; // 0x0138(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightFunctionFadeDistance_57_B9D9A2ED480B7DB5A1AE7BBF00CBDD7E; // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DisabledBrightness_58_DEE5BAAE436EB3430D8008B7EC3F21E0; // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureLightProfile*                   IESTexture_59_C72DFCAB4615E4534BB6D29A1D13F9BC;    // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UseIESIntensity_60_E7347B2F436E1BE339AE39B84532BC68; // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A85[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IESIntensityScale_61_1565EE0A49027805805282A01037517D; // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Light_02_Settings) == 0x000008, "Wrong alignment on FS_Light_02_Settings");
static_assert(sizeof(FS_Light_02_Settings) == 0x000178, "Wrong size on FS_Light_02_Settings");
static_assert(offsetof(FS_Light_02_Settings, OverridePresetOnOff_98_6A7AC4B24DBBF1B2B58A299CDABA5FD2) == 0x000000, "Member 'FS_Light_02_Settings::OverridePresetOnOff_98_6A7AC4B24DBBF1B2B58A299CDABA5FD2' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, LightLocation_119_03A3F2884ACD0C1928D6EBB348D8EDFB) == 0x000008, "Member 'FS_Light_02_Settings::LightLocation_119_03A3F2884ACD0C1928D6EBB348D8EDFB' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, LightRotation_120_D64B6FC446D0C43545E7C0A1E07B2A9D) == 0x000020, "Member 'FS_Light_02_Settings::LightRotation_120_D64B6FC446D0C43545E7C0A1E07B2A9D' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, LightType_85_72A6005747AD6E64C22533AC028C0A16) == 0x000038, "Member 'FS_Light_02_Settings::LightType_85_72A6005747AD6E64C22533AC028C0A16' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, OverridePresetIntensity_95_5B474DFF4A5095FEE61DA3ADA7E19670) == 0x000039, "Member 'FS_Light_02_Settings::OverridePresetIntensity_95_5B474DFF4A5095FEE61DA3ADA7E19670' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, Intensity_40_15880B874D21B9BFB0F0459746D527E5) == 0x000040, "Member 'FS_Light_02_Settings::Intensity_40_15880B874D21B9BFB0F0459746D527E5' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, OverridePresetColour_96_D35C395949D65E38361A539468E04F62) == 0x000048, "Member 'FS_Light_02_Settings::OverridePresetColour_96_D35C395949D65E38361A539468E04F62' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, Color_41_8D43392B4287350181B61CAF932BC151) == 0x00004C, "Member 'FS_Light_02_Settings::Color_41_8D43392B4287350181B61CAF932BC151' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, OverridePresetAttenuationRadius_97_72E273924D694AA490CA06BF6FE46D00) == 0x00005C, "Member 'FS_Light_02_Settings::OverridePresetAttenuationRadius_97_72E273924D694AA490CA06BF6FE46D00' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, AttenuationRadius_42_7A239FBA4994356B0DB365B9A115F639) == 0x000060, "Member 'FS_Light_02_Settings::AttenuationRadius_42_7A239FBA4994356B0DB365B9A115F639' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, InnerConeAngleSpot_71_420522FA44C3DBD6F59CA29396C04B79) == 0x000068, "Member 'FS_Light_02_Settings::InnerConeAngleSpot_71_420522FA44C3DBD6F59CA29396C04B79' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, OuterConeAngleSpot_72_B253821B4B814F91E15D4AA8B6AFA90E) == 0x000070, "Member 'FS_Light_02_Settings::OuterConeAngleSpot_72_B253821B4B814F91E15D4AA8B6AFA90E' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, ShadowCastingStartDistance_114_11190D274A4E819B9734D7A5171C6E27) == 0x000078, "Member 'FS_Light_02_Settings::ShadowCastingStartDistance_114_11190D274A4E819B9734D7A5171C6E27' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, SourceRadius_43_B0879E0047D0593BB982879A73C1CD27) == 0x000080, "Member 'FS_Light_02_Settings::SourceRadius_43_B0879E0047D0593BB982879A73C1CD27' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, SoftSourceRadius_44_B3A1AFC54B99E30FC8FF3D8A4DC71952) == 0x000088, "Member 'FS_Light_02_Settings::SoftSourceRadius_44_B3A1AFC54B99E30FC8FF3D8A4DC71952' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, SourceLength_45_7B4A79A944A24094A57F0C831F928C13) == 0x000090, "Member 'FS_Light_02_Settings::SourceLength_45_7B4A79A944A24094A57F0C831F928C13' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, SourceWidthRect_73_6CD832CD4AB37056B6B6458EC52BAED6) == 0x000098, "Member 'FS_Light_02_Settings::SourceWidthRect_73_6CD832CD4AB37056B6B6458EC52BAED6' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, SourceHeightRect_74_11A045754DE2B44FE7C64D9AA8EFDCF9) == 0x0000A0, "Member 'FS_Light_02_Settings::SourceHeightRect_74_11A045754DE2B44FE7C64D9AA8EFDCF9' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, BarnDoorAngleRect_75_8F25C00D448EA5AC02E5AFA2D553CD18) == 0x0000A8, "Member 'FS_Light_02_Settings::BarnDoorAngleRect_75_8F25C00D448EA5AC02E5AFA2D553CD18' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, BarnDoorLengthRect_76_B12989D34783B84E9C4B6894C03EA74B) == 0x0000B0, "Member 'FS_Light_02_Settings::BarnDoorLengthRect_76_B12989D34783B84E9C4B6894C03EA74B' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, SourceTextureRect_77_EE0C1687438497F66109CAB299838CF5) == 0x0000B8, "Member 'FS_Light_02_Settings::SourceTextureRect_77_EE0C1687438497F66109CAB299838CF5' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, UseTemperature_46_AA9512F5486D97C5270D20AC02C4F476) == 0x0000C0, "Member 'FS_Light_02_Settings::UseTemperature_46_AA9512F5486D97C5270D20AC02C4F476' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, Temperature_47_554E7E214A36F1585A016582DEDED83B) == 0x0000C8, "Member 'FS_Light_02_Settings::Temperature_47_554E7E214A36F1585A016582DEDED83B' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, CastShadows_48_D24879424C17CB35B259D5A7C0B7FCC3) == 0x0000D0, "Member 'FS_Light_02_Settings::CastShadows_48_D24879424C17CB35B259D5A7C0B7FCC3' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, IndirectLightingIntensity_49_53173332473432CA040E78BAE4404B88) == 0x0000D8, "Member 'FS_Light_02_Settings::IndirectLightingIntensity_49_53173332473432CA040E78BAE4404B88' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, VolumetricScatteringIntensity_50_83AE337C444E66EDBE19F1B43426FE25) == 0x0000E0, "Member 'FS_Light_02_Settings::VolumetricScatteringIntensity_50_83AE337C444E66EDBE19F1B43426FE25' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, UseInverseSquaredFalloff_106_C012324D40A87F9202ADE2BE93E3195E) == 0x0000E8, "Member 'FS_Light_02_Settings::UseInverseSquaredFalloff_106_C012324D40A87F9202ADE2BE93E3195E' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, LightFalloffExponent_107_33D0F06E4B0DE2AA3717B3B5E026479F) == 0x0000F0, "Member 'FS_Light_02_Settings::LightFalloffExponent_107_33D0F06E4B0DE2AA3717B3B5E026479F' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, InverseExposureBlend_108_44253CFD46C22547D4E6E2A98DC224E4) == 0x0000F8, "Member 'FS_Light_02_Settings::InverseExposureBlend_108_44253CFD46C22547D4E6E2A98DC224E4' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, SpecularScale_109_0A69622D4D8A6A1B1197CF808C0EA061) == 0x000100, "Member 'FS_Light_02_Settings::SpecularScale_109_0A69622D4D8A6A1B1197CF808C0EA061' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, ShadowBias_110_200DED814D606CC491594FBB88EAD9E9) == 0x000108, "Member 'FS_Light_02_Settings::ShadowBias_110_200DED814D606CC491594FBB88EAD9E9' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, ShadowSlopeBias_111_43DA33074351B5489DCC80962E0B8CA8) == 0x000110, "Member 'FS_Light_02_Settings::ShadowSlopeBias_111_43DA33074351B5489DCC80962E0B8CA8' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, LightingChannel0_51_CA9410E542C3BF656FA6B39C3C1710E8) == 0x000118, "Member 'FS_Light_02_Settings::LightingChannel0_51_CA9410E542C3BF656FA6B39C3C1710E8' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, LightingChannel1_52_ADF8C606430F042C7F499482E81EFBBC) == 0x000119, "Member 'FS_Light_02_Settings::LightingChannel1_52_ADF8C606430F042C7F499482E81EFBBC' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, LightingChannel2_53_F23BFA43474A336E03CA81B1C370403C) == 0x00011A, "Member 'FS_Light_02_Settings::LightingChannel2_53_F23BFA43474A336E03CA81B1C370403C' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, CastVolumetricShadows_54_269447C94BFB2B7B5D42909FA46DA017) == 0x00011B, "Member 'FS_Light_02_Settings::CastVolumetricShadows_54_269447C94BFB2B7B5D42909FA46DA017' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, MaxDrawDistance_125_8EDA51824DD8BC9CA9DBD99ACAA172D8) == 0x000120, "Member 'FS_Light_02_Settings::MaxDrawDistance_125_8EDA51824DD8BC9CA9DBD99ACAA172D8' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, MaxDistanceFadeRange_126_714A68F24118D7320743D8B9C9528DE0) == 0x000128, "Member 'FS_Light_02_Settings::MaxDistanceFadeRange_126_714A68F24118D7320743D8B9C9528DE0' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, LightFunctionMaterial_55_76E9EEAA4A5E5CE9C45FC4BDDA926C29) == 0x000130, "Member 'FS_Light_02_Settings::LightFunctionMaterial_55_76E9EEAA4A5E5CE9C45FC4BDDA926C29' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, LightFunctionScale_56_2225B092486847C7DAFC14A80B12A4E4) == 0x000138, "Member 'FS_Light_02_Settings::LightFunctionScale_56_2225B092486847C7DAFC14A80B12A4E4' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, LightFunctionFadeDistance_57_B9D9A2ED480B7DB5A1AE7BBF00CBDD7E) == 0x000150, "Member 'FS_Light_02_Settings::LightFunctionFadeDistance_57_B9D9A2ED480B7DB5A1AE7BBF00CBDD7E' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, DisabledBrightness_58_DEE5BAAE436EB3430D8008B7EC3F21E0) == 0x000158, "Member 'FS_Light_02_Settings::DisabledBrightness_58_DEE5BAAE436EB3430D8008B7EC3F21E0' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, IESTexture_59_C72DFCAB4615E4534BB6D29A1D13F9BC) == 0x000160, "Member 'FS_Light_02_Settings::IESTexture_59_C72DFCAB4615E4534BB6D29A1D13F9BC' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, UseIESIntensity_60_E7347B2F436E1BE339AE39B84532BC68) == 0x000168, "Member 'FS_Light_02_Settings::UseIESIntensity_60_E7347B2F436E1BE339AE39B84532BC68' has a wrong offset!");
static_assert(offsetof(FS_Light_02_Settings, IESIntensityScale_61_1565EE0A49027805805282A01037517D) == 0x000170, "Member 'FS_Light_02_Settings::IESIntensityScale_61_1565EE0A49027805805282A01037517D' has a wrong offset!");

}

