#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Light_Presets

#include "Basic.hpp"

#include "E_Light_Presets_Intensity_structs.hpp"
#include "E_Light_Presets_Colour_structs.hpp"
#include "E_Light_Presets_Attenuation_Radius_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Light_Presets.S_Light_Presets
// 0x0003 (0x0003 - 0x0000)
struct FS_Light_Presets final
{
public:
	E_Light_Presets_Intensity                     PresetIntensity_6_20B7AEC94C9C2861EEAEE984EEBB7455; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Light_Presets_Colour                        PresetColour_7_851F94E24012C23DCEBE1BB259DE0073;   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Light_Presets_Attenuation_Radius            PresetAttenuationRadius_8_BDDD868847EEAAEE8F43229D710EA734; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Light_Presets) == 0x000001, "Wrong alignment on FS_Light_Presets");
static_assert(sizeof(FS_Light_Presets) == 0x000003, "Wrong size on FS_Light_Presets");
static_assert(offsetof(FS_Light_Presets, PresetIntensity_6_20B7AEC94C9C2861EEAEE984EEBB7455) == 0x000000, "Member 'FS_Light_Presets::PresetIntensity_6_20B7AEC94C9C2861EEAEE984EEBB7455' has a wrong offset!");
static_assert(offsetof(FS_Light_Presets, PresetColour_7_851F94E24012C23DCEBE1BB259DE0073) == 0x000001, "Member 'FS_Light_Presets::PresetColour_7_851F94E24012C23DCEBE1BB259DE0073' has a wrong offset!");
static_assert(offsetof(FS_Light_Presets, PresetAttenuationRadius_8_BDDD868847EEAAEE8F43229D710EA734) == 0x000002, "Member 'FS_Light_Presets::PresetAttenuationRadius_8_BDDD868847EEAAEE8F43229D710EA734' has a wrong offset!");

}

