#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Main_Throw_Light_02_Settings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_Light_Type_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Main_Throw_Light_02_Settings.S_Main_Throw_Light_02_Settings
// 0x01B0 (0x01B0 - 0x0000)
struct FS_Main_Throw_Light_02_Settings final
{
public:
	bool                                          ForceOffMainThrow_116_82C840194B6A8777F89881A53A56ABA8; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceOnMainThrow_118_B7FFEF29470FE4AD6E7CB68264A1DB27; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479E[0xE];                                     // 0x0002(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             MainThrowTransform_84_FDECA77B488ECF75CB3B259AF6696DA8; // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Light_Type                                  LightType_83_0260D6884ADB5143FBF4E2A6C406CD54;     // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideMainThrowIntensity__87_1E54DB684544E374154DCE91700F9B53; // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479F[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Intensity_40_15880B874D21B9BFB0F0459746D527E5;     // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverridePresetColour_98_34B1B32D46102266827B63A961B77EA9; // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A0[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color_41_8D43392B4287350181B61CAF932BC151;         // 0x0084(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverridePresetAttenuationRadius_99_A883D2394F63A9037BD387BF2DF4BA3A; // 0x0094(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A1[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AttenuationRadius_42_7A239FBA4994356B0DB365B9A115F639; // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InnerConeAngleSpot_71_420522FA44C3DBD6F59CA29396C04B79; // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OuterConeAngleSpot_72_B253821B4B814F91E15D4AA8B6AFA90E; // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShadowCastingStartDistance_115_ECE5212E456168F348116FA64FBFE123; // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceRadius_43_B0879E0047D0593BB982879A73C1CD27;  // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SoftSourceRadius_44_B3A1AFC54B99E30FC8FF3D8A4DC71952; // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceLength_45_7B4A79A944A24094A57F0C831F928C13;  // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceWidthRect_73_6CD832CD4AB37056B6B6458EC52BAED6; // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceHeightRect_74_11A045754DE2B44FE7C64D9AA8EFDCF9; // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BarnDoorAngleRect_75_8F25C00D448EA5AC02E5AFA2D553CD18; // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BarnDoorLengthRect_76_B12989D34783B84E9C4B6894C03EA74B; // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               SourceTextureRect_77_EE0C1687438497F66109CAB299838CF5; // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTemperature_46_AA9512F5486D97C5270D20AC02C4F476; // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A2[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temperature_47_554E7E214A36F1585A016582DEDED83B;   // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CastShadows_48_D24879424C17CB35B259D5A7C0B7FCC3;   // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A3[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IndirectLightingIntensity_49_53173332473432CA040E78BAE4404B88; // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VolumetricScatteringIntensity_50_83AE337C444E66EDBE19F1B43426FE25; // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseInverseSquaredFalloff_107_5B72730B4049D495B65E50A1A176815F; // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A4[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LightFalloffExponent_108_7A217A5D4D55CB085A6DAA816B32BFB7; // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InverseExposureBlend_109_41DFD15B445609AB020DEB88BA6D6C30; // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpecularScale_110_AD8987AE4E6FA9334C1B789ABF86815C; // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShadowBias_111_ABAC428D4E619AF7E56DE885D79F6E3F;   // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShadowSlopeBias_112_6E0208D048E404617B2E24A9F97542A7; // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightingChannel0_51_CA9410E542C3BF656FA6B39C3C1710E8; // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightingChannel1_52_ADF8C606430F042C7F499482E81EFBBC; // 0x0151(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightingChannel2_53_F23BFA43474A336E03CA81B1C370403C; // 0x0152(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CastVolumetricShadows_54_269447C94BFB2B7B5D42909FA46DA017; // 0x0153(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A5[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxDrawDistance_123_9934D12541C3895FB7AECDB87974032D; // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDistanceFadeRange_124_2E0B8FE0405A3AC64FA5EFAE3F972913; // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     LightFunctionMaterial_55_76E9EEAA4A5E5CE9C45FC4BDDA926C29; // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LightFunctionScale_56_2225B092486847C7DAFC14A80B12A4E4; // 0x0170(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightFunctionFadeDistance_57_B9D9A2ED480B7DB5A1AE7BBF00CBDD7E; // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DisabledBrightness_58_DEE5BAAE436EB3430D8008B7EC3F21E0; // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureLightProfile*                   IESTexture_59_C72DFCAB4615E4534BB6D29A1D13F9BC;    // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UseIESIntensity_60_E7347B2F436E1BE339AE39B84532BC68; // 0x01A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A6[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IESIntensityScale_61_1565EE0A49027805805282A01037517D; // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Main_Throw_Light_02_Settings) == 0x000010, "Wrong alignment on FS_Main_Throw_Light_02_Settings");
static_assert(sizeof(FS_Main_Throw_Light_02_Settings) == 0x0001B0, "Wrong size on FS_Main_Throw_Light_02_Settings");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, ForceOffMainThrow_116_82C840194B6A8777F89881A53A56ABA8) == 0x000000, "Member 'FS_Main_Throw_Light_02_Settings::ForceOffMainThrow_116_82C840194B6A8777F89881A53A56ABA8' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, ForceOnMainThrow_118_B7FFEF29470FE4AD6E7CB68264A1DB27) == 0x000001, "Member 'FS_Main_Throw_Light_02_Settings::ForceOnMainThrow_118_B7FFEF29470FE4AD6E7CB68264A1DB27' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, MainThrowTransform_84_FDECA77B488ECF75CB3B259AF6696DA8) == 0x000010, "Member 'FS_Main_Throw_Light_02_Settings::MainThrowTransform_84_FDECA77B488ECF75CB3B259AF6696DA8' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, LightType_83_0260D6884ADB5143FBF4E2A6C406CD54) == 0x000070, "Member 'FS_Main_Throw_Light_02_Settings::LightType_83_0260D6884ADB5143FBF4E2A6C406CD54' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, OverrideMainThrowIntensity__87_1E54DB684544E374154DCE91700F9B53) == 0x000071, "Member 'FS_Main_Throw_Light_02_Settings::OverrideMainThrowIntensity__87_1E54DB684544E374154DCE91700F9B53' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, Intensity_40_15880B874D21B9BFB0F0459746D527E5) == 0x000078, "Member 'FS_Main_Throw_Light_02_Settings::Intensity_40_15880B874D21B9BFB0F0459746D527E5' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, OverridePresetColour_98_34B1B32D46102266827B63A961B77EA9) == 0x000080, "Member 'FS_Main_Throw_Light_02_Settings::OverridePresetColour_98_34B1B32D46102266827B63A961B77EA9' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, Color_41_8D43392B4287350181B61CAF932BC151) == 0x000084, "Member 'FS_Main_Throw_Light_02_Settings::Color_41_8D43392B4287350181B61CAF932BC151' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, OverridePresetAttenuationRadius_99_A883D2394F63A9037BD387BF2DF4BA3A) == 0x000094, "Member 'FS_Main_Throw_Light_02_Settings::OverridePresetAttenuationRadius_99_A883D2394F63A9037BD387BF2DF4BA3A' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, AttenuationRadius_42_7A239FBA4994356B0DB365B9A115F639) == 0x000098, "Member 'FS_Main_Throw_Light_02_Settings::AttenuationRadius_42_7A239FBA4994356B0DB365B9A115F639' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, InnerConeAngleSpot_71_420522FA44C3DBD6F59CA29396C04B79) == 0x0000A0, "Member 'FS_Main_Throw_Light_02_Settings::InnerConeAngleSpot_71_420522FA44C3DBD6F59CA29396C04B79' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, OuterConeAngleSpot_72_B253821B4B814F91E15D4AA8B6AFA90E) == 0x0000A8, "Member 'FS_Main_Throw_Light_02_Settings::OuterConeAngleSpot_72_B253821B4B814F91E15D4AA8B6AFA90E' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, ShadowCastingStartDistance_115_ECE5212E456168F348116FA64FBFE123) == 0x0000B0, "Member 'FS_Main_Throw_Light_02_Settings::ShadowCastingStartDistance_115_ECE5212E456168F348116FA64FBFE123' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, SourceRadius_43_B0879E0047D0593BB982879A73C1CD27) == 0x0000B8, "Member 'FS_Main_Throw_Light_02_Settings::SourceRadius_43_B0879E0047D0593BB982879A73C1CD27' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, SoftSourceRadius_44_B3A1AFC54B99E30FC8FF3D8A4DC71952) == 0x0000C0, "Member 'FS_Main_Throw_Light_02_Settings::SoftSourceRadius_44_B3A1AFC54B99E30FC8FF3D8A4DC71952' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, SourceLength_45_7B4A79A944A24094A57F0C831F928C13) == 0x0000C8, "Member 'FS_Main_Throw_Light_02_Settings::SourceLength_45_7B4A79A944A24094A57F0C831F928C13' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, SourceWidthRect_73_6CD832CD4AB37056B6B6458EC52BAED6) == 0x0000D0, "Member 'FS_Main_Throw_Light_02_Settings::SourceWidthRect_73_6CD832CD4AB37056B6B6458EC52BAED6' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, SourceHeightRect_74_11A045754DE2B44FE7C64D9AA8EFDCF9) == 0x0000D8, "Member 'FS_Main_Throw_Light_02_Settings::SourceHeightRect_74_11A045754DE2B44FE7C64D9AA8EFDCF9' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, BarnDoorAngleRect_75_8F25C00D448EA5AC02E5AFA2D553CD18) == 0x0000E0, "Member 'FS_Main_Throw_Light_02_Settings::BarnDoorAngleRect_75_8F25C00D448EA5AC02E5AFA2D553CD18' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, BarnDoorLengthRect_76_B12989D34783B84E9C4B6894C03EA74B) == 0x0000E8, "Member 'FS_Main_Throw_Light_02_Settings::BarnDoorLengthRect_76_B12989D34783B84E9C4B6894C03EA74B' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, SourceTextureRect_77_EE0C1687438497F66109CAB299838CF5) == 0x0000F0, "Member 'FS_Main_Throw_Light_02_Settings::SourceTextureRect_77_EE0C1687438497F66109CAB299838CF5' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, UseTemperature_46_AA9512F5486D97C5270D20AC02C4F476) == 0x0000F8, "Member 'FS_Main_Throw_Light_02_Settings::UseTemperature_46_AA9512F5486D97C5270D20AC02C4F476' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, Temperature_47_554E7E214A36F1585A016582DEDED83B) == 0x000100, "Member 'FS_Main_Throw_Light_02_Settings::Temperature_47_554E7E214A36F1585A016582DEDED83B' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, CastShadows_48_D24879424C17CB35B259D5A7C0B7FCC3) == 0x000108, "Member 'FS_Main_Throw_Light_02_Settings::CastShadows_48_D24879424C17CB35B259D5A7C0B7FCC3' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, IndirectLightingIntensity_49_53173332473432CA040E78BAE4404B88) == 0x000110, "Member 'FS_Main_Throw_Light_02_Settings::IndirectLightingIntensity_49_53173332473432CA040E78BAE4404B88' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, VolumetricScatteringIntensity_50_83AE337C444E66EDBE19F1B43426FE25) == 0x000118, "Member 'FS_Main_Throw_Light_02_Settings::VolumetricScatteringIntensity_50_83AE337C444E66EDBE19F1B43426FE25' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, UseInverseSquaredFalloff_107_5B72730B4049D495B65E50A1A176815F) == 0x000120, "Member 'FS_Main_Throw_Light_02_Settings::UseInverseSquaredFalloff_107_5B72730B4049D495B65E50A1A176815F' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, LightFalloffExponent_108_7A217A5D4D55CB085A6DAA816B32BFB7) == 0x000128, "Member 'FS_Main_Throw_Light_02_Settings::LightFalloffExponent_108_7A217A5D4D55CB085A6DAA816B32BFB7' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, InverseExposureBlend_109_41DFD15B445609AB020DEB88BA6D6C30) == 0x000130, "Member 'FS_Main_Throw_Light_02_Settings::InverseExposureBlend_109_41DFD15B445609AB020DEB88BA6D6C30' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, SpecularScale_110_AD8987AE4E6FA9334C1B789ABF86815C) == 0x000138, "Member 'FS_Main_Throw_Light_02_Settings::SpecularScale_110_AD8987AE4E6FA9334C1B789ABF86815C' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, ShadowBias_111_ABAC428D4E619AF7E56DE885D79F6E3F) == 0x000140, "Member 'FS_Main_Throw_Light_02_Settings::ShadowBias_111_ABAC428D4E619AF7E56DE885D79F6E3F' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, ShadowSlopeBias_112_6E0208D048E404617B2E24A9F97542A7) == 0x000148, "Member 'FS_Main_Throw_Light_02_Settings::ShadowSlopeBias_112_6E0208D048E404617B2E24A9F97542A7' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, LightingChannel0_51_CA9410E542C3BF656FA6B39C3C1710E8) == 0x000150, "Member 'FS_Main_Throw_Light_02_Settings::LightingChannel0_51_CA9410E542C3BF656FA6B39C3C1710E8' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, LightingChannel1_52_ADF8C606430F042C7F499482E81EFBBC) == 0x000151, "Member 'FS_Main_Throw_Light_02_Settings::LightingChannel1_52_ADF8C606430F042C7F499482E81EFBBC' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, LightingChannel2_53_F23BFA43474A336E03CA81B1C370403C) == 0x000152, "Member 'FS_Main_Throw_Light_02_Settings::LightingChannel2_53_F23BFA43474A336E03CA81B1C370403C' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, CastVolumetricShadows_54_269447C94BFB2B7B5D42909FA46DA017) == 0x000153, "Member 'FS_Main_Throw_Light_02_Settings::CastVolumetricShadows_54_269447C94BFB2B7B5D42909FA46DA017' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, MaxDrawDistance_123_9934D12541C3895FB7AECDB87974032D) == 0x000158, "Member 'FS_Main_Throw_Light_02_Settings::MaxDrawDistance_123_9934D12541C3895FB7AECDB87974032D' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, MaxDistanceFadeRange_124_2E0B8FE0405A3AC64FA5EFAE3F972913) == 0x000160, "Member 'FS_Main_Throw_Light_02_Settings::MaxDistanceFadeRange_124_2E0B8FE0405A3AC64FA5EFAE3F972913' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, LightFunctionMaterial_55_76E9EEAA4A5E5CE9C45FC4BDDA926C29) == 0x000168, "Member 'FS_Main_Throw_Light_02_Settings::LightFunctionMaterial_55_76E9EEAA4A5E5CE9C45FC4BDDA926C29' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, LightFunctionScale_56_2225B092486847C7DAFC14A80B12A4E4) == 0x000170, "Member 'FS_Main_Throw_Light_02_Settings::LightFunctionScale_56_2225B092486847C7DAFC14A80B12A4E4' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, LightFunctionFadeDistance_57_B9D9A2ED480B7DB5A1AE7BBF00CBDD7E) == 0x000188, "Member 'FS_Main_Throw_Light_02_Settings::LightFunctionFadeDistance_57_B9D9A2ED480B7DB5A1AE7BBF00CBDD7E' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, DisabledBrightness_58_DEE5BAAE436EB3430D8008B7EC3F21E0) == 0x000190, "Member 'FS_Main_Throw_Light_02_Settings::DisabledBrightness_58_DEE5BAAE436EB3430D8008B7EC3F21E0' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, IESTexture_59_C72DFCAB4615E4534BB6D29A1D13F9BC) == 0x000198, "Member 'FS_Main_Throw_Light_02_Settings::IESTexture_59_C72DFCAB4615E4534BB6D29A1D13F9BC' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, UseIESIntensity_60_E7347B2F436E1BE339AE39B84532BC68) == 0x0001A0, "Member 'FS_Main_Throw_Light_02_Settings::UseIESIntensity_60_E7347B2F436E1BE339AE39B84532BC68' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_02_Settings, IESIntensityScale_61_1565EE0A49027805805282A01037517D) == 0x0001A8, "Member 'FS_Main_Throw_Light_02_Settings::IESIntensityScale_61_1565EE0A49027805805282A01037517D' has a wrong offset!");

}

