#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Main_Throw_Light_01_Settings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_Light_Type_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Main_Throw_Light_01_Settings.S_Main_Throw_Light_01_Settings
// 0x01E0 (0x01E0 - 0x0000)
struct FS_Main_Throw_Light_01_Settings final
{
public:
	bool                                          ForceOffMainThrow_116_82C840194B6A8777F89881A53A56ABA8; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceOnMainThrow_118_FE798D5D4BEF9E9551CC18BB3915AA9C; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578D[0xE];                                     // 0x0002(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             MainThrowTransform_133_92F1F08242F3DB3B07B4D3AB8C0232DC; // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MainThrowLocation_123_CD8D051D42A0A8A701E42F977110503D; // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               MainThrowRotation_124_B41E8905450671D3E28A7C8DB92B71DE; // 0x0088(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_Light_Type                                  LightType_83_0260D6884ADB5143FBF4E2A6C406CD54;     // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideMainThrowIntensity__87_1E54DB684544E374154DCE91700F9B53; // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578E[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Intensity_40_15880B874D21B9BFB0F0459746D527E5;     // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverridePresetColour_98_F9B7D9E74055852FBF2D05BF3DC51E96; // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578F[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color_41_8D43392B4287350181B61CAF932BC151;         // 0x00B4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverridePresetAttenuationRadius_99_BA4576114FCE42F3E44565873CC14338; // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5790[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AttenuationRadius_42_7A239FBA4994356B0DB365B9A115F639; // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InnerConeAngleSpot_71_420522FA44C3DBD6F59CA29396C04B79; // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OuterConeAngleSpot_72_B253821B4B814F91E15D4AA8B6AFA90E; // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShadowCastingStartDistance_115_B437A9A340B1F734B2A3E7915FEF9413; // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceRadius_43_B0879E0047D0593BB982879A73C1CD27;  // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SoftSourceRadius_44_B3A1AFC54B99E30FC8FF3D8A4DC71952; // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceLength_45_7B4A79A944A24094A57F0C831F928C13;  // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceWidthRect_73_6CD832CD4AB37056B6B6458EC52BAED6; // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceHeightRect_74_11A045754DE2B44FE7C64D9AA8EFDCF9; // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BarnDoorAngleRect_75_8F25C00D448EA5AC02E5AFA2D553CD18; // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BarnDoorLengthRect_76_B12989D34783B84E9C4B6894C03EA74B; // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               SourceTextureRect_77_EE0C1687438497F66109CAB299838CF5; // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTemperature_46_AA9512F5486D97C5270D20AC02C4F476; // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5791[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temperature_47_554E7E214A36F1585A016582DEDED83B;   // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CastShadows_48_D24879424C17CB35B259D5A7C0B7FCC3;   // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5792[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IndirectLightingIntensity_49_53173332473432CA040E78BAE4404B88; // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VolumetricScatteringIntensity_50_83AE337C444E66EDBE19F1B43426FE25; // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseInverseSquaredFalloff_107_C5F498FE422F386C2C6A3A87FB3BD309; // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5793[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LightFalloffExponent_108_97FDF3154B2B27215B66369E979D493D; // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InverseExposureBlend_109_F00E982D481458AEBE5275A8D5666978; // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpecularScale_110_9D9B3A9243185BE6C31C6CAAAF43B640; // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShadowBias_111_3B1A84814E8785B6A06C93AADBC36E85;   // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShadowSlopeBias_112_C93EF81E4FD3B07C95E148A1E83484FC; // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightingChannel0_51_CA9410E542C3BF656FA6B39C3C1710E8; // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightingChannel1_52_ADF8C606430F042C7F499482E81EFBBC; // 0x0181(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightingChannel2_53_F23BFA43474A336E03CA81B1C370403C; // 0x0182(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CastVolumetricShadows_54_269447C94BFB2B7B5D42909FA46DA017; // 0x0183(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5794[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxDrawDistance_129_C4D1800E493CB5167516479632B8C103; // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDistanceFadeRange_130_78A10BFD4EB5E8293722E8B40F2DF430; // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     LightFunctionMaterial_55_76E9EEAA4A5E5CE9C45FC4BDDA926C29; // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LightFunctionScale_56_2225B092486847C7DAFC14A80B12A4E4; // 0x01A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightFunctionFadeDistance_57_B9D9A2ED480B7DB5A1AE7BBF00CBDD7E; // 0x01B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DisabledBrightness_58_DEE5BAAE436EB3430D8008B7EC3F21E0; // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureLightProfile*                   IESTexture_59_C72DFCAB4615E4534BB6D29A1D13F9BC;    // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UseIESIntensity_60_E7347B2F436E1BE339AE39B84532BC68; // 0x01D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5795[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IESIntensityScale_61_1565EE0A49027805805282A01037517D; // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Main_Throw_Light_01_Settings) == 0x000010, "Wrong alignment on FS_Main_Throw_Light_01_Settings");
static_assert(sizeof(FS_Main_Throw_Light_01_Settings) == 0x0001E0, "Wrong size on FS_Main_Throw_Light_01_Settings");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, ForceOffMainThrow_116_82C840194B6A8777F89881A53A56ABA8) == 0x000000, "Member 'FS_Main_Throw_Light_01_Settings::ForceOffMainThrow_116_82C840194B6A8777F89881A53A56ABA8' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, ForceOnMainThrow_118_FE798D5D4BEF9E9551CC18BB3915AA9C) == 0x000001, "Member 'FS_Main_Throw_Light_01_Settings::ForceOnMainThrow_118_FE798D5D4BEF9E9551CC18BB3915AA9C' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, MainThrowTransform_133_92F1F08242F3DB3B07B4D3AB8C0232DC) == 0x000010, "Member 'FS_Main_Throw_Light_01_Settings::MainThrowTransform_133_92F1F08242F3DB3B07B4D3AB8C0232DC' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, MainThrowLocation_123_CD8D051D42A0A8A701E42F977110503D) == 0x000070, "Member 'FS_Main_Throw_Light_01_Settings::MainThrowLocation_123_CD8D051D42A0A8A701E42F977110503D' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, MainThrowRotation_124_B41E8905450671D3E28A7C8DB92B71DE) == 0x000088, "Member 'FS_Main_Throw_Light_01_Settings::MainThrowRotation_124_B41E8905450671D3E28A7C8DB92B71DE' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, LightType_83_0260D6884ADB5143FBF4E2A6C406CD54) == 0x0000A0, "Member 'FS_Main_Throw_Light_01_Settings::LightType_83_0260D6884ADB5143FBF4E2A6C406CD54' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, OverrideMainThrowIntensity__87_1E54DB684544E374154DCE91700F9B53) == 0x0000A1, "Member 'FS_Main_Throw_Light_01_Settings::OverrideMainThrowIntensity__87_1E54DB684544E374154DCE91700F9B53' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, Intensity_40_15880B874D21B9BFB0F0459746D527E5) == 0x0000A8, "Member 'FS_Main_Throw_Light_01_Settings::Intensity_40_15880B874D21B9BFB0F0459746D527E5' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, OverridePresetColour_98_F9B7D9E74055852FBF2D05BF3DC51E96) == 0x0000B0, "Member 'FS_Main_Throw_Light_01_Settings::OverridePresetColour_98_F9B7D9E74055852FBF2D05BF3DC51E96' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, Color_41_8D43392B4287350181B61CAF932BC151) == 0x0000B4, "Member 'FS_Main_Throw_Light_01_Settings::Color_41_8D43392B4287350181B61CAF932BC151' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, OverridePresetAttenuationRadius_99_BA4576114FCE42F3E44565873CC14338) == 0x0000C4, "Member 'FS_Main_Throw_Light_01_Settings::OverridePresetAttenuationRadius_99_BA4576114FCE42F3E44565873CC14338' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, AttenuationRadius_42_7A239FBA4994356B0DB365B9A115F639) == 0x0000C8, "Member 'FS_Main_Throw_Light_01_Settings::AttenuationRadius_42_7A239FBA4994356B0DB365B9A115F639' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, InnerConeAngleSpot_71_420522FA44C3DBD6F59CA29396C04B79) == 0x0000D0, "Member 'FS_Main_Throw_Light_01_Settings::InnerConeAngleSpot_71_420522FA44C3DBD6F59CA29396C04B79' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, OuterConeAngleSpot_72_B253821B4B814F91E15D4AA8B6AFA90E) == 0x0000D8, "Member 'FS_Main_Throw_Light_01_Settings::OuterConeAngleSpot_72_B253821B4B814F91E15D4AA8B6AFA90E' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, ShadowCastingStartDistance_115_B437A9A340B1F734B2A3E7915FEF9413) == 0x0000E0, "Member 'FS_Main_Throw_Light_01_Settings::ShadowCastingStartDistance_115_B437A9A340B1F734B2A3E7915FEF9413' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, SourceRadius_43_B0879E0047D0593BB982879A73C1CD27) == 0x0000E8, "Member 'FS_Main_Throw_Light_01_Settings::SourceRadius_43_B0879E0047D0593BB982879A73C1CD27' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, SoftSourceRadius_44_B3A1AFC54B99E30FC8FF3D8A4DC71952) == 0x0000F0, "Member 'FS_Main_Throw_Light_01_Settings::SoftSourceRadius_44_B3A1AFC54B99E30FC8FF3D8A4DC71952' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, SourceLength_45_7B4A79A944A24094A57F0C831F928C13) == 0x0000F8, "Member 'FS_Main_Throw_Light_01_Settings::SourceLength_45_7B4A79A944A24094A57F0C831F928C13' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, SourceWidthRect_73_6CD832CD4AB37056B6B6458EC52BAED6) == 0x000100, "Member 'FS_Main_Throw_Light_01_Settings::SourceWidthRect_73_6CD832CD4AB37056B6B6458EC52BAED6' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, SourceHeightRect_74_11A045754DE2B44FE7C64D9AA8EFDCF9) == 0x000108, "Member 'FS_Main_Throw_Light_01_Settings::SourceHeightRect_74_11A045754DE2B44FE7C64D9AA8EFDCF9' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, BarnDoorAngleRect_75_8F25C00D448EA5AC02E5AFA2D553CD18) == 0x000110, "Member 'FS_Main_Throw_Light_01_Settings::BarnDoorAngleRect_75_8F25C00D448EA5AC02E5AFA2D553CD18' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, BarnDoorLengthRect_76_B12989D34783B84E9C4B6894C03EA74B) == 0x000118, "Member 'FS_Main_Throw_Light_01_Settings::BarnDoorLengthRect_76_B12989D34783B84E9C4B6894C03EA74B' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, SourceTextureRect_77_EE0C1687438497F66109CAB299838CF5) == 0x000120, "Member 'FS_Main_Throw_Light_01_Settings::SourceTextureRect_77_EE0C1687438497F66109CAB299838CF5' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, UseTemperature_46_AA9512F5486D97C5270D20AC02C4F476) == 0x000128, "Member 'FS_Main_Throw_Light_01_Settings::UseTemperature_46_AA9512F5486D97C5270D20AC02C4F476' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, Temperature_47_554E7E214A36F1585A016582DEDED83B) == 0x000130, "Member 'FS_Main_Throw_Light_01_Settings::Temperature_47_554E7E214A36F1585A016582DEDED83B' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, CastShadows_48_D24879424C17CB35B259D5A7C0B7FCC3) == 0x000138, "Member 'FS_Main_Throw_Light_01_Settings::CastShadows_48_D24879424C17CB35B259D5A7C0B7FCC3' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, IndirectLightingIntensity_49_53173332473432CA040E78BAE4404B88) == 0x000140, "Member 'FS_Main_Throw_Light_01_Settings::IndirectLightingIntensity_49_53173332473432CA040E78BAE4404B88' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, VolumetricScatteringIntensity_50_83AE337C444E66EDBE19F1B43426FE25) == 0x000148, "Member 'FS_Main_Throw_Light_01_Settings::VolumetricScatteringIntensity_50_83AE337C444E66EDBE19F1B43426FE25' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, UseInverseSquaredFalloff_107_C5F498FE422F386C2C6A3A87FB3BD309) == 0x000150, "Member 'FS_Main_Throw_Light_01_Settings::UseInverseSquaredFalloff_107_C5F498FE422F386C2C6A3A87FB3BD309' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, LightFalloffExponent_108_97FDF3154B2B27215B66369E979D493D) == 0x000158, "Member 'FS_Main_Throw_Light_01_Settings::LightFalloffExponent_108_97FDF3154B2B27215B66369E979D493D' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, InverseExposureBlend_109_F00E982D481458AEBE5275A8D5666978) == 0x000160, "Member 'FS_Main_Throw_Light_01_Settings::InverseExposureBlend_109_F00E982D481458AEBE5275A8D5666978' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, SpecularScale_110_9D9B3A9243185BE6C31C6CAAAF43B640) == 0x000168, "Member 'FS_Main_Throw_Light_01_Settings::SpecularScale_110_9D9B3A9243185BE6C31C6CAAAF43B640' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, ShadowBias_111_3B1A84814E8785B6A06C93AADBC36E85) == 0x000170, "Member 'FS_Main_Throw_Light_01_Settings::ShadowBias_111_3B1A84814E8785B6A06C93AADBC36E85' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, ShadowSlopeBias_112_C93EF81E4FD3B07C95E148A1E83484FC) == 0x000178, "Member 'FS_Main_Throw_Light_01_Settings::ShadowSlopeBias_112_C93EF81E4FD3B07C95E148A1E83484FC' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, LightingChannel0_51_CA9410E542C3BF656FA6B39C3C1710E8) == 0x000180, "Member 'FS_Main_Throw_Light_01_Settings::LightingChannel0_51_CA9410E542C3BF656FA6B39C3C1710E8' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, LightingChannel1_52_ADF8C606430F042C7F499482E81EFBBC) == 0x000181, "Member 'FS_Main_Throw_Light_01_Settings::LightingChannel1_52_ADF8C606430F042C7F499482E81EFBBC' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, LightingChannel2_53_F23BFA43474A336E03CA81B1C370403C) == 0x000182, "Member 'FS_Main_Throw_Light_01_Settings::LightingChannel2_53_F23BFA43474A336E03CA81B1C370403C' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, CastVolumetricShadows_54_269447C94BFB2B7B5D42909FA46DA017) == 0x000183, "Member 'FS_Main_Throw_Light_01_Settings::CastVolumetricShadows_54_269447C94BFB2B7B5D42909FA46DA017' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, MaxDrawDistance_129_C4D1800E493CB5167516479632B8C103) == 0x000188, "Member 'FS_Main_Throw_Light_01_Settings::MaxDrawDistance_129_C4D1800E493CB5167516479632B8C103' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, MaxDistanceFadeRange_130_78A10BFD4EB5E8293722E8B40F2DF430) == 0x000190, "Member 'FS_Main_Throw_Light_01_Settings::MaxDistanceFadeRange_130_78A10BFD4EB5E8293722E8B40F2DF430' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, LightFunctionMaterial_55_76E9EEAA4A5E5CE9C45FC4BDDA926C29) == 0x000198, "Member 'FS_Main_Throw_Light_01_Settings::LightFunctionMaterial_55_76E9EEAA4A5E5CE9C45FC4BDDA926C29' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, LightFunctionScale_56_2225B092486847C7DAFC14A80B12A4E4) == 0x0001A0, "Member 'FS_Main_Throw_Light_01_Settings::LightFunctionScale_56_2225B092486847C7DAFC14A80B12A4E4' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, LightFunctionFadeDistance_57_B9D9A2ED480B7DB5A1AE7BBF00CBDD7E) == 0x0001B8, "Member 'FS_Main_Throw_Light_01_Settings::LightFunctionFadeDistance_57_B9D9A2ED480B7DB5A1AE7BBF00CBDD7E' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, DisabledBrightness_58_DEE5BAAE436EB3430D8008B7EC3F21E0) == 0x0001C0, "Member 'FS_Main_Throw_Light_01_Settings::DisabledBrightness_58_DEE5BAAE436EB3430D8008B7EC3F21E0' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, IESTexture_59_C72DFCAB4615E4534BB6D29A1D13F9BC) == 0x0001C8, "Member 'FS_Main_Throw_Light_01_Settings::IESTexture_59_C72DFCAB4615E4534BB6D29A1D13F9BC' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, UseIESIntensity_60_E7347B2F436E1BE339AE39B84532BC68) == 0x0001D0, "Member 'FS_Main_Throw_Light_01_Settings::UseIESIntensity_60_E7347B2F436E1BE339AE39B84532BC68' has a wrong offset!");
static_assert(offsetof(FS_Main_Throw_Light_01_Settings, IESIntensityScale_61_1565EE0A49027805805282A01037517D) == 0x0001D8, "Member 'FS_Main_Throw_Light_01_Settings::IESIntensityScale_61_1565EE0A49027805805282A01037517D' has a wrong offset!");

}

