#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PingPrompts

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_PingPrompts.S_PingPrompts
// 0x00D0 (0x00D0 - 0x0000)
struct FS_PingPrompts final
{
public:
	class FText                                   Cancel_24_2E9E37C647EF5E4B5C0CE18D635571D6;        // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FText                                   LocationNeg_38_6670DFB34FCB68D36ED8B9ACEA5B9D06;   // 0x0010(0x0010)(Edit, BlueprintVisible)
	class FText                                   EnemyNeg_39_83EF84BE4D928EB47F5DA1B964D3CA9E;      // 0x0020(0x0010)(Edit, BlueprintVisible)
	class FText                                   ItemNeg_42_E6187C8E462F57B1C1FEECACF8683E01;       // 0x0030(0x0010)(Edit, BlueprintVisible)
	class FText                                   WorldObjectNeg_43_AF5BD6FE405DCB37DC27E5BE6DD95D9C; // 0x0040(0x0010)(Edit, BlueprintVisible)
	class FText                                   MarkerNeg_44_7762635B4B8BCFC784FBD7803F13246B;     // 0x0050(0x0010)(Edit, BlueprintVisible)
	class FText                                   LootContainerNeg_45_2A053EE943142C8C46AAC4AA3975ADEB; // 0x0060(0x0010)(Edit, BlueprintVisible)
	class FText                                   LocationPos_46_F194CAA645864B3139FEA383092E5140;   // 0x0070(0x0010)(Edit, BlueprintVisible)
	class FText                                   EnemyPos_47_BDFBF882401566C310656B99765F503E;      // 0x0080(0x0010)(Edit, BlueprintVisible)
	class FText                                   ItemPos_48_5EC422B7418489C67C99B8BAD662DADA;       // 0x0090(0x0010)(Edit, BlueprintVisible)
	class FText                                   WorldObjectPos_49_D08E40D845E762CE0E062CAEA320D838; // 0x00A0(0x0010)(Edit, BlueprintVisible)
	class FText                                   MarkerPos_50_F4A595E748389CDCD2DFCA84A4B34F15;     // 0x00B0(0x0010)(Edit, BlueprintVisible)
	class FText                                   LootContainerPos_51_34BA887E423FE17671403193A2804A18; // 0x00C0(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_PingPrompts) == 0x000008, "Wrong alignment on FS_PingPrompts");
static_assert(sizeof(FS_PingPrompts) == 0x0000D0, "Wrong size on FS_PingPrompts");
static_assert(offsetof(FS_PingPrompts, Cancel_24_2E9E37C647EF5E4B5C0CE18D635571D6) == 0x000000, "Member 'FS_PingPrompts::Cancel_24_2E9E37C647EF5E4B5C0CE18D635571D6' has a wrong offset!");
static_assert(offsetof(FS_PingPrompts, LocationNeg_38_6670DFB34FCB68D36ED8B9ACEA5B9D06) == 0x000010, "Member 'FS_PingPrompts::LocationNeg_38_6670DFB34FCB68D36ED8B9ACEA5B9D06' has a wrong offset!");
static_assert(offsetof(FS_PingPrompts, EnemyNeg_39_83EF84BE4D928EB47F5DA1B964D3CA9E) == 0x000020, "Member 'FS_PingPrompts::EnemyNeg_39_83EF84BE4D928EB47F5DA1B964D3CA9E' has a wrong offset!");
static_assert(offsetof(FS_PingPrompts, ItemNeg_42_E6187C8E462F57B1C1FEECACF8683E01) == 0x000030, "Member 'FS_PingPrompts::ItemNeg_42_E6187C8E462F57B1C1FEECACF8683E01' has a wrong offset!");
static_assert(offsetof(FS_PingPrompts, WorldObjectNeg_43_AF5BD6FE405DCB37DC27E5BE6DD95D9C) == 0x000040, "Member 'FS_PingPrompts::WorldObjectNeg_43_AF5BD6FE405DCB37DC27E5BE6DD95D9C' has a wrong offset!");
static_assert(offsetof(FS_PingPrompts, MarkerNeg_44_7762635B4B8BCFC784FBD7803F13246B) == 0x000050, "Member 'FS_PingPrompts::MarkerNeg_44_7762635B4B8BCFC784FBD7803F13246B' has a wrong offset!");
static_assert(offsetof(FS_PingPrompts, LootContainerNeg_45_2A053EE943142C8C46AAC4AA3975ADEB) == 0x000060, "Member 'FS_PingPrompts::LootContainerNeg_45_2A053EE943142C8C46AAC4AA3975ADEB' has a wrong offset!");
static_assert(offsetof(FS_PingPrompts, LocationPos_46_F194CAA645864B3139FEA383092E5140) == 0x000070, "Member 'FS_PingPrompts::LocationPos_46_F194CAA645864B3139FEA383092E5140' has a wrong offset!");
static_assert(offsetof(FS_PingPrompts, EnemyPos_47_BDFBF882401566C310656B99765F503E) == 0x000080, "Member 'FS_PingPrompts::EnemyPos_47_BDFBF882401566C310656B99765F503E' has a wrong offset!");
static_assert(offsetof(FS_PingPrompts, ItemPos_48_5EC422B7418489C67C99B8BAD662DADA) == 0x000090, "Member 'FS_PingPrompts::ItemPos_48_5EC422B7418489C67C99B8BAD662DADA' has a wrong offset!");
static_assert(offsetof(FS_PingPrompts, WorldObjectPos_49_D08E40D845E762CE0E062CAEA320D838) == 0x0000A0, "Member 'FS_PingPrompts::WorldObjectPos_49_D08E40D845E762CE0E062CAEA320D838' has a wrong offset!");
static_assert(offsetof(FS_PingPrompts, MarkerPos_50_F4A595E748389CDCD2DFCA84A4B34F15) == 0x0000B0, "Member 'FS_PingPrompts::MarkerPos_50_F4A595E748389CDCD2DFCA84A4B34F15' has a wrong offset!");
static_assert(offsetof(FS_PingPrompts, LootContainerPos_51_34BA887E423FE17671403193A2804A18) == 0x0000C0, "Member 'FS_PingPrompts::LootContainerPos_51_34BA887E423FE17671403193A2804A18' has a wrong offset!");

}

