#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Procedural_Railings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Procedural_Railings.S_Procedural_Railings
// 0x0058 (0x0058 - 0x0000)
struct FS_Procedural_Railings final
{
public:
	class UStaticMesh*                            EndCapMesh01_3_760BBF3442CEE66A8619C6ACDB6FC8A5;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            MiddleMesh_13_AF81189944A40C7BE1EB0FBDD7DA8D92;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         MidSections_9_E8A416F7420638E589374EBD6B46658F;    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6542[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            AnchorMesh_12_0D2BA111453584DBA4F69BA366F04A5C;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        AnchorMeshZOffset_26_FE31A0AB4EDBD34F6F85E5933A7DAE60; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            LightMesh_15_B371CCF74C09256980BD9F923011B2D4;     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        LightMeshZOffset_27_EC1E51134369A963454D728A071D4263; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberofLights_18_93F9FEBE4203A20BA3B91DAC07E81238; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Spacing_20_9A9E5BC34EEB2FD15228599E217275F3;       // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InitialLightOffset_33_F848CB0A413F7A81BDED4CBC572F311A; // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Procedural_Railings) == 0x000008, "Wrong alignment on FS_Procedural_Railings");
static_assert(sizeof(FS_Procedural_Railings) == 0x000058, "Wrong size on FS_Procedural_Railings");
static_assert(offsetof(FS_Procedural_Railings, EndCapMesh01_3_760BBF3442CEE66A8619C6ACDB6FC8A5) == 0x000000, "Member 'FS_Procedural_Railings::EndCapMesh01_3_760BBF3442CEE66A8619C6ACDB6FC8A5' has a wrong offset!");
static_assert(offsetof(FS_Procedural_Railings, MiddleMesh_13_AF81189944A40C7BE1EB0FBDD7DA8D92) == 0x000008, "Member 'FS_Procedural_Railings::MiddleMesh_13_AF81189944A40C7BE1EB0FBDD7DA8D92' has a wrong offset!");
static_assert(offsetof(FS_Procedural_Railings, MidSections_9_E8A416F7420638E589374EBD6B46658F) == 0x000010, "Member 'FS_Procedural_Railings::MidSections_9_E8A416F7420638E589374EBD6B46658F' has a wrong offset!");
static_assert(offsetof(FS_Procedural_Railings, AnchorMesh_12_0D2BA111453584DBA4F69BA366F04A5C) == 0x000018, "Member 'FS_Procedural_Railings::AnchorMesh_12_0D2BA111453584DBA4F69BA366F04A5C' has a wrong offset!");
static_assert(offsetof(FS_Procedural_Railings, AnchorMeshZOffset_26_FE31A0AB4EDBD34F6F85E5933A7DAE60) == 0x000020, "Member 'FS_Procedural_Railings::AnchorMeshZOffset_26_FE31A0AB4EDBD34F6F85E5933A7DAE60' has a wrong offset!");
static_assert(offsetof(FS_Procedural_Railings, LightMesh_15_B371CCF74C09256980BD9F923011B2D4) == 0x000028, "Member 'FS_Procedural_Railings::LightMesh_15_B371CCF74C09256980BD9F923011B2D4' has a wrong offset!");
static_assert(offsetof(FS_Procedural_Railings, LightMeshZOffset_27_EC1E51134369A963454D728A071D4263) == 0x000030, "Member 'FS_Procedural_Railings::LightMeshZOffset_27_EC1E51134369A963454D728A071D4263' has a wrong offset!");
static_assert(offsetof(FS_Procedural_Railings, NumberofLights_18_93F9FEBE4203A20BA3B91DAC07E81238) == 0x000038, "Member 'FS_Procedural_Railings::NumberofLights_18_93F9FEBE4203A20BA3B91DAC07E81238' has a wrong offset!");
static_assert(offsetof(FS_Procedural_Railings, Spacing_20_9A9E5BC34EEB2FD15228599E217275F3) == 0x00003C, "Member 'FS_Procedural_Railings::Spacing_20_9A9E5BC34EEB2FD15228599E217275F3' has a wrong offset!");
static_assert(offsetof(FS_Procedural_Railings, InitialLightOffset_33_F848CB0A413F7A81BDED4CBC572F311A) == 0x000040, "Member 'FS_Procedural_Railings::InitialLightOffset_33_F848CB0A413F7A81BDED4CBC572F311A' has a wrong offset!");

}

