#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SBaseDoorStyles

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct SBaseDoorStyles.SBaseDoorStyles
// 0x0048 (0x0048 - 0x0000)
struct FSBaseDoorStyles final
{
public:
	class UStaticMesh*                            FrameMesh_2_702515BA417786D23349A2B9AB4146D1;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            DoorMesh_L_23_CBF8C4374112EEBE8FDC39BFB360E55C;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            DoorMesh_R_26_A0AF8504466850FFDE01DFAC297CA1CD;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            LockedDoorMesh_22_005355194BBAF5102105F2862CAC7BB9; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          OpenSound_8_DCB2FA9043FF38CF2A505FA3DE958333;      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CloseSound_19_9EF56B384CD4C4B4B2879C8D91624AAA;    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        SlideSpeed_12_B540190A4FC485A8332820B8D4C77AD2;    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SlideDistance_14_07F11B1B49821235FABC4ABF9506B11C; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InterpExponent_16_15C9E4C8459447D280F66ABC33557685; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSBaseDoorStyles) == 0x000008, "Wrong alignment on FSBaseDoorStyles");
static_assert(sizeof(FSBaseDoorStyles) == 0x000048, "Wrong size on FSBaseDoorStyles");
static_assert(offsetof(FSBaseDoorStyles, FrameMesh_2_702515BA417786D23349A2B9AB4146D1) == 0x000000, "Member 'FSBaseDoorStyles::FrameMesh_2_702515BA417786D23349A2B9AB4146D1' has a wrong offset!");
static_assert(offsetof(FSBaseDoorStyles, DoorMesh_L_23_CBF8C4374112EEBE8FDC39BFB360E55C) == 0x000008, "Member 'FSBaseDoorStyles::DoorMesh_L_23_CBF8C4374112EEBE8FDC39BFB360E55C' has a wrong offset!");
static_assert(offsetof(FSBaseDoorStyles, DoorMesh_R_26_A0AF8504466850FFDE01DFAC297CA1CD) == 0x000010, "Member 'FSBaseDoorStyles::DoorMesh_R_26_A0AF8504466850FFDE01DFAC297CA1CD' has a wrong offset!");
static_assert(offsetof(FSBaseDoorStyles, LockedDoorMesh_22_005355194BBAF5102105F2862CAC7BB9) == 0x000018, "Member 'FSBaseDoorStyles::LockedDoorMesh_22_005355194BBAF5102105F2862CAC7BB9' has a wrong offset!");
static_assert(offsetof(FSBaseDoorStyles, OpenSound_8_DCB2FA9043FF38CF2A505FA3DE958333) == 0x000020, "Member 'FSBaseDoorStyles::OpenSound_8_DCB2FA9043FF38CF2A505FA3DE958333' has a wrong offset!");
static_assert(offsetof(FSBaseDoorStyles, CloseSound_19_9EF56B384CD4C4B4B2879C8D91624AAA) == 0x000028, "Member 'FSBaseDoorStyles::CloseSound_19_9EF56B384CD4C4B4B2879C8D91624AAA' has a wrong offset!");
static_assert(offsetof(FSBaseDoorStyles, SlideSpeed_12_B540190A4FC485A8332820B8D4C77AD2) == 0x000030, "Member 'FSBaseDoorStyles::SlideSpeed_12_B540190A4FC485A8332820B8D4C77AD2' has a wrong offset!");
static_assert(offsetof(FSBaseDoorStyles, SlideDistance_14_07F11B1B49821235FABC4ABF9506B11C) == 0x000038, "Member 'FSBaseDoorStyles::SlideDistance_14_07F11B1B49821235FABC4ABF9506B11C' has a wrong offset!");
static_assert(offsetof(FSBaseDoorStyles, InterpExponent_16_15C9E4C8459447D280F66ABC33557685) == 0x000040, "Member 'FSBaseDoorStyles::InterpExponent_16_15C9E4C8459447D280F66ABC33557685' has a wrong offset!");

}

