#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_Container_Medium_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SM_Container_Medium_01.SM_Container_Medium_01_C
// 0x0018 (0x02B8 - 0x02A0)
class ASM_Container_Medium_01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Container_Medium_Decal_01;                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Medium_Mesh_01;                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SM_Container_Medium_01_C">();
	}
	static class ASM_Container_Medium_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASM_Container_Medium_01_C>();
	}
};
static_assert(alignof(ASM_Container_Medium_01_C) == 0x000008, "Wrong alignment on ASM_Container_Medium_01_C");
static_assert(sizeof(ASM_Container_Medium_01_C) == 0x0002B8, "Wrong size on ASM_Container_Medium_01_C");
static_assert(offsetof(ASM_Container_Medium_01_C, SM_Container_Medium_Decal_01) == 0x0002A0, "Member 'ASM_Container_Medium_01_C::SM_Container_Medium_Decal_01' has a wrong offset!");
static_assert(offsetof(ASM_Container_Medium_01_C, SM_Container_Medium_Mesh_01) == 0x0002A8, "Member 'ASM_Container_Medium_01_C::SM_Container_Medium_Mesh_01' has a wrong offset!");
static_assert(offsetof(ASM_Container_Medium_01_C, DefaultSceneRoot) == 0x0002B0, "Member 'ASM_Container_Medium_01_C::DefaultSceneRoot' has a wrong offset!");

}

