#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_Container_Medium_03

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SM_Container_Medium_03.SM_Container_Medium_03_C
// 0x0018 (0x02B8 - 0x02A0)
class ASM_Container_Medium_03_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Container_Medium_Decal_03;                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_Medium_Mesh_03;                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SM_Container_Medium_03_C">();
	}
	static class ASM_Container_Medium_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASM_Container_Medium_03_C>();
	}
};
static_assert(alignof(ASM_Container_Medium_03_C) == 0x000008, "Wrong alignment on ASM_Container_Medium_03_C");
static_assert(sizeof(ASM_Container_Medium_03_C) == 0x0002B8, "Wrong size on ASM_Container_Medium_03_C");
static_assert(offsetof(ASM_Container_Medium_03_C, SM_Container_Medium_Decal_03) == 0x0002A0, "Member 'ASM_Container_Medium_03_C::SM_Container_Medium_Decal_03' has a wrong offset!");
static_assert(offsetof(ASM_Container_Medium_03_C, SM_Container_Medium_Mesh_03) == 0x0002A8, "Member 'ASM_Container_Medium_03_C::SM_Container_Medium_Mesh_03' has a wrong offset!");
static_assert(offsetof(ASM_Container_Medium_03_C, DefaultSceneRoot) == 0x0002B0, "Member 'ASM_Container_Medium_03_C::DefaultSceneRoot' has a wrong offset!");

}

