#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_LK_Traffic_SGN_02

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SM_LK_Traffic_SGN_02.SM_LK_Traffic_SGN_02_C
// 0x0018 (0x02B8 - 0x02A0)
class ASM_LK_Traffic_SGN_02_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_LK_Traffic_SGN_Mesh_02;                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LK_Traffic_SGN_Decal_02;                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SM_LK_Traffic_SGN_02_C">();
	}
	static class ASM_LK_Traffic_SGN_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASM_LK_Traffic_SGN_02_C>();
	}
};
static_assert(alignof(ASM_LK_Traffic_SGN_02_C) == 0x000008, "Wrong alignment on ASM_LK_Traffic_SGN_02_C");
static_assert(sizeof(ASM_LK_Traffic_SGN_02_C) == 0x0002B8, "Wrong size on ASM_LK_Traffic_SGN_02_C");
static_assert(offsetof(ASM_LK_Traffic_SGN_02_C, SM_LK_Traffic_SGN_Mesh_02) == 0x0002A0, "Member 'ASM_LK_Traffic_SGN_02_C::SM_LK_Traffic_SGN_Mesh_02' has a wrong offset!");
static_assert(offsetof(ASM_LK_Traffic_SGN_02_C, SM_LK_Traffic_SGN_Decal_02) == 0x0002A8, "Member 'ASM_LK_Traffic_SGN_02_C::SM_LK_Traffic_SGN_Decal_02' has a wrong offset!");
static_assert(offsetof(ASM_LK_Traffic_SGN_02_C, DefaultSceneRoot) == 0x0002B0, "Member 'ASM_LK_Traffic_SGN_02_C::DefaultSceneRoot' has a wrong offset!");

}

