#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_LK_Dumpster_Nanite_MeshDecal_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SM_LK_Dumpster_Nanite_MeshDecal_01.SM_LK_Dumpster_Nanite_MeshDecal_01_C
// 0x0018 (0x02B8 - 0x02A0)
class ASM_LK_Dumpster_Nanite_MeshDecal_01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_LK_Dumpster_MHP_01_StaticMeshComponent0;        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LK_Dumpster_MHP_MeshDecal_01_StaticMeshComponent0; // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SM_LK_Dumpster_Nanite_MeshDecal_01_C">();
	}
	static class ASM_LK_Dumpster_Nanite_MeshDecal_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASM_LK_Dumpster_Nanite_MeshDecal_01_C>();
	}
};
static_assert(alignof(ASM_LK_Dumpster_Nanite_MeshDecal_01_C) == 0x000008, "Wrong alignment on ASM_LK_Dumpster_Nanite_MeshDecal_01_C");
static_assert(sizeof(ASM_LK_Dumpster_Nanite_MeshDecal_01_C) == 0x0002B8, "Wrong size on ASM_LK_Dumpster_Nanite_MeshDecal_01_C");
static_assert(offsetof(ASM_LK_Dumpster_Nanite_MeshDecal_01_C, SM_LK_Dumpster_MHP_01_StaticMeshComponent0) == 0x0002A0, "Member 'ASM_LK_Dumpster_Nanite_MeshDecal_01_C::SM_LK_Dumpster_MHP_01_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ASM_LK_Dumpster_Nanite_MeshDecal_01_C, SM_LK_Dumpster_MHP_MeshDecal_01_StaticMeshComponent0) == 0x0002A8, "Member 'ASM_LK_Dumpster_Nanite_MeshDecal_01_C::SM_LK_Dumpster_MHP_MeshDecal_01_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ASM_LK_Dumpster_Nanite_MeshDecal_01_C, SharedRoot) == 0x0002B0, "Member 'ASM_LK_Dumpster_Nanite_MeshDecal_01_C::SharedRoot' has a wrong offset!");

}

