#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_VEH_STC_CIV_SDN_Odesa_02

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SM_VEH_STC_CIV_SDN_Odesa_02.SM_VEH_STC_CIV_SDN_Odesa_02_C
// 0x0028 (0x02C8 - 0x02A0)
class ASM_VEH_STC_CIV_SDN_Odesa_02_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_VEH_STC_CIV_SDN_Odesa_01_Decals;                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_VEH_STC_CIV_SDN_Odesa_Hood;                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_VEH_STC_CIV_SDN_Odesa_Bumper_FW;                // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_VEH_STC_CIV_SDN_Odesa_Bumper_BW;                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SM_VEH_STC_CIV_SDN_Odesa_02_C">();
	}
	static class ASM_VEH_STC_CIV_SDN_Odesa_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASM_VEH_STC_CIV_SDN_Odesa_02_C>();
	}
};
static_assert(alignof(ASM_VEH_STC_CIV_SDN_Odesa_02_C) == 0x000008, "Wrong alignment on ASM_VEH_STC_CIV_SDN_Odesa_02_C");
static_assert(sizeof(ASM_VEH_STC_CIV_SDN_Odesa_02_C) == 0x0002C8, "Wrong size on ASM_VEH_STC_CIV_SDN_Odesa_02_C");
static_assert(offsetof(ASM_VEH_STC_CIV_SDN_Odesa_02_C, SM_VEH_STC_CIV_SDN_Odesa_01_Decals) == 0x0002A0, "Member 'ASM_VEH_STC_CIV_SDN_Odesa_02_C::SM_VEH_STC_CIV_SDN_Odesa_01_Decals' has a wrong offset!");
static_assert(offsetof(ASM_VEH_STC_CIV_SDN_Odesa_02_C, SM_VEH_STC_CIV_SDN_Odesa_Hood) == 0x0002A8, "Member 'ASM_VEH_STC_CIV_SDN_Odesa_02_C::SM_VEH_STC_CIV_SDN_Odesa_Hood' has a wrong offset!");
static_assert(offsetof(ASM_VEH_STC_CIV_SDN_Odesa_02_C, SM_VEH_STC_CIV_SDN_Odesa_Bumper_FW) == 0x0002B0, "Member 'ASM_VEH_STC_CIV_SDN_Odesa_02_C::SM_VEH_STC_CIV_SDN_Odesa_Bumper_FW' has a wrong offset!");
static_assert(offsetof(ASM_VEH_STC_CIV_SDN_Odesa_02_C, SM_VEH_STC_CIV_SDN_Odesa_Bumper_BW) == 0x0002B8, "Member 'ASM_VEH_STC_CIV_SDN_Odesa_02_C::SM_VEH_STC_CIV_SDN_Odesa_Bumper_BW' has a wrong offset!");
static_assert(offsetof(ASM_VEH_STC_CIV_SDN_Odesa_02_C, StaticMesh) == 0x0002C0, "Member 'ASM_VEH_STC_CIV_SDN_Odesa_02_C::StaticMesh' has a wrong offset!");

}

