#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Stork_Crane_Truck

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Stork_Crane_Truck.Stork_Crane_Truck_C
// 0x0038 (0x02D8 - 0x02A0)
class AStork_Crane_Truck_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Strela;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Head;                                           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Catt;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Body;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Balast;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Tross;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Stork_Crane_Truck_C">();
	}
	static class AStork_Crane_Truck_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStork_Crane_Truck_C>();
	}
};
static_assert(alignof(AStork_Crane_Truck_C) == 0x000008, "Wrong alignment on AStork_Crane_Truck_C");
static_assert(sizeof(AStork_Crane_Truck_C) == 0x0002D8, "Wrong size on AStork_Crane_Truck_C");
static_assert(offsetof(AStork_Crane_Truck_C, SM_Strela) == 0x0002A0, "Member 'AStork_Crane_Truck_C::SM_Strela' has a wrong offset!");
static_assert(offsetof(AStork_Crane_Truck_C, SM_Head) == 0x0002A8, "Member 'AStork_Crane_Truck_C::SM_Head' has a wrong offset!");
static_assert(offsetof(AStork_Crane_Truck_C, SM_Catt) == 0x0002B0, "Member 'AStork_Crane_Truck_C::SM_Catt' has a wrong offset!");
static_assert(offsetof(AStork_Crane_Truck_C, SM_Body) == 0x0002B8, "Member 'AStork_Crane_Truck_C::SM_Body' has a wrong offset!");
static_assert(offsetof(AStork_Crane_Truck_C, SM_Balast) == 0x0002C0, "Member 'AStork_Crane_Truck_C::SM_Balast' has a wrong offset!");
static_assert(offsetof(AStork_Crane_Truck_C, SM_Tross) == 0x0002C8, "Member 'AStork_Crane_Truck_C::SM_Tross' has a wrong offset!");
static_assert(offsetof(AStork_Crane_Truck_C, DefaultSceneRoot) == 0x0002D0, "Member 'AStork_Crane_Truck_C::DefaultSceneRoot' has a wrong offset!");

}

