#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "RigVM_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "PBIK_structs.hpp"


namespace SDK
{

// PropertyBag Transient.PropertyBag_0
// 0x0000 (0x0000 - 0x0000)
struct FPropertyBag_0 final
{
};
static_assert(alignof(FPropertyBag_0) == 0x000001, "Wrong alignment on FPropertyBag_0");
static_assert(sizeof(FPropertyBag_0) == 0x000001, "Wrong size on FPropertyBag_0");

// PropertyBag Transient.PropertyBag_e1a6c311960c897f
// 0x02A0 (0x02A0 - 0x0000)
struct FPropertyBag_e1a6c311960c897f final
{
public:
	struct FTransform                             RigVMModel___WPN_Left_IK_RigUnit_SetTransform_3_2_Value__IO; // 0x0000(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___WPN_Left_IK_RigUnit_SetTransform_3_2_CachedIndex; // 0x0060(0x0010)(Edit)
	struct FTransform                             RigVMModel___WPN_Left_IK_RigUnit_GetTransform_1_Transform; // 0x0070(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___WPN_Left_IK_RigUnit_GetTransform_1_CachedIndex; // 0x00D0(0x0010)(Edit)
	struct FTransform                             RigVMModel___WPN_Left_IK_RigUnit_GetTransform_5_2_Transform; // 0x00E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___WPN_Left_IK_RigUnit_GetTransform_5_2_CachedIndex; // 0x0140(0x0010)(Edit)
	TArray<struct FPBIKEffector>                  RigVMModel___WPN_Left_IK_PBIK_2_Effectors__IO;     // 0x0150(0x0010)(Edit)
	TArray<TArray<int32>>                         RigVMModel___WPN_Left_IK_PBIK_2_EffectorSolverIndices; // 0x0160(0x0010)(Edit)
	TArray<struct FPBIKWorkData>                  RigVMModel___WPN_Left_IK_PBIK_2_WorkData;          // 0x0170(0x0010)(Edit)
	struct FTransform                             RigVMModel___WPN_Right_IK_RigUnit_SetTransform_3_1_Value__IO; // 0x0180(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___WPN_Right_IK_RigUnit_SetTransform_3_1_CachedIndex; // 0x01E0(0x0010)(Edit)
	struct FTransform                             RigVMModel___WPN_Right_IK_RigUnit_GetTransform_5_1_Transform; // 0x01F0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___WPN_Right_IK_RigUnit_GetTransform_5_1_CachedIndex; // 0x0250(0x0010)(Edit)
	TArray<struct FPBIKEffector>                  RigVMModel___WPN_Right_IK_PBIK_1_Effectors__IO;    // 0x0260(0x0010)(Edit)
	TArray<TArray<int32>>                         RigVMModel___WPN_Right_IK_PBIK_1_EffectorSolverIndices; // 0x0270(0x0010)(Edit)
	TArray<struct FPBIKWorkData>                  RigVMModel___WPN_Right_IK_PBIK_1_WorkData;         // 0x0280(0x0010)(Edit)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_2_1_BlockToRun; // 0x0290(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x0298(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_e1a6c311960c897f) == 0x000010, "Wrong alignment on FPropertyBag_e1a6c311960c897f");
static_assert(sizeof(FPropertyBag_e1a6c311960c897f) == 0x0002A0, "Wrong size on FPropertyBag_e1a6c311960c897f");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Left_IK_RigUnit_SetTransform_3_2_Value__IO) == 0x000000, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Left_IK_RigUnit_SetTransform_3_2_Value__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Left_IK_RigUnit_SetTransform_3_2_CachedIndex) == 0x000060, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Left_IK_RigUnit_SetTransform_3_2_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Left_IK_RigUnit_GetTransform_1_Transform) == 0x000070, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Left_IK_RigUnit_GetTransform_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Left_IK_RigUnit_GetTransform_1_CachedIndex) == 0x0000D0, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Left_IK_RigUnit_GetTransform_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Left_IK_RigUnit_GetTransform_5_2_Transform) == 0x0000E0, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Left_IK_RigUnit_GetTransform_5_2_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Left_IK_RigUnit_GetTransform_5_2_CachedIndex) == 0x000140, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Left_IK_RigUnit_GetTransform_5_2_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Left_IK_PBIK_2_Effectors__IO) == 0x000150, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Left_IK_PBIK_2_Effectors__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Left_IK_PBIK_2_EffectorSolverIndices) == 0x000160, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Left_IK_PBIK_2_EffectorSolverIndices' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Left_IK_PBIK_2_WorkData) == 0x000170, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Left_IK_PBIK_2_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Right_IK_RigUnit_SetTransform_3_1_Value__IO) == 0x000180, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Right_IK_RigUnit_SetTransform_3_1_Value__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Right_IK_RigUnit_SetTransform_3_1_CachedIndex) == 0x0001E0, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Right_IK_RigUnit_SetTransform_3_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Right_IK_RigUnit_GetTransform_5_1_Transform) == 0x0001F0, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Right_IK_RigUnit_GetTransform_5_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Right_IK_RigUnit_GetTransform_5_1_CachedIndex) == 0x000250, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Right_IK_RigUnit_GetTransform_5_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Right_IK_PBIK_1_Effectors__IO) == 0x000260, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Right_IK_PBIK_1_Effectors__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Right_IK_PBIK_1_EffectorSolverIndices) == 0x000270, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Right_IK_PBIK_1_EffectorSolverIndices' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___WPN_Right_IK_PBIK_1_WorkData) == 0x000280, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___WPN_Right_IK_PBIK_1_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___RigVMFunction_ControlFlowBranch_2_1_BlockToRun) == 0x000290, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___RigVMFunction_ControlFlowBranch_2_1_BlockToRun' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e1a6c311960c897f, RigVMModel___RigVMFunction_ControlFlowBranch_2_BlockToRun) == 0x000298, "Member 'FPropertyBag_e1a6c311960c897f::RigVMModel___RigVMFunction_ControlFlowBranch_2_BlockToRun' has a wrong offset!");

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosDestructionEvent_SWC) == 0x000004, "Wrong alignment on FChaosDestructionEvent_SWC");
static_assert(sizeof(FChaosDestructionEvent_SWC) == 0x000044, "Wrong size on FChaosDestructionEvent_SWC");
static_assert(offsetof(FChaosDestructionEvent_SWC, Position) == 0x000000, "Member 'FChaosDestructionEvent_SWC::Position' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Normal) == 0x00000C, "Member 'FChaosDestructionEvent_SWC::Normal' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Velocity) == 0x000018, "Member 'FChaosDestructionEvent_SWC::Velocity' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, AngularVelocity) == 0x000024, "Member 'FChaosDestructionEvent_SWC::AngularVelocity' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ExtentMin) == 0x000030, "Member 'FChaosDestructionEvent_SWC::ExtentMin' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ExtentMax) == 0x000034, "Member 'FChaosDestructionEvent_SWC::ExtentMax' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ParticleID) == 0x000038, "Member 'FChaosDestructionEvent_SWC::ParticleID' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Time) == 0x00003C, "Member 'FChaosDestructionEvent_SWC::Time' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Type) == 0x000040, "Member 'FChaosDestructionEvent_SWC::Type' has a wrong offset!");

// PropertyBag Transient.PropertyBag_c6625ea533c5970e
// 0x02A0 (0x02A0 - 0x0000)
struct FPropertyBag_c6625ea533c5970e final
{
public:
	struct FRigElementKey                         RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_Child__Const; // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_bMaintainOffset__Const; // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFilterOptionPerAxis                   RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_Filter__Const; // 0x000D(0x0003)(Edit, NoDestructor)
	TArray<struct FConstraintParent>              RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_Parents__Const; // 0x0010(0x0010)(Edit)
	struct FRigUnit_RotationConstraint_AdvancedSettings RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_AdvancedSettings__Const; // 0x0020(0x0002)(Edit, NoDestructor)
	uint8                                         Pad_51A4[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_Weight__Const; // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___CollapseNode_RigUnit_SetRotation_Item__Const; // 0x0028(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___CollapseNode_RigUnit_SetRotation_Space__Const; // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___CollapseNode_RigUnit_SetRotation_bInitial__Const; // 0x0035(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51A5[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___CollapseNode_AimBoneMath_Primary__Const; // 0x0038(0x0048)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___CollapseNode_RigUnit_GetTransform_1_Item__Const; // 0x0080(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51A6[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___CollapseNode_AimBoneMath_Secondary__Const; // 0x0090(0x0048)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___CollapseNode_RigUnit_GetTransform_6_1_Item__Const; // 0x00D8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51A7[0xC];                                     // 0x00E4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         RigVMModel___CollapseNode_AimBoneMath_DebugSettings__Const; // 0x00F0(0x0070)(Edit, NoDestructor)
	struct FRigUnit_AimItem_Target                RigVMModel___CollapseNode_AimBoneMath_1_Primary__Const; // 0x0160(0x0048)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___CollapseNode_RigUnit_SetRotation_2_Item__Const; // 0x01A8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___CollapseNode_RigUnit_GetTransform_1_1_Item__Const; // 0x01B4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                RigVMModel___CollapseNode_AimBoneMath_2_Secondary__Const; // 0x01C0(0x0048)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_1_Child__Const; // 0x0208(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51A8[0x4];                                     // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_1_Parents__Const; // 0x0218(0x0010)(Edit)
	struct FRigElementKey                         RigVMModel___CollapseNode_RigUnit_SetRotation_3_Item__Const; // 0x0228(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___CollapseNode_RigUnit_GetTransform_1_2_Item__Const; // 0x0234(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___CollapseNode_RigUnit_GetTransform_6_Item__Const; // 0x0240(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___CollapseNode_RigUnit_SetRotation_2_1_Item__Const; // 0x024C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___CollapseNode_RigUnit_GetTransform_1_1_1_Item__Const; // 0x0258(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___CollapseNode_RigUnit_SetRotation_4_Item__Const; // 0x0264(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___CollapseNode_RigUnit_GetTransform_4_Item__Const; // 0x0270(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___CollapseNode_RigUnit_SetRotation_5_Item__Const; // 0x027C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___CollapseNode_RigUnit_GetTransform_5_Item__Const; // 0x0288(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_c6625ea533c5970e) == 0x000010, "Wrong alignment on FPropertyBag_c6625ea533c5970e");
static_assert(sizeof(FPropertyBag_c6625ea533c5970e) == 0x0002A0, "Wrong size on FPropertyBag_c6625ea533c5970e");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_Child__Const) == 0x000000, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_Child__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_bMaintainOffset__Const) == 0x00000C, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_bMaintainOffset__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_Filter__Const) == 0x00000D, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_Filter__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_Parents__Const) == 0x000010, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_Parents__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_AdvancedSettings__Const) == 0x000020, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_AdvancedSettings__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_Weight__Const) == 0x000024, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_Weight__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_SetRotation_Item__Const) == 0x000028, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_SetRotation_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_SetRotation_Space__Const) == 0x000034, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_SetRotation_Space__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_SetRotation_bInitial__Const) == 0x000035, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_SetRotation_bInitial__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_AimBoneMath_Primary__Const) == 0x000038, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_AimBoneMath_Primary__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_GetTransform_1_Item__Const) == 0x000080, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_GetTransform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_AimBoneMath_Secondary__Const) == 0x000090, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_AimBoneMath_Secondary__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_GetTransform_6_1_Item__Const) == 0x0000D8, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_GetTransform_6_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_AimBoneMath_DebugSettings__Const) == 0x0000F0, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_AimBoneMath_DebugSettings__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_AimBoneMath_1_Primary__Const) == 0x000160, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_AimBoneMath_1_Primary__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_SetRotation_2_Item__Const) == 0x0001A8, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_SetRotation_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_GetTransform_1_1_Item__Const) == 0x0001B4, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_GetTransform_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_AimBoneMath_2_Secondary__Const) == 0x0001C0, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_AimBoneMath_2_Secondary__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_1_Child__Const) == 0x000208, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_1_Child__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_1_Parents__Const) == 0x000218, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RotationConstraintLocalSpaceOffset_1_Parents__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_SetRotation_3_Item__Const) == 0x000228, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_SetRotation_3_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_GetTransform_1_2_Item__Const) == 0x000234, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_GetTransform_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_GetTransform_6_Item__Const) == 0x000240, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_GetTransform_6_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_SetRotation_2_1_Item__Const) == 0x00024C, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_SetRotation_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_GetTransform_1_1_1_Item__Const) == 0x000258, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_GetTransform_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_SetRotation_4_Item__Const) == 0x000264, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_SetRotation_4_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_GetTransform_4_Item__Const) == 0x000270, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_GetTransform_4_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_SetRotation_5_Item__Const) == 0x00027C, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_SetRotation_5_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c6625ea533c5970e, RigVMModel___CollapseNode_RigUnit_GetTransform_5_Item__Const) == 0x000288, "Member 'FPropertyBag_c6625ea533c5970e::RigVMModel___CollapseNode_RigUnit_GetTransform_5_Item__Const' has a wrong offset!");

// PropertyBag Transient.PropertyBag_a595b57757c5fe82
// 0x0A30 (0x0A30 - 0x0000)
struct FPropertyBag_a595b57757c5fe82 final
{
public:
	double                                        RigVMModel___VariableSetter_HeadShot_Head_Ints__Const; // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableSetter_HeadShot_Body_Ints__Const; // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableSetter_HeadShot_Arm_Ints__Const; // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableSetter_BodyShoy_Head_Ints__Const; // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableSetter_BodyShoy_Body_Ints__Const; // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableSetter_ArmShotL_Head_Ints__Const; // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableSetter_ArmShotL_Body_Ints__Const; // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableSetter_ArmShotL_ArmL_Ints__Const; // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableSetter_RandomAngle__Const;    // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetControlTransformsToBones_RigUnit_SetTransform_2_Item__Const; // 0x0048(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___SetControlTransformsToBones_RigUnit_SetTransform_2_Space__Const; // 0x0054(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___SetControlTransformsToBones_RigUnit_SetTransform_2_bInitial__Const; // 0x0055(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51A9[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___SetControlTransformsToBones_RigUnit_GetTransform_2_Item__Const; // 0x0058(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SetControlTransformsToBones_RigUnit_SetTransform_2_Weight__Const; // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___SetControlTransformsToBones_RigUnit_SetTransform_2_bPropagateToChildren__Const; // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51AA[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___SetControlTransformsToBones_RigUnit_SetTransform_3_Item__Const; // 0x006C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetControlTransformsToBones_RigUnit_GetTransform_3_Item__Const; // 0x0078(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51AB[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CheckAndManipulateVector_3___CheckAndManipulateVector_DISPATCH_RigVMDispatch_CoreNotEquals_1_1_1_1_1_1_1_1_1_B__Const; // 0x0088(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CheckAndManipulateVector_3___CheckAndManipulateVector_GetRandomAngle_Random_Seed__Const; // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51AC[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CheckAndManipulateVector_3___CheckAndManipulateVector_GetRandomAngle_Divide_4_B__Const; // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CheckAndManipulateVector_3___CheckAndManipulateVector_GetRandomAngle_Divide_4_1_B__Const; // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CheckAndManipulateVector_3___CheckAndManipulateVector_GetRandomAngle_Random_Duration__Const; // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           CheckAndManipulateVector_3___CheckAndManipulateVector_GetRandomAngle_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const; // 0x00BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51AD[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CheckAndManipulateVector_3___CheckAndManipulateVector_AccumulateLerp_1_1_1_1_Blend__Const; // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckAndManipulateVector_3___CheckAndManipulateVector_AccumulateLerp_1_1_1_1_bIntegrateDeltaTime__Const; // 0x00C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51AE[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SmoothWeight_3___SmoothWeight_AccumulateLerp_8_2_InitialValue__Const; // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SmoothWeight_3___SmoothWeight_AccumulateLerp_8_2_Blend__Const; // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SmoothWeight_3___SmoothWeight_AccumulateLerp_8_2_bIntegrateDeltaTime__Const; // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51AF[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         Offset___Offset_RigUnit_OffsetTransformForItem_3_1_1_1_1_1_1_2_Item__Const; // 0x00D4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Offset___Offset_RigUnit_OffsetTransformForItem_3_1_1_1_1_1_1_2_OffsetTransform__Const; // 0x00E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset___Offset_DecreasePowerOverTime_1_Blend__Const; // 0x0140(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B0[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DecreasePowerOverTime_1___DecreasePowerOverTime_AccumulateLerp_InitialValue__Const; // 0x0148(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DecreasePowerOverTime_1___DecreasePowerOverTime_AccumulateLerp_bIntegrateDeltaTime__Const; // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B1[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     DecreasePowerOverTime_1___DecreasePowerOverTime_RigVMFunction_AnimEvalRichCurve_1_1_1_2_2_1_Curve__Const; // 0x0168(0x0088)(Edit)
	float                                         DecreasePowerOverTime_1___DecreasePowerOverTime_RigVMFunction_AnimEvalRichCurve_1_1_1_2_2_1_SourceMinimum__Const; // 0x01F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DecreasePowerOverTime_1___DecreasePowerOverTime_RigVMFunction_AnimEvalRichCurve_1_1_1_2_2_1_SourceMaximum__Const; // 0x01F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Offset___Offset_Interpolate_A__Const;              // 0x01F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Offset___Offset_Interpolate_B__Const;              // 0x0200(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Offset___Offset_Random_4_1_1_1_1_1_1_3_Seed__Const; // 0x0208(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset___Offset_Random_4_1_1_1_1_1_1_3_Minimum__Const; // 0x020C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset___Offset_Random_4_1_1_1_1_1_1_3_Maximum__Const; // 0x0210(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset___Offset_Random_4_1_1_1_1_1_1_3_Duration__Const; // 0x0214(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset___Offset_AccumulateLerp_4_1_3_Blend__Const; // 0x0218(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Offset___Offset_AccumulateLerp_4_1_3_bIntegrateDeltaTime__Const; // 0x021C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B2[0x3];                                     // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Offset___Offset_SpringInterp_4_2_Force__Const;     // 0x0220(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Offset___Offset_Subtract_B__Const;                 // 0x0238(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset___Offset_Random_4_1_1_1_1_1_1_3_1_Duration__Const; // 0x0240(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           IncreaseValueImpact_2___IncreaseValueImpact_RigVMFunction_MathQuaternionFromEuler_2_2_1_2_RotationOrder__Const; // 0x0244(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B3[0x3];                                     // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         Offset___Offset_RigUnit_OffsetTransformForItem_3_1_1_1_1_1_1_2_1_1_Item__Const; // 0x0248(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           IncreaseValueImpact_1___IncreaseValueImpact_RigVMFunction_MathQuaternionFromEuler_2_2_1_2_RotationOrder__Const; // 0x0254(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B4[0x3];                                     // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Offset___Offset_RigUnit_OffsetTransformForItem_3_1_1_1_1_1_1_2_1_1_Weight__Const; // 0x0258(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Offset___Offset_ParentConstraint_Child__Const;     // 0x025C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FTransformFilter                       Offset___Offset_ParentConstraint_Filter__Const;    // 0x0268(0x0009)(Edit, NoDestructor)
	uint8                                         Pad_51B5[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              Offset___Offset_ParentConstraint_Parents__Const;   // 0x0278(0x0010)(Edit)
	struct FRigUnit_ParentConstraint_AdvancedSettings Offset___Offset_ParentConstraint_AdvancedSettings__Const; // 0x0288(0x0002)(Edit, NoDestructor)
	uint8                                         Pad_51B6[0x2];                                     // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Offset___Offset_ParentConstraint_Weight__Const;    // 0x028C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Offset___Offset_ParentConstraint_1_Child__Const;   // 0x0290(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B7[0x4];                                     // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              Offset___Offset_ParentConstraint_1_Parents__Const; // 0x02A0(0x0010)(Edit)
	ERigVMTransformSpace                          Offset___Offset_RigUnit_SetTransform_1_1_1_Space__Const; // 0x02B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Offset___Offset_RigUnit_SetTransform_1_1_1_bInitial__Const; // 0x02B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B8[0x2];                                     // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         Offset___Offset_RigUnit_GetTransform_5_1_1_1_Item__Const; // 0x02B4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           IncreaseValueImpact_4___IncreaseValueImpact_RigVMFunction_MathQuaternionFromEuler_2_2_1_2_RotationOrder__Const; // 0x02C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B9[0x3];                                     // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         Offset___Offset_RigUnit_GetTransform_5_2_1_Item__Const; // 0x02C4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           IncreaseValueImpact_4_1___IncreaseValueImpact_RigVMFunction_MathQuaternionFromEuler_2_2_1_2_RotationOrder__Const; // 0x02D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51BA[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CheckAndManipulateVector_1___CheckAndManipulateVector_DISPATCH_RigVMDispatch_CoreNotEquals_1_1_1_1_1_1_1_1_1_B__Const; // 0x02D8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CheckAndManipulateVector_1___CheckAndManipulateVector_GetRandomAngle_Random_Seed__Const; // 0x02F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51BB[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CheckAndManipulateVector_1___CheckAndManipulateVector_GetRandomAngle_Divide_4_B__Const; // 0x02F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CheckAndManipulateVector_1___CheckAndManipulateVector_GetRandomAngle_Divide_4_1_B__Const; // 0x0300(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CheckAndManipulateVector_1___CheckAndManipulateVector_GetRandomAngle_Random_Duration__Const; // 0x0308(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           CheckAndManipulateVector_1___CheckAndManipulateVector_GetRandomAngle_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const; // 0x030C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51BC[0x3];                                     // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CheckAndManipulateVector_1___CheckAndManipulateVector_AccumulateLerp_1_1_1_1_Blend__Const; // 0x0310(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckAndManipulateVector_1___CheckAndManipulateVector_AccumulateLerp_1_1_1_1_bIntegrateDeltaTime__Const; // 0x0314(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51BD[0x3];                                     // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SmoothWeight_4___SmoothWeight_AccumulateLerp_8_2_InitialValue__Const; // 0x0318(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SmoothWeight_4___SmoothWeight_AccumulateLerp_8_2_Blend__Const; // 0x031C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SmoothWeight_4___SmoothWeight_AccumulateLerp_8_2_bIntegrateDeltaTime__Const; // 0x0320(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51BE[0x3];                                     // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         Offset_1___Offset_RigUnit_OffsetTransformForItem_3_1_1_1_1_1_1_2_Item__Const; // 0x0324(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Offset_1___Offset_RigUnit_OffsetTransformForItem_3_1_1_1_1_1_1_2_OffsetTransform__Const; // 0x0330(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_1___Offset_DecreasePowerOverTime_1_Blend__Const; // 0x0390(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51BF[0x4];                                     // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Offset_1___Offset_Interpolate_A__Const;            // 0x0398(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Offset_1___Offset_Interpolate_B__Const;            // 0x03A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Offset_1___Offset_Random_4_1_1_1_1_1_1_3_Seed__Const; // 0x03A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_1___Offset_Random_4_1_1_1_1_1_1_3_Minimum__Const; // 0x03AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_1___Offset_Random_4_1_1_1_1_1_1_3_Maximum__Const; // 0x03B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_1___Offset_Random_4_1_1_1_1_1_1_3_Duration__Const; // 0x03B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_1___Offset_AccumulateLerp_4_1_3_Blend__Const; // 0x03B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Offset_1___Offset_AccumulateLerp_4_1_3_bIntegrateDeltaTime__Const; // 0x03BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C0[0x3];                                     // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Offset_1___Offset_SpringInterp_4_2_Force__Const;   // 0x03C0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Offset_1___Offset_Subtract_B__Const;               // 0x03D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_1___Offset_Random_4_1_1_1_1_1_1_3_1_Duration__Const; // 0x03E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Offset_1___Offset_RigUnit_OffsetTransformForItem_3_1_1_1_1_1_1_2_1_1_Item__Const; // 0x03E4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_1___Offset_RigUnit_OffsetTransformForItem_3_1_1_1_1_1_1_2_1_1_Weight__Const; // 0x03F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Offset_1___Offset_ParentConstraint_Child__Const;   // 0x03F4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FTransformFilter                       Offset_1___Offset_ParentConstraint_Filter__Const;  // 0x0400(0x0009)(Edit, NoDestructor)
	uint8                                         Pad_51C1[0x7];                                     // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              Offset_1___Offset_ParentConstraint_Parents__Const; // 0x0410(0x0010)(Edit)
	struct FRigUnit_ParentConstraint_AdvancedSettings Offset_1___Offset_ParentConstraint_AdvancedSettings__Const; // 0x0420(0x0002)(Edit, NoDestructor)
	uint8                                         Pad_51C2[0x2];                                     // 0x0422(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Offset_1___Offset_ParentConstraint_Weight__Const;  // 0x0424(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Offset_1___Offset_ParentConstraint_1_Child__Const; // 0x0428(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C3[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              Offset_1___Offset_ParentConstraint_1_Parents__Const; // 0x0438(0x0010)(Edit)
	ERigVMTransformSpace                          Offset_1___Offset_RigUnit_SetTransform_1_1_1_Space__Const; // 0x0448(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Offset_1___Offset_RigUnit_SetTransform_1_1_1_bInitial__Const; // 0x0449(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C4[0x2];                                     // 0x044A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         Offset_1___Offset_RigUnit_GetTransform_5_1_1_1_Item__Const; // 0x044C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Offset_1___Offset_RigUnit_GetTransform_5_2_1_Item__Const; // 0x0458(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C5[0x4];                                     // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CheckAndManipulateVector___CheckAndManipulateVector_DISPATCH_RigVMDispatch_CoreNotEquals_1_1_1_1_1_1_1_1_1_B__Const; // 0x0468(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CheckAndManipulateVector___CheckAndManipulateVector_GetRandomAngle_Random_Seed__Const; // 0x0480(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C6[0x4];                                     // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CheckAndManipulateVector___CheckAndManipulateVector_GetRandomAngle_Divide_4_B__Const; // 0x0488(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CheckAndManipulateVector___CheckAndManipulateVector_GetRandomAngle_Divide_4_1_B__Const; // 0x0490(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CheckAndManipulateVector___CheckAndManipulateVector_GetRandomAngle_Random_Duration__Const; // 0x0498(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           CheckAndManipulateVector___CheckAndManipulateVector_GetRandomAngle_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const; // 0x049C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C7[0x3];                                     // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CheckAndManipulateVector___CheckAndManipulateVector_AccumulateLerp_1_1_1_1_Blend__Const; // 0x04A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckAndManipulateVector___CheckAndManipulateVector_AccumulateLerp_1_1_1_1_bIntegrateDeltaTime__Const; // 0x04A4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C8[0x3];                                     // 0x04A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SmoothWeight_1___SmoothWeight_AccumulateLerp_8_2_InitialValue__Const; // 0x04A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SmoothWeight_1___SmoothWeight_AccumulateLerp_8_2_Blend__Const; // 0x04AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SmoothWeight_1___SmoothWeight_AccumulateLerp_8_2_bIntegrateDeltaTime__Const; // 0x04B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C9[0x3];                                     // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         Offset_2___Offset_RigUnit_OffsetTransformForItem_3_1_1_1_1_1_1_2_Item__Const; // 0x04B4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Offset_2___Offset_RigUnit_OffsetTransformForItem_3_1_1_1_1_1_1_2_OffsetTransform__Const; // 0x04C0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_2___Offset_DecreasePowerOverTime_1_Blend__Const; // 0x0520(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51CA[0x4];                                     // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Offset_2___Offset_Interpolate_A__Const;            // 0x0528(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Offset_2___Offset_Interpolate_B__Const;            // 0x0530(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Offset_2___Offset_Random_4_1_1_1_1_1_1_3_Seed__Const; // 0x0538(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_2___Offset_Random_4_1_1_1_1_1_1_3_Minimum__Const; // 0x053C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_2___Offset_Random_4_1_1_1_1_1_1_3_Maximum__Const; // 0x0540(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_2___Offset_Random_4_1_1_1_1_1_1_3_Duration__Const; // 0x0544(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_2___Offset_AccumulateLerp_4_1_3_Blend__Const; // 0x0548(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Offset_2___Offset_AccumulateLerp_4_1_3_bIntegrateDeltaTime__Const; // 0x054C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51CB[0x3];                                     // 0x054D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Offset_2___Offset_SpringInterp_4_2_Force__Const;   // 0x0550(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Offset_2___Offset_Subtract_B__Const;               // 0x0568(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_2___Offset_Random_4_1_1_1_1_1_1_3_1_Duration__Const; // 0x0570(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Offset_2___Offset_RigUnit_OffsetTransformForItem_3_1_1_1_1_1_1_2_1_1_Item__Const; // 0x0574(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_2___Offset_RigUnit_OffsetTransformForItem_3_1_1_1_1_1_1_2_1_1_Weight__Const; // 0x0580(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Offset_2___Offset_ParentConstraint_Child__Const;   // 0x0584(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FTransformFilter                       Offset_2___Offset_ParentConstraint_Filter__Const;  // 0x0590(0x0009)(Edit, NoDestructor)
	uint8                                         Pad_51CC[0x7];                                     // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              Offset_2___Offset_ParentConstraint_Parents__Const; // 0x05A0(0x0010)(Edit)
	struct FRigUnit_ParentConstraint_AdvancedSettings Offset_2___Offset_ParentConstraint_AdvancedSettings__Const; // 0x05B0(0x0002)(Edit, NoDestructor)
	uint8                                         Pad_51CD[0x2];                                     // 0x05B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Offset_2___Offset_ParentConstraint_Weight__Const;  // 0x05B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Offset_2___Offset_ParentConstraint_1_Child__Const; // 0x05B8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51CE[0x4];                                     // 0x05C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              Offset_2___Offset_ParentConstraint_1_Parents__Const; // 0x05C8(0x0010)(Edit)
	ERigVMTransformSpace                          Offset_2___Offset_RigUnit_SetTransform_1_1_1_Space__Const; // 0x05D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Offset_2___Offset_RigUnit_SetTransform_1_1_1_bInitial__Const; // 0x05D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51CF[0x2];                                     // 0x05DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         Offset_2___Offset_RigUnit_GetTransform_5_1_1_1_Item__Const; // 0x05DC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Offset_2___Offset_RigUnit_GetTransform_5_2_1_Item__Const; // 0x05E8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51D0[0x4];                                     // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CheckAndManipulateVector_2___CheckAndManipulateVector_DISPATCH_RigVMDispatch_CoreNotEquals_1_1_1_1_1_1_1_1_1_B__Const; // 0x05F8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
