#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TTR_PlayerKnocks_Tracker

#include "Basic.hpp"

#include "G01_structs.hpp"


namespace SDK::Params
{

// Function TTR_PlayerKnocks_Tracker.TTR_PlayerKnocks_Tracker_C.ExecuteUbergraph_TTR_PlayerKnocks_Tracker
// 0x0050 (0x0050 - 0x0000)
struct TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_664A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGzGameMessage*                   K2Node_CustomEvent_Message;                        // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzPlayerKnockedDownMessage*            K2Node_DynamicCast_AsGz_Player_Knocked_Down_Message; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_664B[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UGzGameMessage* Message)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_664C[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzGameModeSubsystem*                   CallFunc_GetSubsystem_OutSubsystem;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzGetSubsystemResult                         CallFunc_GetSubsystem_OutExecNodes;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_664D[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzGameMessageSubsystem*                K2Node_DynamicCast_AsGz_Game_Message_Subsystem;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker) == 0x000008, "Wrong alignment on TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker");
static_assert(sizeof(TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker) == 0x000050, "Wrong size on TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker");
static_assert(offsetof(TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker, EntryPoint) == 0x000000, "Member 'TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker::EntryPoint' has a wrong offset!");
static_assert(offsetof(TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker, K2Node_CustomEvent_Message) == 0x000008, "Member 'TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker, K2Node_DynamicCast_AsGz_Player_Knocked_Down_Message) == 0x000010, "Member 'TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker::K2Node_DynamicCast_AsGz_Player_Knocked_Down_Message' has a wrong offset!");
static_assert(offsetof(TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker, CallFunc_GetSubsystem_OutSubsystem) == 0x000030, "Member 'TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker::CallFunc_GetSubsystem_OutSubsystem' has a wrong offset!");
static_assert(offsetof(TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker, CallFunc_GetSubsystem_OutExecNodes) == 0x000038, "Member 'TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker::CallFunc_GetSubsystem_OutExecNodes' has a wrong offset!");
static_assert(offsetof(TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker, K2Node_SwitchEnum_CmpSuccess) == 0x000039, "Member 'TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker, K2Node_DynamicCast_AsGz_Game_Message_Subsystem) == 0x000040, "Member 'TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker::K2Node_DynamicCast_AsGz_Game_Message_Subsystem' has a wrong offset!");
static_assert(offsetof(TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'TTR_PlayerKnocks_Tracker_C_ExecuteUbergraph_TTR_PlayerKnocks_Tracker::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function TTR_PlayerKnocks_Tracker.TTR_PlayerKnocks_Tracker_C.OnPlayerKnocked
// 0x0008 (0x0008 - 0x0000)
struct TTR_PlayerKnocks_Tracker_C_OnPlayerKnocked final
{
public:
	const class UGzGameMessage*                   Message;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TTR_PlayerKnocks_Tracker_C_OnPlayerKnocked) == 0x000008, "Wrong alignment on TTR_PlayerKnocks_Tracker_C_OnPlayerKnocked");
static_assert(sizeof(TTR_PlayerKnocks_Tracker_C_OnPlayerKnocked) == 0x000008, "Wrong size on TTR_PlayerKnocks_Tracker_C_OnPlayerKnocked");
static_assert(offsetof(TTR_PlayerKnocks_Tracker_C_OnPlayerKnocked, Message) == 0x000000, "Member 'TTR_PlayerKnocks_Tracker_C_OnPlayerKnocked::Message' has a wrong offset!");

}

