#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VCamExtensions

#include "Basic.hpp"

#include "VCamExtensions_structs.hpp"


namespace SDK::Params
{

// Function VCamExtensions.ModifierBoundWidgetStyleDefinitions.GetStyleForConnectionPointByClass
// 0x0020 (0x0020 - 0x0000)
struct ModifierBoundWidgetStyleDefinitions_GetStyleForConnectionPointByClass final
{
public:
	class UVCamModifier*                          Modifier;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ConnectionPoint;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UWidgetStyleData>           Param_Class;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetStyleData*                       ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierBoundWidgetStyleDefinitions_GetStyleForConnectionPointByClass) == 0x000008, "Wrong alignment on ModifierBoundWidgetStyleDefinitions_GetStyleForConnectionPointByClass");
static_assert(sizeof(ModifierBoundWidgetStyleDefinitions_GetStyleForConnectionPointByClass) == 0x000020, "Wrong size on ModifierBoundWidgetStyleDefinitions_GetStyleForConnectionPointByClass");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStyleForConnectionPointByClass, Modifier) == 0x000000, "Member 'ModifierBoundWidgetStyleDefinitions_GetStyleForConnectionPointByClass::Modifier' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStyleForConnectionPointByClass, ConnectionPoint) == 0x000008, "Member 'ModifierBoundWidgetStyleDefinitions_GetStyleForConnectionPointByClass::ConnectionPoint' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStyleForConnectionPointByClass, Param_Class) == 0x000010, "Member 'ModifierBoundWidgetStyleDefinitions_GetStyleForConnectionPointByClass::Param_Class' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStyleForConnectionPointByClass, ReturnValue) == 0x000018, "Member 'ModifierBoundWidgetStyleDefinitions_GetStyleForConnectionPointByClass::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierBoundWidgetStyleDefinitions.GetStyleForModifierByClass
// 0x0018 (0x0018 - 0x0000)
struct ModifierBoundWidgetStyleDefinitions_GetStyleForModifierByClass final
{
public:
	class UVCamModifier*                          Modifier;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UWidgetStyleData>           Param_Class;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetStyleData*                       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierBoundWidgetStyleDefinitions_GetStyleForModifierByClass) == 0x000008, "Wrong alignment on ModifierBoundWidgetStyleDefinitions_GetStyleForModifierByClass");
static_assert(sizeof(ModifierBoundWidgetStyleDefinitions_GetStyleForModifierByClass) == 0x000018, "Wrong size on ModifierBoundWidgetStyleDefinitions_GetStyleForModifierByClass");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStyleForModifierByClass, Modifier) == 0x000000, "Member 'ModifierBoundWidgetStyleDefinitions_GetStyleForModifierByClass::Modifier' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStyleForModifierByClass, Param_Class) == 0x000008, "Member 'ModifierBoundWidgetStyleDefinitions_GetStyleForModifierByClass::Param_Class' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStyleForModifierByClass, ReturnValue) == 0x000010, "Member 'ModifierBoundWidgetStyleDefinitions_GetStyleForModifierByClass::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierBoundWidgetStyleDefinitions.GetStyleForNameByClass
// 0x0018 (0x0018 - 0x0000)
struct ModifierBoundWidgetStyleDefinitions_GetStyleForNameByClass final
{
public:
	class FName                                   Category;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UWidgetStyleData>           Param_Class;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetStyleData*                       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierBoundWidgetStyleDefinitions_GetStyleForNameByClass) == 0x000008, "Wrong alignment on ModifierBoundWidgetStyleDefinitions_GetStyleForNameByClass");
static_assert(sizeof(ModifierBoundWidgetStyleDefinitions_GetStyleForNameByClass) == 0x000018, "Wrong size on ModifierBoundWidgetStyleDefinitions_GetStyleForNameByClass");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStyleForNameByClass, Category) == 0x000000, "Member 'ModifierBoundWidgetStyleDefinitions_GetStyleForNameByClass::Category' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStyleForNameByClass, Param_Class) == 0x000008, "Member 'ModifierBoundWidgetStyleDefinitions_GetStyleForNameByClass::Param_Class' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStyleForNameByClass, ReturnValue) == 0x000010, "Member 'ModifierBoundWidgetStyleDefinitions_GetStyleForNameByClass::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierBoundWidgetStyleDefinitions.GetStylesForConnectionPoint
// 0x0020 (0x0020 - 0x0000)
struct ModifierBoundWidgetStyleDefinitions_GetStylesForConnectionPoint final
{
public:
	class UVCamModifier*                          Modifier;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ConnectionPoint;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UWidgetStyleData*>               ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierBoundWidgetStyleDefinitions_GetStylesForConnectionPoint) == 0x000008, "Wrong alignment on ModifierBoundWidgetStyleDefinitions_GetStylesForConnectionPoint");
static_assert(sizeof(ModifierBoundWidgetStyleDefinitions_GetStylesForConnectionPoint) == 0x000020, "Wrong size on ModifierBoundWidgetStyleDefinitions_GetStylesForConnectionPoint");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStylesForConnectionPoint, Modifier) == 0x000000, "Member 'ModifierBoundWidgetStyleDefinitions_GetStylesForConnectionPoint::Modifier' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStylesForConnectionPoint, ConnectionPoint) == 0x000008, "Member 'ModifierBoundWidgetStyleDefinitions_GetStylesForConnectionPoint::ConnectionPoint' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStylesForConnectionPoint, ReturnValue) == 0x000010, "Member 'ModifierBoundWidgetStyleDefinitions_GetStylesForConnectionPoint::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierBoundWidgetStyleDefinitions.GetStylesForModifier
// 0x0018 (0x0018 - 0x0000)
struct ModifierBoundWidgetStyleDefinitions_GetStylesForModifier final
{
public:
	class UVCamModifier*                          Modifier;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UWidgetStyleData*>               ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierBoundWidgetStyleDefinitions_GetStylesForModifier) == 0x000008, "Wrong alignment on ModifierBoundWidgetStyleDefinitions_GetStylesForModifier");
static_assert(sizeof(ModifierBoundWidgetStyleDefinitions_GetStylesForModifier) == 0x000018, "Wrong size on ModifierBoundWidgetStyleDefinitions_GetStylesForModifier");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStylesForModifier, Modifier) == 0x000000, "Member 'ModifierBoundWidgetStyleDefinitions_GetStylesForModifier::Modifier' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStylesForModifier, ReturnValue) == 0x000008, "Member 'ModifierBoundWidgetStyleDefinitions_GetStylesForModifier::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierBoundWidgetStyleDefinitions.GetStylesForName
// 0x0018 (0x0018 - 0x0000)
struct ModifierBoundWidgetStyleDefinitions_GetStylesForName final
{
public:
	class FName                                   Category;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UWidgetStyleData*>               ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierBoundWidgetStyleDefinitions_GetStylesForName) == 0x000008, "Wrong alignment on ModifierBoundWidgetStyleDefinitions_GetStylesForName");
static_assert(sizeof(ModifierBoundWidgetStyleDefinitions_GetStylesForName) == 0x000018, "Wrong size on ModifierBoundWidgetStyleDefinitions_GetStylesForName");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStylesForName, Category) == 0x000000, "Member 'ModifierBoundWidgetStyleDefinitions_GetStylesForName::Category' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStyleDefinitions_GetStylesForName, ReturnValue) == 0x000008, "Member 'ModifierBoundWidgetStyleDefinitions_GetStylesForName::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierBoundWidgetStylesAsset.GetStyleForConnectionPointByClass
// 0x0020 (0x0020 - 0x0000)
struct ModifierBoundWidgetStylesAsset_GetStyleForConnectionPointByClass final
{
public:
	class UVCamModifier*                          Modifier;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ConnectionPoint;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UWidgetStyleData>           Param_Class;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetStyleData*                       ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierBoundWidgetStylesAsset_GetStyleForConnectionPointByClass) == 0x000008, "Wrong alignment on ModifierBoundWidgetStylesAsset_GetStyleForConnectionPointByClass");
static_assert(sizeof(ModifierBoundWidgetStylesAsset_GetStyleForConnectionPointByClass) == 0x000020, "Wrong size on ModifierBoundWidgetStylesAsset_GetStyleForConnectionPointByClass");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStyleForConnectionPointByClass, Modifier) == 0x000000, "Member 'ModifierBoundWidgetStylesAsset_GetStyleForConnectionPointByClass::Modifier' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStyleForConnectionPointByClass, ConnectionPoint) == 0x000008, "Member 'ModifierBoundWidgetStylesAsset_GetStyleForConnectionPointByClass::ConnectionPoint' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStyleForConnectionPointByClass, Param_Class) == 0x000010, "Member 'ModifierBoundWidgetStylesAsset_GetStyleForConnectionPointByClass::Param_Class' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStyleForConnectionPointByClass, ReturnValue) == 0x000018, "Member 'ModifierBoundWidgetStylesAsset_GetStyleForConnectionPointByClass::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierBoundWidgetStylesAsset.GetStyleForModifierByClass
// 0x0018 (0x0018 - 0x0000)
struct ModifierBoundWidgetStylesAsset_GetStyleForModifierByClass final
{
public:
	class UVCamModifier*                          Modifier;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UWidgetStyleData>           Param_Class;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetStyleData*                       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierBoundWidgetStylesAsset_GetStyleForModifierByClass) == 0x000008, "Wrong alignment on ModifierBoundWidgetStylesAsset_GetStyleForModifierByClass");
static_assert(sizeof(ModifierBoundWidgetStylesAsset_GetStyleForModifierByClass) == 0x000018, "Wrong size on ModifierBoundWidgetStylesAsset_GetStyleForModifierByClass");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStyleForModifierByClass, Modifier) == 0x000000, "Member 'ModifierBoundWidgetStylesAsset_GetStyleForModifierByClass::Modifier' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStyleForModifierByClass, Param_Class) == 0x000008, "Member 'ModifierBoundWidgetStylesAsset_GetStyleForModifierByClass::Param_Class' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStyleForModifierByClass, ReturnValue) == 0x000010, "Member 'ModifierBoundWidgetStylesAsset_GetStyleForModifierByClass::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierBoundWidgetStylesAsset.GetStyleForNameByClass
// 0x0018 (0x0018 - 0x0000)
struct ModifierBoundWidgetStylesAsset_GetStyleForNameByClass final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UWidgetStyleData>           Param_Class;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetStyleData*                       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierBoundWidgetStylesAsset_GetStyleForNameByClass) == 0x000008, "Wrong alignment on ModifierBoundWidgetStylesAsset_GetStyleForNameByClass");
static_assert(sizeof(ModifierBoundWidgetStylesAsset_GetStyleForNameByClass) == 0x000018, "Wrong size on ModifierBoundWidgetStylesAsset_GetStyleForNameByClass");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStyleForNameByClass, Param_Name) == 0x000000, "Member 'ModifierBoundWidgetStylesAsset_GetStyleForNameByClass::Param_Name' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStyleForNameByClass, Param_Class) == 0x000008, "Member 'ModifierBoundWidgetStylesAsset_GetStyleForNameByClass::Param_Class' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStyleForNameByClass, ReturnValue) == 0x000010, "Member 'ModifierBoundWidgetStylesAsset_GetStyleForNameByClass::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierBoundWidgetStylesAsset.GetStylesForConnectionPoint
// 0x0020 (0x0020 - 0x0000)
struct ModifierBoundWidgetStylesAsset_GetStylesForConnectionPoint final
{
public:
	class UVCamModifier*                          Modifier;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ConnectionPoint;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UWidgetStyleData*>               ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierBoundWidgetStylesAsset_GetStylesForConnectionPoint) == 0x000008, "Wrong alignment on ModifierBoundWidgetStylesAsset_GetStylesForConnectionPoint");
static_assert(sizeof(ModifierBoundWidgetStylesAsset_GetStylesForConnectionPoint) == 0x000020, "Wrong size on ModifierBoundWidgetStylesAsset_GetStylesForConnectionPoint");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStylesForConnectionPoint, Modifier) == 0x000000, "Member 'ModifierBoundWidgetStylesAsset_GetStylesForConnectionPoint::Modifier' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStylesForConnectionPoint, ConnectionPoint) == 0x000008, "Member 'ModifierBoundWidgetStylesAsset_GetStylesForConnectionPoint::ConnectionPoint' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStylesForConnectionPoint, ReturnValue) == 0x000010, "Member 'ModifierBoundWidgetStylesAsset_GetStylesForConnectionPoint::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierBoundWidgetStylesAsset.GetStylesForModifier
// 0x0018 (0x0018 - 0x0000)
struct ModifierBoundWidgetStylesAsset_GetStylesForModifier final
{
public:
	class UVCamModifier*                          Modifier;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UWidgetStyleData*>               ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierBoundWidgetStylesAsset_GetStylesForModifier) == 0x000008, "Wrong alignment on ModifierBoundWidgetStylesAsset_GetStylesForModifier");
static_assert(sizeof(ModifierBoundWidgetStylesAsset_GetStylesForModifier) == 0x000018, "Wrong size on ModifierBoundWidgetStylesAsset_GetStylesForModifier");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStylesForModifier, Modifier) == 0x000000, "Member 'ModifierBoundWidgetStylesAsset_GetStylesForModifier::Modifier' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStylesForModifier, ReturnValue) == 0x000008, "Member 'ModifierBoundWidgetStylesAsset_GetStylesForModifier::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierBoundWidgetStylesAsset.GetStylesForName
// 0x0018 (0x0018 - 0x0000)
struct ModifierBoundWidgetStylesAsset_GetStylesForName final
{
public:
	class FName                                   Category;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UWidgetStyleData*>               ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierBoundWidgetStylesAsset_GetStylesForName) == 0x000008, "Wrong alignment on ModifierBoundWidgetStylesAsset_GetStylesForName");
static_assert(sizeof(ModifierBoundWidgetStylesAsset_GetStylesForName) == 0x000018, "Wrong size on ModifierBoundWidgetStylesAsset_GetStylesForName");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStylesForName, Category) == 0x000000, "Member 'ModifierBoundWidgetStylesAsset_GetStylesForName::Category' has a wrong offset!");
static_assert(offsetof(ModifierBoundWidgetStylesAsset_GetStylesForName, ReturnValue) == 0x000008, "Member 'ModifierBoundWidgetStylesAsset_GetStylesForName::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierHierarchyAsset.GetChildNodes
// 0x0058 (0x0058 - 0x0000)
struct ModifierHierarchyAsset_GetChildNodes final
{
public:
	class FName                                   ParentGroup;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierHierarchyAsset_GetChildNodes) == 0x000008, "Wrong alignment on ModifierHierarchyAsset_GetChildNodes");
static_assert(sizeof(ModifierHierarchyAsset_GetChildNodes) == 0x000058, "Wrong size on ModifierHierarchyAsset_GetChildNodes");
static_assert(offsetof(ModifierHierarchyAsset_GetChildNodes, ParentGroup) == 0x000000, "Member 'ModifierHierarchyAsset_GetChildNodes::ParentGroup' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyAsset_GetChildNodes, ReturnValue) == 0x000008, "Member 'ModifierHierarchyAsset_GetChildNodes::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierHierarchyAsset.GetConnectionPointTargetForNode
// 0x0028 (0x0028 - 0x0000)
struct ModifierHierarchyAsset_GetConnectionPointTargetForNode final
{
public:
	class FName                                   GroupName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVCamComponent*                         Component;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVCamModifierConnectionBinding         Connection;                                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_472C[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModifierHierarchyAsset_GetConnectionPointTargetForNode) == 0x000008, "Wrong alignment on ModifierHierarchyAsset_GetConnectionPointTargetForNode");
static_assert(sizeof(ModifierHierarchyAsset_GetConnectionPointTargetForNode) == 0x000028, "Wrong size on ModifierHierarchyAsset_GetConnectionPointTargetForNode");
static_assert(offsetof(ModifierHierarchyAsset_GetConnectionPointTargetForNode, GroupName) == 0x000000, "Member 'ModifierHierarchyAsset_GetConnectionPointTargetForNode::GroupName' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyAsset_GetConnectionPointTargetForNode, Component) == 0x000008, "Member 'ModifierHierarchyAsset_GetConnectionPointTargetForNode::Component' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyAsset_GetConnectionPointTargetForNode, Connection) == 0x000010, "Member 'ModifierHierarchyAsset_GetConnectionPointTargetForNode::Connection' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyAsset_GetConnectionPointTargetForNode, ReturnValue) == 0x000020, "Member 'ModifierHierarchyAsset_GetConnectionPointTargetForNode::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierHierarchyAsset.GetGroupsContainingModifier
// 0x0058 (0x0058 - 0x0000)
struct ModifierHierarchyAsset_GetGroupsContainingModifier final
{
public:
	class UVCamModifier*                          Modifier;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierHierarchyAsset_GetGroupsContainingModifier) == 0x000008, "Wrong alignment on ModifierHierarchyAsset_GetGroupsContainingModifier");
static_assert(sizeof(ModifierHierarchyAsset_GetGroupsContainingModifier) == 0x000058, "Wrong size on ModifierHierarchyAsset_GetGroupsContainingModifier");
static_assert(offsetof(ModifierHierarchyAsset_GetGroupsContainingModifier, Modifier) == 0x000000, "Member 'ModifierHierarchyAsset_GetGroupsContainingModifier::Modifier' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyAsset_GetGroupsContainingModifier, ReturnValue) == 0x000008, "Member 'ModifierHierarchyAsset_GetGroupsContainingModifier::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierHierarchyAsset.GetModifierInNode
// 0x0018 (0x0018 - 0x0000)
struct ModifierHierarchyAsset_GetModifierInNode final
{
public:
	class UVCamComponent*                         Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GroupName;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVCamModifier*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierHierarchyAsset_GetModifierInNode) == 0x000008, "Wrong alignment on ModifierHierarchyAsset_GetModifierInNode");
static_assert(sizeof(ModifierHierarchyAsset_GetModifierInNode) == 0x000018, "Wrong size on ModifierHierarchyAsset_GetModifierInNode");
static_assert(offsetof(ModifierHierarchyAsset_GetModifierInNode, Component) == 0x000000, "Member 'ModifierHierarchyAsset_GetModifierInNode::Component' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyAsset_GetModifierInNode, GroupName) == 0x000008, "Member 'ModifierHierarchyAsset_GetModifierInNode::GroupName' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyAsset_GetModifierInNode, ReturnValue) == 0x000010, "Member 'ModifierHierarchyAsset_GetModifierInNode::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierHierarchyAsset.GetParentNode
// 0x0014 (0x0014 - 0x0000)
struct ModifierHierarchyAsset_GetParentNode final
{
public:
	class FName                                   ChildNode;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParentNode;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_472D[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModifierHierarchyAsset_GetParentNode) == 0x000004, "Wrong alignment on ModifierHierarchyAsset_GetParentNode");
static_assert(sizeof(ModifierHierarchyAsset_GetParentNode) == 0x000014, "Wrong size on ModifierHierarchyAsset_GetParentNode");
static_assert(offsetof(ModifierHierarchyAsset_GetParentNode, ChildNode) == 0x000000, "Member 'ModifierHierarchyAsset_GetParentNode::ChildNode' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyAsset_GetParentNode, ParentNode) == 0x000008, "Member 'ModifierHierarchyAsset_GetParentNode::ParentNode' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyAsset_GetParentNode, ReturnValue) == 0x000010, "Member 'ModifierHierarchyAsset_GetParentNode::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierHierarchyAsset.GetRootNode
// 0x0008 (0x0008 - 0x0000)
struct ModifierHierarchyAsset_GetRootNode final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierHierarchyAsset_GetRootNode) == 0x000004, "Wrong alignment on ModifierHierarchyAsset_GetRootNode");
static_assert(sizeof(ModifierHierarchyAsset_GetRootNode) == 0x000008, "Wrong size on ModifierHierarchyAsset_GetRootNode");
static_assert(offsetof(ModifierHierarchyAsset_GetRootNode, ReturnValue) == 0x000000, "Member 'ModifierHierarchyAsset_GetRootNode::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierHierarchyRules.GetChildNodes
// 0x0058 (0x0058 - 0x0000)
struct ModifierHierarchyRules_GetChildNodes final
{
public:
	class FName                                   Node;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierHierarchyRules_GetChildNodes) == 0x000008, "Wrong alignment on ModifierHierarchyRules_GetChildNodes");
static_assert(sizeof(ModifierHierarchyRules_GetChildNodes) == 0x000058, "Wrong size on ModifierHierarchyRules_GetChildNodes");
static_assert(offsetof(ModifierHierarchyRules_GetChildNodes, Node) == 0x000000, "Member 'ModifierHierarchyRules_GetChildNodes::Node' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyRules_GetChildNodes, ReturnValue) == 0x000008, "Member 'ModifierHierarchyRules_GetChildNodes::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierHierarchyRules.GetConnectionPointTargetForNode
// 0x0028 (0x0028 - 0x0000)
struct ModifierHierarchyRules_GetConnectionPointTargetForNode final
{
public:
	class FName                                   GroupName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVCamComponent*                         Component;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVCamModifierConnectionBinding         Connection;                                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_472E[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModifierHierarchyRules_GetConnectionPointTargetForNode) == 0x000008, "Wrong alignment on ModifierHierarchyRules_GetConnectionPointTargetForNode");
static_assert(sizeof(ModifierHierarchyRules_GetConnectionPointTargetForNode) == 0x000028, "Wrong size on ModifierHierarchyRules_GetConnectionPointTargetForNode");
static_assert(offsetof(ModifierHierarchyRules_GetConnectionPointTargetForNode, GroupName) == 0x000000, "Member 'ModifierHierarchyRules_GetConnectionPointTargetForNode::GroupName' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyRules_GetConnectionPointTargetForNode, Component) == 0x000008, "Member 'ModifierHierarchyRules_GetConnectionPointTargetForNode::Component' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyRules_GetConnectionPointTargetForNode, Connection) == 0x000010, "Member 'ModifierHierarchyRules_GetConnectionPointTargetForNode::Connection' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyRules_GetConnectionPointTargetForNode, ReturnValue) == 0x000020, "Member 'ModifierHierarchyRules_GetConnectionPointTargetForNode::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierHierarchyRules.GetModifierInNode
// 0x0018 (0x0018 - 0x0000)
struct ModifierHierarchyRules_GetModifierInNode final
{
public:
	class UVCamComponent*                         Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NodeName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVCamModifier*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierHierarchyRules_GetModifierInNode) == 0x000008, "Wrong alignment on ModifierHierarchyRules_GetModifierInNode");
static_assert(sizeof(ModifierHierarchyRules_GetModifierInNode) == 0x000018, "Wrong size on ModifierHierarchyRules_GetModifierInNode");
static_assert(offsetof(ModifierHierarchyRules_GetModifierInNode, Component) == 0x000000, "Member 'ModifierHierarchyRules_GetModifierInNode::Component' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyRules_GetModifierInNode, NodeName) == 0x000008, "Member 'ModifierHierarchyRules_GetModifierInNode::NodeName' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyRules_GetModifierInNode, ReturnValue) == 0x000010, "Member 'ModifierHierarchyRules_GetModifierInNode::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierHierarchyRules.GetNodesContainingModifier
// 0x0058 (0x0058 - 0x0000)
struct ModifierHierarchyRules_GetNodesContainingModifier final
{
public:
	class UVCamModifier*                          Modifier;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierHierarchyRules_GetNodesContainingModifier) == 0x000008, "Wrong alignment on ModifierHierarchyRules_GetNodesContainingModifier");
static_assert(sizeof(ModifierHierarchyRules_GetNodesContainingModifier) == 0x000058, "Wrong size on ModifierHierarchyRules_GetNodesContainingModifier");
static_assert(offsetof(ModifierHierarchyRules_GetNodesContainingModifier, Modifier) == 0x000000, "Member 'ModifierHierarchyRules_GetNodesContainingModifier::Modifier' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyRules_GetNodesContainingModifier, ReturnValue) == 0x000008, "Member 'ModifierHierarchyRules_GetNodesContainingModifier::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierHierarchyRules.GetParentNode
// 0x0014 (0x0014 - 0x0000)
struct ModifierHierarchyRules_GetParentNode final
{
public:
	class FName                                   ChildNode;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParentNode;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_472F[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModifierHierarchyRules_GetParentNode) == 0x000004, "Wrong alignment on ModifierHierarchyRules_GetParentNode");
static_assert(sizeof(ModifierHierarchyRules_GetParentNode) == 0x000014, "Wrong size on ModifierHierarchyRules_GetParentNode");
static_assert(offsetof(ModifierHierarchyRules_GetParentNode, ChildNode) == 0x000000, "Member 'ModifierHierarchyRules_GetParentNode::ChildNode' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyRules_GetParentNode, ParentNode) == 0x000008, "Member 'ModifierHierarchyRules_GetParentNode::ParentNode' has a wrong offset!");
static_assert(offsetof(ModifierHierarchyRules_GetParentNode, ReturnValue) == 0x000010, "Member 'ModifierHierarchyRules_GetParentNode::ReturnValue' has a wrong offset!");

// Function VCamExtensions.ModifierHierarchyRules.GetRootNode
// 0x0008 (0x0008 - 0x0000)
struct ModifierHierarchyRules_GetRootNode final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModifierHierarchyRules_GetRootNode) == 0x000004, "Wrong alignment on ModifierHierarchyRules_GetRootNode");
static_assert(sizeof(ModifierHierarchyRules_GetRootNode) == 0x000008, "Wrong size on ModifierHierarchyRules_GetRootNode");
static_assert(offsetof(ModifierHierarchyRules_GetRootNode, ReturnValue) == 0x000000, "Member 'ModifierHierarchyRules_GetRootNode::ReturnValue' has a wrong offset!");

}

