#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VirtualCamera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "VirtualCamera_structs.hpp"
#include "VCamCore_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function VirtualCamera.AssetFilteringAndSortingFunctionLibrary.GetAllAssetsByMetaDataTags
// 0x00B0 (0x00B0 - 0x0000)
struct AssetFilteringAndSortingFunctionLibrary_GetAllAssetsByMetaDataTags final
{
public:
	TSet<class FName>                             RequiredTags;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSet<class UClass*>                           AllowedClasses;                                    // 0x0050(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     ReturnValue;                                       // 0x00A0(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AssetFilteringAndSortingFunctionLibrary_GetAllAssetsByMetaDataTags) == 0x000008, "Wrong alignment on AssetFilteringAndSortingFunctionLibrary_GetAllAssetsByMetaDataTags");
static_assert(sizeof(AssetFilteringAndSortingFunctionLibrary_GetAllAssetsByMetaDataTags) == 0x0000B0, "Wrong size on AssetFilteringAndSortingFunctionLibrary_GetAllAssetsByMetaDataTags");
static_assert(offsetof(AssetFilteringAndSortingFunctionLibrary_GetAllAssetsByMetaDataTags, RequiredTags) == 0x000000, "Member 'AssetFilteringAndSortingFunctionLibrary_GetAllAssetsByMetaDataTags::RequiredTags' has a wrong offset!");
static_assert(offsetof(AssetFilteringAndSortingFunctionLibrary_GetAllAssetsByMetaDataTags, AllowedClasses) == 0x000050, "Member 'AssetFilteringAndSortingFunctionLibrary_GetAllAssetsByMetaDataTags::AllowedClasses' has a wrong offset!");
static_assert(offsetof(AssetFilteringAndSortingFunctionLibrary_GetAllAssetsByMetaDataTags, ReturnValue) == 0x0000A0, "Member 'AssetFilteringAndSortingFunctionLibrary_GetAllAssetsByMetaDataTags::ReturnValue' has a wrong offset!");

// Function VirtualCamera.AssetFilteringAndSortingFunctionLibrary.SortByAssetName
// 0x0018 (0x0018 - 0x0000)
struct AssetFilteringAndSortingFunctionLibrary_SortByAssetName final
{
public:
	TArray<struct FAssetData>                     Assets;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	ESortOrder                                    SortOrder;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4737[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AssetFilteringAndSortingFunctionLibrary_SortByAssetName) == 0x000008, "Wrong alignment on AssetFilteringAndSortingFunctionLibrary_SortByAssetName");
static_assert(sizeof(AssetFilteringAndSortingFunctionLibrary_SortByAssetName) == 0x000018, "Wrong size on AssetFilteringAndSortingFunctionLibrary_SortByAssetName");
static_assert(offsetof(AssetFilteringAndSortingFunctionLibrary_SortByAssetName, Assets) == 0x000000, "Member 'AssetFilteringAndSortingFunctionLibrary_SortByAssetName::Assets' has a wrong offset!");
static_assert(offsetof(AssetFilteringAndSortingFunctionLibrary_SortByAssetName, SortOrder) == 0x000010, "Member 'AssetFilteringAndSortingFunctionLibrary_SortByAssetName::SortOrder' has a wrong offset!");

// Function VirtualCamera.AssetFilteringAndSortingFunctionLibrary.SortByCustomPredicate
// 0x0028 (0x0028 - 0x0000)
struct AssetFilteringAndSortingFunctionLibrary_SortByCustomPredicate final
{
public:
	TArray<struct FAssetData>                     Assets;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(struct FAssetData& Left, struct FAssetData& Right)> SortingPredicate;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESortOrder                                    SortOrder;                                         // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4738[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AssetFilteringAndSortingFunctionLibrary_SortByCustomPredicate) == 0x000008, "Wrong alignment on AssetFilteringAndSortingFunctionLibrary_SortByCustomPredicate");
static_assert(sizeof(AssetFilteringAndSortingFunctionLibrary_SortByCustomPredicate) == 0x000028, "Wrong size on AssetFilteringAndSortingFunctionLibrary_SortByCustomPredicate");
static_assert(offsetof(AssetFilteringAndSortingFunctionLibrary_SortByCustomPredicate, Assets) == 0x000000, "Member 'AssetFilteringAndSortingFunctionLibrary_SortByCustomPredicate::Assets' has a wrong offset!");
static_assert(offsetof(AssetFilteringAndSortingFunctionLibrary_SortByCustomPredicate, SortingPredicate) == 0x000010, "Member 'AssetFilteringAndSortingFunctionLibrary_SortByCustomPredicate::SortingPredicate' has a wrong offset!");
static_assert(offsetof(AssetFilteringAndSortingFunctionLibrary_SortByCustomPredicate, SortOrder) == 0x000020, "Member 'AssetFilteringAndSortingFunctionLibrary_SortByCustomPredicate::SortOrder' has a wrong offset!");

// Function VirtualCamera.AssetFilteringAndSortingFunctionLibrary.SortByMetaData
// 0x0020 (0x0020 - 0x0000)
struct AssetFilteringAndSortingFunctionLibrary_SortByMetaData final
{
public:
	TArray<struct FAssetData>                     Assets;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   MetaDataTag;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAssetTagMetaDataSortType                     MetaDataType;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESortOrder                                    SortOrder;                                         // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4739[0x5];                                     // 0x001B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AssetFilteringAndSortingFunctionLibrary_SortByMetaData) == 0x000008, "Wrong alignment on AssetFilteringAndSortingFunctionLibrary_SortByMetaData");
static_assert(sizeof(AssetFilteringAndSortingFunctionLibrary_SortByMetaData) == 0x000020, "Wrong size on AssetFilteringAndSortingFunctionLibrary_SortByMetaData");
static_assert(offsetof(AssetFilteringAndSortingFunctionLibrary_SortByMetaData, Assets) == 0x000000, "Member 'AssetFilteringAndSortingFunctionLibrary_SortByMetaData::Assets' has a wrong offset!");
static_assert(offsetof(AssetFilteringAndSortingFunctionLibrary_SortByMetaData, MetaDataTag) == 0x000010, "Member 'AssetFilteringAndSortingFunctionLibrary_SortByMetaData::MetaDataTag' has a wrong offset!");
static_assert(offsetof(AssetFilteringAndSortingFunctionLibrary_SortByMetaData, MetaDataType) == 0x000018, "Member 'AssetFilteringAndSortingFunctionLibrary_SortByMetaData::MetaDataType' has a wrong offset!");
static_assert(offsetof(AssetFilteringAndSortingFunctionLibrary_SortByMetaData, SortOrder) == 0x000019, "Member 'AssetFilteringAndSortingFunctionLibrary_SortByMetaData::SortOrder' has a wrong offset!");
static_assert(offsetof(AssetFilteringAndSortingFunctionLibrary_SortByMetaData, ReturnValue) == 0x00001A, "Member 'AssetFilteringAndSortingFunctionLibrary_SortByMetaData::ReturnValue' has a wrong offset!");

// Function VirtualCamera.GameViewFunctionLibrary.CanToggleGameView
// 0x0002 (0x0002 - 0x0000)
struct GameViewFunctionLibrary_CanToggleGameView final
{
public:
	EVCamTargetViewportID                         ViewportID;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameViewFunctionLibrary_CanToggleGameView) == 0x000001, "Wrong alignment on GameViewFunctionLibrary_CanToggleGameView");
static_assert(sizeof(GameViewFunctionLibrary_CanToggleGameView) == 0x000002, "Wrong size on GameViewFunctionLibrary_CanToggleGameView");
static_assert(offsetof(GameViewFunctionLibrary_CanToggleGameView, ViewportID) == 0x000000, "Member 'GameViewFunctionLibrary_CanToggleGameView::ViewportID' has a wrong offset!");
static_assert(offsetof(GameViewFunctionLibrary_CanToggleGameView, ReturnValue) == 0x000001, "Member 'GameViewFunctionLibrary_CanToggleGameView::ReturnValue' has a wrong offset!");

// Function VirtualCamera.GameViewFunctionLibrary.IsInGameView
// 0x0002 (0x0002 - 0x0000)
struct GameViewFunctionLibrary_IsInGameView final
{
public:
	EVCamTargetViewportID                         ViewportID;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameViewFunctionLibrary_IsInGameView) == 0x000001, "Wrong alignment on GameViewFunctionLibrary_IsInGameView");
static_assert(sizeof(GameViewFunctionLibrary_IsInGameView) == 0x000002, "Wrong size on GameViewFunctionLibrary_IsInGameView");
static_assert(offsetof(GameViewFunctionLibrary_IsInGameView, ViewportID) == 0x000000, "Member 'GameViewFunctionLibrary_IsInGameView::ViewportID' has a wrong offset!");
static_assert(offsetof(GameViewFunctionLibrary_IsInGameView, ReturnValue) == 0x000001, "Member 'GameViewFunctionLibrary_IsInGameView::ReturnValue' has a wrong offset!");

// Function VirtualCamera.GameViewFunctionLibrary.RestoreGameViewStates
// 0x0050 (0x0050 - 0x0000)
struct GameViewFunctionLibrary_RestoreGameViewStates final
{
public:
	TMap<EVCamTargetViewportID, bool>             Snapshot;                                          // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameViewFunctionLibrary_RestoreGameViewStates) == 0x000008, "Wrong alignment on GameViewFunctionLibrary_RestoreGameViewStates");
static_assert(sizeof(GameViewFunctionLibrary_RestoreGameViewStates) == 0x000050, "Wrong size on GameViewFunctionLibrary_RestoreGameViewStates");
static_assert(offsetof(GameViewFunctionLibrary_RestoreGameViewStates, Snapshot) == 0x000000, "Member 'GameViewFunctionLibrary_RestoreGameViewStates::Snapshot' has a wrong offset!");

// Function VirtualCamera.GameViewFunctionLibrary.SetGameViewEnabled
// 0x0002 (0x0002 - 0x0000)
struct GameViewFunctionLibrary_SetGameViewEnabled final
{
public:
	EVCamTargetViewportID                         ViewportID;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameViewFunctionLibrary_SetGameViewEnabled) == 0x000001, "Wrong alignment on GameViewFunctionLibrary_SetGameViewEnabled");
static_assert(sizeof(GameViewFunctionLibrary_SetGameViewEnabled) == 0x000002, "Wrong size on GameViewFunctionLibrary_SetGameViewEnabled");
static_assert(offsetof(GameViewFunctionLibrary_SetGameViewEnabled, ViewportID) == 0x000000, "Member 'GameViewFunctionLibrary_SetGameViewEnabled::ViewportID' has a wrong offset!");
static_assert(offsetof(GameViewFunctionLibrary_SetGameViewEnabled, bIsEnabled) == 0x000001, "Member 'GameViewFunctionLibrary_SetGameViewEnabled::bIsEnabled' has a wrong offset!");

// Function VirtualCamera.GameViewFunctionLibrary.SetGameViewEnabledForAllViewports
// 0x0001 (0x0001 - 0x0000)
struct GameViewFunctionLibrary_SetGameViewEnabledForAllViewports final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameViewFunctionLibrary_SetGameViewEnabledForAllViewports) == 0x000001, "Wrong alignment on GameViewFunctionLibrary_SetGameViewEnabledForAllViewports");
static_assert(sizeof(GameViewFunctionLibrary_SetGameViewEnabledForAllViewports) == 0x000001, "Wrong size on GameViewFunctionLibrary_SetGameViewEnabledForAllViewports");
static_assert(offsetof(GameViewFunctionLibrary_SetGameViewEnabledForAllViewports, bIsEnabled) == 0x000000, "Member 'GameViewFunctionLibrary_SetGameViewEnabledForAllViewports::bIsEnabled' has a wrong offset!");

// Function VirtualCamera.GameViewFunctionLibrary.SnapshotGameViewStates
// 0x0050 (0x0050 - 0x0000)
struct GameViewFunctionLibrary_SnapshotGameViewStates final
{
public:
	TMap<EVCamTargetViewportID, bool>             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameViewFunctionLibrary_SnapshotGameViewStates) == 0x000008, "Wrong alignment on GameViewFunctionLibrary_SnapshotGameViewStates");
static_assert(sizeof(GameViewFunctionLibrary_SnapshotGameViewStates) == 0x000050, "Wrong size on GameViewFunctionLibrary_SnapshotGameViewStates");
static_assert(offsetof(GameViewFunctionLibrary_SnapshotGameViewStates, ReturnValue) == 0x000000, "Member 'GameViewFunctionLibrary_SnapshotGameViewStates::ReturnValue' has a wrong offset!");

// Function VirtualCamera.GameViewFunctionLibrary.ToggleGameView
// 0x0001 (0x0001 - 0x0000)
struct GameViewFunctionLibrary_ToggleGameView final
{
public:
	EVCamTargetViewportID                         ViewportID;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameViewFunctionLibrary_ToggleGameView) == 0x000001, "Wrong alignment on GameViewFunctionLibrary_ToggleGameView");
static_assert(sizeof(GameViewFunctionLibrary_ToggleGameView) == 0x000001, "Wrong size on GameViewFunctionLibrary_ToggleGameView");
static_assert(offsetof(GameViewFunctionLibrary_ToggleGameView, ViewportID) == 0x000000, "Member 'GameViewFunctionLibrary_ToggleGameView::ViewportID' has a wrong offset!");

// Function VirtualCamera.LevelSequenceVCamLibrary.FindPilotableCamerasInActiveLevelSequence
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceVCamLibrary_FindPilotableCamerasInActiveLevelSequence final
{
public:
	TArray<struct FPilotableSequenceCameraInfo>   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequenceVCamLibrary_FindPilotableCamerasInActiveLevelSequence) == 0x000008, "Wrong alignment on LevelSequenceVCamLibrary_FindPilotableCamerasInActiveLevelSequence");
static_assert(sizeof(LevelSequenceVCamLibrary_FindPilotableCamerasInActiveLevelSequence) == 0x000010, "Wrong size on LevelSequenceVCamLibrary_FindPilotableCamerasInActiveLevelSequence");
static_assert(offsetof(LevelSequenceVCamLibrary_FindPilotableCamerasInActiveLevelSequence, ReturnValue) == 0x000000, "Member 'LevelSequenceVCamLibrary_FindPilotableCamerasInActiveLevelSequence::ReturnValue' has a wrong offset!");

// Function VirtualCamera.LevelSequenceVCamLibrary.HasAnyCameraCutsInLevelSequence
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceVCamLibrary_HasAnyCameraCutsInLevelSequence final
{
public:
	class ULevelSequence*                         Sequence;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_473A[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceVCamLibrary_HasAnyCameraCutsInLevelSequence) == 0x000008, "Wrong alignment on LevelSequenceVCamLibrary_HasAnyCameraCutsInLevelSequence");
static_assert(sizeof(LevelSequenceVCamLibrary_HasAnyCameraCutsInLevelSequence) == 0x000010, "Wrong size on LevelSequenceVCamLibrary_HasAnyCameraCutsInLevelSequence");
static_assert(offsetof(LevelSequenceVCamLibrary_HasAnyCameraCutsInLevelSequence, Sequence) == 0x000000, "Member 'LevelSequenceVCamLibrary_HasAnyCameraCutsInLevelSequence::Sequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceVCamLibrary_HasAnyCameraCutsInLevelSequence, ReturnValue) == 0x000008, "Member 'LevelSequenceVCamLibrary_HasAnyCameraCutsInLevelSequence::ReturnValue' has a wrong offset!");

// Function VirtualCamera.MultiUserTakesVCamFunctionLibrary.GetRecordOnClient
// 0x0014 (0x0014 - 0x0000)
struct MultiUserTakesVCamFunctionLibrary_GetRecordOnClient final
{
public:
	struct FGuid                                  ClientEndpointId;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_473B[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MultiUserTakesVCamFunctionLibrary_GetRecordOnClient) == 0x000004, "Wrong alignment on MultiUserTakesVCamFunctionLibrary_GetRecordOnClient");
static_assert(sizeof(MultiUserTakesVCamFunctionLibrary_GetRecordOnClient) == 0x000014, "Wrong size on MultiUserTakesVCamFunctionLibrary_GetRecordOnClient");
static_assert(offsetof(MultiUserTakesVCamFunctionLibrary_GetRecordOnClient, ClientEndpointId) == 0x000000, "Member 'MultiUserTakesVCamFunctionLibrary_GetRecordOnClient::ClientEndpointId' has a wrong offset!");
static_assert(offsetof(MultiUserTakesVCamFunctionLibrary_GetRecordOnClient, ReturnValue) == 0x000010, "Member 'MultiUserTakesVCamFunctionLibrary_GetRecordOnClient::ReturnValue' has a wrong offset!");

// Function VirtualCamera.MultiUserTakesVCamFunctionLibrary.GetRecordOnClientLocal
// 0x0001 (0x0001 - 0x0000)
struct MultiUserTakesVCamFunctionLibrary_GetRecordOnClientLocal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiUserTakesVCamFunctionLibrary_GetRecordOnClientLocal) == 0x000001, "Wrong alignment on MultiUserTakesVCamFunctionLibrary_GetRecordOnClientLocal");
static_assert(sizeof(MultiUserTakesVCamFunctionLibrary_GetRecordOnClientLocal) == 0x000001, "Wrong size on MultiUserTakesVCamFunctionLibrary_GetRecordOnClientLocal");
static_assert(offsetof(MultiUserTakesVCamFunctionLibrary_GetRecordOnClientLocal, ReturnValue) == 0x000000, "Member 'MultiUserTakesVCamFunctionLibrary_GetRecordOnClientLocal::ReturnValue' has a wrong offset!");

// Function VirtualCamera.MultiUserTakesVCamFunctionLibrary.GetSynchronizeTakeRecorderTransactions
// 0x0014 (0x0014 - 0x0000)
struct MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactions final
{
public:
	struct FGuid                                  ClientEndpointId;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_473C[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactions) == 0x000004, "Wrong alignment on MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactions");
static_assert(sizeof(MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactions) == 0x000014, "Wrong size on MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactions");
static_assert(offsetof(MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactions, ClientEndpointId) == 0x000000, "Member 'MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactions::ClientEndpointId' has a wrong offset!");
static_assert(offsetof(MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactions, ReturnValue) == 0x000010, "Member 'MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactions::ReturnValue' has a wrong offset!");

// Function VirtualCamera.MultiUserTakesVCamFunctionLibrary.GetSynchronizeTakeRecorderTransactionsLocal
// 0x0001 (0x0001 - 0x0000)
struct MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactionsLocal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactionsLocal) == 0x000001, "Wrong alignment on MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactionsLocal");
static_assert(sizeof(MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactionsLocal) == 0x000001, "Wrong size on MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactionsLocal");
static_assert(offsetof(MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactionsLocal, ReturnValue) == 0x000000, "Member 'MultiUserTakesVCamFunctionLibrary_GetSynchronizeTakeRecorderTransactionsLocal::ReturnValue' has a wrong offset!");

// Function VirtualCamera.MultiUserTakesVCamFunctionLibrary.SetRecordOnClient
// 0x0014 (0x0014 - 0x0000)
struct MultiUserTakesVCamFunctionLibrary_SetRecordOnClient final
{
public:
	struct FGuid                                  ClientEndpointId;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewValue;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_473D[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MultiUserTakesVCamFunctionLibrary_SetRecordOnClient) == 0x000004, "Wrong alignment on MultiUserTakesVCamFunctionLibrary_SetRecordOnClient");
static_assert(sizeof(MultiUserTakesVCamFunctionLibrary_SetRecordOnClient) == 0x000014, "Wrong size on MultiUserTakesVCamFunctionLibrary_SetRecordOnClient");
static_assert(offsetof(MultiUserTakesVCamFunctionLibrary_SetRecordOnClient, ClientEndpointId) == 0x000000, "Member 'MultiUserTakesVCamFunctionLibrary_SetRecordOnClient::ClientEndpointId' has a wrong offset!");
static_assert(offsetof(MultiUserTakesVCamFunctionLibrary_SetRecordOnClient, bNewValue) == 0x000010, "Member 'MultiUserTakesVCamFunctionLibrary_SetRecordOnClient::bNewValue' has a wrong offset!");

// Function VirtualCamera.MultiUserTakesVCamFunctionLibrary.SetRecordOnClientLocal
// 0x0001 (0x0001 - 0x0000)
struct MultiUserTakesVCamFunctionLibrary_SetRecordOnClientLocal final
{
public:
	bool                                          bNewValue;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiUserTakesVCamFunctionLibrary_SetRecordOnClientLocal) == 0x000001, "Wrong alignment on MultiUserTakesVCamFunctionLibrary_SetRecordOnClientLocal");
static_assert(sizeof(MultiUserTakesVCamFunctionLibrary_SetRecordOnClientLocal) == 0x000001, "Wrong size on MultiUserTakesVCamFunctionLibrary_SetRecordOnClientLocal");
static_assert(offsetof(MultiUserTakesVCamFunctionLibrary_SetRecordOnClientLocal, bNewValue) == 0x000000, "Member 'MultiUserTakesVCamFunctionLibrary_SetRecordOnClientLocal::bNewValue' has a wrong offset!");

// Function VirtualCamera.MultiUserTakesVCamFunctionLibrary.SetSynchronizeTakeRecorderTransactionsLocal
// 0x0001 (0x0001 - 0x0000)
struct MultiUserTakesVCamFunctionLibrary_SetSynchronizeTakeRecorderTransactionsLocal final
{
public:
	bool                                          bNewValue;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiUserTakesVCamFunctionLibrary_SetSynchronizeTakeRecorderTransactionsLocal) == 0x000001, "Wrong alignment on MultiUserTakesVCamFunctionLibrary_SetSynchronizeTakeRecorderTransactionsLocal");
static_assert(sizeof(MultiUserTakesVCamFunctionLibrary_SetSynchronizeTakeRecorderTransactionsLocal) == 0x000001, "Wrong size on MultiUserTakesVCamFunctionLibrary_SetSynchronizeTakeRecorderTransactionsLocal");
static_assert(offsetof(MultiUserTakesVCamFunctionLibrary_SetSynchronizeTakeRecorderTransactionsLocal, bNewValue) == 0x000000, "Member 'MultiUserTakesVCamFunctionLibrary_SetSynchronizeTakeRecorderTransactionsLocal::bNewValue' has a wrong offset!");

// Function VirtualCamera.TakeMetaDataTagsFunctionLibrary.GetAllTakeMetaDataTags
// 0x0050 (0x0050 - 0x0000)
struct TakeMetaDataTagsFunctionLibrary_GetAllTakeMetaDataTags final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TakeMetaDataTagsFunctionLibrary_GetAllTakeMetaDataTags) == 0x000008, "Wrong alignment on TakeMetaDataTagsFunctionLibrary_GetAllTakeMetaDataTags");
static_assert(sizeof(TakeMetaDataTagsFunctionLibrary_GetAllTakeMetaDataTags) == 0x000050, "Wrong size on TakeMetaDataTagsFunctionLibrary_GetAllTakeMetaDataTags");
static_assert(offsetof(TakeMetaDataTagsFunctionLibrary_GetAllTakeMetaDataTags, ReturnValue) == 0x000000, "Member 'TakeMetaDataTagsFunctionLibrary_GetAllTakeMetaDataTags::ReturnValue' has a wrong offset!");

// Function VirtualCamera.TakeMetaDataTagsFunctionLibrary.GetTakeMetaDataTag_Description
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Description final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Description) == 0x000004, "Wrong alignment on TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Description");
static_assert(sizeof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Description) == 0x000008, "Wrong size on TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Description");
static_assert(offsetof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Description, ReturnValue) == 0x000000, "Member 'TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Description::ReturnValue' has a wrong offset!");

// Function VirtualCamera.TakeMetaDataTagsFunctionLibrary.GetTakeMetaDataTag_LevelPath
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_LevelPath final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_LevelPath) == 0x000004, "Wrong alignment on TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_LevelPath");
static_assert(sizeof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_LevelPath) == 0x000008, "Wrong size on TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_LevelPath");
static_assert(offsetof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_LevelPath, ReturnValue) == 0x000000, "Member 'TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_LevelPath::ReturnValue' has a wrong offset!");

// Function VirtualCamera.TakeMetaDataTagsFunctionLibrary.GetTakeMetaDataTag_Slate
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Slate final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Slate) == 0x000004, "Wrong alignment on TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Slate");
static_assert(sizeof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Slate) == 0x000008, "Wrong size on TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Slate");
static_assert(offsetof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Slate, ReturnValue) == 0x000000, "Member 'TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Slate::ReturnValue' has a wrong offset!");

// Function VirtualCamera.TakeMetaDataTagsFunctionLibrary.GetTakeMetaDataTag_TakeNumber
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TakeNumber final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TakeNumber) == 0x000004, "Wrong alignment on TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TakeNumber");
static_assert(sizeof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TakeNumber) == 0x000008, "Wrong size on TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TakeNumber");
static_assert(offsetof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TakeNumber, ReturnValue) == 0x000000, "Member 'TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TakeNumber::ReturnValue' has a wrong offset!");

// Function VirtualCamera.TakeMetaDataTagsFunctionLibrary.GetTakeMetaDataTag_TimecodeIn
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TimecodeIn final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TimecodeIn) == 0x000004, "Wrong alignment on TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TimecodeIn");
static_assert(sizeof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TimecodeIn) == 0x000008, "Wrong size on TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TimecodeIn");
static_assert(offsetof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TimecodeIn, ReturnValue) == 0x000000, "Member 'TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TimecodeIn::ReturnValue' has a wrong offset!");

// Function VirtualCamera.TakeMetaDataTagsFunctionLibrary.GetTakeMetaDataTag_TimecodeOut
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TimecodeOut final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TimecodeOut) == 0x000004, "Wrong alignment on TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TimecodeOut");
static_assert(sizeof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TimecodeOut) == 0x000008, "Wrong size on TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TimecodeOut");
static_assert(offsetof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TimecodeOut, ReturnValue) == 0x000000, "Member 'TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_TimecodeOut::ReturnValue' has a wrong offset!");

// Function VirtualCamera.TakeMetaDataTagsFunctionLibrary.GetTakeMetaDataTag_Timestamp
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Timestamp final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Timestamp) == 0x000004, "Wrong alignment on TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Timestamp");
static_assert(sizeof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Timestamp) == 0x000008, "Wrong size on TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Timestamp");
static_assert(offsetof(TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Timestamp, ReturnValue) == 0x000000, "Member 'TakeMetaDataTagsFunctionLibrary_GetTakeMetaDataTag_Timestamp::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.CalculateAutoFocusDistance
// 0x0020 (0x0020 - 0x0000)
struct VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance final
{
public:
	struct FVector2D                              ReticlePosition;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCineCameraComponent*                   CineCamera;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_473E[0x4];                                     // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance");
static_assert(sizeof(VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance) == 0x000020, "Wrong size on VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance, ReticlePosition) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance::ReticlePosition' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance, CineCamera) == 0x000010, "Member 'VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance::CineCamera' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance, ReturnValue) == 0x000018, "Member 'VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.CallFunctionByName
// 0x0018 (0x0018 - 0x0000)
struct VCamBlueprintFunctionLibrary_CallFunctionByName final
{
public:
	class UObject*                                ObjPtr;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FunctionName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_473F[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VCamBlueprintFunctionLibrary_CallFunctionByName) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_CallFunctionByName");
static_assert(sizeof(VCamBlueprintFunctionLibrary_CallFunctionByName) == 0x000018, "Wrong size on VCamBlueprintFunctionLibrary_CallFunctionByName");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CallFunctionByName, ObjPtr) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_CallFunctionByName::ObjPtr' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CallFunctionByName, FunctionName) == 0x000008, "Member 'VCamBlueprintFunctionLibrary_CallFunctionByName::FunctionName' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CallFunctionByName, ReturnValue) == 0x000010, "Member 'VCamBlueprintFunctionLibrary_CallFunctionByName::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.ConvertStringToFrameRate
// 0x0018 (0x0018 - 0x0000)
struct VCamBlueprintFunctionLibrary_ConvertStringToFrameRate final
{
public:
	class FString                                 InFrameRateString;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamBlueprintFunctionLibrary_ConvertStringToFrameRate) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_ConvertStringToFrameRate");
static_assert(sizeof(VCamBlueprintFunctionLibrary_ConvertStringToFrameRate) == 0x000018, "Wrong size on VCamBlueprintFunctionLibrary_ConvertStringToFrameRate");
static_assert(offsetof(VCamBlueprintFunctionLibrary_ConvertStringToFrameRate, InFrameRateString) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_ConvertStringToFrameRate::InFrameRateString' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_ConvertStringToFrameRate, ReturnValue) == 0x000010, "Member 'VCamBlueprintFunctionLibrary_ConvertStringToFrameRate::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.CopyToCineCameraActor
// 0x0018 (0x0018 - 0x0000)
struct VCamBlueprintFunctionLibrary_CopyToCineCameraActor final
{
public:
	class UCineCameraComponent*                   SourceCameraComponent;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACineCameraActor*                       TargetCameraActor;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4740[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VCamBlueprintFunctionLibrary_CopyToCineCameraActor) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_CopyToCineCameraActor");
static_assert(sizeof(VCamBlueprintFunctionLibrary_CopyToCineCameraActor) == 0x000018, "Wrong size on VCamBlueprintFunctionLibrary_CopyToCineCameraActor");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CopyToCineCameraActor, SourceCameraComponent) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_CopyToCineCameraActor::SourceCameraComponent' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CopyToCineCameraActor, TargetCameraActor) == 0x000008, "Member 'VCamBlueprintFunctionLibrary_CopyToCineCameraActor::TargetCameraActor' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CopyToCineCameraActor, ReturnValue) == 0x000010, "Member 'VCamBlueprintFunctionLibrary_CopyToCineCameraActor::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.DeprojectScreenToWorld
// 0x0048 (0x0048 - 0x0000)
struct VCamBlueprintFunctionLibrary_DeprojectScreenToWorld final
{
public:
	struct FVector2D                              InScreenPosition;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutWorldPosition;                                  // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutWorldDirection;                                 // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4741[0x7];                                     // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VCamBlueprintFunctionLibrary_DeprojectScreenToWorld) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_DeprojectScreenToWorld");
static_assert(sizeof(VCamBlueprintFunctionLibrary_DeprojectScreenToWorld) == 0x000048, "Wrong size on VCamBlueprintFunctionLibrary_DeprojectScreenToWorld");
static_assert(offsetof(VCamBlueprintFunctionLibrary_DeprojectScreenToWorld, InScreenPosition) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_DeprojectScreenToWorld::InScreenPosition' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_DeprojectScreenToWorld, OutWorldPosition) == 0x000010, "Member 'VCamBlueprintFunctionLibrary_DeprojectScreenToWorld::OutWorldPosition' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_DeprojectScreenToWorld, OutWorldDirection) == 0x000028, "Member 'VCamBlueprintFunctionLibrary_DeprojectScreenToWorld::OutWorldDirection' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_DeprojectScreenToWorld, ReturnValue) == 0x000040, "Member 'VCamBlueprintFunctionLibrary_DeprojectScreenToWorld::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.DeprojectScreenToWorldByViewport
// 0x0050 (0x0050 - 0x0000)
struct VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport final
{
public:
	struct FVector2D                              InScreenPosition;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVCamTargetViewportID                         TargetViewport;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4742[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutWorldPosition;                                  // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutWorldDirection;                                 // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4743[0x7];                                     // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport");
static_assert(sizeof(VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport) == 0x000050, "Wrong size on VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport");
static_assert(offsetof(VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport, InScreenPosition) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport::InScreenPosition' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport, TargetViewport) == 0x000010, "Member 'VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport::TargetViewport' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport, OutWorldPosition) == 0x000018, "Member 'VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport::OutWorldPosition' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport, OutWorldDirection) == 0x000030, "Member 'VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport::OutWorldDirection' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport, ReturnValue) == 0x000048, "Member 'VCamBlueprintFunctionLibrary_DeprojectScreenToWorldByViewport::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.EditorLoadAsset
// 0x0018 (0x0018 - 0x0000)
struct VCamBlueprintFunctionLibrary_EditorLoadAsset final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamBlueprintFunctionLibrary_EditorLoadAsset) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_EditorLoadAsset");
static_assert(sizeof(VCamBlueprintFunctionLibrary_EditorLoadAsset) == 0x000018, "Wrong size on VCamBlueprintFunctionLibrary_EditorLoadAsset");
static_assert(offsetof(VCamBlueprintFunctionLibrary_EditorLoadAsset, AssetPath) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_EditorLoadAsset::AssetPath' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_EditorLoadAsset, ReturnValue) == 0x000010, "Member 'VCamBlueprintFunctionLibrary_EditorLoadAsset::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.EditorSaveAsset
// 0x0018 (0x0018 - 0x0000)
struct VCamBlueprintFunctionLibrary_EditorSaveAsset final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4744[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VCamBlueprintFunctionLibrary_EditorSaveAsset) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_EditorSaveAsset");
static_assert(sizeof(VCamBlueprintFunctionLibrary_EditorSaveAsset) == 0x000018, "Wrong size on VCamBlueprintFunctionLibrary_EditorSaveAsset");
static_assert(offsetof(VCamBlueprintFunctionLibrary_EditorSaveAsset, AssetPath) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_EditorSaveAsset::AssetPath' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_EditorSaveAsset, ReturnValue) == 0x000010, "Member 'VCamBlueprintFunctionLibrary_EditorSaveAsset::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.EditorSetGameView
// 0x0001 (0x0001 - 0x0000)
struct VCamBlueprintFunctionLibrary_EditorSetGameView final
{
public:
	bool                                          bIsToggled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamBlueprintFunctionLibrary_EditorSetGameView) == 0x000001, "Wrong alignment on VCamBlueprintFunctionLibrary_EditorSetGameView");
static_assert(sizeof(VCamBlueprintFunctionLibrary_EditorSetGameView) == 0x000001, "Wrong size on VCamBlueprintFunctionLibrary_EditorSetGameView");
static_assert(offsetof(VCamBlueprintFunctionLibrary_EditorSetGameView, bIsToggled) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_EditorSetGameView::bIsToggled' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.EnableDebugFocusPlane
// 0x0010 (0x0010 - 0x0000)
struct VCamBlueprintFunctionLibrary_EnableDebugFocusPlane final
{
public:
	class UCineCameraComponent*                   CineCamera;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4745[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VCamBlueprintFunctionLibrary_EnableDebugFocusPlane) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_EnableDebugFocusPlane");
static_assert(sizeof(VCamBlueprintFunctionLibrary_EnableDebugFocusPlane) == 0x000010, "Wrong size on VCamBlueprintFunctionLibrary_EnableDebugFocusPlane");
static_assert(offsetof(VCamBlueprintFunctionLibrary_EnableDebugFocusPlane, CineCamera) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_EnableDebugFocusPlane::CineCamera' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_EnableDebugFocusPlane, bEnabled) == 0x000008, "Member 'VCamBlueprintFunctionLibrary_EnableDebugFocusPlane::bEnabled' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.GetBoundObjects
// 0x0028 (0x0028 - 0x0000)
struct VCamBlueprintFunctionLibrary_GetBoundObjects final
{
public:
	struct FMovieSceneObjectBindingID             CameraBindingID;                                   // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamBlueprintFunctionLibrary_GetBoundObjects) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_GetBoundObjects");
static_assert(sizeof(VCamBlueprintFunctionLibrary_GetBoundObjects) == 0x000028, "Wrong size on VCamBlueprintFunctionLibrary_GetBoundObjects");
static_assert(offsetof(VCamBlueprintFunctionLibrary_GetBoundObjects, CameraBindingID) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_GetBoundObjects::CameraBindingID' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_GetBoundObjects, ReturnValue) == 0x000018, "Member 'VCamBlueprintFunctionLibrary_GetBoundObjects::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.GetCurrentLevelSequence
// 0x0008 (0x0008 - 0x0000)
struct VCamBlueprintFunctionLibrary_GetCurrentLevelSequence final
{
public:
	class ULevelSequence*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamBlueprintFunctionLibrary_GetCurrentLevelSequence) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_GetCurrentLevelSequence");
static_assert(sizeof(VCamBlueprintFunctionLibrary_GetCurrentLevelSequence) == 0x000008, "Wrong size on VCamBlueprintFunctionLibrary_GetCurrentLevelSequence");
static_assert(offsetof(VCamBlueprintFunctionLibrary_GetCurrentLevelSequence, ReturnValue) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_GetCurrentLevelSequence::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.GetCurrentLevelSequenceCurrentFrame
// 0x0004 (0x0004 - 0x0000)
struct VCamBlueprintFunctionLibrary_GetCurrentLevelSequenceCurrentFrame final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamBlueprintFunctionLibrary_GetCurrentLevelSequenceCurrentFrame) == 0x000004, "Wrong alignment on VCamBlueprintFunctionLibrary_GetCurrentLevelSequenceCurrentFrame");
static_assert(sizeof(VCamBlueprintFunctionLibrary_GetCurrentLevelSequenceCurrentFrame) == 0x000004, "Wrong size on VCamBlueprintFunctionLibrary_GetCurrentLevelSequenceCurrentFrame");
static_assert(offsetof(VCamBlueprintFunctionLibrary_GetCurrentLevelSequenceCurrentFrame, ReturnValue) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_GetCurrentLevelSequenceCurrentFrame::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.GetDisplayRate
// 0x0010 (0x0010 - 0x0000)
struct VCamBlueprintFunctionLibrary_GetDisplayRate final
{
public:
	class ULevelSequence*                         LevelSequence;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamBlueprintFunctionLibrary_GetDisplayRate) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_GetDisplayRate");
static_assert(sizeof(VCamBlueprintFunctionLibrary_GetDisplayRate) == 0x000010, "Wrong size on VCamBlueprintFunctionLibrary_GetDisplayRate");
static_assert(offsetof(VCamBlueprintFunctionLibrary_GetDisplayRate, LevelSequence) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_GetDisplayRate::LevelSequence' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_GetDisplayRate, ReturnValue) == 0x000008, "Member 'VCamBlueprintFunctionLibrary_GetDisplayRate::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.GetLevelSequenceFrameAsTimecode
// 0x0020 (0x0020 - 0x0000)
struct VCamBlueprintFunctionLibrary_GetLevelSequenceFrameAsTimecode final
{
public:
	const class ULevelSequence*                   LevelSequence;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InFrame;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimecode                              ReturnValue;                                       // 0x000C(0x0014)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamBlueprintFunctionLibrary_GetLevelSequenceFrameAsTimecode) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_GetLevelSequenceFrameAsTimecode");
static_assert(sizeof(VCamBlueprintFunctionLibrary_GetLevelSequenceFrameAsTimecode) == 0x000020, "Wrong size on VCamBlueprintFunctionLibrary_GetLevelSequenceFrameAsTimecode");
static_assert(offsetof(VCamBlueprintFunctionLibrary_GetLevelSequenceFrameAsTimecode, LevelSequence) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_GetLevelSequenceFrameAsTimecode::LevelSequence' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_GetLevelSequenceFrameAsTimecode, InFrame) == 0x000008, "Member 'VCamBlueprintFunctionLibrary_GetLevelSequenceFrameAsTimecode::InFrame' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_GetLevelSequenceFrameAsTimecode, ReturnValue) == 0x00000C, "Member 'VCamBlueprintFunctionLibrary_GetLevelSequenceFrameAsTimecode::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.GetLevelSequenceFrameAsTimecodeWithoutObject
// 0x0020 (0x0020 - 0x0000)
struct VCamBlueprintFunctionLibrary_GetLevelSequenceFrameAsTimecodeWithoutObject final
{
public:
