#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoginBrowser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "XsollaLogin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LoginBrowser.W_LoginBrowser_C
// 0x0028 (0x0318 - 0x02F0)
class UW_LoginBrowser_C final : public UXsollaLoginBrowserWrapper
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Close;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UXsollaWebBrowser*                      XsollaWebBrowser_43;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             Browser_Closed;                                    // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__W_LoginBrowser_Button_45_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__XsollaWebBrowser_42_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature(const class FText& Text);
	void Browser_Closed__DelegateSignature(bool Authentication_Completed);
	void CloseBrowser(bool bAuthCompleted);
	void Construct();
	void ExecuteUbergraph_W_LoginBrowser(int32 EntryPoint);
	void LoadUrl(const class FString& URL);
	void OnCodeExchangeError(const class FString& Code, const class FString& Description);
	void OnCodeExchangeSuccess(const struct FXsollaLoginData& LoginData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_LoginBrowser_C">();
	}
	static class UW_LoginBrowser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LoginBrowser_C>();
	}
};
static_assert(alignof(UW_LoginBrowser_C) == 0x000008, "Wrong alignment on UW_LoginBrowser_C");
static_assert(sizeof(UW_LoginBrowser_C) == 0x000318, "Wrong size on UW_LoginBrowser_C");
static_assert(offsetof(UW_LoginBrowser_C, UberGraphFrame) == 0x0002F0, "Member 'UW_LoginBrowser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_LoginBrowser_C, Button_Close) == 0x0002F8, "Member 'UW_LoginBrowser_C::Button_Close' has a wrong offset!");
static_assert(offsetof(UW_LoginBrowser_C, XsollaWebBrowser_43) == 0x000300, "Member 'UW_LoginBrowser_C::XsollaWebBrowser_43' has a wrong offset!");
static_assert(offsetof(UW_LoginBrowser_C, Browser_Closed) == 0x000308, "Member 'UW_LoginBrowser_C::Browser_Closed' has a wrong offset!");

}

