#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_StoreBrowser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "XsollaStore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_StoreBrowser.W_StoreBrowser_C
// 0x0050 (0x0340 - 0x02F0)
class UW_StoreBrowser_C final : public UXsollaStoreBrowserWrapper
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Back;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Close;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_Loader;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UXsollaWebBrowser*                      XsollaWebBrowser_Browser;                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 CurrentPayStationUrl;                              // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 PopupUrl;                                          // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          ShowBackButtonAfterLoad;                           // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_171_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__W_StoreBrowser_Button_Back_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature(const class FText& Text);
	void BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_3_OnBeforePopup__DelegateSignature(const class FString& URL, const class FString& Frame);
	void BndEvt__XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_1_OnPageLoaded__DelegateSignature();
	void Construct();
	void DestroyBrowser(bool bIsManually);
	void ExecuteUbergraph_W_StoreBrowser(int32 EntryPoint);
	void IsAnyStatusInUrl(bool* bIsAnyStatus);
	void IsUrlStatusDone(bool* bIsDone);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_StoreBrowser_C">();
	}
	static class UW_StoreBrowser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_StoreBrowser_C>();
	}
};
static_assert(alignof(UW_StoreBrowser_C) == 0x000008, "Wrong alignment on UW_StoreBrowser_C");
static_assert(sizeof(UW_StoreBrowser_C) == 0x000340, "Wrong size on UW_StoreBrowser_C");
static_assert(offsetof(UW_StoreBrowser_C, UberGraphFrame) == 0x0002F0, "Member 'UW_StoreBrowser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_StoreBrowser_C, Button_Back) == 0x0002F8, "Member 'UW_StoreBrowser_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UW_StoreBrowser_C, Button_Close) == 0x000300, "Member 'UW_StoreBrowser_C::Button_Close' has a wrong offset!");
static_assert(offsetof(UW_StoreBrowser_C, CircularThrobber_Loader) == 0x000308, "Member 'UW_StoreBrowser_C::CircularThrobber_Loader' has a wrong offset!");
static_assert(offsetof(UW_StoreBrowser_C, XsollaWebBrowser_Browser) == 0x000310, "Member 'UW_StoreBrowser_C::XsollaWebBrowser_Browser' has a wrong offset!");
static_assert(offsetof(UW_StoreBrowser_C, CurrentPayStationUrl) == 0x000318, "Member 'UW_StoreBrowser_C::CurrentPayStationUrl' has a wrong offset!");
static_assert(offsetof(UW_StoreBrowser_C, PopupUrl) == 0x000328, "Member 'UW_StoreBrowser_C::PopupUrl' has a wrong offset!");
static_assert(offsetof(UW_StoreBrowser_C, ShowBackButtonAfterLoad) == 0x000338, "Member 'UW_StoreBrowser_C::ShowBackButtonAfterLoad' has a wrong offset!");

}

