#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_StoreBrowser

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_StoreBrowser.W_StoreBrowser_C.BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature");
static_assert(sizeof(W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature) == 0x000010, "Wrong size on W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature");
static_assert(offsetof(W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature, Text) == 0x000000, "Member 'W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature::Text' has a wrong offset!");

// Function W_StoreBrowser.W_StoreBrowser_C.BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_3_OnBeforePopup__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_3_OnBeforePopup__DelegateSignature final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Frame;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_3_OnBeforePopup__DelegateSignature) == 0x000008, "Wrong alignment on W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_3_OnBeforePopup__DelegateSignature");
static_assert(sizeof(W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_3_OnBeforePopup__DelegateSignature) == 0x000020, "Wrong size on W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_3_OnBeforePopup__DelegateSignature");
static_assert(offsetof(W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_3_OnBeforePopup__DelegateSignature, URL) == 0x000000, "Member 'W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_3_OnBeforePopup__DelegateSignature::URL' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_3_OnBeforePopup__DelegateSignature, Frame) == 0x000010, "Member 'W_StoreBrowser_C_BndEvt__W_StoreBrowser_XsollaWebBrowser_Browser_K2Node_ComponentBoundEvent_3_OnBeforePopup__DelegateSignature::Frame' has a wrong offset!");

// Function W_StoreBrowser.W_StoreBrowser_C.DestroyBrowser
// 0x0001 (0x0001 - 0x0000)
struct W_StoreBrowser_C_DestroyBrowser final
{
public:
	bool                                          bIsManually;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StoreBrowser_C_DestroyBrowser) == 0x000001, "Wrong alignment on W_StoreBrowser_C_DestroyBrowser");
static_assert(sizeof(W_StoreBrowser_C_DestroyBrowser) == 0x000001, "Wrong size on W_StoreBrowser_C_DestroyBrowser");
static_assert(offsetof(W_StoreBrowser_C_DestroyBrowser, bIsManually) == 0x000000, "Member 'W_StoreBrowser_C_DestroyBrowser::bIsManually' has a wrong offset!");

// Function W_StoreBrowser.W_StoreBrowser_C.ExecuteUbergraph_W_StoreBrowser
// 0x0078 (0x0078 - 0x0000)
struct W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B30[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUrl_ReturnValue;                       // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_URL;                    // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_Frame;                  // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0038(0x0010)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsManually;                    // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyStatusInUrl_bIsAnyStatus;            // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUrlStatusDone_bIsDone;                  // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UXsollaStoreSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPendingPaystationUrl_ReturnValue;      // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser) == 0x000008, "Wrong alignment on W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser");
static_assert(sizeof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser) == 0x000078, "Wrong size on W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, EntryPoint) == 0x000000, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_GetUrl_ReturnValue) == 0x000008, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_GetUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, K2Node_ComponentBoundEvent_URL) == 0x000018, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::K2Node_ComponentBoundEvent_URL' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, K2Node_ComponentBoundEvent_Frame) == 0x000028, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::K2Node_ComponentBoundEvent_Frame' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, K2Node_ComponentBoundEvent_Text) == 0x000038, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000058, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000059, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_BooleanOR_ReturnValue) == 0x00005A, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, K2Node_CustomEvent_bIsManually) == 0x00005B, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::K2Node_CustomEvent_bIsManually' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_IsInViewport_ReturnValue) == 0x00005C, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_IsAnyStatusInUrl_bIsAnyStatus) == 0x00005D, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_IsAnyStatusInUrl_bIsAnyStatus' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_IsUrlStatusDone_bIsDone) == 0x00005E, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_IsUrlStatusDone_bIsDone' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_BooleanAND_ReturnValue) == 0x00005F, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000060, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_GetPendingPaystationUrl_ReturnValue) == 0x000068, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_GetPendingPaystationUrl_ReturnValue' has a wrong offset!");

// Function W_StoreBrowser.W_StoreBrowser_C.IsAnyStatusInUrl
// 0x0020 (0x0020 - 0x0000)
struct W_StoreBrowser_C_IsAnyStatusInUrl final
{
public:
	bool                                          bIsAnyStatus;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B31[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUrl_ReturnValue;                       // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StoreBrowser_C_IsAnyStatusInUrl) == 0x000008, "Wrong alignment on W_StoreBrowser_C_IsAnyStatusInUrl");
static_assert(sizeof(W_StoreBrowser_C_IsAnyStatusInUrl) == 0x000020, "Wrong size on W_StoreBrowser_C_IsAnyStatusInUrl");
static_assert(offsetof(W_StoreBrowser_C_IsAnyStatusInUrl, bIsAnyStatus) == 0x000000, "Member 'W_StoreBrowser_C_IsAnyStatusInUrl::bIsAnyStatus' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_IsAnyStatusInUrl, CallFunc_GetUrl_ReturnValue) == 0x000008, "Member 'W_StoreBrowser_C_IsAnyStatusInUrl::CallFunc_GetUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_IsAnyStatusInUrl, CallFunc_Contains_ReturnValue) == 0x000018, "Member 'W_StoreBrowser_C_IsAnyStatusInUrl::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function W_StoreBrowser.W_StoreBrowser_C.IsUrlStatusDone
// 0x0020 (0x0020 - 0x0000)
struct W_StoreBrowser_C_IsUrlStatusDone final
{
public:
	bool                                          bIsDone;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B32[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUrl_ReturnValue;                       // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StoreBrowser_C_IsUrlStatusDone) == 0x000008, "Wrong alignment on W_StoreBrowser_C_IsUrlStatusDone");
static_assert(sizeof(W_StoreBrowser_C_IsUrlStatusDone) == 0x000020, "Wrong size on W_StoreBrowser_C_IsUrlStatusDone");
static_assert(offsetof(W_StoreBrowser_C_IsUrlStatusDone, bIsDone) == 0x000000, "Member 'W_StoreBrowser_C_IsUrlStatusDone::bIsDone' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_IsUrlStatusDone, CallFunc_GetUrl_ReturnValue) == 0x000008, "Member 'W_StoreBrowser_C_IsUrlStatusDone::CallFunc_GetUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_IsUrlStatusDone, CallFunc_Contains_ReturnValue) == 0x000018, "Member 'W_StoreBrowser_C_IsUrlStatusDone::CallFunc_Contains_ReturnValue' has a wrong offset!");

}

