#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBE_MarkerHighlightAnimation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WBE_MarkerHighlightAnimation.WBE_MarkerHighlightAnimation_C
// 0x0018 (0x0040 - 0x0028)
class UWBE_MarkerHighlightAnimation_C final : public UGzUserWidgetExtension
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimHighlight;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        EndTime;                                           // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBE_MarkerHighlightAnimation(int32 EntryPoint);
	void On_Marker_States_Changed(class UGzMarkerComponent* MarkerComponent, const struct FGameplayTagContainer& States);
	void OnConstruct();
	void OnDestruct();
	void RefreshAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBE_MarkerHighlightAnimation_C">();
	}
	static class UWBE_MarkerHighlightAnimation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBE_MarkerHighlightAnimation_C>();
	}
};
static_assert(alignof(UWBE_MarkerHighlightAnimation_C) == 0x000008, "Wrong alignment on UWBE_MarkerHighlightAnimation_C");
static_assert(sizeof(UWBE_MarkerHighlightAnimation_C) == 0x000040, "Wrong size on UWBE_MarkerHighlightAnimation_C");
static_assert(offsetof(UWBE_MarkerHighlightAnimation_C, UberGraphFrame) == 0x000028, "Member 'UWBE_MarkerHighlightAnimation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBE_MarkerHighlightAnimation_C, AnimHighlight) == 0x000030, "Member 'UWBE_MarkerHighlightAnimation_C::AnimHighlight' has a wrong offset!");
static_assert(offsetof(UWBE_MarkerHighlightAnimation_C, EndTime) == 0x000038, "Member 'UWBE_MarkerHighlightAnimation_C::EndTime' has a wrong offset!");

}

