#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBE_MarkerHighlightAnimation

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBE_MarkerHighlightAnimation.WBE_MarkerHighlightAnimation_C.ExecuteUbergraph_WBE_MarkerHighlightAnimation
// 0x0058 (0x0058 - 0x0000)
struct WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGzMarkerComponent* MarkerComponent, struct FGameplayTagContainer& States)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AE5[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzMarkerWidget*                        K2Node_DynamicCast_AsGz_Marker_Widget;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AE6[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_1;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzMarkerWidget*                        K2Node_DynamicCast_AsGz_Marker_Widget_1;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AE7[0x1];                                     // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UGzMarkerComponent* MarkerComponent, struct FGameplayTagContainer& States)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation) == 0x000008, "Wrong alignment on WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation");
static_assert(sizeof(WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation) == 0x000058, "Wrong size on WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation, EntryPoint) == 0x000000, "Member 'WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation, CallFunc_GetWidget_ReturnValue) == 0x000018, "Member 'WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation, K2Node_DynamicCast_AsGz_Marker_Widget) == 0x000020, "Member 'WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation::K2Node_DynamicCast_AsGz_Marker_Widget' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation, CallFunc_GetWidget_ReturnValue_1) == 0x000030, "Member 'WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation::CallFunc_GetWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation, K2Node_DynamicCast_AsGz_Marker_Widget_1) == 0x000038, "Member 'WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation::K2Node_DynamicCast_AsGz_Marker_Widget_1' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation, CallFunc_IsValid_ReturnValue_1) == 0x000042, "Member 'WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'WBE_MarkerHighlightAnimation_C_ExecuteUbergraph_WBE_MarkerHighlightAnimation::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBE_MarkerHighlightAnimation.WBE_MarkerHighlightAnimation_C.On Marker States Changed
// 0x0028 (0x0028 - 0x0000)
struct WBE_MarkerHighlightAnimation_C_On_Marker_States_Changed final
{
public:
	class UGzMarkerComponent*                     MarkerComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  States;                                            // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBE_MarkerHighlightAnimation_C_On_Marker_States_Changed) == 0x000008, "Wrong alignment on WBE_MarkerHighlightAnimation_C_On_Marker_States_Changed");
static_assert(sizeof(WBE_MarkerHighlightAnimation_C_On_Marker_States_Changed) == 0x000028, "Wrong size on WBE_MarkerHighlightAnimation_C_On_Marker_States_Changed");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_On_Marker_States_Changed, MarkerComponent) == 0x000000, "Member 'WBE_MarkerHighlightAnimation_C_On_Marker_States_Changed::MarkerComponent' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_On_Marker_States_Changed, States) == 0x000008, "Member 'WBE_MarkerHighlightAnimation_C_On_Marker_States_Changed::States' has a wrong offset!");

// Function WBE_MarkerHighlightAnimation.WBE_MarkerHighlightAnimation_C.RefreshAnimation
// 0x0080 (0x0080 - 0x0000)
struct WBE_MarkerHighlightAnimation_C_RefreshAnimation final
{
public:
	class UWBP_MapMarker_C*                       MarkerWidget;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AE8[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetMarkerStates_ReturnValue;              // 0x0010(0x0020)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AE9[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_1;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_2;                  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_3;                  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AEA[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_4;                  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MapMarker_C*                       K2Node_DynamicCast_AsWBP_Map_Marker;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBE_MarkerHighlightAnimation_C_RefreshAnimation) == 0x000008, "Wrong alignment on WBE_MarkerHighlightAnimation_C_RefreshAnimation");
static_assert(sizeof(WBE_MarkerHighlightAnimation_C_RefreshAnimation) == 0x000080, "Wrong size on WBE_MarkerHighlightAnimation_C_RefreshAnimation");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, MarkerWidget) == 0x000000, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::MarkerWidget' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, CallFunc_GetMarkerStates_ReturnValue) == 0x000010, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::CallFunc_GetMarkerStates_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, CallFunc_HasTag_ReturnValue) == 0x000030, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, CallFunc_GetWidget_ReturnValue) == 0x000038, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, CallFunc_GetWidget_ReturnValue_1) == 0x000040, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::CallFunc_GetWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, CallFunc_GetWidget_ReturnValue_2) == 0x000048, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::CallFunc_GetWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, CallFunc_GetWidget_ReturnValue_3) == 0x000050, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::CallFunc_GetWidget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000060, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000061, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, CallFunc_GetWidget_ReturnValue_4) == 0x000068, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::CallFunc_GetWidget_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, K2Node_DynamicCast_AsWBP_Map_Marker) == 0x000070, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::K2Node_DynamicCast_AsWBP_Map_Marker' has a wrong offset!");
static_assert(offsetof(WBE_MarkerHighlightAnimation_C_RefreshAnimation, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBE_MarkerHighlightAnimation_C_RefreshAnimation::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

