#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClanTag

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ClanTag.WBP_ClanTag_C.ExecuteUbergraph_WBP_ClanTag
// 0x0008 (0x0008 - 0x0000)
struct WBP_ClanTag_C_ExecuteUbergraph_WBP_ClanTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClanTag_C_ExecuteUbergraph_WBP_ClanTag) == 0x000004, "Wrong alignment on WBP_ClanTag_C_ExecuteUbergraph_WBP_ClanTag");
static_assert(sizeof(WBP_ClanTag_C_ExecuteUbergraph_WBP_ClanTag) == 0x000008, "Wrong size on WBP_ClanTag_C_ExecuteUbergraph_WBP_ClanTag");
static_assert(offsetof(WBP_ClanTag_C_ExecuteUbergraph_WBP_ClanTag, EntryPoint) == 0x000000, "Member 'WBP_ClanTag_C_ExecuteUbergraph_WBP_ClanTag::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_ExecuteUbergraph_WBP_ClanTag, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_ClanTag_C_ExecuteUbergraph_WBP_ClanTag::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_ClanTag.WBP_ClanTag_C.OnTagUpdated
// 0x0008 (0x0008 - 0x0000)
struct WBP_ClanTag_C_OnTagUpdated final
{
public:
	class AGzPlayerState*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClanTag_C_OnTagUpdated) == 0x000008, "Wrong alignment on WBP_ClanTag_C_OnTagUpdated");
static_assert(sizeof(WBP_ClanTag_C_OnTagUpdated) == 0x000008, "Wrong size on WBP_ClanTag_C_OnTagUpdated");
static_assert(offsetof(WBP_ClanTag_C_OnTagUpdated, PlayerState) == 0x000000, "Member 'WBP_ClanTag_C_OnTagUpdated::PlayerState' has a wrong offset!");

// Function WBP_ClanTag.WBP_ClanTag_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ClanTag_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClanTag_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ClanTag_C_PreConstruct");
static_assert(sizeof(WBP_ClanTag_C_PreConstruct) == 0x000001, "Wrong size on WBP_ClanTag_C_PreConstruct");
static_assert(offsetof(WBP_ClanTag_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ClanTag_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ClanTag.WBP_ClanTag_C.SetTag
// 0x0050 (0x0050 - 0x0000)
struct WBP_ClanTag_C_SetTag final
{
public:
	class AGzPlayerState*                         InPlayerState;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerClanTag_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClanTag_C_SetTag) == 0x000008, "Wrong alignment on WBP_ClanTag_C_SetTag");
static_assert(sizeof(WBP_ClanTag_C_SetTag) == 0x000050, "Wrong size on WBP_ClanTag_C_SetTag");
static_assert(offsetof(WBP_ClanTag_C_SetTag, InPlayerState) == 0x000000, "Member 'WBP_ClanTag_C_SetTag::InPlayerState' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTag, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_ClanTag_C_SetTag::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTag, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_ClanTag_C_SetTag::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTag, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_ClanTag_C_SetTag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTag, CallFunc_GetPlayerClanTag_ReturnValue) == 0x000030, "Member 'WBP_ClanTag_C_SetTag::CallFunc_GetPlayerClanTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTag, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'WBP_ClanTag_C_SetTag::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTag, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'WBP_ClanTag_C_SetTag::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_ClanTag.WBP_ClanTag_C.SetTagText
// 0x0088 (0x0088 - 0x0000)
struct WBP_ClanTag_C_SetTagText final
{
public:
	class FString                                 ClanTag;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bLocalTag;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerCommunicationRestricted_ReturnValue; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0010)()
};
static_assert(alignof(WBP_ClanTag_C_SetTagText) == 0x000008, "Wrong alignment on WBP_ClanTag_C_SetTagText");
static_assert(sizeof(WBP_ClanTag_C_SetTagText) == 0x000088, "Wrong size on WBP_ClanTag_C_SetTagText");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, ClanTag) == 0x000000, "Member 'WBP_ClanTag_C_SetTagText::ClanTag' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, bLocalTag) == 0x000010, "Member 'WBP_ClanTag_C_SetTagText::bLocalTag' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, Temp_byte_Variable) == 0x000011, "Member 'WBP_ClanTag_C_SetTagText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_ClanTag_C_SetTagText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, Temp_bool_Variable) == 0x000013, "Member 'WBP_ClanTag_C_SetTagText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, Temp_string_Variable) == 0x000018, "Member 'WBP_ClanTag_C_SetTagText::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'WBP_ClanTag_C_SetTagText::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'WBP_ClanTag_C_SetTagText::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, CallFunc_IsEmpty_ReturnValue) == 0x000040, "Member 'WBP_ClanTag_C_SetTagText::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'WBP_ClanTag_C_SetTagText::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, CallFunc_IsLocalPlayerCommunicationRestricted_ReturnValue) == 0x000058, "Member 'WBP_ClanTag_C_SetTagText::CallFunc_IsLocalPlayerCommunicationRestricted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, CallFunc_BooleanAND_ReturnValue) == 0x000059, "Member 'WBP_ClanTag_C_SetTagText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, CallFunc_BooleanOR_ReturnValue) == 0x00005A, "Member 'WBP_ClanTag_C_SetTagText::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, Temp_bool_Variable_1) == 0x00005B, "Member 'WBP_ClanTag_C_SetTagText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, K2Node_Select_Default) == 0x000060, "Member 'WBP_ClanTag_C_SetTagText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, K2Node_Select_Default_1) == 0x000070, "Member 'WBP_ClanTag_C_SetTagText::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ClanTag_C_SetTagText, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'WBP_ClanTag_C_SetTagText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

