#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MatchResultBannerContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MatchResultBannerContainer.WBP_MatchResultBannerContainer_C
// 0x00E8 (0x0610 - 0x0528)
class UWBP_MatchResultBannerContainer_C final : public UGzNavigationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       VictoryAnimation;                                  // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnimation;                                     // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Navigation_DarkBG_Button_C*        LeaveMatch_Button;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Container;                                 // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Navigation_DarkBG_Button_C*        Spectatte_Button;                                  // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VictoryPanel_Image;                                // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MatchResultBanner_C*               WBP_MatchResultBanner;                             // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScreenBackground_C*                WBP_ScreenBackground;                              // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SquadScreen_C*                     WBP_SquadScreen;                                   // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGzMatchResult                         Match_Result;                                      // 0x0578(0x0090)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bShowLeavePopup;                                   // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WinnerTeam;                                        // 0x0609(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShowMatchScreen();
	bool IsWinnerTeam();
	void GetMatchResultBanner(class UWBP_MatchResultBanner_C** MatchResultBanner);
	void Finished_6DC7A98D4AB33D9FE92ABC8D359452D7();
	void ExecuteUbergraph_WBP_MatchResultBannerContainer(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_MatchResultBannerContainer_WBP_MatchResultBanner_K2Node_ComponentBoundEvent_1_OnEnd__DelegateSignature();
	void BndEvt__WBP_MatchResultBannerContainer_WBP_MatchResultBanner_K2Node_ComponentBoundEvent_0_OnStartAnimation__DelegateSignature();
	void BndEvt__WBP_MatchResultBannerContainer_Spectatte_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MatchResultBannerContainer_LeaveMatch_Button_1_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MatchResultBannerContainer_C">();
	}
	static class UWBP_MatchResultBannerContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MatchResultBannerContainer_C>();
	}
};
static_assert(alignof(UWBP_MatchResultBannerContainer_C) == 0x000008, "Wrong alignment on UWBP_MatchResultBannerContainer_C");
static_assert(sizeof(UWBP_MatchResultBannerContainer_C) == 0x000610, "Wrong size on UWBP_MatchResultBannerContainer_C");
static_assert(offsetof(UWBP_MatchResultBannerContainer_C, UberGraphFrame) == 0x000528, "Member 'UWBP_MatchResultBannerContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBannerContainer_C, VictoryAnimation) == 0x000530, "Member 'UWBP_MatchResultBannerContainer_C::VictoryAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBannerContainer_C, ShowAnimation) == 0x000538, "Member 'UWBP_MatchResultBannerContainer_C::ShowAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBannerContainer_C, LeaveMatch_Button) == 0x000540, "Member 'UWBP_MatchResultBannerContainer_C::LeaveMatch_Button' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBannerContainer_C, Overlay_Container) == 0x000548, "Member 'UWBP_MatchResultBannerContainer_C::Overlay_Container' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBannerContainer_C, Spectatte_Button) == 0x000550, "Member 'UWBP_MatchResultBannerContainer_C::Spectatte_Button' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBannerContainer_C, VictoryPanel_Image) == 0x000558, "Member 'UWBP_MatchResultBannerContainer_C::VictoryPanel_Image' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBannerContainer_C, WBP_MatchResultBanner) == 0x000560, "Member 'UWBP_MatchResultBannerContainer_C::WBP_MatchResultBanner' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBannerContainer_C, WBP_ScreenBackground) == 0x000568, "Member 'UWBP_MatchResultBannerContainer_C::WBP_ScreenBackground' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBannerContainer_C, WBP_SquadScreen) == 0x000570, "Member 'UWBP_MatchResultBannerContainer_C::WBP_SquadScreen' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBannerContainer_C, Match_Result) == 0x000578, "Member 'UWBP_MatchResultBannerContainer_C::Match_Result' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBannerContainer_C, bShowLeavePopup) == 0x000608, "Member 'UWBP_MatchResultBannerContainer_C::bShowLeavePopup' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBannerContainer_C, WinnerTeam) == 0x000609, "Member 'UWBP_MatchResultBannerContainer_C::WinnerTeam' has a wrong offset!");

}

