#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PickUpLog

#include "Basic.hpp"

#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PickUpLog.WBP_PickUpLog_C
// 0x0020 (0x03C0 - 0x03A0)
class UWBP_PickUpLog_C final : public UGzPickUpLogWidget
{
public:
	class UWBP_PickUpLogEntry_C*                  WBP_PickUpLogEntry;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PickUpLogEntry_C*                  WBP_PickUpLogEntry_28;                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PickUpLogEntry_C*                  WBP_PickUpLogEntry_62;                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PickUpLogEntry_C*                  WBP_PickUpLogEntry_146;                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PickUpLog_C">();
	}
	static class UWBP_PickUpLog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PickUpLog_C>();
	}
};
static_assert(alignof(UWBP_PickUpLog_C) == 0x000010, "Wrong alignment on UWBP_PickUpLog_C");
static_assert(sizeof(UWBP_PickUpLog_C) == 0x0003C0, "Wrong size on UWBP_PickUpLog_C");
static_assert(offsetof(UWBP_PickUpLog_C, WBP_PickUpLogEntry) == 0x0003A0, "Member 'UWBP_PickUpLog_C::WBP_PickUpLogEntry' has a wrong offset!");
static_assert(offsetof(UWBP_PickUpLog_C, WBP_PickUpLogEntry_28) == 0x0003A8, "Member 'UWBP_PickUpLog_C::WBP_PickUpLogEntry_28' has a wrong offset!");
static_assert(offsetof(UWBP_PickUpLog_C, WBP_PickUpLogEntry_62) == 0x0003B0, "Member 'UWBP_PickUpLog_C::WBP_PickUpLogEntry_62' has a wrong offset!");
static_assert(offsetof(UWBP_PickUpLog_C, WBP_PickUpLogEntry_146) == 0x0003B8, "Member 'UWBP_PickUpLog_C::WBP_PickUpLogEntry_146' has a wrong offset!");

}

