#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Navigation_Highlighted_Button

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Navigation_Highlighted_Button.WBP_Navigation_Highlighted_Button_C
// 0x0070 (0x16A0 - 0x1630)
class UWBP_Navigation_Highlighted_Button_C final : public UGzCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   ButtonText;                                        // 0x1638(0x0010)(Edit, BlueprintVisible)
	class UClass*                                 TextStyle;                                         // 0x1648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         TextStyles;                                        // 0x1650(0x0010)(Edit, BlueprintVisible)
	struct FLinearColor                           IconColor;                                         // 0x1660(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Icon_ColorGray;                                    // 0x1670(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Icon_ColorBlue;                                    // 0x1680(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Icon_ColorWhite;                                   // 0x1690(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetWhiteTextStyle();
	void SetText(const class FText& InText);
	void SetGrayTextStyle();
	void SetDefaultText(class UCommonButtonBase* Button);
	void SetBlueTextStyle();
	void Set_TextStyle();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_Navigation_Highlighted_Button(int32 EntryPoint);
	void Construct();
	void BP_OnUnhovered();
	void BP_OnSelected();
	void BP_OnReleased();
	void BP_OnPressed();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Navigation_Highlighted_Button_C">();
	}
	static class UWBP_Navigation_Highlighted_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Navigation_Highlighted_Button_C>();
	}
};
static_assert(alignof(UWBP_Navigation_Highlighted_Button_C) == 0x000010, "Wrong alignment on UWBP_Navigation_Highlighted_Button_C");
static_assert(sizeof(UWBP_Navigation_Highlighted_Button_C) == 0x0016A0, "Wrong size on UWBP_Navigation_Highlighted_Button_C");
static_assert(offsetof(UWBP_Navigation_Highlighted_Button_C, UberGraphFrame) == 0x001630, "Member 'UWBP_Navigation_Highlighted_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_Highlighted_Button_C, ButtonText) == 0x001638, "Member 'UWBP_Navigation_Highlighted_Button_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_Highlighted_Button_C, TextStyle) == 0x001648, "Member 'UWBP_Navigation_Highlighted_Button_C::TextStyle' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_Highlighted_Button_C, TextStyles) == 0x001650, "Member 'UWBP_Navigation_Highlighted_Button_C::TextStyles' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_Highlighted_Button_C, IconColor) == 0x001660, "Member 'UWBP_Navigation_Highlighted_Button_C::IconColor' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_Highlighted_Button_C, Icon_ColorGray) == 0x001670, "Member 'UWBP_Navigation_Highlighted_Button_C::Icon_ColorGray' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_Highlighted_Button_C, Icon_ColorBlue) == 0x001680, "Member 'UWBP_Navigation_Highlighted_Button_C::Icon_ColorBlue' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_Highlighted_Button_C, Icon_ColorWhite) == 0x001690, "Member 'UWBP_Navigation_Highlighted_Button_C::Icon_ColorWhite' has a wrong offset!");

}

