#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EventLogHUD

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_EventLogHUD.WBP_EventLogHUD_C.ExecuteUbergraph_WBP_EventLogHUD
// 0x0028 (0x0028 - 0x0000)
struct WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_ViewTarget;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         K2Node_DynamicCast_AsGz_Player_State;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD) == 0x000008, "Wrong alignment on WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD");
static_assert(sizeof(WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD) == 0x000028, "Wrong size on WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD");
static_assert(offsetof(WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD, EntryPoint) == 0x000000, "Member 'WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD, K2Node_Event_ViewTarget) == 0x000008, "Member 'WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD::K2Node_Event_ViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD, K2Node_DynamicCast_AsGz_Player_State) == 0x000018, "Member 'WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD::K2Node_DynamicCast_AsGz_Player_State' has a wrong offset!");
static_assert(offsetof(WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_EventLogHUD_C_ExecuteUbergraph_WBP_EventLogHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_EventLogHUD.WBP_EventLogHUD_C.OnViewTargetChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_EventLogHUD_C_OnViewTargetChanged final
{
public:
	class APawn*                                  ViewTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EventLogHUD_C_OnViewTargetChanged) == 0x000008, "Wrong alignment on WBP_EventLogHUD_C_OnViewTargetChanged");
static_assert(sizeof(WBP_EventLogHUD_C_OnViewTargetChanged) == 0x000008, "Wrong size on WBP_EventLogHUD_C_OnViewTargetChanged");
static_assert(offsetof(WBP_EventLogHUD_C_OnViewTargetChanged, ViewTarget) == 0x000000, "Member 'WBP_EventLogHUD_C_OnViewTargetChanged::ViewTarget' has a wrong offset!");

}

