#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RotatorVisualBars

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RotatorVisualBars.WBP_RotatorVisualBars_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_RotatorVisualBars_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_12;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           SelectedColor;                                     // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NormalColor;                                       // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_RotatorVisualBars(int32 EntryPoint);
	void Deselect();
	void Select();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RotatorVisualBars_C">();
	}
	static class UWBP_RotatorVisualBars_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RotatorVisualBars_C>();
	}
};
static_assert(alignof(UWBP_RotatorVisualBars_C) == 0x000008, "Wrong alignment on UWBP_RotatorVisualBars_C");
static_assert(sizeof(UWBP_RotatorVisualBars_C) == 0x000318, "Wrong size on UWBP_RotatorVisualBars_C");
static_assert(offsetof(UWBP_RotatorVisualBars_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_RotatorVisualBars_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RotatorVisualBars_C, Image_12) == 0x0002E8, "Member 'UWBP_RotatorVisualBars_C::Image_12' has a wrong offset!");
static_assert(offsetof(UWBP_RotatorVisualBars_C, SelectedColor) == 0x0002F0, "Member 'UWBP_RotatorVisualBars_C::SelectedColor' has a wrong offset!");
static_assert(offsetof(UWBP_RotatorVisualBars_C, NormalColor) == 0x000300, "Member 'UWBP_RotatorVisualBars_C::NormalColor' has a wrong offset!");
static_assert(offsetof(UWBP_RotatorVisualBars_C, IsSelected) == 0x000310, "Member 'UWBP_RotatorVisualBars_C::IsSelected' has a wrong offset!");

}

