#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipInteraction_Item_DOS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_BaseTooltip_classes.hpp"
#include "E_TooltipItemType_structs.hpp"
#include "G01_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TooltipInteraction_Item_DOS.WBP_TooltipInteraction_Item_DOS_C
// 0x0068 (0x0350 - 0x02E8)
class UWBP_TooltipInteraction_Item_DOS_C final : public UWBP_BaseTooltip_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzRichTextBlock*                       Description_RichText;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Quality_Image;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ToolTip_SizeBox;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemImage_C*                       WBP_ItemImage;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TooltipDetailsPanel_C*             WBP_TooltipDetailsPanel;                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         LetterOnDisplayBorder;                             // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D44[0x4];                                     // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LongDisplay;                                       // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   DescriprionFont_Default;                           // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DescriprionFont_Illumionation;                     // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_TooltipInteraction_Item_DOS(int32 EntryPoint);
	void FindCurrentWeaponData(class UGzWeaponItemData** CurrentWeaponData);
	void InitItemSetup(class UGzItemData* Param_ItemData, int32 Quantity, E_TooltipItemType ItemType);
	void PreConstruct(bool IsDesignTime);
	void SetAmmoDescription(class UGzItemData* Param_ItemData);
	void SetItemDescription(class UGzItemData* Param_ItemData);
	void UpdateRarity(class UGzItemData* Param_ItemData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TooltipInteraction_Item_DOS_C">();
	}
	static class UWBP_TooltipInteraction_Item_DOS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TooltipInteraction_Item_DOS_C>();
	}
};
static_assert(alignof(UWBP_TooltipInteraction_Item_DOS_C) == 0x000008, "Wrong alignment on UWBP_TooltipInteraction_Item_DOS_C");
static_assert(sizeof(UWBP_TooltipInteraction_Item_DOS_C) == 0x000350, "Wrong size on UWBP_TooltipInteraction_Item_DOS_C");
static_assert(offsetof(UWBP_TooltipInteraction_Item_DOS_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_TooltipInteraction_Item_DOS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Item_DOS_C, Description_RichText) == 0x0002F0, "Member 'UWBP_TooltipInteraction_Item_DOS_C::Description_RichText' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Item_DOS_C, Quality_Image) == 0x0002F8, "Member 'UWBP_TooltipInteraction_Item_DOS_C::Quality_Image' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Item_DOS_C, ToolTip_SizeBox) == 0x000300, "Member 'UWBP_TooltipInteraction_Item_DOS_C::ToolTip_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Item_DOS_C, WBP_ItemImage) == 0x000308, "Member 'UWBP_TooltipInteraction_Item_DOS_C::WBP_ItemImage' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Item_DOS_C, WBP_TooltipDetailsPanel) == 0x000310, "Member 'UWBP_TooltipInteraction_Item_DOS_C::WBP_TooltipDetailsPanel' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Item_DOS_C, LetterOnDisplayBorder) == 0x000318, "Member 'UWBP_TooltipInteraction_Item_DOS_C::LetterOnDisplayBorder' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Item_DOS_C, LongDisplay) == 0x000320, "Member 'UWBP_TooltipInteraction_Item_DOS_C::LongDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Item_DOS_C, DescriprionFont_Default) == 0x000330, "Member 'UWBP_TooltipInteraction_Item_DOS_C::DescriprionFont_Default' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Item_DOS_C, DescriprionFont_Illumionation) == 0x000340, "Member 'UWBP_TooltipInteraction_Item_DOS_C::DescriprionFont_Illumionation' has a wrong offset!");

}

