#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HEX_PriceList_Entry

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_HEX_PriceList_Entry.WBP_HEX_PriceList_Entry_C.ExecuteUbergraph_WBP_HEX_PriceList_Entry
// 0x0090 (0x0090 - 0x0000)
struct WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHexExtractionCostMultiplier_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzItemRarity                                 Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D3D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D3E[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D3F[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetRarityName_RarityName;                 // 0x0058(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0068(0x0010)()
	struct FLinearColor                           CallFunc_GetRarityColor_ReturnValue;               // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry) == 0x000008, "Wrong alignment on WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry");
static_assert(sizeof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry) == 0x000090, "Wrong size on WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, EntryPoint) == 0x000000, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, CallFunc_GetHexExtractionCostMultiplier_ReturnValue) == 0x000004, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::CallFunc_GetHexExtractionCostMultiplier_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, Temp_byte_Variable) == 0x000008, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, Temp_name_Variable) == 0x00000C, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, Temp_name_Variable_1) == 0x000014, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, Temp_name_Variable_2) == 0x00001C, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, Temp_name_Variable_3) == 0x000024, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, Temp_name_Variable_4) == 0x00002C, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, K2Node_Select_Default) == 0x000048, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, CallFunc_FTrunc_ReturnValue) == 0x000050, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, CallFunc_GetRarityName_RarityName) == 0x000058, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::CallFunc_GetRarityName_RarityName' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, CallFunc_Conv_IntToText_ReturnValue) == 0x000068, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, CallFunc_GetRarityColor_ReturnValue) == 0x000078, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::CallFunc_GetRarityColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000088, "Member 'WBP_HEX_PriceList_Entry_C_ExecuteUbergraph_WBP_HEX_PriceList_Entry::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");

}

