#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipInteraction_Weapon_DOS

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function WBP_TooltipInteraction_Weapon_DOS.WBP_TooltipInteraction_Weapon_DOS_C.FindCurrentWeaponData
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData final
{
public:
	class UGzWeaponItemData*                      TooltipWeapon;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzWeaponItemData*                      CurrentWeaponData;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzInvComponent*                        Inventory;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          HaveEmptySlot;                                     // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E26[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   HandSlots;                                         // 0x0020(0x0010)(Edit, BlueprintVisible)
	class UGzWeaponItemData*                      ItemInHand;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           Character;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UGzWeaponItemData*                      WeaponInSlot;                                      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzCombatComponent*                     CombatComp;                                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzWeaponActor*                         WeaponActor;                                       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UGzCombatComponent*                     CombatComponent;                                   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Pawn;                                              // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E27[0x1];                                     // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzWeaponItemData*                      CallFunc_FindItemInPocket_Return;                  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x007C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGzPlayerViewTargetInterface> CallFunc_GetViewTargetInventory_self_CastInput;    // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzInvComponent*                        CallFunc_GetViewTargetInventory_ReturnValue;       // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   CallFunc_GetAllSlotsFromPocketDef_ReturnValue;     // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E28[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzWeaponItemData*                      CallFunc_FindItemInPocket_Return_1;                // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E29[0x2];                                     // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzWeaponItemData*                      CallFunc_GetWeaponDataInHand_CurrentWeaponData;    // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E2A[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E2B[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData");
static_assert(sizeof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData) == 0x0000F0, "Wrong size on WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, TooltipWeapon) == 0x000000, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::TooltipWeapon' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CurrentWeaponData) == 0x000008, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CurrentWeaponData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, Inventory) == 0x000010, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::Inventory' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, HaveEmptySlot) == 0x000018, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::HaveEmptySlot' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, HandSlots) == 0x000020, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::HandSlots' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, ItemInHand) == 0x000030, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::ItemInHand' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, Character) == 0x000038, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::Character' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, WeaponInSlot) == 0x000040, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::WeaponInSlot' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CombatComp) == 0x000048, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CombatComp' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, WeaponActor) == 0x000050, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::WeaponActor' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CombatComponent) == 0x000058, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CombatComponent' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, Pawn) == 0x000060, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::Pawn' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, Temp_int_Array_Index_Variable) == 0x000068, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_IsValid_ReturnValue) == 0x00006C, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_IsValid_ReturnValue_1) == 0x00006D, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_IsValid_ReturnValue_2) == 0x00006E, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_FindItemInPocket_Return) == 0x000070, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_FindItemInPocket_Return' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000078, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, Temp_bool_True_if_break_was_hit_Variable) == 0x000079, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x00007A, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_Not_PreBool_ReturnValue) == 0x00007B, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_Array_Get_Item) == 0x00007C, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_GetViewTargetInventory_self_CastInput) == 0x000088, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_GetViewTargetInventory_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_GetViewTargetInventory_ReturnValue) == 0x000098, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_GetViewTargetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_GetAllSlotsFromPocketDef_ReturnValue) == 0x0000A0, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_GetAllSlotsFromPocketDef_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_IsValid_ReturnValue_3) == 0x0000B0, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, Temp_int_Loop_Counter_Variable) == 0x0000B4, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_FindItemInPocket_Return_1) == 0x0000B8, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_FindItemInPocket_Return_1' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_BooleanAND_ReturnValue) == 0x0000C1, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_Add_IntInt_ReturnValue) == 0x0000C4, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_GetWeaponDataInHand_CurrentWeaponData) == 0x0000C8, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_GetWeaponDataInHand_CurrentWeaponData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, K2Node_DynamicCast_AsGz_Character) == 0x0000D0, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_Array_Length_ReturnValue_1) == 0x0000DC, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E0, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_IsValid_ReturnValue_4) == 0x0000E1, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x0000E8, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindCurrentWeaponData::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");

// Function WBP_TooltipInteraction_Weapon_DOS.WBP_TooltipInteraction_Weapon_DOS_C.FindItemInPocket
// 0x0090 (0x0090 - 0x0000)
struct WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket final
{
public:
	class AGzBaseCharacter*                       Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Param_Slot;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UGzWeaponItemData*                      Return;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzWeaponActor*                         ItemInPocket;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UGzCombatComponent*                     CombatComp;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGzPlayerViewTargetInterface> CallFunc_GetViewTargetInventory_self_CastInput;    // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzInvComponent*                        CallFunc_GetViewTargetInventory_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E2C[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzInvPocket                           CallFunc_GetPocketBySlot_ReturnValue;              // 0x0048(0x0028)(ConstParm)
	class UGzCombatComponent*                     CallFunc_GetCombatComponent_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzWeaponActor*                         CallFunc_GetWeaponAtPocket_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzWeaponItemData*                      CallFunc_GetItemData_ReturnValue;                  // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket");
static_assert(sizeof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket) == 0x000090, "Wrong size on WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket, Character) == 0x000000, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket::Character' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket, Param_Slot) == 0x000008, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket::Param_Slot' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket, Return) == 0x000010, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket::Return' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket, ItemInPocket) == 0x000018, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket::ItemInPocket' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket, CombatComp) == 0x000020, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket::CombatComp' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket, CallFunc_GetViewTargetInventory_self_CastInput) == 0x000028, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket::CallFunc_GetViewTargetInventory_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket, CallFunc_GetViewTargetInventory_ReturnValue) == 0x000038, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket::CallFunc_GetViewTargetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket, CallFunc_GetPocketBySlot_ReturnValue) == 0x000048, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket::CallFunc_GetPocketBySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket, CallFunc_GetCombatComponent_ReturnValue) == 0x000070, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket::CallFunc_GetCombatComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket, CallFunc_GetWeaponAtPocket_ReturnValue) == 0x000078, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket::CallFunc_GetWeaponAtPocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket, CallFunc_GetItemData_ReturnValue) == 0x000080, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket, CallFunc_IsValid_ReturnValue_2) == 0x000088, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindItemInPocket::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_TooltipInteraction_Weapon_DOS.WBP_TooltipInteraction_Weapon_DOS_C.FindWeaponAttachInPickableWeapon
// 0x0080 (0x0080 - 0x0000)
struct WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon final
{
public:
	struct FGzWeaponInvItem                       WeaponInvItem;                                     // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EGzWeaponAttachmentType                       AttachType;                                        // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E2D[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzItemData*                            ItemData;                                          // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzWeaponAttachmentItemData*            CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E2E[0x2];                                     // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon");
static_assert(sizeof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon) == 0x000080, "Wrong size on WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon, WeaponInvItem) == 0x000000, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon::WeaponInvItem' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon, AttachType) == 0x000050, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon::AttachType' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon, ItemData) == 0x000058, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon::ItemData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon, Temp_int_Array_Index_Variable) == 0x000060, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon, CallFunc_Array_Get_Item) == 0x000068, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000074, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon, CallFunc_Less_IntInt_ReturnValue) == 0x000075, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInPickableWeapon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_TooltipInteraction_Weapon_DOS.WBP_TooltipInteraction_Weapon_DOS_C.FindWeaponAttachInWeaponAttachComp
// 0x0040 (0x0040 - 0x0000)
struct WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp final
{
public:
	class AGzWeaponActor*                         WeaponActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzItemData*                            ItemData;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzWeaponAttachmentItemData*            AttachItemData;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzWeaponAttachmentComponent*           WeaponAttachComp;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E2F[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzWeaponAttachmentComponent*           CallFunc_GetWeaponAttachment_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UGzWeaponAttachmentItemData*      CallFunc_GetWeaponAttachmentItemData_ReturnValue;  // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp");
static_assert(sizeof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp) == 0x000040, "Wrong size on WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp, WeaponActor) == 0x000000, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp::WeaponActor' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp, ItemData) == 0x000008, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp::ItemData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp, AttachItemData) == 0x000010, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp::AttachItemData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp, WeaponAttachComp) == 0x000018, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp::WeaponAttachComp' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp, CallFunc_GetWeaponAttachment_ReturnValue) == 0x000028, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp::CallFunc_GetWeaponAttachment_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp, CallFunc_GetWeaponAttachmentItemData_ReturnValue) == 0x000030, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp::CallFunc_GetWeaponAttachmentItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp, CallFunc_IsValid_ReturnValue_2) == 0x000038, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_FindWeaponAttachInWeaponAttachComp::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_TooltipInteraction_Weapon_DOS.WBP_TooltipInteraction_Weapon_DOS_C.InitWeaponSetup
// 0x0020 (0x0020 - 0x0000)
struct WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup final
{
public:
	class UGzWeaponItemData*                      TooltipWeaponData;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzItemData*                            AttachItemData;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzWeaponItemData*                      CallFunc_FindCurrentWeaponData_CurrentWeaponData;  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowComparisonTooltip_ReturnValue;  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup");
static_assert(sizeof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup) == 0x000020, "Wrong size on WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup, TooltipWeaponData) == 0x000000, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup::TooltipWeaponData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup, AttachItemData) == 0x000008, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup::AttachItemData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup, CallFunc_FindCurrentWeaponData_CurrentWeaponData) == 0x000010, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup::CallFunc_FindCurrentWeaponData_CurrentWeaponData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup, CallFunc_ShouldShowComparisonTooltip_ReturnValue) == 0x000018, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup::CallFunc_ShouldShowComparisonTooltip_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_TooltipInteraction_Weapon_DOS.WBP_TooltipInteraction_Weapon_DOS_C.InitWeaponSetupByPickableIWeapon
// 0x0060 (0x0060 - 0x0000)
struct WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByPickableIWeapon final
{
public:
	class UGzWeaponItemData*                      TooltipWeaponData;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGzWeaponInvItem                       WeaponInvItem;                                     // 0x0008(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGzItemData*                            CallFunc_FindWeaponAttachInPickableWeapon_ItemData; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByPickableIWeapon) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByPickableIWeapon");
static_assert(sizeof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByPickableIWeapon) == 0x000060, "Wrong size on WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByPickableIWeapon");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByPickableIWeapon, TooltipWeaponData) == 0x000000, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByPickableIWeapon::TooltipWeaponData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByPickableIWeapon, WeaponInvItem) == 0x000008, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByPickableIWeapon::WeaponInvItem' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByPickableIWeapon, CallFunc_FindWeaponAttachInPickableWeapon_ItemData) == 0x000058, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByPickableIWeapon::CallFunc_FindWeaponAttachInPickableWeapon_ItemData' has a wrong offset!");

// Function WBP_TooltipInteraction_Weapon_DOS.WBP_TooltipInteraction_Weapon_DOS_C.InitWeaponSetupByWeaponActor
// 0x0018 (0x0018 - 0x0000)
struct WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByWeaponActor final
{
public:
	class UGzWeaponItemData*                      TooltipWeaponData;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzWeaponActor*                         WeaponActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzItemData*                            CallFunc_FindWeaponAttachInWeaponAttachComp_ItemData; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByWeaponActor) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByWeaponActor");
static_assert(sizeof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByWeaponActor) == 0x000018, "Wrong size on WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByWeaponActor");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByWeaponActor, TooltipWeaponData) == 0x000000, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByWeaponActor::TooltipWeaponData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByWeaponActor, WeaponActor) == 0x000008, "Member 'WBP_TooltipInteraction_Weapon_DOS_C_InitWeaponSetupByWeaponActor::WeaponActor' has a wrong offset!");
