#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSlots_List_QuickOrder

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_LoadoutSlots_List_QuickOrder.WBP_LoadoutSlots_List_QuickOrder_C.ExecuteUbergraph_WBP_LoadoutSlots_List_QuickOrder
// 0x0018 (0x0018 - 0x0000)
struct WBP_LoadoutSlots_List_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSlots_List_QuickOrder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B89[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzLoadoutSelectionButton*              K2Node_Event_NewButton;                            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSlots_List_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSlots_List_QuickOrder) == 0x000008, "Wrong alignment on WBP_LoadoutSlots_List_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSlots_List_QuickOrder");
static_assert(sizeof(WBP_LoadoutSlots_List_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSlots_List_QuickOrder) == 0x000018, "Wrong size on WBP_LoadoutSlots_List_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSlots_List_QuickOrder");
static_assert(offsetof(WBP_LoadoutSlots_List_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSlots_List_QuickOrder, EntryPoint) == 0x000000, "Member 'WBP_LoadoutSlots_List_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSlots_List_QuickOrder::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSlots_List_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSlots_List_QuickOrder, K2Node_Event_NewButton) == 0x000008, "Member 'WBP_LoadoutSlots_List_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSlots_List_QuickOrder::K2Node_Event_NewButton' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSlots_List_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSlots_List_QuickOrder, CallFunc_AddChild_ReturnValue) == 0x000010, "Member 'WBP_LoadoutSlots_List_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSlots_List_QuickOrder::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_LoadoutSlots_List_QuickOrder.WBP_LoadoutSlots_List_QuickOrder_C.OnButtonCreated
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoadoutSlots_List_QuickOrder_C_OnButtonCreated final
{
public:
	class UGzLoadoutSelectionButton*              NewButton;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSlots_List_QuickOrder_C_OnButtonCreated) == 0x000008, "Wrong alignment on WBP_LoadoutSlots_List_QuickOrder_C_OnButtonCreated");
static_assert(sizeof(WBP_LoadoutSlots_List_QuickOrder_C_OnButtonCreated) == 0x000008, "Wrong size on WBP_LoadoutSlots_List_QuickOrder_C_OnButtonCreated");
static_assert(offsetof(WBP_LoadoutSlots_List_QuickOrder_C_OnButtonCreated, NewButton) == 0x000000, "Member 'WBP_LoadoutSlots_List_QuickOrder_C_OnButtonCreated::NewButton' has a wrong offset!");

}

