#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CrosshairLeaf

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CrosshairLeaf.WBP_CrosshairLeaf_C.ExecuteUbergraph_WBP_CrosshairLeaf
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_CrosshairLeaf_C_ExecuteUbergraph_WBP_CrosshairLeaf final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49E0[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00D0)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrosshairLeaf_C_ExecuteUbergraph_WBP_CrosshairLeaf) == 0x000010, "Wrong alignment on WBP_CrosshairLeaf_C_ExecuteUbergraph_WBP_CrosshairLeaf");
static_assert(sizeof(WBP_CrosshairLeaf_C_ExecuteUbergraph_WBP_CrosshairLeaf) == 0x0000F0, "Wrong size on WBP_CrosshairLeaf_C_ExecuteUbergraph_WBP_CrosshairLeaf");
static_assert(offsetof(WBP_CrosshairLeaf_C_ExecuteUbergraph_WBP_CrosshairLeaf, EntryPoint) == 0x000000, "Member 'WBP_CrosshairLeaf_C_ExecuteUbergraph_WBP_CrosshairLeaf::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CrosshairLeaf_C_ExecuteUbergraph_WBP_CrosshairLeaf, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'WBP_CrosshairLeaf_C_ExecuteUbergraph_WBP_CrosshairLeaf::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_CrosshairLeaf_C_ExecuteUbergraph_WBP_CrosshairLeaf, K2Node_Event_IsDesignTime) == 0x0000E0, "Member 'WBP_CrosshairLeaf_C_ExecuteUbergraph_WBP_CrosshairLeaf::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_CrosshairLeaf.WBP_CrosshairLeaf_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CrosshairLeaf_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrosshairLeaf_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CrosshairLeaf_C_PreConstruct");
static_assert(sizeof(WBP_CrosshairLeaf_C_PreConstruct) == 0x000001, "Wrong size on WBP_CrosshairLeaf_C_PreConstruct");
static_assert(offsetof(WBP_CrosshairLeaf_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CrosshairLeaf_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

