#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RespawnTimeReductionLog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RespawnTimeReductionLog.WBP_RespawnTimeReductionLog_C
// 0x0030 (0x0370 - 0x0340)
class UWBP_RespawnTimeReductionLog_C final : public UGzHUDComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnimation;                                  // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnimation;                                   // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowNumberAnimation;                               // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Time_Text;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_RespawnTimeReductionLog(int32 EntryPoint);
	void OnInitialized();
	void ResetFadeOutAnimation();
	void UpdateLog(float TimeBonus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RespawnTimeReductionLog_C">();
	}
	static class UWBP_RespawnTimeReductionLog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RespawnTimeReductionLog_C>();
	}
};
static_assert(alignof(UWBP_RespawnTimeReductionLog_C) == 0x000008, "Wrong alignment on UWBP_RespawnTimeReductionLog_C");
static_assert(sizeof(UWBP_RespawnTimeReductionLog_C) == 0x000370, "Wrong size on UWBP_RespawnTimeReductionLog_C");
static_assert(offsetof(UWBP_RespawnTimeReductionLog_C, UberGraphFrame) == 0x000340, "Member 'UWBP_RespawnTimeReductionLog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RespawnTimeReductionLog_C, FadeOutAnimation) == 0x000348, "Member 'UWBP_RespawnTimeReductionLog_C::FadeOutAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_RespawnTimeReductionLog_C, FadeInAnimation) == 0x000350, "Member 'UWBP_RespawnTimeReductionLog_C::FadeInAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_RespawnTimeReductionLog_C, ShowNumberAnimation) == 0x000358, "Member 'UWBP_RespawnTimeReductionLog_C::ShowNumberAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_RespawnTimeReductionLog_C, Icon) == 0x000360, "Member 'UWBP_RespawnTimeReductionLog_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_RespawnTimeReductionLog_C, Time_Text) == 0x000368, "Member 'UWBP_RespawnTimeReductionLog_C::Time_Text' has a wrong offset!");

}

