#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Death

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_Death.WBP_Death_C.ExecuteUbergraph_WBP_Death
// 0x0120 (0x0120 - 0x0000)
struct WBP_Death_C_ExecuteUbergraph_WBP_Death final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_676B[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0048(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_676C[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_NewViewTarget;                        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_676D[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_676E[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetAnimationTime_Time;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue;  // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAnimationTime_Time_1;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_676F[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetAnimationTime_Time_2;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAnimationTime_Time_3;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAnimationTime_Time_4;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAnimationTime_Time_5;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3; // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_4; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Death_C_ExecuteUbergraph_WBP_Death) == 0x000008, "Wrong alignment on WBP_Death_C_ExecuteUbergraph_WBP_Death");
static_assert(sizeof(WBP_Death_C_ExecuteUbergraph_WBP_Death) == 0x000120, "Wrong size on WBP_Death_C_ExecuteUbergraph_WBP_Death");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, EntryPoint) == 0x000000, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, K2Node_CustomEvent_Tag_1) == 0x000004, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, K2Node_CustomEvent_Tag) == 0x00001C, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, Temp_struct_Variable) == 0x000034, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, K2Node_Event_IsDesignTime) == 0x00003C, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, K2Node_Event_MyGeometry) == 0x000048, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, K2Node_Event_InDeltaTime) == 0x000080, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000088, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, K2Node_Event_NewViewTarget) == 0x000090, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::K2Node_Event_NewViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, K2Node_SwitchInteger_CmpSuccess) == 0x000098, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, K2Node_DynamicCast_AsGz_Player_Character) == 0x0000A0, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_GetAnimationTime_Time) == 0x0000B0, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_GetAnimationTime_Time' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_GetGzAbilitySystemComponent_ReturnValue) == 0x0000B8, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_GetGzAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue) == 0x0000C0, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_GetAnimationTime_Time_1) == 0x0000C8, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_GetAnimationTime_Time_1' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_GetAnimationTime_Time_2) == 0x0000D8, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_GetAnimationTime_Time_2' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_GetAnimationTime_Time_3) == 0x0000E0, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_GetAnimationTime_Time_3' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_GetAnimationTime_Time_4) == 0x0000E8, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_GetAnimationTime_Time_4' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_GetAnimationTime_Time_5) == 0x0000F0, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_GetAnimationTime_Time_5' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000100, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000108, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1) == 0x00010C, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2) == 0x000110, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3) == 0x000114, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_4) == 0x000118, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_ExecuteUbergraph_WBP_Death, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x00011C, "Member 'WBP_Death_C_ExecuteUbergraph_WBP_Death::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_Death.WBP_Death_C.GetAnimationTime
// 0x0010 (0x0010 - 0x0000)
struct WBP_Death_C_GetAnimationTime final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Death_C_GetAnimationTime) == 0x000008, "Wrong alignment on WBP_Death_C_GetAnimationTime");
static_assert(sizeof(WBP_Death_C_GetAnimationTime) == 0x000010, "Wrong size on WBP_Death_C_GetAnimationTime");
static_assert(offsetof(WBP_Death_C_GetAnimationTime, Time) == 0x000000, "Member 'WBP_Death_C_GetAnimationTime::Time' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_GetAnimationTime, CallFunc_MapRangeClamped_ReturnValue) == 0x000008, "Member 'WBP_Death_C_GetAnimationTime::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function WBP_Death.WBP_Death_C.IncrementAndResetTime
// 0x0008 (0x0008 - 0x0000)
struct WBP_Death_C_IncrementAndResetTime final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Death_C_IncrementAndResetTime) == 0x000004, "Wrong alignment on WBP_Death_C_IncrementAndResetTime");
static_assert(sizeof(WBP_Death_C_IncrementAndResetTime) == 0x000008, "Wrong size on WBP_Death_C_IncrementAndResetTime");
static_assert(offsetof(WBP_Death_C_IncrementAndResetTime, Temp_int_Variable) == 0x000000, "Member 'WBP_Death_C_IncrementAndResetTime::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_IncrementAndResetTime, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Death_C_IncrementAndResetTime::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Death.WBP_Death_C.OnTagAdded_32009AEB4941CFA3A7EE8780347B9276
// 0x0008 (0x0008 - 0x0000)
struct WBP_Death_C_OnTagAdded_32009AEB4941CFA3A7EE8780347B9276 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Death_C_OnTagAdded_32009AEB4941CFA3A7EE8780347B9276) == 0x000004, "Wrong alignment on WBP_Death_C_OnTagAdded_32009AEB4941CFA3A7EE8780347B9276");
static_assert(sizeof(WBP_Death_C_OnTagAdded_32009AEB4941CFA3A7EE8780347B9276) == 0x000008, "Wrong size on WBP_Death_C_OnTagAdded_32009AEB4941CFA3A7EE8780347B9276");
static_assert(offsetof(WBP_Death_C_OnTagAdded_32009AEB4941CFA3A7EE8780347B9276, Tag) == 0x000000, "Member 'WBP_Death_C_OnTagAdded_32009AEB4941CFA3A7EE8780347B9276::Tag' has a wrong offset!");

// Function WBP_Death.WBP_Death_C.OnTagRemoved_32009AEB4941CFA3A7EE8780347B9276
// 0x0008 (0x0008 - 0x0000)
struct WBP_Death_C_OnTagRemoved_32009AEB4941CFA3A7EE8780347B9276 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Death_C_OnTagRemoved_32009AEB4941CFA3A7EE8780347B9276) == 0x000004, "Wrong alignment on WBP_Death_C_OnTagRemoved_32009AEB4941CFA3A7EE8780347B9276");
static_assert(sizeof(WBP_Death_C_OnTagRemoved_32009AEB4941CFA3A7EE8780347B9276) == 0x000008, "Wrong size on WBP_Death_C_OnTagRemoved_32009AEB4941CFA3A7EE8780347B9276");
static_assert(offsetof(WBP_Death_C_OnTagRemoved_32009AEB4941CFA3A7EE8780347B9276, Tag) == 0x000000, "Member 'WBP_Death_C_OnTagRemoved_32009AEB4941CFA3A7EE8780347B9276::Tag' has a wrong offset!");

// Function WBP_Death.WBP_Death_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Death_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Death_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Death_C_PreConstruct");
static_assert(sizeof(WBP_Death_C_PreConstruct) == 0x000001, "Wrong size on WBP_Death_C_PreConstruct");
static_assert(offsetof(WBP_Death_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Death_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Death.WBP_Death_C.ReceiveBindEvents
// 0x0008 (0x0008 - 0x0000)
struct WBP_Death_C_ReceiveBindEvents final
{
public:
	class APawn*                                  NewViewTarget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Death_C_ReceiveBindEvents) == 0x000008, "Wrong alignment on WBP_Death_C_ReceiveBindEvents");
static_assert(sizeof(WBP_Death_C_ReceiveBindEvents) == 0x000008, "Wrong size on WBP_Death_C_ReceiveBindEvents");
static_assert(offsetof(WBP_Death_C_ReceiveBindEvents, NewViewTarget) == 0x000000, "Member 'WBP_Death_C_ReceiveBindEvents::NewViewTarget' has a wrong offset!");

// Function WBP_Death.WBP_Death_C.SetDefaultValues
// 0x0038 (0x0038 - 0x0000)
struct WBP_Death_C_SetDefaultValues final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6770[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetScalarParameterNames_ReturnValue;      // 0x0010(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetScalarParameterDefaultValue_bParameterFound; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6771[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterDefaultValue_ReturnValue; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Death_C_SetDefaultValues) == 0x000008, "Wrong alignment on WBP_Death_C_SetDefaultValues");
static_assert(sizeof(WBP_Death_C_SetDefaultValues) == 0x000038, "Wrong size on WBP_Death_C_SetDefaultValues");
static_assert(offsetof(WBP_Death_C_SetDefaultValues, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Death_C_SetDefaultValues::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_SetDefaultValues, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Death_C_SetDefaultValues::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_SetDefaultValues, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Death_C_SetDefaultValues::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_SetDefaultValues, CallFunc_GetScalarParameterNames_ReturnValue) == 0x000010, "Member 'WBP_Death_C_SetDefaultValues::CallFunc_GetScalarParameterNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_SetDefaultValues, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Death_C_SetDefaultValues::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_SetDefaultValues, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_Death_C_SetDefaultValues::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_SetDefaultValues, CallFunc_GetScalarParameterDefaultValue_bParameterFound) == 0x00002C, "Member 'WBP_Death_C_SetDefaultValues::CallFunc_GetScalarParameterDefaultValue_bParameterFound' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_SetDefaultValues, CallFunc_GetScalarParameterDefaultValue_ReturnValue) == 0x000030, "Member 'WBP_Death_C_SetDefaultValues::CallFunc_GetScalarParameterDefaultValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_SetDefaultValues, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WBP_Death_C_SetDefaultValues::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Death.WBP_Death_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Death_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Death_C_Tick) == 0x000004, "Wrong alignment on WBP_Death_C_Tick");
static_assert(sizeof(WBP_Death_C_Tick) == 0x00003C, "Wrong size on WBP_Death_C_Tick");
static_assert(offsetof(WBP_Death_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Death_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Death_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Death.WBP_Death_C.UpdateAnimationState
// 0x000C (0x000C - 0x0000)
struct WBP_Death_C_UpdateAnimationState final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6772[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Death_C_UpdateAnimationState) == 0x000004, "Wrong alignment on WBP_Death_C_UpdateAnimationState");
static_assert(sizeof(WBP_Death_C_UpdateAnimationState) == 0x00000C, "Wrong size on WBP_Death_C_UpdateAnimationState");
static_assert(offsetof(WBP_Death_C_UpdateAnimationState, Temp_int_Variable) == 0x000000, "Member 'WBP_Death_C_UpdateAnimationState::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_UpdateAnimationState, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000004, "Member 'WBP_Death_C_UpdateAnimationState::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Death_C_UpdateAnimationState, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Death_C_UpdateAnimationState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

