#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReportCheckBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReportCheckBox.WBP_ReportCheckBox_C
// 0x0018 (0x0320 - 0x0308)
class UWBP_ReportCheckBox_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CheckmarkImage;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsChecked;                                        // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ToggleChecked(bool Param_bIsChecked);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_ReportCheckBox(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReportCheckBox_C">();
	}
	static class UWBP_ReportCheckBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReportCheckBox_C>();
	}
};
static_assert(alignof(UWBP_ReportCheckBox_C) == 0x000008, "Wrong alignment on UWBP_ReportCheckBox_C");
static_assert(sizeof(UWBP_ReportCheckBox_C) == 0x000320, "Wrong size on UWBP_ReportCheckBox_C");
static_assert(offsetof(UWBP_ReportCheckBox_C, UberGraphFrame) == 0x000308, "Member 'UWBP_ReportCheckBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ReportCheckBox_C, CheckmarkImage) == 0x000310, "Member 'UWBP_ReportCheckBox_C::CheckmarkImage' has a wrong offset!");
static_assert(offsetof(UWBP_ReportCheckBox_C, bIsChecked) == 0x000318, "Member 'UWBP_ReportCheckBox_C::bIsChecked' has a wrong offset!");

}

