#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KillLog_KillMark

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_KillLog_KillMark.WBP_KillLog_KillMark_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_KillLog_KillMark_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Event_Image;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_KillLog_KillMark(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_KillLog_KillMark_C">();
	}
	static class UWBP_KillLog_KillMark_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_KillLog_KillMark_C>();
	}
};
static_assert(alignof(UWBP_KillLog_KillMark_C) == 0x000008, "Wrong alignment on UWBP_KillLog_KillMark_C");
static_assert(sizeof(UWBP_KillLog_KillMark_C) == 0x0002F8, "Wrong size on UWBP_KillLog_KillMark_C");
static_assert(offsetof(UWBP_KillLog_KillMark_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_KillLog_KillMark_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_KillLog_KillMark_C, Show) == 0x0002E8, "Member 'UWBP_KillLog_KillMark_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_KillLog_KillMark_C, Event_Image) == 0x0002F0, "Member 'UWBP_KillLog_KillMark_C::Event_Image' has a wrong offset!");

}

