#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsEntry_Scalar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameSettings_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SettingsEntry_Scalar.WBP_SettingsEntry_Scalar_C
// 0x0050 (0x03B0 - 0x0360)
class UWBP_SettingsEntry_Scalar_C final : public UGameSettingListEntrySetting_Scalar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background_Image;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundRotator_Image;                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NavigationButton_C*                Button_Decrease;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NavigationButton_C*                Button_Increase;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           HoverColor;                                        // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnhoverColor;                                      // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	class UWidget* GetPrimaryGamepadFocusWidget();
	void ExecuteUbergraph_WBP_SettingsEntry_Scalar(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_SettingsEntry_Scalar_Slider_SettingValue_K2Node_ComponentBoundEvent_5_OnControllerCaptureEndEvent__DelegateSignature();
	void BndEvt__WBP_SettingsEntry_Scalar_Slider_SettingValue_K2Node_ComponentBoundEvent_4_OnControllerCaptureBeginEvent__DelegateSignature();
	void BndEvt__WBP_SettingsEntry_Scalar_Slider_SettingValue_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__WBP_SettingsEntry_Scalar_Button_Increase_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SettingsEntry_Scalar_Button_Decrease_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SettingsEntry_Scalar_C">();
	}
	static class UWBP_SettingsEntry_Scalar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SettingsEntry_Scalar_C>();
	}
};
static_assert(alignof(UWBP_SettingsEntry_Scalar_C) == 0x000008, "Wrong alignment on UWBP_SettingsEntry_Scalar_C");
static_assert(sizeof(UWBP_SettingsEntry_Scalar_C) == 0x0003B0, "Wrong size on UWBP_SettingsEntry_Scalar_C");
static_assert(offsetof(UWBP_SettingsEntry_Scalar_C, UberGraphFrame) == 0x000360, "Member 'UWBP_SettingsEntry_Scalar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsEntry_Scalar_C, Background_Image) == 0x000368, "Member 'UWBP_SettingsEntry_Scalar_C::Background_Image' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsEntry_Scalar_C, BackgroundRotator_Image) == 0x000370, "Member 'UWBP_SettingsEntry_Scalar_C::BackgroundRotator_Image' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsEntry_Scalar_C, Button_Decrease) == 0x000378, "Member 'UWBP_SettingsEntry_Scalar_C::Button_Decrease' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsEntry_Scalar_C, Button_Increase) == 0x000380, "Member 'UWBP_SettingsEntry_Scalar_C::Button_Increase' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsEntry_Scalar_C, ProgressBar) == 0x000388, "Member 'UWBP_SettingsEntry_Scalar_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsEntry_Scalar_C, HoverColor) == 0x000390, "Member 'UWBP_SettingsEntry_Scalar_C::HoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsEntry_Scalar_C, UnhoverColor) == 0x0003A0, "Member 'UWBP_SettingsEntry_Scalar_C::UnhoverColor' has a wrong offset!");

}

