#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldRegionName

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WorldRegionName.WBP_WorldRegionName_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_WorldRegionName_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGzTextBlock*                           RegionName_GzText;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateText(const class FText& InText);
	void Start_Fade_Out(float PlaybackSpeed);
	void ExecuteUbergraph_WBP_WorldRegionName(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WorldRegionName_C">();
	}
	static class UWBP_WorldRegionName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WorldRegionName_C>();
	}
};
static_assert(alignof(UWBP_WorldRegionName_C) == 0x000008, "Wrong alignment on UWBP_WorldRegionName_C");
static_assert(sizeof(UWBP_WorldRegionName_C) == 0x0002F8, "Wrong size on UWBP_WorldRegionName_C");
static_assert(offsetof(UWBP_WorldRegionName_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_WorldRegionName_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WorldRegionName_C, FadeOut) == 0x0002E8, "Member 'UWBP_WorldRegionName_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_WorldRegionName_C, RegionName_GzText) == 0x0002F0, "Member 'UWBP_WorldRegionName_C::RegionName_GzText' has a wrong offset!");

}

