#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSelectionScreen_SharedContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoadoutSelectionScreen_SharedContainer.WBP_LoadoutSelectionScreen_SharedContainer_C
// 0x0048 (0x06C8 - 0x0680)
class UWBP_LoadoutSelectionScreen_SharedContainer_C final : public UGzLoadoutSelectionScreenSharedContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               ConfirmButtonSizeBox;                              // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSelection_Capture_C*        LoadoutSelectionCapture;                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSelection_ScreenDescription_C* WBP_LoadoutSelection_ScreenDescription;            // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shared_LabelHeader_C*              WBP_Shared_LabelHeader;                            // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shared_LabelHeader_C*              WBP_Shared_LabelHeader_1;                          // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shared_LabelHeader_C*              WBP_Shared_LabelHeader_2;                          // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSharedLoadoutSelectionEnded;                     // 0x06B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnSharedLoadoutSelectionEnded__DelegateSignature(bool IsSuccessfull, class AGzPlayerController* Controller, const struct FGuid& Guid, class AGzPlayerCharacter* Character);
	void OnEndedSelection_Event(bool bSuccessfull, const class AGzPlayerController* Controller, const struct FGzLoadoutDataConfig& CompledWithGuid);
	void InitializeLoadoutSlots();
	void ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer(int32 EntryPoint);
	void BP_OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoadoutSelectionScreen_SharedContainer_C">();
	}
	static class UWBP_LoadoutSelectionScreen_SharedContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoadoutSelectionScreen_SharedContainer_C>();
	}
};
static_assert(alignof(UWBP_LoadoutSelectionScreen_SharedContainer_C) == 0x000008, "Wrong alignment on UWBP_LoadoutSelectionScreen_SharedContainer_C");
static_assert(sizeof(UWBP_LoadoutSelectionScreen_SharedContainer_C) == 0x0006C8, "Wrong size on UWBP_LoadoutSelectionScreen_SharedContainer_C");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_SharedContainer_C, UberGraphFrame) == 0x000680, "Member 'UWBP_LoadoutSelectionScreen_SharedContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_SharedContainer_C, ConfirmButtonSizeBox) == 0x000688, "Member 'UWBP_LoadoutSelectionScreen_SharedContainer_C::ConfirmButtonSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_SharedContainer_C, LoadoutSelectionCapture) == 0x000690, "Member 'UWBP_LoadoutSelectionScreen_SharedContainer_C::LoadoutSelectionCapture' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_SharedContainer_C, WBP_LoadoutSelection_ScreenDescription) == 0x000698, "Member 'UWBP_LoadoutSelectionScreen_SharedContainer_C::WBP_LoadoutSelection_ScreenDescription' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_SharedContainer_C, WBP_Shared_LabelHeader) == 0x0006A0, "Member 'UWBP_LoadoutSelectionScreen_SharedContainer_C::WBP_Shared_LabelHeader' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_SharedContainer_C, WBP_Shared_LabelHeader_1) == 0x0006A8, "Member 'UWBP_LoadoutSelectionScreen_SharedContainer_C::WBP_Shared_LabelHeader_1' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_SharedContainer_C, WBP_Shared_LabelHeader_2) == 0x0006B0, "Member 'UWBP_LoadoutSelectionScreen_SharedContainer_C::WBP_Shared_LabelHeader_2' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_SharedContainer_C, OnSharedLoadoutSelectionEnded) == 0x0006B8, "Member 'UWBP_LoadoutSelectionScreen_SharedContainer_C::OnSharedLoadoutSelectionEnded' has a wrong offset!");

}

