#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DisplayDamage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DisplayDamage.WBP_DisplayDamage_C.ShowDamage
// 0x0030 (0x0030 - 0x0000)
struct WBP_DisplayDamage_C_ShowDamage final
{
public:
	double                                        Body;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Armor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Limb;                                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Vehicle;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Jetpack;                                           // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GridArmorDamage;                                   // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DisplayDamage_C_ShowDamage) == 0x000008, "Wrong alignment on WBP_DisplayDamage_C_ShowDamage");
static_assert(sizeof(WBP_DisplayDamage_C_ShowDamage) == 0x000030, "Wrong size on WBP_DisplayDamage_C_ShowDamage");
static_assert(offsetof(WBP_DisplayDamage_C_ShowDamage, Body) == 0x000000, "Member 'WBP_DisplayDamage_C_ShowDamage::Body' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ShowDamage, Armor) == 0x000008, "Member 'WBP_DisplayDamage_C_ShowDamage::Armor' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ShowDamage, Limb) == 0x000010, "Member 'WBP_DisplayDamage_C_ShowDamage::Limb' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ShowDamage, Vehicle) == 0x000018, "Member 'WBP_DisplayDamage_C_ShowDamage::Vehicle' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ShowDamage, Jetpack) == 0x000020, "Member 'WBP_DisplayDamage_C_ShowDamage::Jetpack' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ShowDamage, GridArmorDamage) == 0x000028, "Member 'WBP_DisplayDamage_C_ShowDamage::GridArmorDamage' has a wrong offset!");

// Function WBP_DisplayDamage.WBP_DisplayDamage_C.SetDamage
// 0x0028 (0x0028 - 0x0000)
struct WBP_DisplayDamage_C_SetDamage final
{
public:
	class UTextBlock*                             DamageWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        DamageValue;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_677B[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0018(0x0010)()
};
static_assert(alignof(WBP_DisplayDamage_C_SetDamage) == 0x000008, "Wrong alignment on WBP_DisplayDamage_C_SetDamage");
static_assert(sizeof(WBP_DisplayDamage_C_SetDamage) == 0x000028, "Wrong size on WBP_DisplayDamage_C_SetDamage");
static_assert(offsetof(WBP_DisplayDamage_C_SetDamage, DamageWidget) == 0x000000, "Member 'WBP_DisplayDamage_C_SetDamage::DamageWidget' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_SetDamage, DamageValue) == 0x000008, "Member 'WBP_DisplayDamage_C_SetDamage::DamageValue' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_SetDamage, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_DisplayDamage_C_SetDamage::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_SetDamage, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000018, "Member 'WBP_DisplayDamage_C_SetDamage::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");

// Function WBP_DisplayDamage.WBP_DisplayDamage_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DisplayDamage_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DisplayDamage_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DisplayDamage_C_PreConstruct");
static_assert(sizeof(WBP_DisplayDamage_C_PreConstruct) == 0x000001, "Wrong size on WBP_DisplayDamage_C_PreConstruct");
static_assert(offsetof(WBP_DisplayDamage_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DisplayDamage_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DisplayDamage.WBP_DisplayDamage_C.ExecuteUbergraph_WBP_DisplayDamage
// 0x0138 (0x0138 - 0x0000)
struct WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzDamageSettings*                      CallFunc_GetDamageSettings_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0044(0x0014)()
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_2;    // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_3;    // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0078(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x008C(0x0014)()
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_4;    // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x00B0(0x0014)()
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_5;    // 0x00C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x00D4(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_677C[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Body;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Armor;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Limb;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Vehicle;                        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Jetpack;                        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_GridArmorDamage;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_677D[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage) == 0x000008, "Wrong alignment on WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage");
static_assert(sizeof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage) == 0x000138, "Wrong size on WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, EntryPoint) == 0x000000, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000004, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, CallFunc_GetDamageSettings_ReturnValue) == 0x000008, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::CallFunc_GetDamageSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000010, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x000020, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, K2Node_MakeStruct_SlateColor_1) == 0x000044, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, CallFunc_Conv_ColorToLinearColor_ReturnValue_2) == 0x000058, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::CallFunc_Conv_ColorToLinearColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, CallFunc_Conv_ColorToLinearColor_ReturnValue_3) == 0x000068, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::CallFunc_Conv_ColorToLinearColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, K2Node_MakeStruct_SlateColor_2) == 0x000078, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, K2Node_MakeStruct_SlateColor_3) == 0x00008C, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, CallFunc_Conv_ColorToLinearColor_ReturnValue_4) == 0x0000A0, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::CallFunc_Conv_ColorToLinearColor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, K2Node_MakeStruct_SlateColor_4) == 0x0000B0, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, CallFunc_Conv_ColorToLinearColor_ReturnValue_5) == 0x0000C4, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::CallFunc_Conv_ColorToLinearColor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, K2Node_MakeStruct_SlateColor_5) == 0x0000D4, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, K2Node_Event_IsDesignTime) == 0x0000E8, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, K2Node_CustomEvent_Body) == 0x0000F0, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::K2Node_CustomEvent_Body' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, K2Node_CustomEvent_Armor) == 0x0000F8, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::K2Node_CustomEvent_Armor' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, K2Node_CustomEvent_Limb) == 0x000100, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::K2Node_CustomEvent_Limb' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, K2Node_CustomEvent_Vehicle) == 0x000108, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::K2Node_CustomEvent_Vehicle' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, K2Node_CustomEvent_Jetpack) == 0x000110, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::K2Node_CustomEvent_Jetpack' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, K2Node_CustomEvent_GridArmorDamage) == 0x000118, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::K2Node_CustomEvent_GridArmorDamage' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, Temp_int_Variable) == 0x000120, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, K2Node_Select_Default) == 0x000128, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage, CallFunc_PlayAnimationForward_ReturnValue) == 0x000130, "Member 'WBP_DisplayDamage_C_ExecuteUbergraph_WBP_DisplayDamage::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

