#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Spectate

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "G01_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_Spectate.WBP_Spectate_C.BndEvt__WBP_Spectate_LeaveMatch_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Spectate_C_BndEvt__WBP_Spectate_LeaveMatch_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Spectate_C_BndEvt__WBP_Spectate_LeaveMatch_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Spectate_C_BndEvt__WBP_Spectate_LeaveMatch_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Spectate_C_BndEvt__WBP_Spectate_LeaveMatch_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Spectate_C_BndEvt__WBP_Spectate_LeaveMatch_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Spectate_C_BndEvt__WBP_Spectate_LeaveMatch_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Spectate_C_BndEvt__WBP_Spectate_LeaveMatch_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Spectate.WBP_Spectate_C.BndEvt__WBP_Spectate_NextPlayer_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Spectate_C_BndEvt__WBP_Spectate_NextPlayer_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Spectate_C_BndEvt__WBP_Spectate_NextPlayer_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Spectate_C_BndEvt__WBP_Spectate_NextPlayer_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Spectate_C_BndEvt__WBP_Spectate_NextPlayer_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Spectate_C_BndEvt__WBP_Spectate_NextPlayer_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Spectate_C_BndEvt__WBP_Spectate_NextPlayer_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Spectate_C_BndEvt__WBP_Spectate_NextPlayer_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Spectate.WBP_Spectate_C.BndEvt__WBP_Spectate_PingTerminal_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Spectate_C_BndEvt__WBP_Spectate_PingTerminal_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Spectate_C_BndEvt__WBP_Spectate_PingTerminal_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Spectate_C_BndEvt__WBP_Spectate_PingTerminal_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Spectate_C_BndEvt__WBP_Spectate_PingTerminal_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Spectate_C_BndEvt__WBP_Spectate_PingTerminal_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Spectate_C_BndEvt__WBP_Spectate_PingTerminal_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Spectate_C_BndEvt__WBP_Spectate_PingTerminal_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Spectate.WBP_Spectate_C.BndEvt__WBP_Spectate_PreviousPlayer_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Spectate_C_BndEvt__WBP_Spectate_PreviousPlayer_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Spectate_C_BndEvt__WBP_Spectate_PreviousPlayer_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Spectate_C_BndEvt__WBP_Spectate_PreviousPlayer_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Spectate_C_BndEvt__WBP_Spectate_PreviousPlayer_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Spectate_C_BndEvt__WBP_Spectate_PreviousPlayer_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Spectate_C_BndEvt__WBP_Spectate_PreviousPlayer_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Spectate_C_BndEvt__WBP_Spectate_PreviousPlayer_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Spectate.WBP_Spectate_C.BndEvt__WBP_Spectate_ReportPlayer_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Spectate_C_BndEvt__WBP_Spectate_ReportPlayer_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Spectate_C_BndEvt__WBP_Spectate_ReportPlayer_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Spectate_C_BndEvt__WBP_Spectate_ReportPlayer_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Spectate_C_BndEvt__WBP_Spectate_ReportPlayer_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Spectate_C_BndEvt__WBP_Spectate_ReportPlayer_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Spectate_C_BndEvt__WBP_Spectate_ReportPlayer_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Spectate_C_BndEvt__WBP_Spectate_ReportPlayer_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Spectate.WBP_Spectate_C.Check Come Back Arena Info
// 0x0020 (0x0020 - 0x0000)
struct WBP_Spectate_C_Check_Come_Back_Arena_Info final
{
public:
	bool                                          bEnableComeback;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInComebackArenaQueue_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E0[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Spectate_C_Check_Come_Back_Arena_Info) == 0x000008, "Wrong alignment on WBP_Spectate_C_Check_Come_Back_Arena_Info");
static_assert(sizeof(WBP_Spectate_C_Check_Come_Back_Arena_Info) == 0x000020, "Wrong size on WBP_Spectate_C_Check_Come_Back_Arena_Info");
static_assert(offsetof(WBP_Spectate_C_Check_Come_Back_Arena_Info, bEnableComeback) == 0x000000, "Member 'WBP_Spectate_C_Check_Come_Back_Arena_Info::bEnableComeback' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_Check_Come_Back_Arena_Info, Temp_byte_Variable) == 0x000001, "Member 'WBP_Spectate_C_Check_Come_Back_Arena_Info::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_Check_Come_Back_Arena_Info, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Spectate_C_Check_Come_Back_Arena_Info::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_Check_Come_Back_Arena_Info, CallFunc_IsValid_ReturnValue) == 0x000003, "Member 'WBP_Spectate_C_Check_Come_Back_Arena_Info::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_Check_Come_Back_Arena_Info, CallFunc_IsInComebackArenaQueue_ReturnValue) == 0x000004, "Member 'WBP_Spectate_C_Check_Come_Back_Arena_Info::CallFunc_IsInComebackArenaQueue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_Check_Come_Back_Arena_Info, Temp_bool_Variable) == 0x000005, "Member 'WBP_Spectate_C_Check_Come_Back_Arena_Info::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_Check_Come_Back_Arena_Info, K2Node_Select_Default) == 0x000006, "Member 'WBP_Spectate_C_Check_Come_Back_Arena_Info::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_Check_Come_Back_Arena_Info, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Spectate_C_Check_Come_Back_Arena_Info::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_Check_Come_Back_Arena_Info, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'WBP_Spectate_C_Check_Come_Back_Arena_Info::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function WBP_Spectate.WBP_Spectate_C.DisablePingTerminal
// 0x0008 (0x0008 - 0x0000)
struct WBP_Spectate_C_DisablePingTerminal final
{
public:
	const class UGzGameMessage*                   Message;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Spectate_C_DisablePingTerminal) == 0x000008, "Wrong alignment on WBP_Spectate_C_DisablePingTerminal");
static_assert(sizeof(WBP_Spectate_C_DisablePingTerminal) == 0x000008, "Wrong size on WBP_Spectate_C_DisablePingTerminal");
static_assert(offsetof(WBP_Spectate_C_DisablePingTerminal, Message) == 0x000000, "Member 'WBP_Spectate_C_DisablePingTerminal::Message' has a wrong offset!");

// Function WBP_Spectate.WBP_Spectate_C.ExecuteUbergraph_WBP_Spectate
// 0x0480 (0x0480 - 0x0000)
struct WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzPlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E1[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzGameModeSubsystem*                   Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzWaitSubsystem*                       CallFunc_WaitSubsystem_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzTeamSubsystem*                       K2Node_DynamicCast_AsGz_Team_Subsystem;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E2[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGzTeam* Team)>          K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E3[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0048(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E4[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E5[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1_0;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x00B0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x00D8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E6[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E7[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0118(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0140(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E8[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E9[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5_0;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzHUDStatesSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_Pawn;                           // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerController*                    K2Node_DynamicCast_AsGz_Player_Controller;         // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EA[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         K2Node_DynamicCast_AsGz_Player_State;              // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EB[0x3];                                     // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APawn* Pawn)>            K2Node_CreateDelegate_OutputDelegate_2;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EC[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57ED[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzPingControllerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PingClosestActorOfClass_ReturnValue;      // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EE[0x6];                                     // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue;            // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_BattleRoyalePlayerController_C*     K2Node_DynamicCast_AsBP_Battle_Royale_Player_Controller; // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EF[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNavigationWidget*                    CallFunc_AddWidgetCached_ReturnValue;              // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_EscapeMenu_ExitPrompt_C*           K2Node_DynamicCast_AsWBP_Escape_Menu_Exit_Prompt;  // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F0[0x3];                                     // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x023C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x024C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F1[0x6];                                     // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzGameModeSubsystem*                   K2Node_CustomEvent_Subsystem;                      // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSpectatingKiller)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x02B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UGzGameMessage*                   K2Node_CustomEvent_Message;                        // 0x02C0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzAllTerminalsInactiveMessage*         K2Node_DynamicCast_AsGz_All_Terminals_Inactive_Message; // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F2[0x6];                                     // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ExtractionRoyaleHUD_C*              K2Node_DynamicCast_AsBP_Extraction_Royale_HUD;     // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatchResultSet_ReturnValue;             // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F3[0x5];                                     // 0x02EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzMatchResult                         CallFunc_GetMatchResult_ReturnValue;               // 0x02F0(0x0090)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0380(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0398(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ExtractionRoyaleHUD_C*              K2Node_DynamicCast_AsBP_Extraction_Royale_HUD_1;   // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F4[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F5[0x7];                                     // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpectatorPawn*                         CallFunc_GetSpectatorPawn_ReturnValue;             // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F6[0x7];                                     // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerController*                    K2Node_DynamicCast_AsGz_Player_Controller_1;       // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSpectateSomebodyElse_ReturnValue;      // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F7[0x6];                                     // 0x03E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzTeam*                                K2Node_CustomEvent_Team;                           // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzTeam*                                CallFunc_GetTeam_ReturnValue;                      // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzGameModeSubsystem* Subsystem)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x03F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleInHierarchy_ReturnValue;         // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleInHierarchy_ReturnValue_1;       // 0x040A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F8[0x5];                                     // 0x040B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0418(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F9[0x7];                                     // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_4;            // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ReportScreen_C*                    CallFunc_Create_ReturnValue;                       // 0x0438(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGzPlayerViewTargetInterface> K2Node_DynamicCast_AsGz_Player_View_Target_Interface; // 0x0448(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57FA[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetViewTargetPlayerState_ReturnValue;     // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleInHierarchy_ReturnValue_2;       // 0x046A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x046B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57FB[0x3];                                     // 0x046D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue_1;          // 0x0470(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate) == 0x000008, "Wrong alignment on WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate");
static_assert(sizeof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate) == 0x000480, "Wrong size on WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, EntryPoint) == 0x000000, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_object_Variable) == 0x000018, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_WaitSubsystem_ReturnValue) == 0x000020, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_WaitSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_AsGz_Team_Subsystem) == 0x000028, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_AsGz_Team_Subsystem' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x000048, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x000068, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x00006C, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x000070, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000078, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_object_Variable_1) == 0x000080, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_real_Variable) == 0x000088, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_real_Variable_0) == 0x000090, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_real_Variable_1) == 0x000098, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_bool_Variable) == 0x0000A0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_real_Variable_1_0) == 0x0000A8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x0000B0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x0000D0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x0000D4, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x0000D8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_object_Variable_2) == 0x0000E0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0000E8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_real_Variable_2) == 0x0000F0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_real_Variable_3) == 0x0000F8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_real_Variable_2_0) == 0x000100, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_real_Variable_3_0) == 0x000108, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_bool_Variable_1) == 0x000110, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000118, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000138, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00013C, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000140, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_Conv_InputActionValueToBool_ReturnValue_2) == 0x000148, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_Conv_InputActionValueToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_object_Variable_3) == 0x000150, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_real_Variable_4) == 0x000158, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_real_Variable_4_0) == 0x000160, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_real_Variable_4_0' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_real_Variable_5) == 0x000168, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_bool_Variable_2) == 0x000170, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_real_Variable_5_0) == 0x000178, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_real_Variable_5_0' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000180, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_GetOwningPlayer_ReturnValue) == 0x000188, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_CustomEvent_Pawn) == 0x000190, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_CustomEvent_Pawn' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_AsGz_Player_Controller) == 0x000198, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_AsGz_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_bSuccess_1) == 0x0001A0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_AsGz_Player_State) == 0x0001A8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_AsGz_Player_State' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_bSuccess_2) == 0x0001B0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001B4, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_ComponentBoundEvent_Button_4) == 0x0001C8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_ComponentBoundEvent_Button_3) == 0x0001D0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_ComponentBoundEvent_Button_2) == 0x0001D8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_ComponentBoundEvent_Button_1) == 0x0001E0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0001E8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, Temp_bool_Variable_3) == 0x0001F0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_GetComponentByClass_ReturnValue) == 0x0001F8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_IsValid_ReturnValue_1) == 0x000200, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_PingClosestActorOfClass_ReturnValue) == 0x000201, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_PingClosestActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000208, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_GetNavigationRoot_ReturnValue) == 0x000210, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_GetNavigationRoot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_AsBP_Battle_Royale_Player_Controller) == 0x000218, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_AsBP_Battle_Royale_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_bSuccess_3) == 0x000220, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_AddWidgetCached_ReturnValue) == 0x000228, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_AddWidgetCached_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_AsWBP_Escape_Menu_Exit_Prompt) == 0x000230, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_AsWBP_Escape_Menu_Exit_Prompt' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_bSuccess_4) == 0x000238, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_CreateDelegate_OutputDelegate_3) == 0x00023C, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_Event_MyGeometry) == 0x00024C, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_Event_InDeltaTime) == 0x000284, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000288, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000290, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000298, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_IsValid_ReturnValue_2) == 0x000299, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_CustomEvent_Subsystem) == 0x0002A0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_CustomEvent_Subsystem' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_PlayAnimation_ReturnValue) == 0x0002A8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_CreateDelegate_OutputDelegate_4) == 0x0002B0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_CustomEvent_Message) == 0x0002C0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_AsGz_All_Terminals_Inactive_Message) == 0x0002C8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_AsGz_All_Terminals_Inactive_Message' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_bSuccess_5) == 0x0002D0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0002D1, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_GetHUD_ReturnValue) == 0x0002D8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_AsBP_Extraction_Royale_HUD) == 0x0002E0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_AsBP_Extraction_Royale_HUD' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_bSuccess_6) == 0x0002E8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_IsValid_ReturnValue_3) == 0x0002E9, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_IsMatchResultSet_ReturnValue) == 0x0002EA, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_IsMatchResultSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_GetMatchResult_ReturnValue) == 0x0002F0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_GetMatchResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_CreateDelegate_OutputDelegate_5) == 0x000380, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_GetHUD_ReturnValue_1) == 0x000390, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_CreateDelegate_OutputDelegate_6) == 0x000398, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_AsBP_Extraction_Royale_HUD_1) == 0x0003A8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_AsBP_Extraction_Royale_HUD_1' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, K2Node_DynamicCast_bSuccess_7) == 0x0003B0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_GetOwningPlayer_ReturnValue_3) == 0x0003B8, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_GetOwningPlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate, CallFunc_IsValid_ReturnValue_4) == 0x0003C0, "Member 'WBP_Spectate_C_ExecuteUbergraph_WBP_Spectate::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
