#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CyberlimbsPanel_Limb_DOS

#include "Basic.hpp"

#include "EN_CyberlimbTextStyle_structs.hpp"
#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function WBP_CyberlimbsPanel_Limb_DOS.WBP_CyberlimbsPanel_Limb_DOS_C.ClearEnergyTimer
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer final
{
public:
	bool                                          bShouldStayActive;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B3[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0008(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_1;                            // 0x0028(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_2;                            // 0x0048(0x0020)()
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue;  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Select_Default;                             // 0x0070(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer) == 0x000008, "Wrong alignment on WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer");
static_assert(sizeof(WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer) == 0x0000A8, "Wrong size on WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer, bShouldStayActive) == 0x000000, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer::bShouldStayActive' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer, Temp_byte_Variable) == 0x000001, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer, Temp_struct_Variable) == 0x000008, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer, Temp_struct_Variable_1) == 0x000028, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer, Temp_struct_Variable_2) == 0x000048, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer, CallFunc_GetGzAbilitySystemComponent_ReturnValue) == 0x000068, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer::CallFunc_GetGzAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer, K2Node_Select_Default) == 0x000070, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000090, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000A0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x0000A1, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ClearEnergyTimer::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function WBP_CyberlimbsPanel_Limb_DOS.WBP_CyberlimbsPanel_Limb_DOS_C.ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS
// 0x05C8 (0x05C8 - 0x0000)
struct WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B4[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_7;                          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_6;                          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B5[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable_1;                            // 0x0048(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_2;                            // 0x0068(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_3;                            // 0x0088(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable_1;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B6[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable_4;                            // 0x00B0(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_5;                            // 0x00D0(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_6;                            // 0x00F0(0x0020)()
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_5;                          // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_4;                          // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_7;                            // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B7[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag_3;                          // 0x014C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0154(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_2;                          // 0x0164(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x016C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_8;                            // 0x017C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0194(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x019C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_9;                            // 0x01B4(0x0008)(NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable_2;                              // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B8[0x3];                                     // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable_10;                           // 0x01C0(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_11;                           // 0x01E0(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_12;                           // 0x0200(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B9[0x6];                                     // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         K2Node_CustomEvent_ReloadIconText;                 // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Character;                      // 0x0230(0x0010)()
	struct FGameplayAttribute                     Temp_struct_Variable_13;                           // 0x0240(0x0038)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0278(0x0048)(HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSatisfyTagRequirements_BP_ReturnValue; // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13BA[0x2];                                     // 0x02C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_ViewTarget;                           // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TrySetViewTarget_View_Target;             // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13BB[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13BC[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x02F0(0x0010)()
	float                                         Temp_real_Variable_1;                              // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0305(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13BD[0x2];                                     // 0x0306(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetRarityColor_ReturnValue;               // 0x0308(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Get_Limb_Icon_AbilityIcon;                // 0x0318(0x0028)(HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable_3;                              // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13BE[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetLimbCurrentHealth_ReturnValue;         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzLimbWidgetState                            K2Node_Event_NewState;                             // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bLimbValid;                           // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bLimbAbilityValid;                    // 0x0353(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow;                                // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHaveMaxCharges;                      // 0x0355(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRecharging;                          // 0x0356(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13BF[0x1];                                     // 0x0357(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAsyncTaskAttributeChanged*           CallFunc_ListenForAttributeChange_ReturnValue;     // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C0[0x6];                                     // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetLimbCurrentHealth_ReturnValue_1;       // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0370(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x03B0(0x0010)()
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x03C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetLimbCurrentHealth_ReturnValue_2;       // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C1[0x7];                                     // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue;  // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x03E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Select_Default;                             // 0x03F8(0x0020)()
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0418(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue; // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C2[0x7];                                     // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0430(0x0010)()
	struct FGameplayTagContainer                  K2Node_Select_Default_1;                           // 0x0440(0x0020)()
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue_1; // 0x0460(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1; // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0470(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0480(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClearEnergyTimer_bShouldStayActive;       // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClearEnergyTimer_bShouldStayActive_1;     // 0x048A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x048B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C3[0x4];                                     // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x0490(0x0010)()
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C4[0x7];                                     // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x04A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x04F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0500(0x0010)()
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C5[0x7];                                     // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue_2; // 0x0518(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_2; // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C6[0x2];                                     // 0x052A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bLimbAbilityComponentValid;           // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C7[0x7];                                     // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue_3; // 0x0538(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Select_Default_3;                           // 0x0540(0x0020)()
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_3; // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0568(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0578(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClearEnergyTimer_bShouldStayActive_2;     // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C8[0x6];                                     // 0x0582(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x0588(0x0010)()
	class FText                                   Temp_text_Variable_4;                              // 0x0598(0x0010)()
	class FText                                   K2Node_Select_Default_4;                           // 0x05A8(0x0010)()
	float                                         CallFunc_UpdateLimbHealth_NewHealth_ImplicitCast;  // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UpdateLimbHealth_NewHealth_ImplicitCast_1; // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UpdateLimbHealth_NewHealth_ImplicitCast_2; // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS) == 0x000008, "Wrong alignment on WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS");
static_assert(sizeof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS) == 0x0005C8, "Wrong size on WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, EntryPoint) == 0x000000, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CustomEvent_Tag_7) == 0x000018, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CustomEvent_Tag_7' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CustomEvent_Tag_6) == 0x000020, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CustomEvent_Tag_6' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_struct_Variable) == 0x000038, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_byte_Variable) == 0x000040, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_struct_Variable_1) == 0x000048, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_struct_Variable_2) == 0x000068, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_struct_Variable_3) == 0x000088, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_byte_Variable_1) == 0x0000A9, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_struct_Variable_4) == 0x0000B0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_struct_Variable_5) == 0x0000D0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_struct_Variable_6) == 0x0000F0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CreateDelegate_OutputDelegate_2) == 0x000110, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CustomEvent_Tag_5) == 0x000120, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CustomEvent_Tag_5' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CustomEvent_Tag_4) == 0x000128, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CustomEvent_Tag_4' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CreateDelegate_OutputDelegate_3) == 0x000130, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_struct_Variable_7) == 0x000140, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue_2) == 0x000148, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CustomEvent_Tag_3) == 0x00014C, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CustomEvent_Tag_3' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CreateDelegate_OutputDelegate_4) == 0x000154, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CustomEvent_Tag_2) == 0x000164, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CustomEvent_Tag_2' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CreateDelegate_OutputDelegate_5) == 0x00016C, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_struct_Variable_8) == 0x00017C, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CreateDelegate_OutputDelegate_6) == 0x000184, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CustomEvent_Tag_1) == 0x000194, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CustomEvent_Tag) == 0x00019C, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001A4, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_struct_Variable_9) == 0x0001B4, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_byte_Variable_2) == 0x0001BC, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_struct_Variable_10) == 0x0001C0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_struct_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_struct_Variable_11) == 0x0001E0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_struct_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_struct_Variable_12) == 0x000200, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_struct_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue_3) == 0x000220, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue_4) == 0x000221, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CustomEvent_ReloadIconText) == 0x000228, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CustomEvent_ReloadIconText' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CustomEvent_Character) == 0x000230, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_struct_Variable_13) == 0x000240, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_struct_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_MakeStruct_FormatArgumentData) == 0x000278, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_real_Variable) == 0x0002C0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue_5) == 0x0002C4, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_DoesSatisfyTagRequirements_BP_ReturnValue) == 0x0002C5, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_DoesSatisfyTagRequirements_BP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_Event_ViewTarget) == 0x0002C8, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_Event_ViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_TrySetViewTarget_View_Target) == 0x0002D0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_TrySetViewTarget_View_Target' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue_6) == 0x0002D8, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0002E0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue_7) == 0x0002E8, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_text_Variable) == 0x0002F0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_real_Variable_1) == 0x000300, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue_8) == 0x000304, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue_9) == 0x000305, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_GetRarityColor_ReturnValue) == 0x000308, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_GetRarityColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_Get_Limb_Icon_AbilityIcon) == 0x000318, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_Get_Limb_Icon_AbilityIcon' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_byte_Variable_3) == 0x000340, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_GetLimbCurrentHealth_ReturnValue) == 0x000348, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_GetLimbCurrentHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_Event_NewState) == 0x000350, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_SwitchEnum_CmpSuccess) == 0x000351, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_Event_bLimbValid) == 0x000352, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_Event_bLimbValid' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_Event_bLimbAbilityValid) == 0x000353, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_Event_bLimbAbilityValid' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_Event_bShow) == 0x000354, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_Event_bShow' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_Event_bHaveMaxCharges) == 0x000355, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_Event_bHaveMaxCharges' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_Event_bRecharging) == 0x000356, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_Event_bRecharging' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_ListenForAttributeChange_ReturnValue) == 0x000358, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_ListenForAttributeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue_10) == 0x000360, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue_11) == 0x000361, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_GetLimbCurrentHealth_ReturnValue_1) == 0x000368, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_GetLimbCurrentHealth_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CustomEvent_Attribute) == 0x000370, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CustomEvent_NewValue) == 0x0003A8, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CustomEvent_OldValue) == 0x0003AC, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_text_Variable_1) == 0x0003B0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CreateDelegate_OutputDelegate_8) == 0x0003C0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_GetLimbCurrentHealth_ReturnValue_2) == 0x0003D0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_GetLimbCurrentHealth_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0003D8, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_GetGzAbilitySystemComponent_ReturnValue) == 0x0003E0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_GetGzAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CreateDelegate_OutputDelegate_9) == 0x0003E8, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_Select_Default) == 0x0003F8, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000418, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue) == 0x000420, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue_12) == 0x000428, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_text_Variable_2) == 0x000430, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_Select_Default_1) == 0x000440, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_GetGzAbilitySystemComponent_ReturnValue_1) == 0x000460, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_GetGzAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1) == 0x000468, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_CreateDelegate_OutputDelegate_10) == 0x000470, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000480, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue_13) == 0x000488, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_ClearEnergyTimer_bShouldStayActive) == 0x000489, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_ClearEnergyTimer_bShouldStayActive' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_ClearEnergyTimer_bShouldStayActive_1) == 0x00048A, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_ClearEnergyTimer_bShouldStayActive_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, Temp_bool_Variable) == 0x00048B, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_Select_Default_2) == 0x000490, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x0004A0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_MakeStruct_FormatArgumentData_1) == 0x0004A8, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_MakeArray_Array) == 0x0004F0, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_Format_ReturnValue) == 0x000500, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_K2_IsValidTimerHandle_ReturnValue_1) == 0x000510, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_K2_IsValidTimerHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_GetGzAbilitySystemComponent_ReturnValue_2) == 0x000518, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_GetGzAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_2) == 0x000520, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_IsValid_ReturnValue_14) == 0x000528, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000529, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x00052C, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_Event_bLimbAbilityComponentValid) == 0x000530, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_Event_bLimbAbilityComponentValid' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_GetGzAbilitySystemComponent_ReturnValue_3) == 0x000538, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_GetGzAbilitySystemComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, K2Node_Select_Default_3) == 0x000540, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_3) == 0x000560, "Member 'WBP_CyberlimbsPanel_Limb_DOS_C_ExecuteUbergraph_WBP_CyberlimbsPanel_Limb_DOS::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_3' has a wrong offset!");
