#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ZoomLevel

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ZoomLevel.WBP_ZoomLevel_C.ExecuteUbergraph_WBP_ZoomLevel
// 0x0058 (0x0058 - 0x0000)
struct WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E96[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E97[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzCombatComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E98[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzWeaponComponent*                     CallFunc_GetEquippedWeaponComponent_ReturnValue;   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E99[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentScopeMagnification_ReturnValue; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9A[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentScopeMagnification_ReturnValue_1; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel) == 0x000008, "Wrong alignment on WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel");
static_assert(sizeof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel) == 0x000058, "Wrong size on WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel");
static_assert(offsetof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel, EntryPoint) == 0x000000, "Member 'WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel, K2Node_DynamicCast_AsGz_Player_Character) == 0x000020, "Member 'WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel, CallFunc_GetEquippedWeaponComponent_ReturnValue) == 0x000040, "Member 'WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel::CallFunc_GetEquippedWeaponComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel, CallFunc_IsValid_ReturnValue_2) == 0x000048, "Member 'WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel, CallFunc_IsValid_ReturnValue_3) == 0x000049, "Member 'WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel, CallFunc_GetCurrentScopeMagnification_ReturnValue) == 0x00004C, "Member 'WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel::CallFunc_GetCurrentScopeMagnification_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel, CallFunc_IsValid_ReturnValue_4) == 0x000050, "Member 'WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel, CallFunc_GetCurrentScopeMagnification_ReturnValue_1) == 0x000054, "Member 'WBP_ZoomLevel_C_ExecuteUbergraph_WBP_ZoomLevel::CallFunc_GetCurrentScopeMagnification_ReturnValue_1' has a wrong offset!");

// Function WBP_ZoomLevel.WBP_ZoomLevel_C.UpdateZoomLevel
// 0x0078 (0x0078 - 0x0000)
struct WBP_ZoomLevel_C_UpdateZoomLevel final
{
public:
	int32                                         NewMagnification;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0010)()
};
static_assert(alignof(WBP_ZoomLevel_C_UpdateZoomLevel) == 0x000008, "Wrong alignment on WBP_ZoomLevel_C_UpdateZoomLevel");
static_assert(sizeof(WBP_ZoomLevel_C_UpdateZoomLevel) == 0x000078, "Wrong size on WBP_ZoomLevel_C_UpdateZoomLevel");
static_assert(offsetof(WBP_ZoomLevel_C_UpdateZoomLevel, NewMagnification) == 0x000000, "Member 'WBP_ZoomLevel_C_UpdateZoomLevel::NewMagnification' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_UpdateZoomLevel, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_ZoomLevel_C_UpdateZoomLevel::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_UpdateZoomLevel, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_ZoomLevel_C_UpdateZoomLevel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_UpdateZoomLevel, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_ZoomLevel_C_UpdateZoomLevel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ZoomLevel_C_UpdateZoomLevel, CallFunc_Format_ReturnValue) == 0x000068, "Member 'WBP_ZoomLevel_C_UpdateZoomLevel::CallFunc_Format_ReturnValue' has a wrong offset!");

}

