#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Crosshair_Unarmed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Crosshair_Unarmed.WBP_Crosshair_Unarmed_C
// 0x0040 (0x0328 - 0x02E8)
class UWBP_Crosshair_Unarmed_C final : public UGzCrosshair
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DeploymentFadeOut;                                 // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Circle;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FRotator                               CachedCameraRotation;                              // 0x0308(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           Handle;                                            // 0x0320(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Crosshair_Unarmed(int32 EntryPoint);
	void Hide_During_Deployment();
	void OnReset_BP();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Crosshair_Unarmed_C">();
	}
	static class UWBP_Crosshair_Unarmed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Crosshair_Unarmed_C>();
	}
};
static_assert(alignof(UWBP_Crosshair_Unarmed_C) == 0x000008, "Wrong alignment on UWBP_Crosshair_Unarmed_C");
static_assert(sizeof(UWBP_Crosshair_Unarmed_C) == 0x000328, "Wrong size on UWBP_Crosshair_Unarmed_C");
static_assert(offsetof(UWBP_Crosshair_Unarmed_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_Crosshair_Unarmed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Unarmed_C, DeploymentFadeOut) == 0x0002F0, "Member 'UWBP_Crosshair_Unarmed_C::DeploymentFadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Unarmed_C, CanvasPanel_0) == 0x0002F8, "Member 'UWBP_Crosshair_Unarmed_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Unarmed_C, Circle) == 0x000300, "Member 'UWBP_Crosshair_Unarmed_C::Circle' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Unarmed_C, CachedCameraRotation) == 0x000308, "Member 'UWBP_Crosshair_Unarmed_C::CachedCameraRotation' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Unarmed_C, Handle) == 0x000320, "Member 'UWBP_Crosshair_Unarmed_C::Handle' has a wrong offset!");

}

