#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoiceChatStateEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_VoiceChatStateEntry.WBP_VoiceChatStateEntry_C.Set Is Pro
// 0x0005 (0x0005 - 0x0000)
struct WBP_VoiceChatStateEntry_C_Set_Is_Pro final
{
public:
	bool                                          bPro;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatStateEntry_C_Set_Is_Pro) == 0x000001, "Wrong alignment on WBP_VoiceChatStateEntry_C_Set_Is_Pro");
static_assert(sizeof(WBP_VoiceChatStateEntry_C_Set_Is_Pro) == 0x000005, "Wrong size on WBP_VoiceChatStateEntry_C_Set_Is_Pro");
static_assert(offsetof(WBP_VoiceChatStateEntry_C_Set_Is_Pro, bPro) == 0x000000, "Member 'WBP_VoiceChatStateEntry_C_Set_Is_Pro::bPro' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateEntry_C_Set_Is_Pro, Temp_bool_Variable) == 0x000001, "Member 'WBP_VoiceChatStateEntry_C_Set_Is_Pro::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateEntry_C_Set_Is_Pro, Temp_byte_Variable) == 0x000002, "Member 'WBP_VoiceChatStateEntry_C_Set_Is_Pro::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateEntry_C_Set_Is_Pro, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_VoiceChatStateEntry_C_Set_Is_Pro::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateEntry_C_Set_Is_Pro, K2Node_Select_Default) == 0x000004, "Member 'WBP_VoiceChatStateEntry_C_Set_Is_Pro::K2Node_Select_Default' has a wrong offset!");

// Function WBP_VoiceChatStateEntry.WBP_VoiceChatStateEntry_C.Set Name
// 0x0020 (0x0020 - 0x0000)
struct WBP_VoiceChatStateEntry_C_Set_Name final
{
public:
	class FString                                 Param_Name;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0010)()
};
static_assert(alignof(WBP_VoiceChatStateEntry_C_Set_Name) == 0x000008, "Wrong alignment on WBP_VoiceChatStateEntry_C_Set_Name");
static_assert(sizeof(WBP_VoiceChatStateEntry_C_Set_Name) == 0x000020, "Wrong size on WBP_VoiceChatStateEntry_C_Set_Name");
static_assert(offsetof(WBP_VoiceChatStateEntry_C_Set_Name, Param_Name) == 0x000000, "Member 'WBP_VoiceChatStateEntry_C_Set_Name::Param_Name' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateEntry_C_Set_Name, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_VoiceChatStateEntry_C_Set_Name::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_VoiceChatStateEntry.WBP_VoiceChatStateEntry_C.Set Tag
// 0x0018 (0x0018 - 0x0000)
struct WBP_VoiceChatStateEntry_C_Set_Tag final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bLocalPlayer;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatStateEntry_C_Set_Tag) == 0x000008, "Wrong alignment on WBP_VoiceChatStateEntry_C_Set_Tag");
static_assert(sizeof(WBP_VoiceChatStateEntry_C_Set_Tag) == 0x000018, "Wrong size on WBP_VoiceChatStateEntry_C_Set_Tag");
static_assert(offsetof(WBP_VoiceChatStateEntry_C_Set_Tag, Tag) == 0x000000, "Member 'WBP_VoiceChatStateEntry_C_Set_Tag::Tag' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateEntry_C_Set_Tag, bLocalPlayer) == 0x000010, "Member 'WBP_VoiceChatStateEntry_C_Set_Tag::bLocalPlayer' has a wrong offset!");

}

