#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_Lobby_IdlePoses

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Debug_Lobby_IdlePoses.WBP_Debug_Lobby_IdlePoses_C
// 0x00A0 (0x0380 - 0x02E0)
class UWBP_Debug_Lobby_IdlePoses_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_1;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_2;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_3;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_48;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                OnePlayerOptions;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ThreePlayersOption;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UABP_Hideout_Player_C*                  HideOutAbp;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             SetMiddlePoses;                                    // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             SetLeftPoses;                                      // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             SetRightPoses;                                     // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             SetToOnePlayer;                                    // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             SetToThreePlayers;                                 // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABP_Debug_Lobby_IdlePoses_C*            DebugActor;                                        // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Debug_Lobby_IdlePoses_Button_2_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Debug_Lobby_IdlePoses_Button_3_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_DebugIdle_Button_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_DebugIdle_Button_48_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_DebugIdle_Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Debug_Lobby_IdlePoses(int32 EntryPoint);
	void SetLeftPoses__DelegateSignature();
	void SetMiddlePoses__DelegateSignature();
	void SetRightPoses__DelegateSignature();
	void SetToOnePlayer__DelegateSignature();
	void SetToThreePlayers__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Debug_Lobby_IdlePoses_C">();
	}
	static class UWBP_Debug_Lobby_IdlePoses_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Debug_Lobby_IdlePoses_C>();
	}
};
static_assert(alignof(UWBP_Debug_Lobby_IdlePoses_C) == 0x000008, "Wrong alignment on UWBP_Debug_Lobby_IdlePoses_C");
static_assert(sizeof(UWBP_Debug_Lobby_IdlePoses_C) == 0x000380, "Wrong size on UWBP_Debug_Lobby_IdlePoses_C");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Debug_Lobby_IdlePoses_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, Button) == 0x0002E8, "Member 'UWBP_Debug_Lobby_IdlePoses_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, Button_1) == 0x0002F0, "Member 'UWBP_Debug_Lobby_IdlePoses_C::Button_1' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, Button_2) == 0x0002F8, "Member 'UWBP_Debug_Lobby_IdlePoses_C::Button_2' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, Button_3) == 0x000300, "Member 'UWBP_Debug_Lobby_IdlePoses_C::Button_3' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, Button_48) == 0x000308, "Member 'UWBP_Debug_Lobby_IdlePoses_C::Button_48' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, OnePlayerOptions) == 0x000310, "Member 'UWBP_Debug_Lobby_IdlePoses_C::OnePlayerOptions' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, ThreePlayersOption) == 0x000318, "Member 'UWBP_Debug_Lobby_IdlePoses_C::ThreePlayersOption' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, HideOutAbp) == 0x000320, "Member 'UWBP_Debug_Lobby_IdlePoses_C::HideOutAbp' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, SetMiddlePoses) == 0x000328, "Member 'UWBP_Debug_Lobby_IdlePoses_C::SetMiddlePoses' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, SetLeftPoses) == 0x000338, "Member 'UWBP_Debug_Lobby_IdlePoses_C::SetLeftPoses' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, SetRightPoses) == 0x000348, "Member 'UWBP_Debug_Lobby_IdlePoses_C::SetRightPoses' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, SetToOnePlayer) == 0x000358, "Member 'UWBP_Debug_Lobby_IdlePoses_C::SetToOnePlayer' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, SetToThreePlayers) == 0x000368, "Member 'UWBP_Debug_Lobby_IdlePoses_C::SetToThreePlayers' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Lobby_IdlePoses_C, DebugActor) == 0x000378, "Member 'UWBP_Debug_Lobby_IdlePoses_C::DebugActor' has a wrong offset!");

}

