#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RespawnTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_RespawnTimer.WBP_RespawnTimer_C.ExecuteUbergraph_WBP_RespawnTimer
// 0x0030 (0x0030 - 0x0000)
struct WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DBF[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerController*                    K2Node_DynamicCast_AsGz_Player_Controller;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer) == 0x000008, "Wrong alignment on WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer");
static_assert(sizeof(WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer) == 0x000030, "Wrong size on WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer");
static_assert(offsetof(WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer, EntryPoint) == 0x000000, "Member 'WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000014, "Member 'WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer, CallFunc_K2_IsValidTimerHandle_ReturnValue_1) == 0x000015, "Member 'WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer::CallFunc_K2_IsValidTimerHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer, K2Node_DynamicCast_AsGz_Player_Controller) == 0x000020, "Member 'WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer::K2Node_DynamicCast_AsGz_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_RespawnTimer_C_ExecuteUbergraph_WBP_RespawnTimer::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_RespawnTimer.WBP_RespawnTimer_C.Start Respawn Timer
// 0x0070 (0x0070 - 0x0000)
struct WBP_RespawnTimer_C_Start_Respawn_Timer final
{
public:
	double                                        WaitTillRespawnTime;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzGameState*                           K2Node_DynamicCast_AsGz_Game_State;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC0[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGzBattleRoyaleSettings*                K2Node_DynamicCast_AsGz_Battle_Royale_Settings;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC1[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC2[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC3[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_WaitTillRespawnTime_ImplicitCast; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RespawnTimer_C_Start_Respawn_Timer) == 0x000008, "Wrong alignment on WBP_RespawnTimer_C_Start_Respawn_Timer");
static_assert(sizeof(WBP_RespawnTimer_C_Start_Respawn_Timer) == 0x000070, "Wrong size on WBP_RespawnTimer_C_Start_Respawn_Timer");
static_assert(offsetof(WBP_RespawnTimer_C_Start_Respawn_Timer, WaitTillRespawnTime) == 0x000000, "Member 'WBP_RespawnTimer_C_Start_Respawn_Timer::WaitTillRespawnTime' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_Start_Respawn_Timer, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'WBP_RespawnTimer_C_Start_Respawn_Timer::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_Start_Respawn_Timer, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_RespawnTimer_C_Start_Respawn_Timer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_Start_Respawn_Timer, K2Node_DynamicCast_AsGz_Game_State) == 0x000020, "Member 'WBP_RespawnTimer_C_Start_Respawn_Timer::K2Node_DynamicCast_AsGz_Game_State' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_Start_Respawn_Timer, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_RespawnTimer_C_Start_Respawn_Timer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_Start_Respawn_Timer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'WBP_RespawnTimer_C_Start_Respawn_Timer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_Start_Respawn_Timer, K2Node_DynamicCast_AsGz_Battle_Royale_Settings) == 0x000038, "Member 'WBP_RespawnTimer_C_Start_Respawn_Timer::K2Node_DynamicCast_AsGz_Battle_Royale_Settings' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_Start_Respawn_Timer, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBP_RespawnTimer_C_Start_Respawn_Timer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_Start_Respawn_Timer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'WBP_RespawnTimer_C_Start_Respawn_Timer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_Start_Respawn_Timer, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000058, "Member 'WBP_RespawnTimer_C_Start_Respawn_Timer::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_Start_Respawn_Timer, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000060, "Member 'WBP_RespawnTimer_C_Start_Respawn_Timer::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_Start_Respawn_Timer, K2Node_VariableSet_WaitTillRespawnTime_ImplicitCast) == 0x000068, "Member 'WBP_RespawnTimer_C_Start_Respawn_Timer::K2Node_VariableSet_WaitTillRespawnTime_ImplicitCast' has a wrong offset!");

// Function WBP_RespawnTimer.WBP_RespawnTimer_C.UpdateText
// 0x0088 (0x0088 - 0x0000)
struct WBP_RespawnTimer_C_UpdateText final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC4[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC5[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RespawnTimer_C_UpdateText) == 0x000008, "Wrong alignment on WBP_RespawnTimer_C_UpdateText");
static_assert(sizeof(WBP_RespawnTimer_C_UpdateText) == 0x000088, "Wrong size on WBP_RespawnTimer_C_UpdateText");
static_assert(offsetof(WBP_RespawnTimer_C_UpdateText, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'WBP_RespawnTimer_C_UpdateText::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_UpdateText, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000004, "Member 'WBP_RespawnTimer_C_UpdateText::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_UpdateText, CallFunc_FTrunc_ReturnValue) == 0x000008, "Member 'WBP_RespawnTimer_C_UpdateText::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_UpdateText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'WBP_RespawnTimer_C_UpdateText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_UpdateText, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_RespawnTimer_C_UpdateText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_UpdateText, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_RespawnTimer_C_UpdateText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_UpdateText, CallFunc_Format_ReturnValue) == 0x000070, "Member 'WBP_RespawnTimer_C_UpdateText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimer_C_UpdateText, CallFunc_FTrunc_A_ImplicitCast) == 0x000080, "Member 'WBP_RespawnTimer_C_UpdateText::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

}

