#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Limbs_InputAction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Limbs_InputAction.WBP_Limbs_InputAction_C
// 0x0040 (0x0380 - 0x0340)
class UWBP_Limbs_InputAction_C final : public UGzHUDComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzActionWidget*                        GzActionWidget;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           RichText_Result;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RText_ActionModifier;                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Hold;                                              // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Release;                                           // 0x0361(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5AAF[0x6];                                     // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           InputAction;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   ResultText;                                        // 0x0370(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_Limbs_InputAction(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void RebuildInputInfo();
	void SetNewInputAction(class UInputAction* NewInputAction);
	void SetNewResultText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Limbs_InputAction_C">();
	}
	static class UWBP_Limbs_InputAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Limbs_InputAction_C>();
	}
};
static_assert(alignof(UWBP_Limbs_InputAction_C) == 0x000008, "Wrong alignment on UWBP_Limbs_InputAction_C");
static_assert(sizeof(UWBP_Limbs_InputAction_C) == 0x000380, "Wrong size on UWBP_Limbs_InputAction_C");
static_assert(offsetof(UWBP_Limbs_InputAction_C, UberGraphFrame) == 0x000340, "Member 'UWBP_Limbs_InputAction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Limbs_InputAction_C, GzActionWidget) == 0x000348, "Member 'UWBP_Limbs_InputAction_C::GzActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Limbs_InputAction_C, RichText_Result) == 0x000350, "Member 'UWBP_Limbs_InputAction_C::RichText_Result' has a wrong offset!");
static_assert(offsetof(UWBP_Limbs_InputAction_C, RText_ActionModifier) == 0x000358, "Member 'UWBP_Limbs_InputAction_C::RText_ActionModifier' has a wrong offset!");
static_assert(offsetof(UWBP_Limbs_InputAction_C, Hold) == 0x000360, "Member 'UWBP_Limbs_InputAction_C::Hold' has a wrong offset!");
static_assert(offsetof(UWBP_Limbs_InputAction_C, Release) == 0x000361, "Member 'UWBP_Limbs_InputAction_C::Release' has a wrong offset!");
static_assert(offsetof(UWBP_Limbs_InputAction_C, InputAction) == 0x000368, "Member 'UWBP_Limbs_InputAction_C::InputAction' has a wrong offset!");
static_assert(offsetof(UWBP_Limbs_InputAction_C, ResultText) == 0x000370, "Member 'UWBP_Limbs_InputAction_C::ResultText' has a wrong offset!");

}

