#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSelection_LoadoutV2

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoadoutSelection_LoadoutV2.WBP_LoadoutSelection_LoadoutV2_C.UpdateCurrencyBoxVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_LoadoutSelection_LoadoutV2_C_UpdateCurrencyBoxVisibility final
{
public:
	bool                                          CallFunc_GetShowLoadoutPrice_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCurrencyBoxVisibility) == 0x000001, "Wrong alignment on WBP_LoadoutSelection_LoadoutV2_C_UpdateCurrencyBoxVisibility");
static_assert(sizeof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCurrencyBoxVisibility) == 0x000001, "Wrong size on WBP_LoadoutSelection_LoadoutV2_C_UpdateCurrencyBoxVisibility");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCurrencyBoxVisibility, CallFunc_GetShowLoadoutPrice_ReturnValue) == 0x000000, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCurrencyBoxVisibility::CallFunc_GetShowLoadoutPrice_ReturnValue' has a wrong offset!");

// Function WBP_LoadoutSelection_LoadoutV2.WBP_LoadoutSelection_LoadoutV2_C.UpdateCostsText
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6684[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0014(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6685[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemCountByType_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6686[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzLoadoutDataConfig                   CallFunc_GetLoadoutData_ReturnValue;               // 0x0028(0x0070)(ConstParm, ContainsInstancedReference)
	class FName                                   Temp_name_Variable_2;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalLoadoutCost_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6687[0x2];                                     // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CurrencyTextFormat_Result;                // 0x00A8(0x0010)()
	class FName                                   K2Node_Select_Default;                             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText");
static_assert(sizeof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText) == 0x0000D0, "Wrong size on WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, Temp_bool_Variable) == 0x000000, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, Temp_name_Variable) == 0x000004, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, Temp_name_Variable_1) == 0x00000C, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, Temp_struct_Variable) == 0x000014, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, CallFunc_GetItemCountByType_ReturnValue) == 0x000020, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::CallFunc_GetItemCountByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, Temp_bool_Variable_1) == 0x000024, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, CallFunc_GetLoadoutData_ReturnValue) == 0x000028, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::CallFunc_GetLoadoutData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, Temp_name_Variable_2) == 0x000098, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, CallFunc_GetLocalLoadoutCost_ReturnValue) == 0x0000A0, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::CallFunc_GetLocalLoadoutCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, CallFunc_IsValid_Guid_ReturnValue) == 0x0000A4, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A5, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, CallFunc_CurrencyTextFormat_Result) == 0x0000A8, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::CallFunc_CurrencyTextFormat_Result' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, K2Node_Select_Default) == 0x0000B8, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, Temp_name_Variable_3) == 0x0000C0, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText, K2Node_Select_Default_1) == 0x0000C8, "Member 'WBP_LoadoutSelection_LoadoutV2_C_UpdateCostsText::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_LoadoutSelection_LoadoutV2.WBP_LoadoutSelection_LoadoutV2_C.OnSelectedStateChanged
// 0x0038 (0x0038 - 0x0000)
struct WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6688[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0010)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0020(0x0014)()
};
static_assert(alignof(WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged");
static_assert(sizeof(WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged) == 0x000038, "Wrong size on WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged, Button) == 0x000000, "Member 'WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged::Button' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged, Selected) == 0x000008, "Member 'WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged::Selected' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged, Temp_bool_Variable) == 0x000009, "Member 'WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged, K2Node_Select_Default) == 0x000020, "Member 'WBP_LoadoutSelection_LoadoutV2_C_OnSelectedStateChanged::K2Node_Select_Default' has a wrong offset!");

// Function WBP_LoadoutSelection_LoadoutV2.WBP_LoadoutSelection_LoadoutV2_C.Load_Loadout
// 0x0190 (0x0190 - 0x0000)
struct WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout final
{
public:
	struct FGzLoadoutDataConfig                   CallFunc_GetLoadoutData_ReturnValue;               // 0x0000(0x0070)(ConstParm, ContainsInstancedReference)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0010)()
	bool                                          CallFunc_IsValidLoadoutConfig_ReturnValue;         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6689[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzLoadoutDataConfig                   CallFunc_GetLoadoutData_ReturnValue_1;             // 0x0088(0x0070)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_GetIsRandomLoadout_ReturnValue;           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_668A[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzLoadoutDataConfig                   CallFunc_GetLoadoutData_ReturnValue_2;             // 0x0100(0x0070)(ConstParm, ContainsInstancedReference)
	class FString                                 CallFunc_GetLocalLoadoutName_ReturnValue;          // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout");
static_assert(sizeof(WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout) == 0x000190, "Wrong size on WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout, CallFunc_GetLoadoutData_ReturnValue) == 0x000000, "Member 'WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout::CallFunc_GetLoadoutData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout, CallFunc_IsValidLoadoutConfig_ReturnValue) == 0x000080, "Member 'WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout::CallFunc_IsValidLoadoutConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout, CallFunc_GetLoadoutData_ReturnValue_1) == 0x000088, "Member 'WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout::CallFunc_GetLoadoutData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout, CallFunc_GetIsRandomLoadout_ReturnValue) == 0x0000F8, "Member 'WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout::CallFunc_GetIsRandomLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout, CallFunc_GetLoadoutData_ReturnValue_2) == 0x000100, "Member 'WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout::CallFunc_GetLoadoutData_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout, CallFunc_GetLocalLoadoutName_ReturnValue) == 0x000170, "Member 'WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout::CallFunc_GetLocalLoadoutName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout, CallFunc_SelectString_ReturnValue) == 0x000180, "Member 'WBP_LoadoutSelection_LoadoutV2_C_Load_Loadout::CallFunc_SelectString_ReturnValue' has a wrong offset!");

// Function WBP_LoadoutSelection_LoadoutV2.WBP_LoadoutSelection_LoadoutV2_C.GetIsPreMatch
// 0x0050 (0x0050 - 0x0000)
struct WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_668B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_668C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzMultiStageGameState*                 K2Node_DynamicCast_AsGz_Multi_Stage_Game_State;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameRuleEnabled_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_668D[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetActiveStageTags_ReturnValue;           // 0x0028(0x0020)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch");
static_assert(sizeof(WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch) == 0x000050, "Wrong size on WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch, ReturnValue) == 0x000000, "Member 'WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch, Temp_struct_Variable) == 0x000004, "Member 'WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch, K2Node_DynamicCast_AsGz_Multi_Stage_Game_State) == 0x000018, "Member 'WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch::K2Node_DynamicCast_AsGz_Multi_Stage_Game_State' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch, CallFunc_IsGameRuleEnabled_ReturnValue) == 0x000021, "Member 'WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch::CallFunc_IsGameRuleEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch, CallFunc_GetActiveStageTags_ReturnValue) == 0x000028, "Member 'WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch::CallFunc_GetActiveStageTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch, CallFunc_HasTag_ReturnValue) == 0x000048, "Member 'WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch, CallFunc_BooleanOR_ReturnValue) == 0x000049, "Member 'WBP_LoadoutSelection_LoadoutV2_C_GetIsPreMatch::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_LoadoutSelection_LoadoutV2.WBP_LoadoutSelection_LoadoutV2_C.ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2
// 0x0070 (0x0070 - 0x0000)
struct WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_668E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_668F[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGzPlayerViewTargetInterface> K2Node_DynamicCast_AsGz_Player_View_Target_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6690[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzInvComponent*                        CallFunc_GetViewTargetInventory_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6691[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonButtonBase* Button, bool Selected)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6692[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetCurrencyIcon_AsTexture_2D;             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6693[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsRandomLoadout_ReturnValue;           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2");
static_assert(sizeof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2) == 0x000070, "Wrong size on WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2, EntryPoint) == 0x000000, "Member 'WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000008, "Member 'WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2, K2Node_DynamicCast_AsGz_Player_View_Target_Interface) == 0x000018, "Member 'WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2::K2Node_DynamicCast_AsGz_Player_View_Target_Interface' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2, CallFunc_GetViewTargetInventory_ReturnValue) == 0x000030, "Member 'WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2::CallFunc_GetViewTargetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2, CallFunc_GetCurrencyIcon_AsTexture_2D) == 0x000050, "Member 'WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2::CallFunc_GetCurrencyIcon_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2, CallFunc_GetIsRandomLoadout_ReturnValue) == 0x00006C, "Member 'WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2::CallFunc_GetIsRandomLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2, CallFunc_GetSelected_ReturnValue) == 0x00006D, "Member 'WBP_LoadoutSelection_LoadoutV2_C_ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2::CallFunc_GetSelected_ReturnValue' has a wrong offset!");

}

