#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemImage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ItemImage.WBP_ItemImage_C.ExecuteUbergraph_WBP_ItemImage
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemImage_C_ExecuteUbergraph_WBP_ItemImage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemImage_C_ExecuteUbergraph_WBP_ItemImage) == 0x000004, "Wrong alignment on WBP_ItemImage_C_ExecuteUbergraph_WBP_ItemImage");
static_assert(sizeof(WBP_ItemImage_C_ExecuteUbergraph_WBP_ItemImage) == 0x000008, "Wrong size on WBP_ItemImage_C_ExecuteUbergraph_WBP_ItemImage");
static_assert(offsetof(WBP_ItemImage_C_ExecuteUbergraph_WBP_ItemImage, EntryPoint) == 0x000000, "Member 'WBP_ItemImage_C_ExecuteUbergraph_WBP_ItemImage::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ItemImage_C_ExecuteUbergraph_WBP_ItemImage, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_ItemImage_C_ExecuteUbergraph_WBP_ItemImage::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_ItemImage.WBP_ItemImage_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemImage_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemImage_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ItemImage_C_PreConstruct");
static_assert(sizeof(WBP_ItemImage_C_PreConstruct) == 0x000001, "Wrong size on WBP_ItemImage_C_PreConstruct");
static_assert(offsetof(WBP_ItemImage_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ItemImage_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ItemImage.WBP_ItemImage_C.SetBrushSize
// 0x0100 (0x0100 - 0x0000)
struct WBP_ItemImage_C_SetBrushSize final
{
public:
	struct FVector2D                              Size;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AD3[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            IconBrush;                                         // 0x0020(0x00D0)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AD4[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDeprecateSlateVector2D                K2Node_SetFieldsInStruct_ImageSize_ImplicitCast;   // 0x00F4(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemImage_C_SetBrushSize) == 0x000010, "Wrong alignment on WBP_ItemImage_C_SetBrushSize");
static_assert(sizeof(WBP_ItemImage_C_SetBrushSize) == 0x000100, "Wrong size on WBP_ItemImage_C_SetBrushSize");
static_assert(offsetof(WBP_ItemImage_C_SetBrushSize, Size) == 0x000000, "Member 'WBP_ItemImage_C_SetBrushSize::Size' has a wrong offset!");
static_assert(offsetof(WBP_ItemImage_C_SetBrushSize, Image) == 0x000010, "Member 'WBP_ItemImage_C_SetBrushSize::Image' has a wrong offset!");
static_assert(offsetof(WBP_ItemImage_C_SetBrushSize, IconBrush) == 0x000020, "Member 'WBP_ItemImage_C_SetBrushSize::IconBrush' has a wrong offset!");
static_assert(offsetof(WBP_ItemImage_C_SetBrushSize, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'WBP_ItemImage_C_SetBrushSize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemImage_C_SetBrushSize, K2Node_SetFieldsInStruct_ImageSize_ImplicitCast) == 0x0000F4, "Member 'WBP_ItemImage_C_SetBrushSize::K2Node_SetFieldsInStruct_ImageSize_ImplicitCast' has a wrong offset!");

// Function WBP_ItemImage.WBP_ItemImage_C.SetItemIcon
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemImage_C_SetItemIcon final
{
public:
	class UTexture2D*                             ItemIcon;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemImage_C_SetItemIcon) == 0x000008, "Wrong alignment on WBP_ItemImage_C_SetItemIcon");
static_assert(sizeof(WBP_ItemImage_C_SetItemIcon) == 0x000008, "Wrong size on WBP_ItemImage_C_SetItemIcon");
static_assert(offsetof(WBP_ItemImage_C_SetItemIcon, ItemIcon) == 0x000000, "Member 'WBP_ItemImage_C_SetItemIcon::ItemIcon' has a wrong offset!");

// Function WBP_ItemImage.WBP_ItemImage_C.SetItemIconSize
// 0x0010 (0x0010 - 0x0000)
struct WBP_ItemImage_C_SetItemIconSize final
{
public:
	struct FVector2D                              Size;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemImage_C_SetItemIconSize) == 0x000008, "Wrong alignment on WBP_ItemImage_C_SetItemIconSize");
static_assert(sizeof(WBP_ItemImage_C_SetItemIconSize) == 0x000010, "Wrong size on WBP_ItemImage_C_SetItemIconSize");
static_assert(offsetof(WBP_ItemImage_C_SetItemIconSize, Size) == 0x000000, "Member 'WBP_ItemImage_C_SetItemIconSize::Size' has a wrong offset!");

// Function WBP_ItemImage.WBP_ItemImage_C.SetItemIconSoft
// 0x0028 (0x0028 - 0x0000)
struct WBP_ItemImage_C_SetItemIconSoft final
{
public:
	TSoftObjectPtr<class UTexture2D>              SoftItemIcon;                                      // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemImage_C_SetItemIconSoft) == 0x000008, "Wrong alignment on WBP_ItemImage_C_SetItemIconSoft");
static_assert(sizeof(WBP_ItemImage_C_SetItemIconSoft) == 0x000028, "Wrong size on WBP_ItemImage_C_SetItemIconSoft");
static_assert(offsetof(WBP_ItemImage_C_SetItemIconSoft, SoftItemIcon) == 0x000000, "Member 'WBP_ItemImage_C_SetItemIconSoft::SoftItemIcon' has a wrong offset!");

}

