#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Scope_LongRange01

#include "Basic.hpp"

#include "WBP_Scope_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Scope_LongRange01.WBP_Scope_LongRange01_C
// 0x0050 (0x0360 - 0x0310)
class UWBP_Scope_LongRange01_C final : public UWBP_Scope_Base_C
{
public:
	class UImage*                                 BulletDrop01;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BulletDrop01_G;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BulletDrop02;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BulletDrop02_G;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BulletDrop03;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BulletDrop03_G;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Reticle;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RangeIndicator_C*                  WBP_RangeIndicator;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SwitchZoomHint_C*                  WBP_SwitchZoomHint;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ZoomLevel_C*                       WBP_ZoomLevel;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Scope_LongRange01_C">();
	}
	static class UWBP_Scope_LongRange01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Scope_LongRange01_C>();
	}
};
static_assert(alignof(UWBP_Scope_LongRange01_C) == 0x000008, "Wrong alignment on UWBP_Scope_LongRange01_C");
static_assert(sizeof(UWBP_Scope_LongRange01_C) == 0x000360, "Wrong size on UWBP_Scope_LongRange01_C");
static_assert(offsetof(UWBP_Scope_LongRange01_C, BulletDrop01) == 0x000310, "Member 'UWBP_Scope_LongRange01_C::BulletDrop01' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_LongRange01_C, BulletDrop01_G) == 0x000318, "Member 'UWBP_Scope_LongRange01_C::BulletDrop01_G' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_LongRange01_C, BulletDrop02) == 0x000320, "Member 'UWBP_Scope_LongRange01_C::BulletDrop02' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_LongRange01_C, BulletDrop02_G) == 0x000328, "Member 'UWBP_Scope_LongRange01_C::BulletDrop02_G' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_LongRange01_C, BulletDrop03) == 0x000330, "Member 'UWBP_Scope_LongRange01_C::BulletDrop03' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_LongRange01_C, BulletDrop03_G) == 0x000338, "Member 'UWBP_Scope_LongRange01_C::BulletDrop03_G' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_LongRange01_C, Reticle) == 0x000340, "Member 'UWBP_Scope_LongRange01_C::Reticle' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_LongRange01_C, WBP_RangeIndicator) == 0x000348, "Member 'UWBP_Scope_LongRange01_C::WBP_RangeIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_LongRange01_C, WBP_SwitchZoomHint) == 0x000350, "Member 'UWBP_Scope_LongRange01_C::WBP_SwitchZoomHint' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_LongRange01_C, WBP_ZoomLevel) == 0x000358, "Member 'UWBP_Scope_LongRange01_C::WBP_ZoomLevel' has a wrong offset!");

}

