#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HEX_Button

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HEX_Button.WBP_HEX_Button_C
// 0x0080 (0x16B0 - 0x1630)
class UWBP_HEX_Button_C final : public UGzCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ButtonBackground_Image;                            // 0x1638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Cost_HorizontalBox;                                // 0x1640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Currency_Image;                                    // 0x1648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hex_Image;                                         // 0x1650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HexBackground_Image;                               // 0x1658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           HexName_GzText;                                    // 0x1660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Price_GzText;                                      // 0x1668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Prompt_GzText;                                     // 0x1670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QualityIcon_Image;                                 // 0x1678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Time_GzText;                                       // 0x1680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           WarningColor;                                      // 0x1688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzItemData*                            HexData;                                           // 0x1698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWBP_HEX_Menu_C*                        HexMenu;                                           // 0x16A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          CanNotPay;                                         // 0x16A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetNameAndTime(bool Hovered);
	void InitHEX();
	void ExecuteUbergraph_WBP_HEX_Button(int32 EntryPoint);
	void Construct();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void BP_OnFocusReceived();
	void BP_OnFocusLost();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HEX_Button_C">();
	}
	static class UWBP_HEX_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HEX_Button_C>();
	}
};
static_assert(alignof(UWBP_HEX_Button_C) == 0x000010, "Wrong alignment on UWBP_HEX_Button_C");
static_assert(sizeof(UWBP_HEX_Button_C) == 0x0016B0, "Wrong size on UWBP_HEX_Button_C");
static_assert(offsetof(UWBP_HEX_Button_C, UberGraphFrame) == 0x001630, "Member 'UWBP_HEX_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Button_C, ButtonBackground_Image) == 0x001638, "Member 'UWBP_HEX_Button_C::ButtonBackground_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Button_C, Cost_HorizontalBox) == 0x001640, "Member 'UWBP_HEX_Button_C::Cost_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Button_C, Currency_Image) == 0x001648, "Member 'UWBP_HEX_Button_C::Currency_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Button_C, Hex_Image) == 0x001650, "Member 'UWBP_HEX_Button_C::Hex_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Button_C, HexBackground_Image) == 0x001658, "Member 'UWBP_HEX_Button_C::HexBackground_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Button_C, HexName_GzText) == 0x001660, "Member 'UWBP_HEX_Button_C::HexName_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Button_C, Price_GzText) == 0x001668, "Member 'UWBP_HEX_Button_C::Price_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Button_C, Prompt_GzText) == 0x001670, "Member 'UWBP_HEX_Button_C::Prompt_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Button_C, QualityIcon_Image) == 0x001678, "Member 'UWBP_HEX_Button_C::QualityIcon_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Button_C, Time_GzText) == 0x001680, "Member 'UWBP_HEX_Button_C::Time_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Button_C, WarningColor) == 0x001688, "Member 'UWBP_HEX_Button_C::WarningColor' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Button_C, HexData) == 0x001698, "Member 'UWBP_HEX_Button_C::HexData' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Button_C, HexMenu) == 0x0016A0, "Member 'UWBP_HEX_Button_C::HexMenu' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Button_C, CanNotPay) == 0x0016A8, "Member 'UWBP_HEX_Button_C::CanNotPay' has a wrong offset!");

}

