#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Vehicle_Seat

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Vehicle_Seat.WBP_Vehicle_Seat_C.ExecuteUbergraph_WBP_Vehicle_Seat
// 0x0008 (0x0008 - 0x0000)
struct WBP_Vehicle_Seat_C_ExecuteUbergraph_WBP_Vehicle_Seat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Vehicle_Seat_C_ExecuteUbergraph_WBP_Vehicle_Seat) == 0x000004, "Wrong alignment on WBP_Vehicle_Seat_C_ExecuteUbergraph_WBP_Vehicle_Seat");
static_assert(sizeof(WBP_Vehicle_Seat_C_ExecuteUbergraph_WBP_Vehicle_Seat) == 0x000008, "Wrong size on WBP_Vehicle_Seat_C_ExecuteUbergraph_WBP_Vehicle_Seat");
static_assert(offsetof(WBP_Vehicle_Seat_C_ExecuteUbergraph_WBP_Vehicle_Seat, EntryPoint) == 0x000000, "Member 'WBP_Vehicle_Seat_C_ExecuteUbergraph_WBP_Vehicle_Seat::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Seat_C_ExecuteUbergraph_WBP_Vehicle_Seat, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Vehicle_Seat_C_ExecuteUbergraph_WBP_Vehicle_Seat::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_Vehicle_Seat.WBP_Vehicle_Seat_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Vehicle_Seat_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Vehicle_Seat_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Vehicle_Seat_C_PreConstruct");
static_assert(sizeof(WBP_Vehicle_Seat_C_PreConstruct) == 0x000001, "Wrong size on WBP_Vehicle_Seat_C_PreConstruct");
static_assert(offsetof(WBP_Vehicle_Seat_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Vehicle_Seat_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Vehicle_Seat.WBP_Vehicle_Seat_C.SetSeatOccupied
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Vehicle_Seat_C_SetSeatOccupied final
{
public:
	bool                                          Param_Occupied;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_LocalPlayer;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 TeamAtitude;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNPC;                                             // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42DC[0x9];                                     // 0x0007(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x0010(0x00D0)()
	struct FSlateBrush                            K2Node_Select_Default_1;                           // 0x00E0(0x00D0)()
};
static_assert(alignof(WBP_Vehicle_Seat_C_SetSeatOccupied) == 0x000010, "Wrong alignment on WBP_Vehicle_Seat_C_SetSeatOccupied");
static_assert(sizeof(WBP_Vehicle_Seat_C_SetSeatOccupied) == 0x0001B0, "Wrong size on WBP_Vehicle_Seat_C_SetSeatOccupied");
static_assert(offsetof(WBP_Vehicle_Seat_C_SetSeatOccupied, Param_Occupied) == 0x000000, "Member 'WBP_Vehicle_Seat_C_SetSeatOccupied::Param_Occupied' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Seat_C_SetSeatOccupied, Param_LocalPlayer) == 0x000001, "Member 'WBP_Vehicle_Seat_C_SetSeatOccupied::Param_LocalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Seat_C_SetSeatOccupied, TeamAtitude) == 0x000002, "Member 'WBP_Vehicle_Seat_C_SetSeatOccupied::TeamAtitude' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Seat_C_SetSeatOccupied, IsNPC) == 0x000003, "Member 'WBP_Vehicle_Seat_C_SetSeatOccupied::IsNPC' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Seat_C_SetSeatOccupied, Temp_bool_Variable) == 0x000004, "Member 'WBP_Vehicle_Seat_C_SetSeatOccupied::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Seat_C_SetSeatOccupied, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'WBP_Vehicle_Seat_C_SetSeatOccupied::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Seat_C_SetSeatOccupied, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_Vehicle_Seat_C_SetSeatOccupied::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Seat_C_SetSeatOccupied, K2Node_Select_Default) == 0x000010, "Member 'WBP_Vehicle_Seat_C_SetSeatOccupied::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Seat_C_SetSeatOccupied, K2Node_Select_Default_1) == 0x0000E0, "Member 'WBP_Vehicle_Seat_C_SetSeatOccupied::K2Node_Select_Default_1' has a wrong offset!");

}

