#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hitmark_LimbDestroyedV2_IconOnly

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Hitmark_LimbDestroyedV2_IconOnly.WBP_Hitmark_LimbDestroyedV2_IconOnly_C.ExecuteUbergraph_WBP_Hitmark_LimbDestroyedV2_IconOnly
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hitmark_LimbDestroyedV2_IconOnly_C_ExecuteUbergraph_WBP_Hitmark_LimbDestroyedV2_IconOnly final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hitmark_LimbDestroyedV2_IconOnly_C_ExecuteUbergraph_WBP_Hitmark_LimbDestroyedV2_IconOnly) == 0x000004, "Wrong alignment on WBP_Hitmark_LimbDestroyedV2_IconOnly_C_ExecuteUbergraph_WBP_Hitmark_LimbDestroyedV2_IconOnly");
static_assert(sizeof(WBP_Hitmark_LimbDestroyedV2_IconOnly_C_ExecuteUbergraph_WBP_Hitmark_LimbDestroyedV2_IconOnly) == 0x000008, "Wrong size on WBP_Hitmark_LimbDestroyedV2_IconOnly_C_ExecuteUbergraph_WBP_Hitmark_LimbDestroyedV2_IconOnly");
static_assert(offsetof(WBP_Hitmark_LimbDestroyedV2_IconOnly_C_ExecuteUbergraph_WBP_Hitmark_LimbDestroyedV2_IconOnly, EntryPoint) == 0x000000, "Member 'WBP_Hitmark_LimbDestroyedV2_IconOnly_C_ExecuteUbergraph_WBP_Hitmark_LimbDestroyedV2_IconOnly::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hitmark_LimbDestroyedV2_IconOnly_C_ExecuteUbergraph_WBP_Hitmark_LimbDestroyedV2_IconOnly, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Hitmark_LimbDestroyedV2_IconOnly_C_ExecuteUbergraph_WBP_Hitmark_LimbDestroyedV2_IconOnly::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_Hitmark_LimbDestroyedV2_IconOnly.WBP_Hitmark_LimbDestroyedV2_IconOnly_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Hitmark_LimbDestroyedV2_IconOnly_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hitmark_LimbDestroyedV2_IconOnly_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Hitmark_LimbDestroyedV2_IconOnly_C_PreConstruct");
static_assert(sizeof(WBP_Hitmark_LimbDestroyedV2_IconOnly_C_PreConstruct) == 0x000001, "Wrong size on WBP_Hitmark_LimbDestroyedV2_IconOnly_C_PreConstruct");
static_assert(offsetof(WBP_Hitmark_LimbDestroyedV2_IconOnly_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Hitmark_LimbDestroyedV2_IconOnly_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Hitmark_LimbDestroyedV2_IconOnly.WBP_Hitmark_LimbDestroyedV2_IconOnly_C.GetDisplayAnimation
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hitmark_LimbDestroyedV2_IconOnly_C_GetDisplayAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hitmark_LimbDestroyedV2_IconOnly_C_GetDisplayAnimation) == 0x000008, "Wrong alignment on WBP_Hitmark_LimbDestroyedV2_IconOnly_C_GetDisplayAnimation");
static_assert(sizeof(WBP_Hitmark_LimbDestroyedV2_IconOnly_C_GetDisplayAnimation) == 0x000008, "Wrong size on WBP_Hitmark_LimbDestroyedV2_IconOnly_C_GetDisplayAnimation");
static_assert(offsetof(WBP_Hitmark_LimbDestroyedV2_IconOnly_C_GetDisplayAnimation, ReturnValue) == 0x000000, "Member 'WBP_Hitmark_LimbDestroyedV2_IconOnly_C_GetDisplayAnimation::ReturnValue' has a wrong offset!");

}

