#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EscapeMenu_LeftVBox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "EscapeMenu_KindOfLeave_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function WBP_EscapeMenu_LeftVBox.WBP_EscapeMenu_LeftVBox_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_EscapeMenu_LeftVBox_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_EscapeMenu_LeftVBox_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_EscapeMenu_LeftVBox_C_OnFocusReceived");
static_assert(sizeof(WBP_EscapeMenu_LeftVBox_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_EscapeMenu_LeftVBox_C_OnFocusReceived");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_EscapeMenu_LeftVBox_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_EscapeMenu_LeftVBox_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_EscapeMenu_LeftVBox_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_EscapeMenu_LeftVBox_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_EscapeMenu_LeftVBox.WBP_EscapeMenu_LeftVBox_C.OnAliveStateChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_EscapeMenu_LeftVBox_C_OnAliveStateChanged final
{
public:
	class AGzPlayerState*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_LeftVBox_C_OnAliveStateChanged) == 0x000008, "Wrong alignment on WBP_EscapeMenu_LeftVBox_C_OnAliveStateChanged");
static_assert(sizeof(WBP_EscapeMenu_LeftVBox_C_OnAliveStateChanged) == 0x000008, "Wrong size on WBP_EscapeMenu_LeftVBox_C_OnAliveStateChanged");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_OnAliveStateChanged, PlayerState) == 0x000000, "Member 'WBP_EscapeMenu_LeftVBox_C_OnAliveStateChanged::PlayerState' has a wrong offset!");

// Function WBP_EscapeMenu_LeftVBox.WBP_EscapeMenu_LeftVBox_C.ExecuteUbergraph_WBP_EscapeMenu_LeftVBox
// 0x0168 (0x0168 - 0x0000)
struct WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5092[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EscapeMenu_KindOfLeave                        Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EscapeMenu_KindOfLeave                        Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5093[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzOfflineSessionManager*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInOfflineSession_ReturnValue;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EscapeMenu_KindOfLeave                        Temp_byte_Variable_3;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EscapeMenu_KindOfLeave                        Temp_byte_Variable_4;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5094[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzOfflineSessionManager*               CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInOfflineSession_ReturnValue_1;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EscapeMenu_KindOfLeave                        K2Node_Select_Default;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5095[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5096[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzNavigationWidget*                    CallFunc_AddWidgetCached_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_EscapeMenu_ExitPrompt_C*           K2Node_DynamicCast_AsWBP_Escape_Menu_Exit_Prompt;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5097[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_EscapeMenu_C*>              CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_EscapeMenu_C*                      CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5098[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         K2Node_CustomEvent_PlayerState;                    // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzAliveState                                 CallFunc_GetPlayerAliveState_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5099[0x5];                                     // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         K2Node_DynamicCast_AsGz_Player_State;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509A[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509B[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerController*                    K2Node_DynamicCast_AsGz_Player_Controller;         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509C[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509D[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         K2Node_DynamicCast_AsGz_Player_State_1;            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509E[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue_1;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGzNavigationWidget*                    CallFunc_AddWidgetCached_ReturnValue_1;            // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509F[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_EscapeMenu_ExitPrompt_C*           K2Node_DynamicCast_AsWBP_Escape_Menu_Exit_Prompt_1; // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EscapeMenu_KindOfLeave                        K2Node_Select_Default_1;                           // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox) == 0x000008, "Wrong alignment on WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox");
static_assert(sizeof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox) == 0x000168, "Wrong size on WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, EntryPoint) == 0x000000, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, Temp_byte_Variable) == 0x000010, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, Temp_bool_Variable) == 0x000011, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, Temp_byte_Variable_2) == 0x000013, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, Temp_bool_Variable_1) == 0x000020, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_IsInOfflineSession_ReturnValue) == 0x000021, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_IsInOfflineSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, Temp_byte_Variable_3) == 0x000022, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, Temp_byte_Variable_4) == 0x000023, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000028, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_IsInOfflineSession_ReturnValue_1) == 0x000030, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_IsInOfflineSession_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_Select_Default) == 0x000031, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_GetNavigationRoot_ReturnValue) == 0x000048, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_GetNavigationRoot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_AddWidgetCached_ReturnValue) == 0x000050, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_AddWidgetCached_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_DynamicCast_AsWBP_Escape_Menu_Exit_Prompt) == 0x000058, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_DynamicCast_AsWBP_Escape_Menu_Exit_Prompt' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_ComponentBoundEvent_Button_6) == 0x000068, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_ComponentBoundEvent_Button_5) == 0x000070, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_ComponentBoundEvent_Button_4) == 0x000078, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_ComponentBoundEvent_Button_3) == 0x000080, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000088, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_Array_Get_Item) == 0x000098, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, Temp_byte_Variable_5) == 0x0000A0, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A8, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_CustomEvent_PlayerState) == 0x0000B0, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_GetPlayerAliveState_ReturnValue) == 0x0000B9, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_GetPlayerAliveState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000BA, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_DynamicCast_AsGz_Player_State) == 0x0000C0, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_DynamicCast_AsGz_Player_State' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_ComponentBoundEvent_Button_2) == 0x0000D0, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000D8, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_IsValid_ReturnValue_1) == 0x0000E0, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_DynamicCast_AsGz_Player_Controller) == 0x0000E8, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_DynamicCast_AsGz_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0000F8, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_CreateDelegate_OutputDelegate_1) == 0x000100, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_ComponentBoundEvent_Button_1) == 0x000110, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_IsValid_ReturnValue_2) == 0x000118, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_DynamicCast_AsGz_Player_State_1) == 0x000120, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_DynamicCast_AsGz_Player_State_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_DynamicCast_bSuccess_3) == 0x000128, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_GetNavigationRoot_ReturnValue_1) == 0x000130, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_GetNavigationRoot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000138, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_AddWidgetCached_ReturnValue_1) == 0x000148, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_AddWidgetCached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000150, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_DynamicCast_AsWBP_Escape_Menu_Exit_Prompt_1) == 0x000158, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_DynamicCast_AsWBP_Escape_Menu_Exit_Prompt_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_DynamicCast_bSuccess_4) == 0x000160, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, Temp_bool_Variable_2) == 0x000161, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_Select_Default_1) == 0x000162, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox, K2Node_Select_Default_2) == 0x000163, "Member 'WBP_EscapeMenu_LeftVBox_C_ExecuteUbergraph_WBP_EscapeMenu_LeftVBox::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_EscapeMenu_LeftVBox.WBP_EscapeMenu_LeftVBox_C.DoCustomNavigation
// 0x0038 (0x0038 - 0x0000)
struct WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A0[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A1[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A2[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlayerProfileItem_C*               K2Node_DynamicCast_AsWBP_Player_Profile_Item;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation) == 0x000008, "Wrong alignment on WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation");
static_assert(sizeof(WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation) == 0x000038, "Wrong size on WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation, Param_Navigation) == 0x000000, "Member 'WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation, ReturnValue) == 0x000008, "Member 'WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation, CallFunc_GetChildrenCount_ReturnValue) == 0x000014, "Member 'WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation, K2Node_DynamicCast_AsWBP_Player_Profile_Item) == 0x000028, "Member 'WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation::K2Node_DynamicCast_AsWBP_Player_Profile_Item' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_EscapeMenu_LeftVBox_C_DoCustomNavigation::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_EscapeMenu_LeftVBox.WBP_EscapeMenu_LeftVBox_C.BndEvt__WBP_EscapeMenu_LeftVBox_SwitchTutorial_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_SwitchTutorial_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_SwitchTutorial_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_SwitchTutorial_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_SwitchTutorial_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_SwitchTutorial_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_SwitchTutorial_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_SwitchTutorial_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_EscapeMenu_LeftVBox.WBP_EscapeMenu_LeftVBox_C.BndEvt__WBP_EscapeMenu_LeftVBox_SuicideButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_SuicideButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_SuicideButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_SuicideButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_SuicideButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_SuicideButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_SuicideButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_SuicideButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_EscapeMenu_LeftVBox.WBP_EscapeMenu_LeftVBox_C.BndEvt__WBP_EscapeMenu_LeftVBox_Settings_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Settings_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Settings_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Settings_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Settings_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Settings_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Settings_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Settings_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_EscapeMenu_LeftVBox.WBP_EscapeMenu_LeftVBox_C.BndEvt__WBP_EscapeMenu_LeftVBox_Scoreboard_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Scoreboard_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Scoreboard_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Scoreboard_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Scoreboard_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Scoreboard_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Scoreboard_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Scoreboard_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_EscapeMenu_LeftVBox.WBP_EscapeMenu_LeftVBox_C.BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_EscapeMenu_LeftVBox.WBP_EscapeMenu_LeftVBox_C.BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_LeaveMatch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_EscapeMenu_LeftVBox.WBP_EscapeMenu_LeftVBox_C.BndEvt__WBP_EscapeMenu_LeftVBox_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_EscapeMenu_LeftVBox_C_BndEvt__WBP_EscapeMenu_LeftVBox_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_EscapeMenu_LeftVBox.WBP_EscapeMenu_LeftVBox_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_EscapeMenu_LeftVBox_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_LeftVBox_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_EscapeMenu_LeftVBox_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_EscapeMenu_LeftVBox_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_EscapeMenu_LeftVBox_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_EscapeMenu_LeftVBox_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_EscapeMenu_LeftVBox_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

