#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Vehicle_Layout

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function WBP_Vehicle_Layout.WBP_Vehicle_Layout_C.ExecuteUbergraph_WBP_Vehicle_Layout
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6694[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           K2Node_CustomEvent_Character;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzVehicleSeatType                            K2Node_CustomEvent_NewSeat;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzVehicleSeatType                            K2Node_CustomEvent_OldSeat;                        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6695[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_Int64ToByte_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6696[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzVehicle*                             CallFunc_GetCurrentVehicle_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6697[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGzVehicleConfig*                 CallFunc_GetVehicleConfig_ReturnValue;             // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6698[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Vehicle_Seat_C*                    CallFunc_Map_Find_Value;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6699[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EGzVehicleSeatType>                    CallFunc_Map_Keys_Keys;                            // 0x0058(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzVehicleSeatType                            CallFunc_Array_Get_Item;                           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669A[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Vehicle_Seat_C*                    CallFunc_Map_Find_Value_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669B[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           CallFunc_GetCharacterInSeat_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGzPlayerViewTargetInterface> K2Node_DynamicCast_AsGz_Player_View_Target_Interface; // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669C[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetViewTargetPlayerState_ReturnValue;     // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSeat_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669D[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669E[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         Temp_object_Variable;                              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669F[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetTeamAttitude_ReturnValue;              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout) == 0x000008, "Wrong alignment on WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout");
static_assert(sizeof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout) == 0x0000E0, "Wrong size on WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, EntryPoint) == 0x000000, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, K2Node_CustomEvent_Character) == 0x000008, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, K2Node_CustomEvent_NewSeat) == 0x000010, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::K2Node_CustomEvent_NewSeat' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, K2Node_CustomEvent_OldSeat) == 0x000011, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::K2Node_CustomEvent_OldSeat' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_IsValid_ReturnValue) == 0x000012, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_Conv_ByteToInt64_ReturnValue) == 0x000018, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_Conv_ByteToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_Conv_Int64ToByte_ReturnValue) == 0x000020, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_Conv_Int64ToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_GetCurrentVehicle_ReturnValue) == 0x000028, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_GetCurrentVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_GetVehicleConfig_ReturnValue) == 0x000038, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_GetVehicleConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, Temp_int_Array_Index_Variable) == 0x000044, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_Map_Find_Value) == 0x000048, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_Map_Find_ReturnValue) == 0x000050, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_Map_Keys_Keys) == 0x000058, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_Array_Get_Item) == 0x00006C, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_Map_Find_Value_1) == 0x000070, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_Map_Find_ReturnValue_1) == 0x000078, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_GetCharacterInSeat_ReturnValue) == 0x000080, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_GetCharacterInSeat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, K2Node_DynamicCast_AsGz_Player_View_Target_Interface) == 0x000088, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::K2Node_DynamicCast_AsGz_Player_View_Target_Interface' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_IsValid_ReturnValue_2) == 0x000099, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_GetViewTargetPlayerState_ReturnValue) == 0x0000A0, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_GetViewTargetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_HasSeat_ReturnValue) == 0x0000A8, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_HasSeat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_Add_IntInt_ReturnValue) == 0x0000AC, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, Temp_object_Variable) == 0x0000B8, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_IsValid_ReturnValue_3) == 0x0000C1, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x0000C8, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_GetPlayerState_ReturnValue) == 0x0000D0, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_GetTeamAttitude_ReturnValue) == 0x0000D8, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_GetTeamAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000D9, "Member 'WBP_Vehicle_Layout_C_ExecuteUbergraph_WBP_Vehicle_Layout::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_Vehicle_Layout.WBP_Vehicle_Layout_C.OnSeatChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_Vehicle_Layout_C_OnSeatChanged final
{
public:
	class AGzCharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzVehicleSeatType                            NewSeat;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzVehicleSeatType                            OldSeat;                                           // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Vehicle_Layout_C_OnSeatChanged) == 0x000008, "Wrong alignment on WBP_Vehicle_Layout_C_OnSeatChanged");
static_assert(sizeof(WBP_Vehicle_Layout_C_OnSeatChanged) == 0x000010, "Wrong size on WBP_Vehicle_Layout_C_OnSeatChanged");
static_assert(offsetof(WBP_Vehicle_Layout_C_OnSeatChanged, Character) == 0x000000, "Member 'WBP_Vehicle_Layout_C_OnSeatChanged::Character' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_OnSeatChanged, NewSeat) == 0x000008, "Member 'WBP_Vehicle_Layout_C_OnSeatChanged::NewSeat' has a wrong offset!");
static_assert(offsetof(WBP_Vehicle_Layout_C_OnSeatChanged, OldSeat) == 0x000009, "Member 'WBP_Vehicle_Layout_C_OnSeatChanged::OldSeat' has a wrong offset!");

}

