#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EventLogNotification

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Enum_EventLogTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_EventLogNotification.WBP_EventLogNotification_C.BuildEntry
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_EventLogNotification_C_BuildEntry final
{
public:
	TMap<class UClass*, Enum_EventLogTypes>       MessageTypesMap;                                   // 0x0000(0x0050)(Edit, BlueprintVisible)
	TMap<class UClass*, Enum_EventLogTypes>       K2Node_MakeVariable_MakeVariableOutput;            // 0x0050(0x0050)()
	Enum_EventLogTypes                            CallFunc_Map_Find_Value;                           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EventLogNotification_C_BuildEntry) == 0x000008, "Wrong alignment on WBP_EventLogNotification_C_BuildEntry");
static_assert(sizeof(WBP_EventLogNotification_C_BuildEntry) == 0x0000A8, "Wrong size on WBP_EventLogNotification_C_BuildEntry");
static_assert(offsetof(WBP_EventLogNotification_C_BuildEntry, MessageTypesMap) == 0x000000, "Member 'WBP_EventLogNotification_C_BuildEntry::MessageTypesMap' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_BuildEntry, K2Node_MakeVariable_MakeVariableOutput) == 0x000050, "Member 'WBP_EventLogNotification_C_BuildEntry::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_BuildEntry, CallFunc_Map_Find_Value) == 0x0000A0, "Member 'WBP_EventLogNotification_C_BuildEntry::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_BuildEntry, CallFunc_Map_Find_ReturnValue) == 0x0000A1, "Member 'WBP_EventLogNotification_C_BuildEntry::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_BuildEntry, K2Node_SwitchEnum_CmpSuccess) == 0x0000A2, "Member 'WBP_EventLogNotification_C_BuildEntry::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_EventLogNotification.WBP_EventLogNotification_C.ExecuteUbergraph_WBP_EventLogNotification
// 0x0048 (0x0048 - 0x0000)
struct WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D5D[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D5E[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification) == 0x000008, "Wrong alignment on WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification");
static_assert(sizeof(WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification) == 0x000048, "Wrong size on WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification");
static_assert(offsetof(WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification, EntryPoint) == 0x000000, "Member 'WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000030, "Member 'WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000038, "Member 'WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000044, "Member 'WBP_EventLogNotification_C_ExecuteUbergraph_WBP_EventLogNotification::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function WBP_EventLogNotification.WBP_EventLogNotification_C.SetActionDescription
// 0x0001 (0x0001 - 0x0000)
struct WBP_EventLogNotification_C_SetActionDescription final
{
public:
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EventLogNotification_C_SetActionDescription) == 0x000001, "Wrong alignment on WBP_EventLogNotification_C_SetActionDescription");
static_assert(sizeof(WBP_EventLogNotification_C_SetActionDescription) == 0x000001, "Wrong size on WBP_EventLogNotification_C_SetActionDescription");
static_assert(offsetof(WBP_EventLogNotification_C_SetActionDescription, CallFunc_TextIsEmpty_ReturnValue) == 0x000000, "Member 'WBP_EventLogNotification_C_SetActionDescription::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_EventLogNotification.WBP_EventLogNotification_C.SetIconTexture
// 0x0170 (0x0170 - 0x0000)
struct WBP_EventLogNotification_C_SetIconTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImageElement;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        IconHeight;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D5F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D60[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D61[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D62[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D63[0xC];                                     // 0x0074(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0080(0x00D0)()
	struct FVector2D                              CallFunc_BreakVector2D_InVec_ImplicitCast;         // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EventLogNotification_C_SetIconTexture) == 0x000010, "Wrong alignment on WBP_EventLogNotification_C_SetIconTexture");
static_assert(sizeof(WBP_EventLogNotification_C_SetIconTexture) == 0x000170, "Wrong size on WBP_EventLogNotification_C_SetIconTexture");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, Texture) == 0x000000, "Member 'WBP_EventLogNotification_C_SetIconTexture::Texture' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, ImageElement) == 0x000008, "Member 'WBP_EventLogNotification_C_SetIconTexture::ImageElement' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, SizeBox) == 0x000010, "Member 'WBP_EventLogNotification_C_SetIconTexture::SizeBox' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, IconHeight) == 0x000018, "Member 'WBP_EventLogNotification_C_SetIconTexture::IconHeight' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_BreakVector2D_X) == 0x000028, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_FTrunc_ReturnValue) == 0x000038, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_IsValid_ReturnValue_1) == 0x00003C, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x000040, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000048, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x000050, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000058, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_SafeDivide_ReturnValue) == 0x000060, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_FTrunc_ReturnValue_1) == 0x000070, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000080, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_BreakVector2D_InVec_ImplicitCast) == 0x000150, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_BreakVector2D_InVec_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000160, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetIconTexture, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000164, "Member 'WBP_EventLogNotification_C_SetIconTexture::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

// Function WBP_EventLogNotification.WBP_EventLogNotification_C.SetInstigatorText
// 0x0002 (0x0002 - 0x0000)
struct WBP_EventLogNotification_C_SetInstigatorText final
{
public:
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EventLogNotification_C_SetInstigatorText) == 0x000001, "Wrong alignment on WBP_EventLogNotification_C_SetInstigatorText");
static_assert(sizeof(WBP_EventLogNotification_C_SetInstigatorText) == 0x000002, "Wrong size on WBP_EventLogNotification_C_SetInstigatorText");
static_assert(offsetof(WBP_EventLogNotification_C_SetInstigatorText, CallFunc_TextIsEmpty_ReturnValue) == 0x000000, "Member 'WBP_EventLogNotification_C_SetInstigatorText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetInstigatorText, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_EventLogNotification_C_SetInstigatorText::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_EventLogNotification.WBP_EventLogNotification_C.SetTextColour
// 0x0048 (0x0048 - 0x0000)
struct WBP_EventLogNotification_C_SetTextColour final
{
public:
	class UTextBlock*                             TextElement;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         PlayerState;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamId_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D64[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D65[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzBattleRoyalePlayerState*             K2Node_DynamicCast_AsGz_Battle_Royale_Player_State; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D66[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamId_ReturnValue_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EventLogNotification_C_SetTextColour) == 0x000008, "Wrong alignment on WBP_EventLogNotification_C_SetTextColour");
static_assert(sizeof(WBP_EventLogNotification_C_SetTextColour) == 0x000048, "Wrong size on WBP_EventLogNotification_C_SetTextColour");
static_assert(offsetof(WBP_EventLogNotification_C_SetTextColour, TextElement) == 0x000000, "Member 'WBP_EventLogNotification_C_SetTextColour::TextElement' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetTextColour, PlayerState) == 0x000008, "Member 'WBP_EventLogNotification_C_SetTextColour::PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetTextColour, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'WBP_EventLogNotification_C_SetTextColour::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetTextColour, CallFunc_GetTeamId_ReturnValue) == 0x000018, "Member 'WBP_EventLogNotification_C_SetTextColour::CallFunc_GetTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetTextColour, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000020, "Member 'WBP_EventLogNotification_C_SetTextColour::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetTextColour, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_EventLogNotification_C_SetTextColour::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetTextColour, K2Node_DynamicCast_AsGz_Battle_Royale_Player_State) == 0x000030, "Member 'WBP_EventLogNotification_C_SetTextColour::K2Node_DynamicCast_AsGz_Battle_Royale_Player_State' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetTextColour, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_EventLogNotification_C_SetTextColour::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetTextColour, CallFunc_GetTeamId_ReturnValue_1) == 0x00003C, "Member 'WBP_EventLogNotification_C_SetTextColour::CallFunc_GetTeamId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetTextColour, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000040, "Member 'WBP_EventLogNotification_C_SetTextColour::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetTextColour, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000041, "Member 'WBP_EventLogNotification_C_SetTextColour::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_EventLogNotification.WBP_EventLogNotification_C.SetVictimText
// 0x0002 (0x0002 - 0x0000)
struct WBP_EventLogNotification_C_SetVictimText final
{
public:
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EventLogNotification_C_SetVictimText) == 0x000001, "Wrong alignment on WBP_EventLogNotification_C_SetVictimText");
static_assert(sizeof(WBP_EventLogNotification_C_SetVictimText) == 0x000002, "Wrong size on WBP_EventLogNotification_C_SetVictimText");
static_assert(offsetof(WBP_EventLogNotification_C_SetVictimText, CallFunc_TextIsEmpty_ReturnValue) == 0x000000, "Member 'WBP_EventLogNotification_C_SetVictimText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification_C_SetVictimText, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_EventLogNotification_C_SetVictimText::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

