#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusEffect_Container

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_StatusEffect_Container.WBP_StatusEffect_Container_C.BindSlots
// 0x0078 (0x0078 - 0x0000)
struct WBP_StatusEffect_Container_C_BindSlots final
{
public:
	TArray<class UWidget*>                        Slots;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_StatusEffrctSlotBase_C* Slot)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_StatusEffrctSlotBase_C* Slot)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C64[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_StatusEffrctSlotBase_C*            K2Node_DynamicCast_AsWBP_Status_Effrct_Slot_Base;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C65[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C66[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffect_Container_C_BindSlots) == 0x000008, "Wrong alignment on WBP_StatusEffect_Container_C_BindSlots");
static_assert(sizeof(WBP_StatusEffect_Container_C_BindSlots) == 0x000078, "Wrong size on WBP_StatusEffect_Container_C_BindSlots");
static_assert(offsetof(WBP_StatusEffect_Container_C_BindSlots, Slots) == 0x000000, "Member 'WBP_StatusEffect_Container_C_BindSlots::Slots' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_BindSlots, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_StatusEffect_Container_C_BindSlots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_BindSlots, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_StatusEffect_Container_C_BindSlots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_BindSlots, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_StatusEffect_Container_C_BindSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_BindSlots, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_StatusEffect_Container_C_BindSlots::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_BindSlots, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_StatusEffect_Container_C_BindSlots::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_BindSlots, CallFunc_GetAllChildren_ReturnValue) == 0x000040, "Member 'WBP_StatusEffect_Container_C_BindSlots::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_BindSlots, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_StatusEffect_Container_C_BindSlots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_BindSlots, K2Node_DynamicCast_AsWBP_Status_Effrct_Slot_Base) == 0x000058, "Member 'WBP_StatusEffect_Container_C_BindSlots::K2Node_DynamicCast_AsWBP_Status_Effrct_Slot_Base' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_BindSlots, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_StatusEffect_Container_C_BindSlots::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_BindSlots, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'WBP_StatusEffect_Container_C_BindSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_BindSlots, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'WBP_StatusEffect_Container_C_BindSlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_BindSlots, CallFunc_Array_AddUnique_ReturnValue) == 0x00006C, "Member 'WBP_StatusEffect_Container_C_BindSlots::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_BindSlots, CallFunc_Array_Contains_ReturnValue) == 0x000070, "Member 'WBP_StatusEffect_Container_C_BindSlots::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function WBP_StatusEffect_Container.WBP_StatusEffect_Container_C.ExecuteUbergraph_WBP_StatusEffect_Container
// 0x0020 (0x0020 - 0x0000)
struct WBP_StatusEffect_Container_C_ExecuteUbergraph_WBP_StatusEffect_Container final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C67[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_StatusEffrctSlotBase_C*            K2Node_CustomEvent_Slot;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_StatusEffrctSlotBase_C*            K2Node_CustomEvent_Slot_1;                         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffect_Container_C_ExecuteUbergraph_WBP_StatusEffect_Container) == 0x000008, "Wrong alignment on WBP_StatusEffect_Container_C_ExecuteUbergraph_WBP_StatusEffect_Container");
static_assert(sizeof(WBP_StatusEffect_Container_C_ExecuteUbergraph_WBP_StatusEffect_Container) == 0x000020, "Wrong size on WBP_StatusEffect_Container_C_ExecuteUbergraph_WBP_StatusEffect_Container");
static_assert(offsetof(WBP_StatusEffect_Container_C_ExecuteUbergraph_WBP_StatusEffect_Container, EntryPoint) == 0x000000, "Member 'WBP_StatusEffect_Container_C_ExecuteUbergraph_WBP_StatusEffect_Container::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_ExecuteUbergraph_WBP_StatusEffect_Container, K2Node_CustomEvent_Slot) == 0x000008, "Member 'WBP_StatusEffect_Container_C_ExecuteUbergraph_WBP_StatusEffect_Container::K2Node_CustomEvent_Slot' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_ExecuteUbergraph_WBP_StatusEffect_Container, K2Node_CustomEvent_Slot_1) == 0x000010, "Member 'WBP_StatusEffect_Container_C_ExecuteUbergraph_WBP_StatusEffect_Container::K2Node_CustomEvent_Slot_1' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_ExecuteUbergraph_WBP_StatusEffect_Container, CallFunc_Array_Contains_ReturnValue) == 0x000018, "Member 'WBP_StatusEffect_Container_C_ExecuteUbergraph_WBP_StatusEffect_Container::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function WBP_StatusEffect_Container.WBP_StatusEffect_Container_C.OnFinishedBlinking
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatusEffect_Container_C_OnFinishedBlinking final
{
public:
	class UWBP_StatusEffrctSlotBase_C*            Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffect_Container_C_OnFinishedBlinking) == 0x000008, "Wrong alignment on WBP_StatusEffect_Container_C_OnFinishedBlinking");
static_assert(sizeof(WBP_StatusEffect_Container_C_OnFinishedBlinking) == 0x000008, "Wrong size on WBP_StatusEffect_Container_C_OnFinishedBlinking");
static_assert(offsetof(WBP_StatusEffect_Container_C_OnFinishedBlinking, Param_Slot) == 0x000000, "Member 'WBP_StatusEffect_Container_C_OnFinishedBlinking::Param_Slot' has a wrong offset!");

// Function WBP_StatusEffect_Container.WBP_StatusEffect_Container_C.OnStartBlinking
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatusEffect_Container_C_OnStartBlinking final
{
public:
	class UWBP_StatusEffrctSlotBase_C*            Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffect_Container_C_OnStartBlinking) == 0x000008, "Wrong alignment on WBP_StatusEffect_Container_C_OnStartBlinking");
static_assert(sizeof(WBP_StatusEffect_Container_C_OnStartBlinking) == 0x000008, "Wrong size on WBP_StatusEffect_Container_C_OnStartBlinking");
static_assert(offsetof(WBP_StatusEffect_Container_C_OnStartBlinking, Param_Slot) == 0x000000, "Member 'WBP_StatusEffect_Container_C_OnStartBlinking::Param_Slot' has a wrong offset!");

// Function WBP_StatusEffect_Container.WBP_StatusEffect_Container_C.UpdateBlinking
// 0x0020 (0x0020 - 0x0000)
struct WBP_StatusEffect_Container_C_UpdateBlinking final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_StatusEffrctSlotBase_C*            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffect_Container_C_UpdateBlinking) == 0x000008, "Wrong alignment on WBP_StatusEffect_Container_C_UpdateBlinking");
static_assert(sizeof(WBP_StatusEffect_Container_C_UpdateBlinking) == 0x000020, "Wrong size on WBP_StatusEffect_Container_C_UpdateBlinking");
static_assert(offsetof(WBP_StatusEffect_Container_C_UpdateBlinking, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_StatusEffect_Container_C_UpdateBlinking::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_UpdateBlinking, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_StatusEffect_Container_C_UpdateBlinking::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_UpdateBlinking, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_StatusEffect_Container_C_UpdateBlinking::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_UpdateBlinking, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WBP_StatusEffect_Container_C_UpdateBlinking::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_UpdateBlinking, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_StatusEffect_Container_C_UpdateBlinking::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_Container_C_UpdateBlinking, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WBP_StatusEffect_Container_C_UpdateBlinking::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

