#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Crosshair_Cyberlimbs_Gorilla_New

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Crosshair_Cyberlimbs_Gorilla_New.WBP_Crosshair_Cyberlimbs_Gorilla_New_C.ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New
// 0x01D8 (0x01D8 - 0x0000)
struct WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F0[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable_1;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F1[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_4;                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_5;                            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   Temp_byte_Variable_2;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F2[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_6;                            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_7;                            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_8;                            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_BP_GetAbilityComponent_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           K2Node_Select_Default;                             // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzGorillaArmComponent*                 K2Node_DynamicCast_AsGz_Gorilla_Arm_Component;     // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F3[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_CurrentValue;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_MaxValue;                             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F4[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   K2Node_Event_LimbType_1;                           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F5[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzLimbGaugeData                       K2Node_Event_GaugeData;                            // 0x00E8(0x0028)(ConstParm, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0110(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F6[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzGA_GorillaArm*                       K2Node_DynamicCast_AsGz_GA_Gorilla_Arm;            // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F7[0x3];                                     // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetChargeProgress_ReturnValue;            // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F8[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   K2Node_Event_LimbType;                             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F9[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GorillaArm_Component_C*             K2Node_DynamicCast_AsBP_Gorilla_Arm_Component;     // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65FA[0x5];                                     // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           K2Node_Select_Default_1;                           // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           K2Node_Select_Default_2;                           // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast;                // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentValue_NewValue_ImplicitCast;    // 0x01C4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New) == 0x000008, "Wrong alignment on WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New");
static_assert(sizeof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New) == 0x0001D8, "Wrong size on WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, EntryPoint) == 0x000000, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, Temp_byte_Variable) == 0x000024, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, Temp_object_Variable) == 0x000038, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, Temp_object_Variable_1) == 0x000040, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, Temp_object_Variable_2) == 0x000048, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, Temp_byte_Variable_1) == 0x000050, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, Temp_object_Variable_3) == 0x000058, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, Temp_object_Variable_4) == 0x000060, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, Temp_object_Variable_5) == 0x000068, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, Temp_byte_Variable_2) == 0x000070, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, Temp_object_Variable_6) == 0x000078, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, Temp_object_Variable_7) == 0x000080, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, Temp_object_Variable_8) == 0x000088, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_BP_GetAbilityComponent_ReturnValue) == 0x000090, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_BP_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_Select_Default) == 0x000098, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_DynamicCast_AsGz_Gorilla_Arm_Component) == 0x0000A0, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_DynamicCast_AsGz_Gorilla_Arm_Component' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_Event_CurrentValue) == 0x0000AC, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_Event_CurrentValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_Event_MaxValue) == 0x0000B0, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_Event_MaxValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_SafeDivide_ReturnValue) == 0x0000B8, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000C8, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D0, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_Event_LimbType_1) == 0x0000E0, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_Event_LimbType_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_Event_GaugeData) == 0x0000E8, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_Event_GaugeData' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_Event_MyGeometry) == 0x000110, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_Event_InDeltaTime) == 0x000148, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_DynamicCast_AsGz_GA_Gorilla_Arm) == 0x000150, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_DynamicCast_AsGz_GA_Gorilla_Arm' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_GetChargeProgress_ReturnValue) == 0x00015C, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_GetChargeProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_MapRangeClamped_ReturnValue) == 0x000160, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000168, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_PlayAnimation_ReturnValue) == 0x000178, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_Event_LimbType) == 0x000180, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_Event_LimbType' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_DynamicCast_AsBP_Gorilla_Arm_Component) == 0x000188, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_DynamicCast_AsBP_Gorilla_Arm_Component' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_DynamicCast_bSuccess_2) == 0x000190, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_IsValid_ReturnValue_1) == 0x000191, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_IsValid_ReturnValue_2) == 0x000192, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_Select_Default_1) == 0x000198, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, K2Node_Select_Default_2) == 0x0001A0, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_SafeDivide_A_ImplicitCast) == 0x0001A8, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_SafeDivide_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0001B0, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_SafeDivide_B_ImplicitCast) == 0x0001B8, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_SafeDivide_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0001C0, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_SetCurrentValue_NewValue_ImplicitCast) == 0x0001C4, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_SetCurrentValue_NewValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x0001C8, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x0001D0, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Gorilla_New::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

// Function WBP_Crosshair_Cyberlimbs_Gorilla_New.WBP_Crosshair_Cyberlimbs_Gorilla_New_C.OnLimbActivated
// 0x0030 (0x0030 - 0x0000)
struct WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivated final
{
public:
	EGzLimbType                                   LimbType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65FB[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzLimbGaugeData                       GaugeData;                                         // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivated) == 0x000008, "Wrong alignment on WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivated");
static_assert(sizeof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivated) == 0x000030, "Wrong size on WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivated");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivated, LimbType) == 0x000000, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivated::LimbType' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivated, GaugeData) == 0x000008, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivated::GaugeData' has a wrong offset!");

// Function WBP_Crosshair_Cyberlimbs_Gorilla_New.WBP_Crosshair_Cyberlimbs_Gorilla_New_C.OnLimbActivationEnded
// 0x0001 (0x0001 - 0x0000)
struct WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivationEnded final
{
public:
	EGzLimbType                                   LimbType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivationEnded) == 0x000001, "Wrong alignment on WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivationEnded");
static_assert(sizeof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivationEnded) == 0x000001, "Wrong size on WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivationEnded");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivationEnded, LimbType) == 0x000000, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_OnLimbActivationEnded::LimbType' has a wrong offset!");

// Function WBP_Crosshair_Cyberlimbs_Gorilla_New.WBP_Crosshair_Cyberlimbs_Gorilla_New_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Crosshair_Cyberlimbs_Gorilla_New_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_Tick) == 0x000004, "Wrong alignment on WBP_Crosshair_Cyberlimbs_Gorilla_New_C_Tick");
static_assert(sizeof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_Tick) == 0x00003C, "Wrong size on WBP_Crosshair_Cyberlimbs_Gorilla_New_C_Tick");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Crosshair_Cyberlimbs_Gorilla_New.WBP_Crosshair_Cyberlimbs_Gorilla_New_C.UdpateValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UdpateValue final
{
public:
	float                                         CurrentValue;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UdpateValue) == 0x000004, "Wrong alignment on WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UdpateValue");
static_assert(sizeof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UdpateValue) == 0x000008, "Wrong size on WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UdpateValue");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UdpateValue, CurrentValue) == 0x000000, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UdpateValue::CurrentValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UdpateValue, MaxValue) == 0x000004, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UdpateValue::MaxValue' has a wrong offset!");

// Function WBP_Crosshair_Cyberlimbs_Gorilla_New.WBP_Crosshair_Cyberlimbs_Gorilla_New_C.UpdateDistanceTooltip
// 0x0058 (0x0058 - 0x0000)
struct WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip final
{
public:
	bool                                          bIsHit;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65FC[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetChargeProgress_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FCeil64_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0028(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0038(0x0010)(ConstParm)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip) == 0x000008, "Wrong alignment on WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip");
static_assert(sizeof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip) == 0x000058, "Wrong size on WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip, bIsHit) == 0x000000, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip::bIsHit' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip, Temp_bool_Variable) == 0x000001, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip, CallFunc_GetChargeProgress_ReturnValue) == 0x000004, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip::CallFunc_GetChargeProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip, CallFunc_FCeil64_ReturnValue) == 0x000020, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip::CallFunc_FCeil64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000028, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip, K2Node_Select_Default) == 0x000038, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000048, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateDistanceTooltip::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_Crosshair_Cyberlimbs_Gorilla_New.WBP_Crosshair_Cyberlimbs_Gorilla_New_C.UpdateTooltipText
// 0x0001 (0x0001 - 0x0000)
struct WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateTooltipText final
{
public:
	bool                                          bChargeInProgress;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateTooltipText) == 0x000001, "Wrong alignment on WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateTooltipText");
static_assert(sizeof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateTooltipText) == 0x000001, "Wrong size on WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateTooltipText");
static_assert(offsetof(WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateTooltipText, bChargeInProgress) == 0x000000, "Member 'WBP_Crosshair_Cyberlimbs_Gorilla_New_C_UpdateTooltipText::bChargeInProgress' has a wrong offset!");

}

