#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hitmark_Leaf

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hitmark_Leaf.WBP_Hitmark_Leaf_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_Hitmark_Leaf_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_HitmarkLeaf;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsCritHitmark;                                     // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C4B[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LeafWidth;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LeafLenghts;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             HitmarkLeafTexture;                                // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Hitmark_Leaf(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hitmark_Leaf_C">();
	}
	static class UWBP_Hitmark_Leaf_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hitmark_Leaf_C>();
	}
};
static_assert(alignof(UWBP_Hitmark_Leaf_C) == 0x000008, "Wrong alignment on UWBP_Hitmark_Leaf_C");
static_assert(sizeof(UWBP_Hitmark_Leaf_C) == 0x000310, "Wrong size on UWBP_Hitmark_Leaf_C");
static_assert(offsetof(UWBP_Hitmark_Leaf_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Hitmark_Leaf_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hitmark_Leaf_C, Image_HitmarkLeaf) == 0x0002E8, "Member 'UWBP_Hitmark_Leaf_C::Image_HitmarkLeaf' has a wrong offset!");
static_assert(offsetof(UWBP_Hitmark_Leaf_C, IsCritHitmark) == 0x0002F0, "Member 'UWBP_Hitmark_Leaf_C::IsCritHitmark' has a wrong offset!");
static_assert(offsetof(UWBP_Hitmark_Leaf_C, LeafWidth) == 0x0002F8, "Member 'UWBP_Hitmark_Leaf_C::LeafWidth' has a wrong offset!");
static_assert(offsetof(UWBP_Hitmark_Leaf_C, LeafLenghts) == 0x000300, "Member 'UWBP_Hitmark_Leaf_C::LeafLenghts' has a wrong offset!");
static_assert(offsetof(UWBP_Hitmark_Leaf_C, HitmarkLeafTexture) == 0x000308, "Member 'UWBP_Hitmark_Leaf_C::HitmarkLeafTexture' has a wrong offset!");

}

