#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MortarLegs_TargetCounter

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MortarLegs_TargetCounter.WBP_MortarLegs_TargetCounter_C.DecrementTargetCount
// 0x0018 (0x0018 - 0x0000)
struct WBP_MortarLegs_TargetCounter_C_DecrementTargetCount final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EFC[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MortarLegs_TargetCounter_C_DecrementTargetCount) == 0x000008, "Wrong alignment on WBP_MortarLegs_TargetCounter_C_DecrementTargetCount");
static_assert(sizeof(WBP_MortarLegs_TargetCounter_C_DecrementTargetCount) == 0x000018, "Wrong size on WBP_MortarLegs_TargetCounter_C_DecrementTargetCount");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_DecrementTargetCount, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'WBP_MortarLegs_TargetCounter_C_DecrementTargetCount::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_DecrementTargetCount, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WBP_MortarLegs_TargetCounter_C_DecrementTargetCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_DecrementTargetCount, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_MortarLegs_TargetCounter_C_DecrementTargetCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_DecrementTargetCount, CallFunc_Clamp_ReturnValue) == 0x000010, "Member 'WBP_MortarLegs_TargetCounter_C_DecrementTargetCount::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function WBP_MortarLegs_TargetCounter.WBP_MortarLegs_TargetCounter_C.ExecuteUbergraph_WBP_MortarLegs_TargetCounter
// 0x0010 (0x0010 - 0x0000)
struct WBP_MortarLegs_TargetCounter_C_ExecuteUbergraph_WBP_MortarLegs_TargetCounter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MortarLegs_TargetCounter_C_ExecuteUbergraph_WBP_MortarLegs_TargetCounter) == 0x000004, "Wrong alignment on WBP_MortarLegs_TargetCounter_C_ExecuteUbergraph_WBP_MortarLegs_TargetCounter");
static_assert(sizeof(WBP_MortarLegs_TargetCounter_C_ExecuteUbergraph_WBP_MortarLegs_TargetCounter) == 0x000010, "Wrong size on WBP_MortarLegs_TargetCounter_C_ExecuteUbergraph_WBP_MortarLegs_TargetCounter");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_ExecuteUbergraph_WBP_MortarLegs_TargetCounter, EntryPoint) == 0x000000, "Member 'WBP_MortarLegs_TargetCounter_C_ExecuteUbergraph_WBP_MortarLegs_TargetCounter::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_ExecuteUbergraph_WBP_MortarLegs_TargetCounter, CallFunc_Array_Add_ReturnValue) == 0x000004, "Member 'WBP_MortarLegs_TargetCounter_C_ExecuteUbergraph_WBP_MortarLegs_TargetCounter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_ExecuteUbergraph_WBP_MortarLegs_TargetCounter, CallFunc_Array_Add_ReturnValue_1) == 0x000008, "Member 'WBP_MortarLegs_TargetCounter_C_ExecuteUbergraph_WBP_MortarLegs_TargetCounter::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_ExecuteUbergraph_WBP_MortarLegs_TargetCounter, CallFunc_Array_Add_ReturnValue_2) == 0x00000C, "Member 'WBP_MortarLegs_TargetCounter_C_ExecuteUbergraph_WBP_MortarLegs_TargetCounter::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

// Function WBP_MortarLegs_TargetCounter.WBP_MortarLegs_TargetCounter_C.IncrementTargetCount
// 0x0018 (0x0018 - 0x0000)
struct WBP_MortarLegs_TargetCounter_C_IncrementTargetCount final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EFD[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MortarLegs_TargetCounter_C_IncrementTargetCount) == 0x000008, "Wrong alignment on WBP_MortarLegs_TargetCounter_C_IncrementTargetCount");
static_assert(sizeof(WBP_MortarLegs_TargetCounter_C_IncrementTargetCount) == 0x000018, "Wrong size on WBP_MortarLegs_TargetCounter_C_IncrementTargetCount");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_IncrementTargetCount, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'WBP_MortarLegs_TargetCounter_C_IncrementTargetCount::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_IncrementTargetCount, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WBP_MortarLegs_TargetCounter_C_IncrementTargetCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_IncrementTargetCount, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_MortarLegs_TargetCounter_C_IncrementTargetCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_IncrementTargetCount, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_MortarLegs_TargetCounter_C_IncrementTargetCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_IncrementTargetCount, CallFunc_Clamp_ReturnValue) == 0x000014, "Member 'WBP_MortarLegs_TargetCounter_C_IncrementTargetCount::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function WBP_MortarLegs_TargetCounter.WBP_MortarLegs_TargetCounter_C.ResetTargetCount
// 0x0020 (0x0020 - 0x0000)
struct WBP_MortarLegs_TargetCounter_C_ResetTargetCount final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EFE[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MortarLegs_TargetCounter_C_ResetTargetCount) == 0x000008, "Wrong alignment on WBP_MortarLegs_TargetCounter_C_ResetTargetCount");
static_assert(sizeof(WBP_MortarLegs_TargetCounter_C_ResetTargetCount) == 0x000020, "Wrong size on WBP_MortarLegs_TargetCounter_C_ResetTargetCount");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_ResetTargetCount, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_MortarLegs_TargetCounter_C_ResetTargetCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_ResetTargetCount, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_MortarLegs_TargetCounter_C_ResetTargetCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_ResetTargetCount, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_MortarLegs_TargetCounter_C_ResetTargetCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_ResetTargetCount, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_MortarLegs_TargetCounter_C_ResetTargetCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_ResetTargetCount, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_MortarLegs_TargetCounter_C_ResetTargetCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_TargetCounter_C_ResetTargetCount, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_MortarLegs_TargetCounter_C_ResetTargetCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

