#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSelection_Capture

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoadoutSelection_Capture.WBP_LoadoutSelection_Capture_C
// 0x0018 (0x03F8 - 0x03E0)
class UWBP_LoadoutSelection_Capture_C final : public UGzLoadoutSlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzTextBlock*                           Arrow;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Title_Text_1;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnLoadoutSlotReady_BP(const struct FGzLoadoutSelectionInitializeData& LoadoutInitializeData);
	void ExecuteUbergraph_WBP_LoadoutSelection_Capture(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoadoutSelection_Capture_C">();
	}
	static class UWBP_LoadoutSelection_Capture_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoadoutSelection_Capture_C>();
	}
};
static_assert(alignof(UWBP_LoadoutSelection_Capture_C) == 0x000008, "Wrong alignment on UWBP_LoadoutSelection_Capture_C");
static_assert(sizeof(UWBP_LoadoutSelection_Capture_C) == 0x0003F8, "Wrong size on UWBP_LoadoutSelection_Capture_C");
static_assert(offsetof(UWBP_LoadoutSelection_Capture_C, UberGraphFrame) == 0x0003E0, "Member 'UWBP_LoadoutSelection_Capture_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Capture_C, Arrow) == 0x0003E8, "Member 'UWBP_LoadoutSelection_Capture_C::Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Capture_C, Title_Text_1) == 0x0003F0, "Member 'UWBP_LoadoutSelection_Capture_C::Title_Text_1' has a wrong offset!");

}

