#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReportPlayerEntry

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReportPlayerEntry.WBP_ReportPlayerEntry_C
// 0x0028 (0x0330 - 0x0308)
class UWBP_ReportPlayerEntry_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_NavigationButton_Action_C*         WBP_NavigationButton_Action_C_0;                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AGzPlayerState*                         GzPlayerState;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWBP_ReportPlayer_C*                    Parent;                                            // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ETeamAttitude                                 Attitude;                                          // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ReportPlayerEntry_WBP_NavigationButton_Action_C_0_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ConstructButton();
	void ExecuteUbergraph_WBP_ReportPlayerEntry(int32 EntryPoint);
	void SetPlayerName();
	void SetStyle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReportPlayerEntry_C">();
	}
	static class UWBP_ReportPlayerEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReportPlayerEntry_C>();
	}
};
static_assert(alignof(UWBP_ReportPlayerEntry_C) == 0x000008, "Wrong alignment on UWBP_ReportPlayerEntry_C");
static_assert(sizeof(UWBP_ReportPlayerEntry_C) == 0x000330, "Wrong size on UWBP_ReportPlayerEntry_C");
static_assert(offsetof(UWBP_ReportPlayerEntry_C, UberGraphFrame) == 0x000308, "Member 'UWBP_ReportPlayerEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ReportPlayerEntry_C, WBP_NavigationButton_Action_C_0) == 0x000310, "Member 'UWBP_ReportPlayerEntry_C::WBP_NavigationButton_Action_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_ReportPlayerEntry_C, GzPlayerState) == 0x000318, "Member 'UWBP_ReportPlayerEntry_C::GzPlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_ReportPlayerEntry_C, Parent) == 0x000320, "Member 'UWBP_ReportPlayerEntry_C::Parent' has a wrong offset!");
static_assert(offsetof(UWBP_ReportPlayerEntry_C, Attitude) == 0x000328, "Member 'UWBP_ReportPlayerEntry_C::Attitude' has a wrong offset!");

}

