#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SquadScreen_MuteButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SquadScreen_MuteButton.WBP_SquadScreen_MuteButton_C
// 0x0030 (0x1660 - 0x1630)
class UWBP_SquadScreen_MuteButton_C final : public UGzCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Mute_Image;                                        // 0x1638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AGzPlayerState*                         Player_State;                                      // 0x1640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FString                                 PlayerEpicID;                                      // 0x1648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void UpdateButtonIcon();
	void TogglePlayerMutedState();
	void SetPlayer(class AGzPlayerState* PlayerState);
	void Init(class AGzPlayerState* PS);
	void ExecuteUbergraph_WBP_SquadScreen_MuteButton(int32 EntryPoint);
	void BP_OnClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SquadScreen_MuteButton_C">();
	}
	static class UWBP_SquadScreen_MuteButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SquadScreen_MuteButton_C>();
	}
};
static_assert(alignof(UWBP_SquadScreen_MuteButton_C) == 0x000010, "Wrong alignment on UWBP_SquadScreen_MuteButton_C");
static_assert(sizeof(UWBP_SquadScreen_MuteButton_C) == 0x001660, "Wrong size on UWBP_SquadScreen_MuteButton_C");
static_assert(offsetof(UWBP_SquadScreen_MuteButton_C, UberGraphFrame) == 0x001630, "Member 'UWBP_SquadScreen_MuteButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SquadScreen_MuteButton_C, Mute_Image) == 0x001638, "Member 'UWBP_SquadScreen_MuteButton_C::Mute_Image' has a wrong offset!");
static_assert(offsetof(UWBP_SquadScreen_MuteButton_C, Player_State) == 0x001640, "Member 'UWBP_SquadScreen_MuteButton_C::Player_State' has a wrong offset!");
static_assert(offsetof(UWBP_SquadScreen_MuteButton_C, PlayerEpicID) == 0x001648, "Member 'UWBP_SquadScreen_MuteButton_C::PlayerEpicID' has a wrong offset!");

}

