#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RewardTooltipSlot

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_RewardTooltipSlot.WBP_RewardTooltipSlot_C.SetReward
// 0x0048 (0x0048 - 0x0000)
struct WBP_RewardTooltipSlot_C_SetReward final
{
public:
	struct FGzMissionRewardWidgetData             Rewards;                                           // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsValid;                                           // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RewardTooltipSlot_C_SetReward) == 0x000008, "Wrong alignment on WBP_RewardTooltipSlot_C_SetReward");
static_assert(sizeof(WBP_RewardTooltipSlot_C_SetReward) == 0x000048, "Wrong size on WBP_RewardTooltipSlot_C_SetReward");
static_assert(offsetof(WBP_RewardTooltipSlot_C_SetReward, Rewards) == 0x000000, "Member 'WBP_RewardTooltipSlot_C_SetReward::Rewards' has a wrong offset!");
static_assert(offsetof(WBP_RewardTooltipSlot_C_SetReward, IsValid) == 0x000038, "Member 'WBP_RewardTooltipSlot_C_SetReward::IsValid' has a wrong offset!");
static_assert(offsetof(WBP_RewardTooltipSlot_C_SetReward, Temp_bool_Variable) == 0x000039, "Member 'WBP_RewardTooltipSlot_C_SetReward::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RewardTooltipSlot_C_SetReward, Temp_byte_Variable) == 0x00003A, "Member 'WBP_RewardTooltipSlot_C_SetReward::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RewardTooltipSlot_C_SetReward, Temp_byte_Variable_1) == 0x00003B, "Member 'WBP_RewardTooltipSlot_C_SetReward::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RewardTooltipSlot_C_SetReward, K2Node_Select_Default) == 0x00003C, "Member 'WBP_RewardTooltipSlot_C_SetReward::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_RewardTooltipSlot_C_SetReward, CallFunc_TextIsEmpty_ReturnValue) == 0x00003D, "Member 'WBP_RewardTooltipSlot_C_SetReward::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RewardTooltipSlot_C_SetReward, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x00003E, "Member 'WBP_RewardTooltipSlot_C_SetReward::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RewardTooltipSlot_C_SetReward, CallFunc_Not_PreBool_ReturnValue) == 0x00003F, "Member 'WBP_RewardTooltipSlot_C_SetReward::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RewardTooltipSlot_C_SetReward, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'WBP_RewardTooltipSlot_C_SetReward::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

