#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Limbs_InputAction

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Limbs_InputAction.WBP_Limbs_InputAction_C.ExecuteUbergraph_WBP_Limbs_InputAction
// 0x0048 (0x0048 - 0x0000)
struct WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AB0[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0018(0x0010)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AB1[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0030(0x0010)(ConstParm)
	class UInputAction*                           K2Node_CustomEvent_NewInputAction;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction) == 0x000008, "Wrong alignment on WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction");
static_assert(sizeof(WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction) == 0x000048, "Wrong size on WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction");
static_assert(offsetof(WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction, EntryPoint) == 0x000000, "Member 'WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction, Temp_byte_Variable) == 0x000005, "Member 'WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction, CallFunc_Format_ReturnValue) == 0x000018, "Member 'WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction, CallFunc_BooleanOR_ReturnValue) == 0x000028, "Member 'WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction, Temp_bool_Variable) == 0x000029, "Member 'WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction, K2Node_Select_Default) == 0x00002A, "Member 'WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction, K2Node_CustomEvent_InText) == 0x000030, "Member 'WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction, K2Node_CustomEvent_NewInputAction) == 0x000040, "Member 'WBP_Limbs_InputAction_C_ExecuteUbergraph_WBP_Limbs_InputAction::K2Node_CustomEvent_NewInputAction' has a wrong offset!");

// Function WBP_Limbs_InputAction.WBP_Limbs_InputAction_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Limbs_InputAction_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Limbs_InputAction_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Limbs_InputAction_C_PreConstruct");
static_assert(sizeof(WBP_Limbs_InputAction_C_PreConstruct) == 0x000001, "Wrong size on WBP_Limbs_InputAction_C_PreConstruct");
static_assert(offsetof(WBP_Limbs_InputAction_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Limbs_InputAction_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Limbs_InputAction.WBP_Limbs_InputAction_C.SetNewInputAction
// 0x0008 (0x0008 - 0x0000)
struct WBP_Limbs_InputAction_C_SetNewInputAction final
{
public:
	class UInputAction*                           NewInputAction;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Limbs_InputAction_C_SetNewInputAction) == 0x000008, "Wrong alignment on WBP_Limbs_InputAction_C_SetNewInputAction");
static_assert(sizeof(WBP_Limbs_InputAction_C_SetNewInputAction) == 0x000008, "Wrong size on WBP_Limbs_InputAction_C_SetNewInputAction");
static_assert(offsetof(WBP_Limbs_InputAction_C_SetNewInputAction, NewInputAction) == 0x000000, "Member 'WBP_Limbs_InputAction_C_SetNewInputAction::NewInputAction' has a wrong offset!");

// Function WBP_Limbs_InputAction.WBP_Limbs_InputAction_C.SetNewResultText
// 0x0010 (0x0010 - 0x0000)
struct WBP_Limbs_InputAction_C_SetNewResultText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Limbs_InputAction_C_SetNewResultText) == 0x000008, "Wrong alignment on WBP_Limbs_InputAction_C_SetNewResultText");
static_assert(sizeof(WBP_Limbs_InputAction_C_SetNewResultText) == 0x000010, "Wrong size on WBP_Limbs_InputAction_C_SetNewResultText");
static_assert(offsetof(WBP_Limbs_InputAction_C_SetNewResultText, InText) == 0x000000, "Member 'WBP_Limbs_InputAction_C_SetNewResultText::InText' has a wrong offset!");

}

