#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tooltip_Weapon_DOS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_BaseTooltip_classes.hpp"
#include "G01_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Tooltip_Weapon_DOS.WBP_Tooltip_Weapon_DOS_C
// 0x0058 (0x0340 - 0x02E8)
class UWBP_Tooltip_Weapon_DOS_C final : public UWBP_BaseTooltip_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Quality_Image;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemImage_C*                       WBP_ItemImage;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TooltipDetailsPanel_C*             WBP_TooltipDetailsPanel;                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WeaponAmmo_Image;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           WeaponType_GzText;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowAttach;                                        // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61AE[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzItemData*                            Attach_Item_Data;                                  // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterOnDisplayBorder;                             // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61AF[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LongDisplay;                                       // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ConstructUpdate();
	void ExecuteUbergraph_WBP_Tooltip_Weapon_DOS(int32 EntryPoint);
	void InitWeaponSetup(class UGzWeaponItemData* WeaponData);
	void PreConstruct(bool IsDesignTime);
	void SetWeaponIcon(class UGzWeaponItemData* WeaponData);
	void SetWeaponType(class UGzWeaponItemData* WeaponData);
	void UpdateQuality(class UGzItemData* WeaponData);
	void UpdateTooltip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Tooltip_Weapon_DOS_C">();
	}
	static class UWBP_Tooltip_Weapon_DOS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Tooltip_Weapon_DOS_C>();
	}
};
static_assert(alignof(UWBP_Tooltip_Weapon_DOS_C) == 0x000008, "Wrong alignment on UWBP_Tooltip_Weapon_DOS_C");
static_assert(sizeof(UWBP_Tooltip_Weapon_DOS_C) == 0x000340, "Wrong size on UWBP_Tooltip_Weapon_DOS_C");
static_assert(offsetof(UWBP_Tooltip_Weapon_DOS_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_Tooltip_Weapon_DOS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_Weapon_DOS_C, Quality_Image) == 0x0002F0, "Member 'UWBP_Tooltip_Weapon_DOS_C::Quality_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_Weapon_DOS_C, WBP_ItemImage) == 0x0002F8, "Member 'UWBP_Tooltip_Weapon_DOS_C::WBP_ItemImage' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_Weapon_DOS_C, WBP_TooltipDetailsPanel) == 0x000300, "Member 'UWBP_Tooltip_Weapon_DOS_C::WBP_TooltipDetailsPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_Weapon_DOS_C, WeaponAmmo_Image) == 0x000308, "Member 'UWBP_Tooltip_Weapon_DOS_C::WeaponAmmo_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_Weapon_DOS_C, WeaponType_GzText) == 0x000310, "Member 'UWBP_Tooltip_Weapon_DOS_C::WeaponType_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_Weapon_DOS_C, ShowAttach) == 0x000318, "Member 'UWBP_Tooltip_Weapon_DOS_C::ShowAttach' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_Weapon_DOS_C, Attach_Item_Data) == 0x000320, "Member 'UWBP_Tooltip_Weapon_DOS_C::Attach_Item_Data' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_Weapon_DOS_C, LetterOnDisplayBorder) == 0x000328, "Member 'UWBP_Tooltip_Weapon_DOS_C::LetterOnDisplayBorder' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_Weapon_DOS_C, LongDisplay) == 0x000330, "Member 'UWBP_Tooltip_Weapon_DOS_C::LongDisplay' has a wrong offset!");

}

