#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadingScreen_AssetLoading_Movies

#include "Basic.hpp"

#include "G01_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoadingScreen_AssetLoading_Movies.WBP_LoadingScreen_AssetLoading_Movies_C.GetContinueWidgetIndex
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoadingScreen_AssetLoading_Movies_C_GetContinueWidgetIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzLoadingInputType                           CallFunc_GetInputType_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadingScreen_AssetLoading_Movies_C_GetContinueWidgetIndex) == 0x000004, "Wrong alignment on WBP_LoadingScreen_AssetLoading_Movies_C_GetContinueWidgetIndex");
static_assert(sizeof(WBP_LoadingScreen_AssetLoading_Movies_C_GetContinueWidgetIndex) == 0x000008, "Wrong size on WBP_LoadingScreen_AssetLoading_Movies_C_GetContinueWidgetIndex");
static_assert(offsetof(WBP_LoadingScreen_AssetLoading_Movies_C_GetContinueWidgetIndex, Param_Index) == 0x000000, "Member 'WBP_LoadingScreen_AssetLoading_Movies_C_GetContinueWidgetIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreen_AssetLoading_Movies_C_GetContinueWidgetIndex, CallFunc_GetInputType_ReturnValue) == 0x000004, "Member 'WBP_LoadingScreen_AssetLoading_Movies_C_GetContinueWidgetIndex::CallFunc_GetInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreen_AssetLoading_Movies_C_GetContinueWidgetIndex, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'WBP_LoadingScreen_AssetLoading_Movies_C_GetContinueWidgetIndex::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_LoadingScreen_AssetLoading_Movies.WBP_LoadingScreen_AssetLoading_Movies_C.ExecuteUbergraph_WBP_LoadingScreen_AssetLoading_Movies
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoadingScreen_AssetLoading_Movies_C_ExecuteUbergraph_WBP_LoadingScreen_AssetLoading_Movies final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetContinueWidgetIndex_Index;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadingScreen_AssetLoading_Movies_C_ExecuteUbergraph_WBP_LoadingScreen_AssetLoading_Movies) == 0x000004, "Wrong alignment on WBP_LoadingScreen_AssetLoading_Movies_C_ExecuteUbergraph_WBP_LoadingScreen_AssetLoading_Movies");
static_assert(sizeof(WBP_LoadingScreen_AssetLoading_Movies_C_ExecuteUbergraph_WBP_LoadingScreen_AssetLoading_Movies) == 0x000008, "Wrong size on WBP_LoadingScreen_AssetLoading_Movies_C_ExecuteUbergraph_WBP_LoadingScreen_AssetLoading_Movies");
static_assert(offsetof(WBP_LoadingScreen_AssetLoading_Movies_C_ExecuteUbergraph_WBP_LoadingScreen_AssetLoading_Movies, EntryPoint) == 0x000000, "Member 'WBP_LoadingScreen_AssetLoading_Movies_C_ExecuteUbergraph_WBP_LoadingScreen_AssetLoading_Movies::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreen_AssetLoading_Movies_C_ExecuteUbergraph_WBP_LoadingScreen_AssetLoading_Movies, CallFunc_GetContinueWidgetIndex_Index) == 0x000004, "Member 'WBP_LoadingScreen_AssetLoading_Movies_C_ExecuteUbergraph_WBP_LoadingScreen_AssetLoading_Movies::CallFunc_GetContinueWidgetIndex_Index' has a wrong offset!");

// Function WBP_LoadingScreen_AssetLoading_Movies.WBP_LoadingScreen_AssetLoading_Movies_C.GetBackgroundWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_LoadingScreen_AssetLoading_Movies_C_GetBackgroundWidgets final
{
public:
	TArray<class UWidget*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_LoadingScreen_AssetLoading_Movies_C_GetBackgroundWidgets) == 0x000008, "Wrong alignment on WBP_LoadingScreen_AssetLoading_Movies_C_GetBackgroundWidgets");
static_assert(sizeof(WBP_LoadingScreen_AssetLoading_Movies_C_GetBackgroundWidgets) == 0x000020, "Wrong size on WBP_LoadingScreen_AssetLoading_Movies_C_GetBackgroundWidgets");
static_assert(offsetof(WBP_LoadingScreen_AssetLoading_Movies_C_GetBackgroundWidgets, ReturnValue) == 0x000000, "Member 'WBP_LoadingScreen_AssetLoading_Movies_C_GetBackgroundWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreen_AssetLoading_Movies_C_GetBackgroundWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_LoadingScreen_AssetLoading_Movies_C_GetBackgroundWidgets::K2Node_MakeArray_Array' has a wrong offset!");

}

