#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BrokenJetpackNotificationSimplefied

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.BindJetpackListner
// 0x0008 (0x0008 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_BindJetpackListner final
{
public:
	class APawn*                                  ViewTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_BindJetpackListner) == 0x000008, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_BindJetpackListner");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_BindJetpackListner) == 0x000008, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_BindJetpackListner");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_BindJetpackListner, ViewTarget) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_BindJetpackListner::ViewTarget' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.ClearAsyncTask
// 0x0003 (0x0003 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_ClearAsyncTask final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_ClearAsyncTask) == 0x000001, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_ClearAsyncTask");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_ClearAsyncTask) == 0x000003, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_ClearAsyncTask");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ClearAsyncTask, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ClearAsyncTask::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ClearAsyncTask, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ClearAsyncTask::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ClearAsyncTask, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ClearAsyncTask::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied
// 0x0160 (0x0160 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x4];                                       // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0008(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0060(0x0038)(HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_3;                          // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_2;                          // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           CallFunc_ListenForAttributeChange_ReturnValue;     // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x3];                                       // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x010C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x0114(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x012C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x4];                                       // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_NewViewTarget;                        // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_ViewTarget;                     // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x6];                                       // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_TryShowNotification_CurrentHealth_ImplicitCast; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied) == 0x000008, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied) == 0x000160, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, EntryPoint) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_CustomEvent_Attribute) == 0x000008, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_CustomEvent_NewValue) == 0x000040, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_CustomEvent_OldValue) == 0x000044, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, Temp_real_Variable) == 0x000058, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, Temp_real_Variable_1) == 0x00005C, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, Temp_struct_Variable) == 0x000060, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_CreateDelegate_OutputDelegate_1) == 0x000098, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_CustomEvent_Tag_3) == 0x0000A8, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_CustomEvent_Tag_3' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_CustomEvent_Tag_2) == 0x0000B0, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_CustomEvent_Tag_2' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B8, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, Temp_struct_Variable_1) == 0x0000C8, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000D0, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, CallFunc_ListenForAttributeChange_ReturnValue) == 0x0000D8, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::CallFunc_ListenForAttributeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue) == 0x0000E0, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, CallFunc_IsValid_ReturnValue_1) == 0x0000E9, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1) == 0x0000F0, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F8, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, CallFunc_IsValid_ReturnValue_2) == 0x000108, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_CustomEvent_Tag_1) == 0x00010C, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_CustomEvent_Tag) == 0x000114, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_CreateDelegate_OutputDelegate_4) == 0x00011C, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, Temp_struct_Variable_2) == 0x00012C, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_Event_NewViewTarget) == 0x000138, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_Event_NewViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_CustomEvent_ViewTarget) == 0x000140, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_CustomEvent_ViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_DynamicCast_AsGz_Player_Character) == 0x000148, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, K2Node_Event_IsDesignTime) == 0x000151, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied, CallFunc_TryShowNotification_CurrentHealth_ImplicitCast) == 0x000158, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied::CallFunc_TryShowNotification_CurrentHealth_ImplicitCast' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.OnAttributeChanged_9F5FD0D54159A8B22DBE5793022A8B4C
// 0x0040 (0x0040 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_OnAttributeChanged_9F5FD0D54159A8B22DBE5793022A8B4C final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_OnAttributeChanged_9F5FD0D54159A8B22DBE5793022A8B4C) == 0x000008, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_OnAttributeChanged_9F5FD0D54159A8B22DBE5793022A8B4C");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_OnAttributeChanged_9F5FD0D54159A8B22DBE5793022A8B4C) == 0x000040, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_OnAttributeChanged_9F5FD0D54159A8B22DBE5793022A8B4C");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_OnAttributeChanged_9F5FD0D54159A8B22DBE5793022A8B4C, Attribute) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_OnAttributeChanged_9F5FD0D54159A8B22DBE5793022A8B4C::Attribute' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_OnAttributeChanged_9F5FD0D54159A8B22DBE5793022A8B4C, NewValue) == 0x000038, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_OnAttributeChanged_9F5FD0D54159A8B22DBE5793022A8B4C::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_OnAttributeChanged_9F5FD0D54159A8B22DBE5793022A8B4C, OldValue) == 0x00003C, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_OnAttributeChanged_9F5FD0D54159A8B22DBE5793022A8B4C::OldValue' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.OnFinishShow
// 0x0040 (0x0040 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow) == 0x000008, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow) == 0x000040, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow, CallFunc_SafeDivide_ReturnValue) == 0x000010, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000030, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000038, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_OnFinishShow::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.OnTagAdded_9426B32746CF22499F7CCFB04A5F73B2
// 0x0008 (0x0008 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_OnTagAdded_9426B32746CF22499F7CCFB04A5F73B2 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_OnTagAdded_9426B32746CF22499F7CCFB04A5F73B2) == 0x000004, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_OnTagAdded_9426B32746CF22499F7CCFB04A5F73B2");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_OnTagAdded_9426B32746CF22499F7CCFB04A5F73B2) == 0x000008, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_OnTagAdded_9426B32746CF22499F7CCFB04A5F73B2");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_OnTagAdded_9426B32746CF22499F7CCFB04A5F73B2, Tag) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_OnTagAdded_9426B32746CF22499F7CCFB04A5F73B2::Tag' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.OnTagAdded_A0A228ED418CFD03D11B309C385D07EF
// 0x0008 (0x0008 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_OnTagAdded_A0A228ED418CFD03D11B309C385D07EF final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_OnTagAdded_A0A228ED418CFD03D11B309C385D07EF) == 0x000004, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_OnTagAdded_A0A228ED418CFD03D11B309C385D07EF");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_OnTagAdded_A0A228ED418CFD03D11B309C385D07EF) == 0x000008, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_OnTagAdded_A0A228ED418CFD03D11B309C385D07EF");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_OnTagAdded_A0A228ED418CFD03D11B309C385D07EF, Tag) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_OnTagAdded_A0A228ED418CFD03D11B309C385D07EF::Tag' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.OnTagRemoved_9426B32746CF22499F7CCFB04A5F73B2
// 0x0008 (0x0008 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_OnTagRemoved_9426B32746CF22499F7CCFB04A5F73B2 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_OnTagRemoved_9426B32746CF22499F7CCFB04A5F73B2) == 0x000004, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_OnTagRemoved_9426B32746CF22499F7CCFB04A5F73B2");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_OnTagRemoved_9426B32746CF22499F7CCFB04A5F73B2) == 0x000008, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_OnTagRemoved_9426B32746CF22499F7CCFB04A5F73B2");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_OnTagRemoved_9426B32746CF22499F7CCFB04A5F73B2, Tag) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_OnTagRemoved_9426B32746CF22499F7CCFB04A5F73B2::Tag' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.OnTagRemoved_A0A228ED418CFD03D11B309C385D07EF
// 0x0008 (0x0008 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_OnTagRemoved_A0A228ED418CFD03D11B309C385D07EF final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_OnTagRemoved_A0A228ED418CFD03D11B309C385D07EF) == 0x000004, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_OnTagRemoved_A0A228ED418CFD03D11B309C385D07EF");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_OnTagRemoved_A0A228ED418CFD03D11B309C385D07EF) == 0x000008, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_OnTagRemoved_A0A228ED418CFD03D11B309C385D07EF");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_OnTagRemoved_A0A228ED418CFD03D11B309C385D07EF, Tag) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_OnTagRemoved_A0A228ED418CFD03D11B309C385D07EF::Tag' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_PreConstruct");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_PreConstruct) == 0x000001, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_PreConstruct");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.ReceiveBindEvents
// 0x0008 (0x0008 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_ReceiveBindEvents final
{
public:
	class APawn*                                  NewViewTarget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_ReceiveBindEvents) == 0x000008, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_ReceiveBindEvents");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_ReceiveBindEvents) == 0x000008, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_ReceiveBindEvents");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ReceiveBindEvents, NewViewTarget) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ReceiveBindEvents::NewViewTarget' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.ReloadMaxTime
// 0x0018 (0x0018 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_ReloadMaxTime final
{
public:
	float                                         CallFunc_GetJetpackDelayAndRepairTime_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67[0x3];                                       // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x4];                                       // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_ReloadMaxTime) == 0x000008, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_ReloadMaxTime");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_ReloadMaxTime) == 0x000018, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_ReloadMaxTime");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ReloadMaxTime, CallFunc_GetJetpackDelayAndRepairTime_ReturnValue) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ReloadMaxTime::CallFunc_GetJetpackDelayAndRepairTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ReloadMaxTime, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ReloadMaxTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ReloadMaxTime, CallFunc_FTrunc_ReturnValue) == 0x000008, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ReloadMaxTime::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ReloadMaxTime, CallFunc_FTrunc_A_ImplicitCast) == 0x000010, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ReloadMaxTime::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.ShowJetpackNotification
// 0x0002 (0x0002 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_ShowJetpackNotification final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Force;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_ShowJetpackNotification) == 0x000001, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_ShowJetpackNotification");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_ShowJetpackNotification) == 0x000002, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_ShowJetpackNotification");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ShowJetpackNotification, Show) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ShowJetpackNotification::Show' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_ShowJetpackNotification, Force) == 0x000001, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_ShowJetpackNotification::Force' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.TryShowNotification
// 0x0010 (0x0010 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_TryShowNotification final
{
public:
	double                                        CurrentHealth;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_TryShowNotification) == 0x000008, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_TryShowNotification");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_TryShowNotification) == 0x000010, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_TryShowNotification");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_TryShowNotification, CurrentHealth) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_TryShowNotification::CurrentHealth' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_TryShowNotification, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_TryShowNotification::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_TryShowNotification, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000009, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_TryShowNotification::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_TryShowNotification, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_TryShowNotification::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.UpdateProgress
// 0x0038 (0x0038 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress final
{
public:
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress) == 0x000008, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress) == 0x000038, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress, Temp_real_Variable) == 0x000008, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress, CallFunc_SafeDivide_ReturnValue) == 0x000020, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000030, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_UpdateProgress::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C.UpdateTime
// 0x0020 (0x0020 - 0x0000)
struct WBP_BrokenJetpackNotificationSimplefied_C_UpdateTime final
{
public:
	class FText                                   TimeFontTag;                                       // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrokenJetpackNotificationSimplefied_C_UpdateTime) == 0x000008, "Wrong alignment on WBP_BrokenJetpackNotificationSimplefied_C_UpdateTime");
static_assert(sizeof(WBP_BrokenJetpackNotificationSimplefied_C_UpdateTime) == 0x000020, "Wrong size on WBP_BrokenJetpackNotificationSimplefied_C_UpdateTime");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_UpdateTime, TimeFontTag) == 0x000000, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_UpdateTime::TimeFontTag' has a wrong offset!");
static_assert(offsetof(WBP_BrokenJetpackNotificationSimplefied_C_UpdateTime, Temp_int_Variable) == 0x000010, "Member 'WBP_BrokenJetpackNotificationSimplefied_C_UpdateTime::Temp_int_Variable' has a wrong offset!");
