#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BackpackTooltipAttributeGridArmor

#include "Basic.hpp"

#include "WBP_BackpackTooltipAttributeBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BackpackTooltipAttributeGridArmor.WBP_BackpackTooltipAttributeGridArmor_C
// 0x0020 (0x0328 - 0x0308)
class UWBP_BackpackTooltipAttributeGridArmor_C final : public UWBP_BackpackTooltipAttributeBase_C
{
public:
	class UBorder*                                Border;                                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Container;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           PercentValue_GzText;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void FindCurrentAttributeValue(struct FGzItemAttribute* Attribute);
	void InitSetup(bool* Result);
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BackpackTooltipAttributeGridArmor_C">();
	}
	static class UWBP_BackpackTooltipAttributeGridArmor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BackpackTooltipAttributeGridArmor_C>();
	}
};
static_assert(alignof(UWBP_BackpackTooltipAttributeGridArmor_C) == 0x000008, "Wrong alignment on UWBP_BackpackTooltipAttributeGridArmor_C");
static_assert(sizeof(UWBP_BackpackTooltipAttributeGridArmor_C) == 0x000328, "Wrong size on UWBP_BackpackTooltipAttributeGridArmor_C");
static_assert(offsetof(UWBP_BackpackTooltipAttributeGridArmor_C, Border) == 0x000308, "Member 'UWBP_BackpackTooltipAttributeGridArmor_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackTooltipAttributeGridArmor_C, Container) == 0x000310, "Member 'UWBP_BackpackTooltipAttributeGridArmor_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackTooltipAttributeGridArmor_C, PercentValue_GzText) == 0x000318, "Member 'UWBP_BackpackTooltipAttributeGridArmor_C::PercentValue_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackTooltipAttributeGridArmor_C, ProgressBar) == 0x000320, "Member 'UWBP_BackpackTooltipAttributeGridArmor_C::ProgressBar' has a wrong offset!");

}

