#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Limbs_DebuffContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Limbs_DebuffContainer.WBP_Limbs_DebuffContainer_C
// 0x0018 (0x0358 - 0x0340)
class UWBP_Limbs_DebuffContainer_C final : public UGzHUDComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Limbs_Debuff_Pulsed_C*             WBP_Limbs_Debuff_Pulsed;                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Limbs_InputAction_C*               WBP_Limbs_SmashDown_InputAction;                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Limbs_DebuffContainer(int32 EntryPoint);
	void OnTagAdded_525530E248F7049BDB8C72B18AC39A5D(const struct FGameplayTag& Tag);
	void OnTagRemoved_525530E248F7049BDB8C72B18AC39A5D(const struct FGameplayTag& Tag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Limbs_DebuffContainer_C">();
	}
	static class UWBP_Limbs_DebuffContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Limbs_DebuffContainer_C>();
	}
};
static_assert(alignof(UWBP_Limbs_DebuffContainer_C) == 0x000008, "Wrong alignment on UWBP_Limbs_DebuffContainer_C");
static_assert(sizeof(UWBP_Limbs_DebuffContainer_C) == 0x000358, "Wrong size on UWBP_Limbs_DebuffContainer_C");
static_assert(offsetof(UWBP_Limbs_DebuffContainer_C, UberGraphFrame) == 0x000340, "Member 'UWBP_Limbs_DebuffContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Limbs_DebuffContainer_C, WBP_Limbs_Debuff_Pulsed) == 0x000348, "Member 'UWBP_Limbs_DebuffContainer_C::WBP_Limbs_Debuff_Pulsed' has a wrong offset!");
static_assert(offsetof(UWBP_Limbs_DebuffContainer_C, WBP_Limbs_SmashDown_InputAction) == 0x000350, "Member 'UWBP_Limbs_DebuffContainer_C::WBP_Limbs_SmashDown_InputAction' has a wrong offset!");

}

