#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EventLog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "G01_classes.hpp"
#include "E_EnclaveOps_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EventLog.WBP_EventLog_C
// 0x0080 (0x0418 - 0x0398)
class UWBP_EventLog_C final : public UGzEventLogWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           Container;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         MaxNumNotifications;                               // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56DA[0x4];                                     // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, class UTexture2D*>  DamageSourceDefaultTextures;                       // 0x03B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UGzPlayerOutOfHealthMessage*            KillMessage;                                       // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Spectating;                                     // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Alignment;                                         // 0x0409(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56DB[0x6];                                     // 0x040A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         ViewTargetPlayerState;                             // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddEnclaveBreachNotification(const class UGzGameMessage* Message);
	void AddEnclaveOpStart(const class UGzGameMessage* Message);
	void AddGridNotification(const class UGzGameMessage* Message);
	void AddPlayerOutOfHealthNotification_BP(const class UGzPlayerOutOfHealthMessage* PlayerOutOfHealthMessage);
	void CheckListLimit();
	void Construct();
	void Create_Notification(class UClass* MessageClass, const class FText& Instigator, class AGzPlayerState* InstigatorPlayerState, const class FText& Victim, class AGzPlayerState* VictimPlayerState, const class FText& ActionDescription, class UTexture2D* KillSourceTexture, class UTexture2D* Modifier1Texture, class UTexture2D* Modifier2Texture, TSoftObjectPtr<class UObject> ObjectReference);
	void DebugPrintString(const class FString& InString);
	void ExecuteUbergraph_WBP_EventLog(int32 EntryPoint);
	void GetInstigatorName(class UGzPlayerToPlayerInteractionMessage* Message, class FText* InstigatorName);
	class AGzPlayerState* GetInstigatorState(class UGzPlayerToPlayerInteractionMessage* Message);
	class UTexture2D* GetKillSourceTexture(class UGzPlayerOutOfHealthMessage* Message);
	void GetVictimName(class UGzPlayerToPlayerInteractionMessage* Message, class FText* VictimName);
	class AGzPlayerState* GetVictimState(class UGzPlayerToPlayerInteractionMessage* Message);
	void OnInitialized();
	void OnReady_1EA3EDBC4241D206BB633DB045E90106(class AGzGameModeSubsystem* Subsystem);
	void PreConstruct(bool IsDesignTime);
	void UpdateNotifications(class AGzPlayerState* Param_ViewTargetPlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EventLog_C">();
	}
	static class UWBP_EventLog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EventLog_C>();
	}
};
static_assert(alignof(UWBP_EventLog_C) == 0x000008, "Wrong alignment on UWBP_EventLog_C");
static_assert(sizeof(UWBP_EventLog_C) == 0x000418, "Wrong size on UWBP_EventLog_C");
static_assert(offsetof(UWBP_EventLog_C, UberGraphFrame) == 0x000398, "Member 'UWBP_EventLog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EventLog_C, Container) == 0x0003A0, "Member 'UWBP_EventLog_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_EventLog_C, MaxNumNotifications) == 0x0003A8, "Member 'UWBP_EventLog_C::MaxNumNotifications' has a wrong offset!");
static_assert(offsetof(UWBP_EventLog_C, DamageSourceDefaultTextures) == 0x0003B0, "Member 'UWBP_EventLog_C::DamageSourceDefaultTextures' has a wrong offset!");
static_assert(offsetof(UWBP_EventLog_C, KillMessage) == 0x000400, "Member 'UWBP_EventLog_C::KillMessage' has a wrong offset!");
static_assert(offsetof(UWBP_EventLog_C, Is_Spectating) == 0x000408, "Member 'UWBP_EventLog_C::Is_Spectating' has a wrong offset!");
static_assert(offsetof(UWBP_EventLog_C, Alignment) == 0x000409, "Member 'UWBP_EventLog_C::Alignment' has a wrong offset!");
static_assert(offsetof(UWBP_EventLog_C, ViewTargetPlayerState) == 0x000410, "Member 'UWBP_EventLog_C::ViewTargetPlayerState' has a wrong offset!");

}

