#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Redeployment

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Redeployment.WBP_Redeployment_C.UpdateEventTime
// 0x0038 (0x0038 - 0x0000)
struct WBP_Redeployment_C_UpdateEventTime final
{
public:
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTimeInMinutesSecondFormatText_Result;  // 0x0010(0x0010)()
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F1[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeInMinutesSecondFormatText_InSeconds_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_C_UpdateEventTime) == 0x000008, "Wrong alignment on WBP_Redeployment_C_UpdateEventTime");
static_assert(sizeof(WBP_Redeployment_C_UpdateEventTime) == 0x000038, "Wrong size on WBP_Redeployment_C_UpdateEventTime");
static_assert(offsetof(WBP_Redeployment_C_UpdateEventTime, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000000, "Member 'WBP_Redeployment_C_UpdateEventTime::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_UpdateEventTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_Redeployment_C_UpdateEventTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_UpdateEventTime, CallFunc_GetTimeInMinutesSecondFormatText_Result) == 0x000010, "Member 'WBP_Redeployment_C_UpdateEventTime::CallFunc_GetTimeInMinutesSecondFormatText_Result' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_UpdateEventTime, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_Redeployment_C_UpdateEventTime::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_UpdateEventTime, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000028, "Member 'WBP_Redeployment_C_UpdateEventTime::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_UpdateEventTime, CallFunc_GetTimeInMinutesSecondFormatText_InSeconds_ImplicitCast) == 0x000030, "Member 'WBP_Redeployment_C_UpdateEventTime::CallFunc_GetTimeInMinutesSecondFormatText_InSeconds_ImplicitCast' has a wrong offset!");

// Function WBP_Redeployment.WBP_Redeployment_C.UpdateButtonRedeployCost
// 0x0048 (0x0048 - 0x0000)
struct WBP_Redeployment_C_UpdateButtonRedeployCost final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F2[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F3[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F4[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Redeployment_MemberButton_C*       K2Node_DynamicCast_AsWBP_Redeployment_Member_Button; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_C_UpdateButtonRedeployCost) == 0x000008, "Wrong alignment on WBP_Redeployment_C_UpdateButtonRedeployCost");
static_assert(sizeof(WBP_Redeployment_C_UpdateButtonRedeployCost) == 0x000048, "Wrong size on WBP_Redeployment_C_UpdateButtonRedeployCost");
static_assert(offsetof(WBP_Redeployment_C_UpdateButtonRedeployCost, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Redeployment_C_UpdateButtonRedeployCost::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_UpdateButtonRedeployCost, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Redeployment_C_UpdateButtonRedeployCost::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_UpdateButtonRedeployCost, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Redeployment_C_UpdateButtonRedeployCost::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_UpdateButtonRedeployCost, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_Redeployment_C_UpdateButtonRedeployCost::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_UpdateButtonRedeployCost, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_Redeployment_C_UpdateButtonRedeployCost::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_UpdateButtonRedeployCost, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_Redeployment_C_UpdateButtonRedeployCost::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_UpdateButtonRedeployCost, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_Redeployment_C_UpdateButtonRedeployCost::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_UpdateButtonRedeployCost, K2Node_DynamicCast_AsWBP_Redeployment_Member_Button) == 0x000038, "Member 'WBP_Redeployment_C_UpdateButtonRedeployCost::K2Node_DynamicCast_AsWBP_Redeployment_Member_Button' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_UpdateButtonRedeployCost, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_Redeployment_C_UpdateButtonRedeployCost::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Redeployment.WBP_Redeployment_C.SetIngameCurrency
// 0x0028 (0x0028 - 0x0000)
struct WBP_Redeployment_C_SetIngameCurrency final
{
public:
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0000(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	class UGzInvComponent*                        CallFunc_GetInventoryComponent_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_CurrencyTextFormat_Result;                // 0x0010(0x0010)()
	int32                                         CallFunc_GetItemCountByType_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_C_SetIngameCurrency) == 0x000008, "Wrong alignment on WBP_Redeployment_C_SetIngameCurrency");
static_assert(sizeof(WBP_Redeployment_C_SetIngameCurrency) == 0x000028, "Wrong size on WBP_Redeployment_C_SetIngameCurrency");
static_assert(offsetof(WBP_Redeployment_C_SetIngameCurrency, Temp_struct_Variable) == 0x000000, "Member 'WBP_Redeployment_C_SetIngameCurrency::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_SetIngameCurrency, CallFunc_GetInventoryComponent_ReturnValue) == 0x000008, "Member 'WBP_Redeployment_C_SetIngameCurrency::CallFunc_GetInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_SetIngameCurrency, CallFunc_CurrencyTextFormat_Result) == 0x000010, "Member 'WBP_Redeployment_C_SetIngameCurrency::CallFunc_CurrencyTextFormat_Result' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_SetIngameCurrency, CallFunc_GetItemCountByType_ReturnValue) == 0x000020, "Member 'WBP_Redeployment_C_SetIngameCurrency::CallFunc_GetItemCountByType_ReturnValue' has a wrong offset!");

// Function WBP_Redeployment.WBP_Redeployment_C.RedeployTeammate
// 0x0080 (0x0080 - 0x0000)
struct WBP_Redeployment_C_RedeployTeammate final
{
public:
	class AGzPlayerState*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Redeployment_MemberButton_C*       RedeploymentButton;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F5[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F6[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Redeployment_MemberButton_C*       K2Node_DynamicCast_AsWBP_Redeployment_Member_Button; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F7[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F8[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerId_ReturnValue;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerController*                    K2Node_DynamicCast_AsGz_Player_Controller;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_C_RedeployTeammate) == 0x000008, "Wrong alignment on WBP_Redeployment_C_RedeployTeammate");
static_assert(sizeof(WBP_Redeployment_C_RedeployTeammate) == 0x000080, "Wrong size on WBP_Redeployment_C_RedeployTeammate");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, PlayerState) == 0x000000, "Member 'WBP_Redeployment_C_RedeployTeammate::PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, RedeploymentButton) == 0x000008, "Member 'WBP_Redeployment_C_RedeployTeammate::RedeploymentButton' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_Redeployment_C_RedeployTeammate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_Redeployment_C_RedeployTeammate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Redeployment_C_RedeployTeammate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WBP_Redeployment_C_RedeployTeammate::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Redeployment_C_RedeployTeammate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, CallFunc_RemoveChild_ReturnValue) == 0x000038, "Member 'WBP_Redeployment_C_RedeployTeammate::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, K2Node_DynamicCast_AsWBP_Redeployment_Member_Button) == 0x000040, "Member 'WBP_Redeployment_C_RedeployTeammate::K2Node_DynamicCast_AsWBP_Redeployment_Member_Button' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_Redeployment_C_RedeployTeammate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'WBP_Redeployment_C_RedeployTeammate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_Redeployment_C_RedeployTeammate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, CallFunc_GetPlayerId_ReturnValue) == 0x000054, "Member 'WBP_Redeployment_C_RedeployTeammate::CallFunc_GetPlayerId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_Redeployment_C_RedeployTeammate::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, CallFunc_GetController_ReturnValue) == 0x000068, "Member 'WBP_Redeployment_C_RedeployTeammate::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, K2Node_DynamicCast_AsGz_Player_Controller) == 0x000070, "Member 'WBP_Redeployment_C_RedeployTeammate::K2Node_DynamicCast_AsGz_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_RedeployTeammate, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'WBP_Redeployment_C_RedeployTeammate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_Redeployment.WBP_Redeployment_C.OnRedeployTeammatesSelected__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Redeployment_C_OnRedeployTeammatesSelected__DelegateSignature final
{
public:
	class AController*                            Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerState*>                   Teammates;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Redeployment_C_OnRedeployTeammatesSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Redeployment_C_OnRedeployTeammatesSelected__DelegateSignature");
static_assert(sizeof(WBP_Redeployment_C_OnRedeployTeammatesSelected__DelegateSignature) == 0x000018, "Wrong size on WBP_Redeployment_C_OnRedeployTeammatesSelected__DelegateSignature");
static_assert(offsetof(WBP_Redeployment_C_OnRedeployTeammatesSelected__DelegateSignature, Controller) == 0x000000, "Member 'WBP_Redeployment_C_OnRedeployTeammatesSelected__DelegateSignature::Controller' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_OnRedeployTeammatesSelected__DelegateSignature, Teammates) == 0x000008, "Member 'WBP_Redeployment_C_OnRedeployTeammatesSelected__DelegateSignature::Teammates' has a wrong offset!");

// Function WBP_Redeployment.WBP_Redeployment_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_Redeployment_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Redeployment_C_OnFocusReceived");
static_assert(sizeof(WBP_Redeployment_C_OnFocusReceived) == 0x0001C0, "Wrong size on WBP_Redeployment_C_OnFocusReceived");
static_assert(offsetof(WBP_Redeployment_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Redeployment_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Redeployment_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Redeployment_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Redeployment_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_Redeployment_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_OnFocusReceived, CallFunc_IsValid_ReturnValue) == 0x0001B8, "Member 'WBP_Redeployment_C_OnFocusReceived::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Redeployment.WBP_Redeployment_C.OnEventNotificationStageDelegat
// 0x001C (0x001C - 0x0000)
struct WBP_Redeployment_C_OnEventNotificationStageDelegat final
{
public:
	class FName                                   NotificationID;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzNotificationStageType                      StageType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F9[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzEventNotificationData               NotificationData;                                  // 0x000C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Redeployment_C_OnEventNotificationStageDelegat) == 0x000004, "Wrong alignment on WBP_Redeployment_C_OnEventNotificationStageDelegat");
static_assert(sizeof(WBP_Redeployment_C_OnEventNotificationStageDelegat) == 0x00001C, "Wrong size on WBP_Redeployment_C_OnEventNotificationStageDelegat");
static_assert(offsetof(WBP_Redeployment_C_OnEventNotificationStageDelegat, NotificationID) == 0x000000, "Member 'WBP_Redeployment_C_OnEventNotificationStageDelegat::NotificationID' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_OnEventNotificationStageDelegat, StageType) == 0x000008, "Member 'WBP_Redeployment_C_OnEventNotificationStageDelegat::StageType' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_OnEventNotificationStageDelegat, NotificationData) == 0x00000C, "Member 'WBP_Redeployment_C_OnEventNotificationStageDelegat::NotificationData' has a wrong offset!");

// Function WBP_Redeployment.WBP_Redeployment_C.InventoryChange
// 0x0058 (0x0058 - 0x0000)
struct WBP_Redeployment_C_InventoryChange final
{
public:
	struct FGzInvItem                             ItemDelta;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EGzInvChangeEvent                             Event;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16FA[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16FB[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16FC[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Redeployment_MemberButton_C*       K2Node_DynamicCast_AsWBP_Redeployment_Member_Button; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_C_InventoryChange) == 0x000008, "Wrong alignment on WBP_Redeployment_C_InventoryChange");
static_assert(sizeof(WBP_Redeployment_C_InventoryChange) == 0x000058, "Wrong size on WBP_Redeployment_C_InventoryChange");
static_assert(offsetof(WBP_Redeployment_C_InventoryChange, ItemDelta) == 0x000000, "Member 'WBP_Redeployment_C_InventoryChange::ItemDelta' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_InventoryChange, Event) == 0x000010, "Member 'WBP_Redeployment_C_InventoryChange::Event' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_InventoryChange, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_Redeployment_C_InventoryChange::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_InventoryChange, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_Redeployment_C_InventoryChange::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_InventoryChange, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Redeployment_C_InventoryChange::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_InventoryChange, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WBP_Redeployment_C_InventoryChange::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_InventoryChange, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_Redeployment_C_InventoryChange::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_InventoryChange, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_Redeployment_C_InventoryChange::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_InventoryChange, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Redeployment_C_InventoryChange::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_InventoryChange, K2Node_DynamicCast_AsWBP_Redeployment_Member_Button) == 0x000048, "Member 'WBP_Redeployment_C_InventoryChange::K2Node_DynamicCast_AsWBP_Redeployment_Member_Button' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_InventoryChange, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_Redeployment_C_InventoryChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Redeployment.WBP_Redeployment_C.GetTeammates
// 0x0028 (0x0028 - 0x0000)
struct WBP_Redeployment_C_GetTeammates final
{
public:
	TArray<class AGzPlayerState*>                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AGzPlayerState*>                 CallFunc_FindTeammates_ReturnValue;                // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_Redeployment_C_GetTeammates) == 0x000008, "Wrong alignment on WBP_Redeployment_C_GetTeammates");
static_assert(sizeof(WBP_Redeployment_C_GetTeammates) == 0x000028, "Wrong size on WBP_Redeployment_C_GetTeammates");
static_assert(offsetof(WBP_Redeployment_C_GetTeammates, ReturnValue) == 0x000000, "Member 'WBP_Redeployment_C_GetTeammates::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GetTeammates, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'WBP_Redeployment_C_GetTeammates::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GetTeammates, CallFunc_FindTeammates_ReturnValue) == 0x000018, "Member 'WBP_Redeployment_C_GetTeammates::CallFunc_FindTeammates_ReturnValue' has a wrong offset!");

// Function WBP_Redeployment.WBP_Redeployment_C.GenerateMembers
// 0x0060 (0x0060 - 0x0000)
struct WBP_Redeployment_C_GenerateMembers final
{
public:
	class AGzPlayerState*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSquadAlive;                                      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16FD[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AGzPlayerState*>                 CallFunc_GetTeammates_ReturnValue;                 // 0x0018(0x0010)(ReferenceParm)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AGzPlayerState*                         CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInComebackArena_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzAliveState                                 CallFunc_GetPlayerAliveState_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16FE[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16FF[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_C_GenerateMembers) == 0x000008, "Wrong alignment on WBP_Redeployment_C_GenerateMembers");
static_assert(sizeof(WBP_Redeployment_C_GenerateMembers) == 0x000060, "Wrong size on WBP_Redeployment_C_GenerateMembers");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, PlayerState) == 0x000000, "Member 'WBP_Redeployment_C_GenerateMembers::PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, IsSquadAlive) == 0x000008, "Member 'WBP_Redeployment_C_GenerateMembers::IsSquadAlive' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_Redeployment_C_GenerateMembers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_Redeployment_C_GenerateMembers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Redeployment_C_GenerateMembers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, CallFunc_GetTeammates_ReturnValue) == 0x000018, "Member 'WBP_Redeployment_C_GenerateMembers::CallFunc_GetTeammates_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'WBP_Redeployment_C_GenerateMembers::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_Redeployment_C_GenerateMembers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'WBP_Redeployment_C_GenerateMembers::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, CallFunc_IsInComebackArena_ReturnValue) == 0x000048, "Member 'WBP_Redeployment_C_GenerateMembers::CallFunc_IsInComebackArena_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, CallFunc_GetPlayerAliveState_ReturnValue) == 0x000049, "Member 'WBP_Redeployment_C_GenerateMembers::CallFunc_GetPlayerAliveState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00004A, "Member 'WBP_Redeployment_C_GenerateMembers::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00004B, "Member 'WBP_Redeployment_C_GenerateMembers::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, CallFunc_BooleanOR_ReturnValue) == 0x00004C, "Member 'WBP_Redeployment_C_GenerateMembers::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_Redeployment_C_GenerateMembers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000054, "Member 'WBP_Redeployment_C_GenerateMembers::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, CallFunc_Less_IntInt_ReturnValue) == 0x000055, "Member 'WBP_Redeployment_C_GenerateMembers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_GenerateMembers, CallFunc_SelectInt_ReturnValue) == 0x000058, "Member 'WBP_Redeployment_C_GenerateMembers::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function WBP_Redeployment.WBP_Redeployment_C.ExecuteUbergraph_WBP_Redeployment
// 0x0120 (0x0120 - 0x0000)
struct WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1700[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotificationID, EGzNotificationStageType StageType, const struct FGzEventNotificationData& NotificationData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  K2Node_DynamicCast_AsBP_Player_Character;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1701[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGzPlayerState*>                 CallFunc_GetTeammates_ReturnValue;                 // 0x0048(0x0010)(ReferenceParm)
	class AGzPlayerState*                         CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1702[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGzPlayerState*>                 CallFunc_GetTeammates_ReturnValue_1;               // 0x0078(0x0010)(ReferenceParm)
	class AGzPlayerState*                         CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1703[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1704[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1705[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzInvComponent*                        CallFunc_GetInventoryComponent_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1706[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGzInvItem& Item, EGzInvChangeEvent ChangeEvent)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGzInvItem& ItemDelta, EGzInvChangeEvent Event)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzGameNotificationSubsystem*           CallFunc_GetWorldSubsystem_ReturnValue;            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotificationID;                 // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzNotificationStageType                      K2Node_CustomEvent_StageType;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1707[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzEventNotificationData               K2Node_CustomEvent_NotificationData;               // 0x010C(0x0010)(NoDestructor)
};
static_assert(alignof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment) == 0x000008, "Wrong alignment on WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment");
static_assert(sizeof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment) == 0x000120, "Wrong size on WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, EntryPoint) == 0x000000, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000030, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, K2Node_DynamicCast_AsBP_Player_Character) == 0x000038, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::K2Node_DynamicCast_AsBP_Player_Character' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, CallFunc_GetTeammates_ReturnValue) == 0x000048, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::CallFunc_GetTeammates_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, K2Node_CreateDelegate_OutputDelegate_1) == 0x000064, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, CallFunc_GetTeammates_ReturnValue_1) == 0x000078, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::CallFunc_GetTeammates_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, K2Node_CreateDelegate_OutputDelegate_2) == 0x000094, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, CallFunc_GetOwningPlayerPawn_ReturnValue_1) == 0x0000A8, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::CallFunc_GetOwningPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, Temp_int_Loop_Counter_Variable_1) == 0x0000B0, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, K2Node_DynamicCast_AsGz_Player_Character) == 0x0000B8, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, CallFunc_GetInventoryComponent_ReturnValue) == 0x0000C8, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::CallFunc_GetInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D0, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D4, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D8, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000E8, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, CallFunc_GetWorldSubsystem_ReturnValue) == 0x0000F8, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, K2Node_CustomEvent_NotificationID) == 0x000100, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::K2Node_CustomEvent_NotificationID' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, K2Node_CustomEvent_StageType) == 0x000108, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::K2Node_CustomEvent_StageType' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment, K2Node_CustomEvent_NotificationData) == 0x00010C, "Member 'WBP_Redeployment_C_ExecuteUbergraph_WBP_Redeployment::K2Node_CustomEvent_NotificationData' has a wrong offset!");

// Function WBP_Redeployment.WBP_Redeployment_C.EventCheck
// 0x0038 (0x0038 - 0x0000)
struct WBP_Redeployment_C_EventCheck final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventActive_IsActive;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1708[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_IsEventActive_ExpireTime;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1709[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_C_EventCheck) == 0x000008, "Wrong alignment on WBP_Redeployment_C_EventCheck");
static_assert(sizeof(WBP_Redeployment_C_EventCheck) == 0x000038, "Wrong size on WBP_Redeployment_C_EventCheck");
static_assert(offsetof(WBP_Redeployment_C_EventCheck, IsActive) == 0x000000, "Member 'WBP_Redeployment_C_EventCheck::IsActive' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_EventCheck, Temp_byte_Variable) == 0x000001, "Member 'WBP_Redeployment_C_EventCheck::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_EventCheck, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Redeployment_C_EventCheck::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_EventCheck, Temp_bool_Variable) == 0x000003, "Member 'WBP_Redeployment_C_EventCheck::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_EventCheck, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_Redeployment_C_EventCheck::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_EventCheck, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_Redeployment_C_EventCheck::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_EventCheck, CallFunc_IsEventActive_IsActive) == 0x000006, "Member 'WBP_Redeployment_C_EventCheck::CallFunc_IsEventActive_IsActive' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_EventCheck, CallFunc_IsEventActive_ExpireTime) == 0x000008, "Member 'WBP_Redeployment_C_EventCheck::CallFunc_IsEventActive_ExpireTime' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_EventCheck, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Redeployment_C_EventCheck::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_EventCheck, K2Node_Select_Default) == 0x000020, "Member 'WBP_Redeployment_C_EventCheck::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_EventCheck, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'WBP_Redeployment_C_EventCheck::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_EventCheck, Temp_bool_Variable_1) == 0x000030, "Member 'WBP_Redeployment_C_EventCheck::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_EventCheck, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000031, "Member 'WBP_Redeployment_C_EventCheck::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_C_EventCheck, K2Node_Select_Default_1) == 0x000032, "Member 'WBP_Redeployment_C_EventCheck::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_Redeployment.WBP_Redeployment_C.CurrencyFilter
// 0x0020 (0x0020 - 0x0000)
struct WBP_Redeployment_C_CurrencyFilter final
{
public:
	struct FGzInvItem                             Item;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EGzInvChangeEvent                             ChangeEvent;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
