#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoiceChatStateWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VoiceChatStateWidget.WBP_VoiceChatStateWidget_C
// 0x0068 (0x03E8 - 0x0380)
class UWBP_VoiceChatStateWidget_C final : public UGzVoiceChatStateWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_46;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           List;                                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           NameTextBlock;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Name_WBP_VoiceChatStateWidget_C;                   // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGzVoiceChatTalker                     New_Talker;                                        // 0x03B0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_VoiceChatStateWidget(int32 EntryPoint);
	void OnRoomEnter();
	void OnRoomExit();
	void OnTalkerAdded(const struct FGzVoiceChatTalker& NewTalker);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VoiceChatStateWidget_C">();
	}
	static class UWBP_VoiceChatStateWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VoiceChatStateWidget_C>();
	}
};
static_assert(alignof(UWBP_VoiceChatStateWidget_C) == 0x000008, "Wrong alignment on UWBP_VoiceChatStateWidget_C");
static_assert(sizeof(UWBP_VoiceChatStateWidget_C) == 0x0003E8, "Wrong size on UWBP_VoiceChatStateWidget_C");
static_assert(offsetof(UWBP_VoiceChatStateWidget_C, UberGraphFrame) == 0x000380, "Member 'UWBP_VoiceChatStateWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatStateWidget_C, Image_46) == 0x000388, "Member 'UWBP_VoiceChatStateWidget_C::Image_46' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatStateWidget_C, List) == 0x000390, "Member 'UWBP_VoiceChatStateWidget_C::List' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatStateWidget_C, NameTextBlock) == 0x000398, "Member 'UWBP_VoiceChatStateWidget_C::NameTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatStateWidget_C, Name_WBP_VoiceChatStateWidget_C) == 0x0003A0, "Member 'UWBP_VoiceChatStateWidget_C::Name_WBP_VoiceChatStateWidget_C' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatStateWidget_C, New_Talker) == 0x0003B0, "Member 'UWBP_VoiceChatStateWidget_C::New_Talker' has a wrong offset!");

}

