#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BaseTooltip

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_BaseTooltip.WBP_BaseTooltip_C.GetItemData
// 0x0008 (0x0008 - 0x0000)
struct WBP_BaseTooltip_C_GetItemData final
{
public:
	class UGzItemData*                            Param_ItemData;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseTooltip_C_GetItemData) == 0x000008, "Wrong alignment on WBP_BaseTooltip_C_GetItemData");
static_assert(sizeof(WBP_BaseTooltip_C_GetItemData) == 0x000008, "Wrong size on WBP_BaseTooltip_C_GetItemData");
static_assert(offsetof(WBP_BaseTooltip_C_GetItemData, Param_ItemData) == 0x000000, "Member 'WBP_BaseTooltip_C_GetItemData::Param_ItemData' has a wrong offset!");

// Function WBP_BaseTooltip.WBP_BaseTooltip_C.SetItemData
// 0x0008 (0x0008 - 0x0000)
struct WBP_BaseTooltip_C_SetItemData final
{
public:
	class UGzItemData*                            Param_ItemData;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseTooltip_C_SetItemData) == 0x000008, "Wrong alignment on WBP_BaseTooltip_C_SetItemData");
static_assert(sizeof(WBP_BaseTooltip_C_SetItemData) == 0x000008, "Wrong size on WBP_BaseTooltip_C_SetItemData");
static_assert(offsetof(WBP_BaseTooltip_C_SetItemData, Param_ItemData) == 0x000000, "Member 'WBP_BaseTooltip_C_SetItemData::Param_ItemData' has a wrong offset!");

}

