#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Crosshairs

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_Crosshairs.WBP_HUD_Crosshairs_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_HUD_Crosshairs_C final : public UUserWidget
{
public:
	class UWBP_HitmarkContainer_C*                WBP_HitmarkContainer;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InGame_CrosshairContainer_C*       WBP_InGame_CrosshairContainer;                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LimbInputHintContainer_C*          WBP_LimbInputHintContainer;                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Limbs_DebuffContainer_C*           WBP_Limbs_DebuffContainer;                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RadialReloadProgress_C*            WBP_RadialReloadProgress;                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_Crosshairs_C">();
	}
	static class UWBP_HUD_Crosshairs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_Crosshairs_C>();
	}
};
static_assert(alignof(UWBP_HUD_Crosshairs_C) == 0x000008, "Wrong alignment on UWBP_HUD_Crosshairs_C");
static_assert(sizeof(UWBP_HUD_Crosshairs_C) == 0x000308, "Wrong size on UWBP_HUD_Crosshairs_C");
static_assert(offsetof(UWBP_HUD_Crosshairs_C, WBP_HitmarkContainer) == 0x0002E0, "Member 'UWBP_HUD_Crosshairs_C::WBP_HitmarkContainer' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Crosshairs_C, WBP_InGame_CrosshairContainer) == 0x0002E8, "Member 'UWBP_HUD_Crosshairs_C::WBP_InGame_CrosshairContainer' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Crosshairs_C, WBP_LimbInputHintContainer) == 0x0002F0, "Member 'UWBP_HUD_Crosshairs_C::WBP_LimbInputHintContainer' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Crosshairs_C, WBP_Limbs_DebuffContainer) == 0x0002F8, "Member 'UWBP_HUD_Crosshairs_C::WBP_Limbs_DebuffContainer' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Crosshairs_C, WBP_RadialReloadProgress) == 0x000300, "Member 'UWBP_HUD_Crosshairs_C::WBP_RadialReloadProgress' has a wrong offset!");

}

