#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DamageIndicator_Directional_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "WBP_DamageIndicator_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DamageIndicator_Directional_Parent.WBP_DamageIndicator_Directional_Parent_C
// 0x0058 (0x0418 - 0x03C0)
class UWBP_DamageIndicator_Directional_Parent_C : public UWBP_DamageIndicator_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_DamageIndicator_Directional_Parent_C; // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Repeat;                                            // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Indicator;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              ImageTexture;                                      // 0x03E0(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)
	struct FLinearColor                           ImageColor;                                        // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_DamageIndicator_Directional_Parent(int32 EntryPoint);
	void OnRepeat();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DamageIndicator_Directional_Parent_C">();
	}
	static class UWBP_DamageIndicator_Directional_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DamageIndicator_Directional_Parent_C>();
	}
};
static_assert(alignof(UWBP_DamageIndicator_Directional_Parent_C) == 0x000008, "Wrong alignment on UWBP_DamageIndicator_Directional_Parent_C");
static_assert(sizeof(UWBP_DamageIndicator_Directional_Parent_C) == 0x000418, "Wrong size on UWBP_DamageIndicator_Directional_Parent_C");
static_assert(offsetof(UWBP_DamageIndicator_Directional_Parent_C, UberGraphFrame_WBP_DamageIndicator_Directional_Parent_C) == 0x0003C0, "Member 'UWBP_DamageIndicator_Directional_Parent_C::UberGraphFrame_WBP_DamageIndicator_Directional_Parent_C' has a wrong offset!");
static_assert(offsetof(UWBP_DamageIndicator_Directional_Parent_C, Repeat) == 0x0003C8, "Member 'UWBP_DamageIndicator_Directional_Parent_C::Repeat' has a wrong offset!");
static_assert(offsetof(UWBP_DamageIndicator_Directional_Parent_C, Image_Indicator) == 0x0003D0, "Member 'UWBP_DamageIndicator_Directional_Parent_C::Image_Indicator' has a wrong offset!");
static_assert(offsetof(UWBP_DamageIndicator_Directional_Parent_C, Overlay) == 0x0003D8, "Member 'UWBP_DamageIndicator_Directional_Parent_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_DamageIndicator_Directional_Parent_C, ImageTexture) == 0x0003E0, "Member 'UWBP_DamageIndicator_Directional_Parent_C::ImageTexture' has a wrong offset!");
static_assert(offsetof(UWBP_DamageIndicator_Directional_Parent_C, ImageColor) == 0x000408, "Member 'UWBP_DamageIndicator_Directional_Parent_C::ImageColor' has a wrong offset!");

}

