#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RewardTooltipContainer

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RewardTooltipContainer.WBP_RewardTooltipContainer_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_RewardTooltipContainer_C final : public UUserWidget
{
public:
	class UHorizontalBox*                         Reward_HorizontalBox;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardTooltipSlot_C*               WBP_RewardTooltipSlot1;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardTooltipSlot_C*               WBP_RewardTooltipSlot2;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetRewards(class UGzMissionData* MissionData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RewardTooltipContainer_C">();
	}
	static class UWBP_RewardTooltipContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RewardTooltipContainer_C>();
	}
};
static_assert(alignof(UWBP_RewardTooltipContainer_C) == 0x000008, "Wrong alignment on UWBP_RewardTooltipContainer_C");
static_assert(sizeof(UWBP_RewardTooltipContainer_C) == 0x0002F8, "Wrong size on UWBP_RewardTooltipContainer_C");
static_assert(offsetof(UWBP_RewardTooltipContainer_C, Reward_HorizontalBox) == 0x0002E0, "Member 'UWBP_RewardTooltipContainer_C::Reward_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_RewardTooltipContainer_C, WBP_RewardTooltipSlot1) == 0x0002E8, "Member 'UWBP_RewardTooltipContainer_C::WBP_RewardTooltipSlot1' has a wrong offset!");
static_assert(offsetof(UWBP_RewardTooltipContainer_C, WBP_RewardTooltipSlot2) == 0x0002F0, "Member 'UWBP_RewardTooltipContainer_C::WBP_RewardTooltipSlot2' has a wrong offset!");

}

