#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Map_Minimap

#include "Basic.hpp"

#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Map_Minimap.WBP_Map_Minimap_C
// 0x0018 (0x0598 - 0x0580)
class UWBP_Map_Minimap_C final : public UGzMapWidget
{
public:
	class UImage*                                 Image_86;                                          // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           LandingZonesContainer;                             // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         PixelResolution;                                   // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Map_Minimap_C">();
	}
	static class UWBP_Map_Minimap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Map_Minimap_C>();
	}
};
static_assert(alignof(UWBP_Map_Minimap_C) == 0x000008, "Wrong alignment on UWBP_Map_Minimap_C");
static_assert(sizeof(UWBP_Map_Minimap_C) == 0x000598, "Wrong size on UWBP_Map_Minimap_C");
static_assert(offsetof(UWBP_Map_Minimap_C, Image_86) == 0x000580, "Member 'UWBP_Map_Minimap_C::Image_86' has a wrong offset!");
static_assert(offsetof(UWBP_Map_Minimap_C, LandingZonesContainer) == 0x000588, "Member 'UWBP_Map_Minimap_C::LandingZonesContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Map_Minimap_C, PixelResolution) == 0x000590, "Member 'UWBP_Map_Minimap_C::PixelResolution' has a wrong offset!");

}

