#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VehicleGun_Overheat

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_VehicleGun_Overheat.WBP_VehicleGun_Overheat_C.ExecuteUbergraph_WBP_VehicleGun_Overheat
// 0x0160 (0x0160 - 0x0000)
struct WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5921[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetOverheatPercentage_ReturnValue;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5922[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_CustomEvent_Character;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzVehicleSeatType                            K2Node_CustomEvent_NewSeat;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzVehicleSeatType                            K2Node_CustomEvent_OldSeat;                        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5923[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGzCharacter* Character, EGzVehicleSeatType NewSeat, EGzVehicleSeatType OldSeat)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5924[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0038(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsOverheated;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5925[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsOverheated)>           K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ViewTarget;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5926[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGzPlayerViewTargetInterface> K2Node_DynamicCast_AsGz_Player_View_Target_Interface; // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5927[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzBaseCharacter*                       CallFunc_GetViewTargetCharacter_ReturnValue;       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5928[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzBaseCharacter*                       Temp_object_Variable;                              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5929[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592A[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzVehicle*                             CallFunc_GetCurrentVehicle_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592B[0x6];                                     // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzTurretComponent*                     CallFunc_GetTurretComponent_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzTurretWeaponActor*                   CallFunc_GetTurretWeaponActor_ReturnValue;         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592C[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzWeaponComponent*                     CallFunc_GetWeaponComponent_ReturnValue;           // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOverheatPercentage_ReturnValue_1;      // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592D[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592E[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue;          // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592F[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_B_ImplicitCast;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLinearColorValue_InTime_ImplicitCast;  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat) == 0x000008, "Wrong alignment on WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat");
static_assert(sizeof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat) == 0x000160, "Wrong size on WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, EntryPoint) == 0x000000, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, Temp_byte_Variable) == 0x000004, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_GetOverheatPercentage_ReturnValue) == 0x000008, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_GetOverheatPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_SafeDivide_ReturnValue) == 0x000010, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_CustomEvent_Character) == 0x000018, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_CustomEvent_NewSeat) == 0x000020, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_CustomEvent_NewSeat' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_CustomEvent_OldSeat) == 0x000021, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_CustomEvent_OldSeat' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000034, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, Temp_byte_Variable_1) == 0x000035, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_Event_MyGeometry) == 0x000038, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_Event_InDeltaTime) == 0x000070, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_CustomEvent_bIsOverheated) == 0x000074, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_CustomEvent_bIsOverheated' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_CreateDelegate_OutputDelegate_1) == 0x000078, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_Event_ViewTarget) == 0x000088, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_Event_ViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, Temp_bool_Variable) == 0x000090, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_DynamicCast_AsGz_Player_View_Target_Interface) == 0x000098, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_DynamicCast_AsGz_Player_View_Target_Interface' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_GetViewTargetCharacter_ReturnValue) == 0x0000B0, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_GetViewTargetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_Select_Default) == 0x0000B8, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_IsValid_ReturnValue_1) == 0x0000B9, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000C0, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, Temp_object_Variable) == 0x0000C8, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_IsValid_ReturnValue_2) == 0x0000D0, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_DynamicCast_AsGz_Character) == 0x0000D8, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_GetCurrentVehicle_ReturnValue) == 0x0000E8, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_GetCurrentVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_IsValid_ReturnValue_3) == 0x0000F0, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_IsValid_ReturnValue_4) == 0x0000F1, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_GetTurretComponent_ReturnValue) == 0x0000F8, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_GetTurretComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_GetTurretWeaponActor_ReturnValue) == 0x000100, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_GetTurretWeaponActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_IsValid_ReturnValue_5) == 0x000108, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_GetWeaponComponent_ReturnValue) == 0x000110, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_GetWeaponComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_GetOverheatPercentage_ReturnValue_1) == 0x000118, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_GetOverheatPercentage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, K2Node_Event_IsDesignTime) == 0x00011C, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_SelectInt_ReturnValue) == 0x000120, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_SelectFloat_ReturnValue) == 0x000128, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_GetLinearColorValue_ReturnValue) == 0x000130, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_GetLinearColorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_SafeDivide_A_ImplicitCast) == 0x000140, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_SafeDivide_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000148, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_SelectFloat_B_ImplicitCast) == 0x000150, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_SelectFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat, CallFunc_GetLinearColorValue_InTime_ImplicitCast) == 0x000158, "Member 'WBP_VehicleGun_Overheat_C_ExecuteUbergraph_WBP_VehicleGun_Overheat::CallFunc_GetLinearColorValue_InTime_ImplicitCast' has a wrong offset!");

// Function WBP_VehicleGun_Overheat.WBP_VehicleGun_Overheat_C.OnOverheatStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_VehicleGun_Overheat_C_OnOverheatStatusChanged final
{
public:
	bool                                          Param_bIsOverheated;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VehicleGun_Overheat_C_OnOverheatStatusChanged) == 0x000001, "Wrong alignment on WBP_VehicleGun_Overheat_C_OnOverheatStatusChanged");
static_assert(sizeof(WBP_VehicleGun_Overheat_C_OnOverheatStatusChanged) == 0x000001, "Wrong size on WBP_VehicleGun_Overheat_C_OnOverheatStatusChanged");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_OnOverheatStatusChanged, Param_bIsOverheated) == 0x000000, "Member 'WBP_VehicleGun_Overheat_C_OnOverheatStatusChanged::Param_bIsOverheated' has a wrong offset!");

// Function WBP_VehicleGun_Overheat.WBP_VehicleGun_Overheat_C.OnVehicleSeatChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_VehicleGun_Overheat_C_OnVehicleSeatChanged final
{
public:
	class AGzCharacter*                           Param_Character;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzVehicleSeatType                            NewSeat;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzVehicleSeatType                            OldSeat;                                           // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VehicleGun_Overheat_C_OnVehicleSeatChanged) == 0x000008, "Wrong alignment on WBP_VehicleGun_Overheat_C_OnVehicleSeatChanged");
static_assert(sizeof(WBP_VehicleGun_Overheat_C_OnVehicleSeatChanged) == 0x000010, "Wrong size on WBP_VehicleGun_Overheat_C_OnVehicleSeatChanged");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_OnVehicleSeatChanged, Param_Character) == 0x000000, "Member 'WBP_VehicleGun_Overheat_C_OnVehicleSeatChanged::Param_Character' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_OnVehicleSeatChanged, NewSeat) == 0x000008, "Member 'WBP_VehicleGun_Overheat_C_OnVehicleSeatChanged::NewSeat' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_OnVehicleSeatChanged, OldSeat) == 0x000009, "Member 'WBP_VehicleGun_Overheat_C_OnVehicleSeatChanged::OldSeat' has a wrong offset!");

// Function WBP_VehicleGun_Overheat.WBP_VehicleGun_Overheat_C.OnViewTargetChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_VehicleGun_Overheat_C_OnViewTargetChanged final
{
public:
	class APawn*                                  ViewTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VehicleGun_Overheat_C_OnViewTargetChanged) == 0x000008, "Wrong alignment on WBP_VehicleGun_Overheat_C_OnViewTargetChanged");
static_assert(sizeof(WBP_VehicleGun_Overheat_C_OnViewTargetChanged) == 0x000008, "Wrong size on WBP_VehicleGun_Overheat_C_OnViewTargetChanged");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_OnViewTargetChanged, ViewTarget) == 0x000000, "Member 'WBP_VehicleGun_Overheat_C_OnViewTargetChanged::ViewTarget' has a wrong offset!");

// Function WBP_VehicleGun_Overheat.WBP_VehicleGun_Overheat_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_VehicleGun_Overheat_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VehicleGun_Overheat_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_VehicleGun_Overheat_C_PreConstruct");
static_assert(sizeof(WBP_VehicleGun_Overheat_C_PreConstruct) == 0x000001, "Wrong size on WBP_VehicleGun_Overheat_C_PreConstruct");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_VehicleGun_Overheat_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_VehicleGun_Overheat.WBP_VehicleGun_Overheat_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_VehicleGun_Overheat_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VehicleGun_Overheat_C_Tick) == 0x000004, "Wrong alignment on WBP_VehicleGun_Overheat_C_Tick");
static_assert(sizeof(WBP_VehicleGun_Overheat_C_Tick) == 0x00003C, "Wrong size on WBP_VehicleGun_Overheat_C_Tick");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_VehicleGun_Overheat_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_VehicleGun_Overheat_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_VehicleGun_Overheat_C_Tick::InDeltaTime' has a wrong offset!");

}

