#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CurrencyDisplay

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CurrencyDisplay.WBP_CurrencyDisplay_C.BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CurrencyDisplay_C_BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CurrencyDisplay_C_BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CurrencyDisplay_C_BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CurrencyDisplay_C_BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CurrencyDisplay_C_BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CurrencyDisplay_C_BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CurrencyDisplay_C_BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CurrencyDisplay.WBP_CurrencyDisplay_C.BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CurrencyDisplay_C_BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CurrencyDisplay_C_BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CurrencyDisplay_C_BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CurrencyDisplay_C_BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CurrencyDisplay_C_BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CurrencyDisplay_C_BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CurrencyDisplay_C_BndEvt__WBP_CurrencyDisplay_PocketButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CurrencyDisplay.WBP_CurrencyDisplay_C.ExecuteUbergraph_WBP_CurrencyDisplay
// 0x0028 (0x0028 - 0x0000)
struct WBP_CurrencyDisplay_C_ExecuteUbergraph_WBP_CurrencyDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B44[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGzInvItem                             K2Node_Event_NewItem;                              // 0x0010(0x0010)(ConstParm)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CurrencyDisplay_C_ExecuteUbergraph_WBP_CurrencyDisplay) == 0x000008, "Wrong alignment on WBP_CurrencyDisplay_C_ExecuteUbergraph_WBP_CurrencyDisplay");
static_assert(sizeof(WBP_CurrencyDisplay_C_ExecuteUbergraph_WBP_CurrencyDisplay) == 0x000028, "Wrong size on WBP_CurrencyDisplay_C_ExecuteUbergraph_WBP_CurrencyDisplay");
static_assert(offsetof(WBP_CurrencyDisplay_C_ExecuteUbergraph_WBP_CurrencyDisplay, EntryPoint) == 0x000000, "Member 'WBP_CurrencyDisplay_C_ExecuteUbergraph_WBP_CurrencyDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_ExecuteUbergraph_WBP_CurrencyDisplay, K2Node_ComponentBoundEvent_Button_1) == 0x000008, "Member 'WBP_CurrencyDisplay_C_ExecuteUbergraph_WBP_CurrencyDisplay::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_ExecuteUbergraph_WBP_CurrencyDisplay, K2Node_Event_NewItem) == 0x000010, "Member 'WBP_CurrencyDisplay_C_ExecuteUbergraph_WBP_CurrencyDisplay::K2Node_Event_NewItem' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_ExecuteUbergraph_WBP_CurrencyDisplay, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'WBP_CurrencyDisplay_C_ExecuteUbergraph_WBP_CurrencyDisplay::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_CurrencyDisplay.WBP_CurrencyDisplay_C.OnPocketChanged_BP
// 0x0010 (0x0010 - 0x0000)
struct WBP_CurrencyDisplay_C_OnPocketChanged_BP final
{
public:
	struct FGzInvItem                             NewItem;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CurrencyDisplay_C_OnPocketChanged_BP) == 0x000008, "Wrong alignment on WBP_CurrencyDisplay_C_OnPocketChanged_BP");
static_assert(sizeof(WBP_CurrencyDisplay_C_OnPocketChanged_BP) == 0x000010, "Wrong size on WBP_CurrencyDisplay_C_OnPocketChanged_BP");
static_assert(offsetof(WBP_CurrencyDisplay_C_OnPocketChanged_BP, NewItem) == 0x000000, "Member 'WBP_CurrencyDisplay_C_OnPocketChanged_BP::NewItem' has a wrong offset!");

// Function WBP_CurrencyDisplay.WBP_CurrencyDisplay_C.TryDropCurrency
// 0x0070 (0x0070 - 0x0000)
struct WBP_CurrencyDisplay_C_TryDropCurrency final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerController*                    K2Node_DynamicCast_AsGz_Player_Controller;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B45[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGzInventoryItemContent                K2Node_MakeStruct_GzInventoryItemContent;          // 0x0018(0x0048)()
	struct FGzInvItem                             CallFunc_MakeItemFromContent_ReturnValue;          // 0x0060(0x0010)()
};
static_assert(alignof(WBP_CurrencyDisplay_C_TryDropCurrency) == 0x000008, "Wrong alignment on WBP_CurrencyDisplay_C_TryDropCurrency");
static_assert(sizeof(WBP_CurrencyDisplay_C_TryDropCurrency) == 0x000070, "Wrong size on WBP_CurrencyDisplay_C_TryDropCurrency");
static_assert(offsetof(WBP_CurrencyDisplay_C_TryDropCurrency, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'WBP_CurrencyDisplay_C_TryDropCurrency::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_TryDropCurrency, K2Node_DynamicCast_AsGz_Player_Controller) == 0x000008, "Member 'WBP_CurrencyDisplay_C_TryDropCurrency::K2Node_DynamicCast_AsGz_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_TryDropCurrency, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_CurrencyDisplay_C_TryDropCurrency::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_TryDropCurrency, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000011, "Member 'WBP_CurrencyDisplay_C_TryDropCurrency::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_TryDropCurrency, CallFunc_SelectInt_ReturnValue) == 0x000014, "Member 'WBP_CurrencyDisplay_C_TryDropCurrency::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_TryDropCurrency, K2Node_MakeStruct_GzInventoryItemContent) == 0x000018, "Member 'WBP_CurrencyDisplay_C_TryDropCurrency::K2Node_MakeStruct_GzInventoryItemContent' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_TryDropCurrency, CallFunc_MakeItemFromContent_ReturnValue) == 0x000060, "Member 'WBP_CurrencyDisplay_C_TryDropCurrency::CallFunc_MakeItemFromContent_ReturnValue' has a wrong offset!");

// Function WBP_CurrencyDisplay.WBP_CurrencyDisplay_C.UpdateCurrencyDisplay
// 0x0078 (0x0078 - 0x0000)
struct WBP_CurrencyDisplay_C_UpdateCurrencyDisplay final
{
public:
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B46[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CurrencyTextFormat_Result;                // 0x0028(0x0010)()
	struct FGzInvPocket                           CallFunc_GetPocket_ReturnValue;                    // 0x0038(0x0028)(ConstParm)
	int32                                         CallFunc_GetItemQuantity_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B47[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CurrencyDisplay_C_UpdateCurrencyDisplay) == 0x000008, "Wrong alignment on WBP_CurrencyDisplay_C_UpdateCurrencyDisplay");
static_assert(sizeof(WBP_CurrencyDisplay_C_UpdateCurrencyDisplay) == 0x000078, "Wrong size on WBP_CurrencyDisplay_C_UpdateCurrencyDisplay");
static_assert(offsetof(WBP_CurrencyDisplay_C_UpdateCurrencyDisplay, Temp_struct_Variable) == 0x000000, "Member 'WBP_CurrencyDisplay_C_UpdateCurrencyDisplay::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_UpdateCurrencyDisplay, Temp_struct_Variable_1) == 0x000010, "Member 'WBP_CurrencyDisplay_C_UpdateCurrencyDisplay::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_UpdateCurrencyDisplay, Temp_bool_Variable) == 0x000020, "Member 'WBP_CurrencyDisplay_C_UpdateCurrencyDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_UpdateCurrencyDisplay, CallFunc_CurrencyTextFormat_Result) == 0x000028, "Member 'WBP_CurrencyDisplay_C_UpdateCurrencyDisplay::CallFunc_CurrencyTextFormat_Result' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_UpdateCurrencyDisplay, CallFunc_GetPocket_ReturnValue) == 0x000038, "Member 'WBP_CurrencyDisplay_C_UpdateCurrencyDisplay::CallFunc_GetPocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_UpdateCurrencyDisplay, CallFunc_GetItemQuantity_ReturnValue) == 0x000060, "Member 'WBP_CurrencyDisplay_C_UpdateCurrencyDisplay::CallFunc_GetItemQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_UpdateCurrencyDisplay, CallFunc_Greater_IntInt_ReturnValue) == 0x000064, "Member 'WBP_CurrencyDisplay_C_UpdateCurrencyDisplay::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CurrencyDisplay_C_UpdateCurrencyDisplay, K2Node_Select_Default) == 0x000068, "Member 'WBP_CurrencyDisplay_C_UpdateCurrencyDisplay::K2Node_Select_Default' has a wrong offset!");

}

