#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipInteraction_Mission

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "G01_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_TooltipInteraction_Mission.WBP_TooltipInteraction_Mission_C.CustomEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_TooltipInteraction_Mission_C_CustomEvent final
{
public:
	const class UGzGameMessage*                   Message;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Mission_C_CustomEvent) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Mission_C_CustomEvent");
static_assert(sizeof(WBP_TooltipInteraction_Mission_C_CustomEvent) == 0x000008, "Wrong size on WBP_TooltipInteraction_Mission_C_CustomEvent");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_CustomEvent, Message) == 0x000000, "Member 'WBP_TooltipInteraction_Mission_C_CustomEvent::Message' has a wrong offset!");

// Function WBP_TooltipInteraction_Mission.WBP_TooltipInteraction_Mission_C.ExecuteUbergraph_WBP_TooltipInteraction_Mission
// 0x0080 (0x0080 - 0x0000)
struct WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BFC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzGameModeSubsystem*                   K2Node_CustomEvent_Subsystem;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzGameModeSubsystem* Subsystem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzGameModeSubsystem*                   Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzWaitSubsystem*                       CallFunc_WaitSubsystem_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BFD[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzGameMessageSubsystem*                K2Node_DynamicCast_AsGz_Game_Message_Subsystem;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BFE[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UGzGameMessage* Message)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BFF[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGzGameMessage*                   K2Node_CustomEvent_Message;                        // 0x0058(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameMessage_MissionCreationFailed_C* K2Node_DynamicCast_AsBP_Game_Message_Mission_Creation_Failed; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C00[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGzMissionData*                   CallFunc_GetMissionData_ReturnValue;               // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission");
static_assert(sizeof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission) == 0x000080, "Wrong size on WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission, EntryPoint) == 0x000000, "Member 'WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission, K2Node_CustomEvent_Subsystem) == 0x000008, "Member 'WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission::K2Node_CustomEvent_Subsystem' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission, Temp_object_Variable) == 0x000020, "Member 'WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission, CallFunc_WaitSubsystem_ReturnValue) == 0x000028, "Member 'WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission::CallFunc_WaitSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission, K2Node_DynamicCast_AsGz_Game_Message_Subsystem) == 0x000038, "Member 'WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission::K2Node_DynamicCast_AsGz_Game_Message_Subsystem' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission, K2Node_CustomEvent_Message) == 0x000058, "Member 'WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission, K2Node_DynamicCast_AsBP_Game_Message_Mission_Creation_Failed) == 0x000060, "Member 'WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission::K2Node_DynamicCast_AsBP_Game_Message_Mission_Creation_Failed' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission, CallFunc_GetMissionData_ReturnValue) == 0x000070, "Member 'WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission::CallFunc_GetMissionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000078, "Member 'WBP_TooltipInteraction_Mission_C_ExecuteUbergraph_WBP_TooltipInteraction_Mission::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_TooltipInteraction_Mission.WBP_TooltipInteraction_Mission_C.InitItemSetup
// 0x0010 (0x0010 - 0x0000)
struct WBP_TooltipInteraction_Mission_C_InitItemSetup final
{
public:
	class UGzMissionData*                         MissionData;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Mission_C_InitItemSetup) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Mission_C_InitItemSetup");
static_assert(sizeof(WBP_TooltipInteraction_Mission_C_InitItemSetup) == 0x000010, "Wrong size on WBP_TooltipInteraction_Mission_C_InitItemSetup");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_InitItemSetup, MissionData) == 0x000000, "Member 'WBP_TooltipInteraction_Mission_C_InitItemSetup::MissionData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_InitItemSetup, Temp_byte_Variable) == 0x000008, "Member 'WBP_TooltipInteraction_Mission_C_InitItemSetup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_InitItemSetup, Temp_byte_Variable_1) == 0x000009, "Member 'WBP_TooltipInteraction_Mission_C_InitItemSetup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_InitItemSetup, Temp_bool_Variable) == 0x00000A, "Member 'WBP_TooltipInteraction_Mission_C_InitItemSetup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_InitItemSetup, K2Node_Select_Default) == 0x00000B, "Member 'WBP_TooltipInteraction_Mission_C_InitItemSetup::K2Node_Select_Default' has a wrong offset!");

// Function WBP_TooltipInteraction_Mission.WBP_TooltipInteraction_Mission_C.OnReady_40AF62C64648AFF30BACB3BDADBC7852
// 0x0008 (0x0008 - 0x0000)
struct WBP_TooltipInteraction_Mission_C_OnReady_40AF62C64648AFF30BACB3BDADBC7852 final
{
public:
	class AGzGameModeSubsystem*                   Subsystem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Mission_C_OnReady_40AF62C64648AFF30BACB3BDADBC7852) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Mission_C_OnReady_40AF62C64648AFF30BACB3BDADBC7852");
static_assert(sizeof(WBP_TooltipInteraction_Mission_C_OnReady_40AF62C64648AFF30BACB3BDADBC7852) == 0x000008, "Wrong size on WBP_TooltipInteraction_Mission_C_OnReady_40AF62C64648AFF30BACB3BDADBC7852");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_OnReady_40AF62C64648AFF30BACB3BDADBC7852, Subsystem) == 0x000000, "Member 'WBP_TooltipInteraction_Mission_C_OnReady_40AF62C64648AFF30BACB3BDADBC7852::Subsystem' has a wrong offset!");

// Function WBP_TooltipInteraction_Mission.WBP_TooltipInteraction_Mission_C.SetMissionDescription
// 0x0010 (0x0010 - 0x0000)
struct WBP_TooltipInteraction_Mission_C_SetMissionDescription final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_TooltipInteraction_Mission_C_SetMissionDescription) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Mission_C_SetMissionDescription");
static_assert(sizeof(WBP_TooltipInteraction_Mission_C_SetMissionDescription) == 0x000010, "Wrong size on WBP_TooltipInteraction_Mission_C_SetMissionDescription");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_SetMissionDescription, Description) == 0x000000, "Member 'WBP_TooltipInteraction_Mission_C_SetMissionDescription::Description' has a wrong offset!");

// Function WBP_TooltipInteraction_Mission.WBP_TooltipInteraction_Mission_C.SetMissionIcon
// 0x0028 (0x0028 - 0x0000)
struct WBP_TooltipInteraction_Mission_C_SetMissionIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              MissionIcon;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Mission_C_SetMissionIcon) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Mission_C_SetMissionIcon");
static_assert(sizeof(WBP_TooltipInteraction_Mission_C_SetMissionIcon) == 0x000028, "Wrong size on WBP_TooltipInteraction_Mission_C_SetMissionIcon");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_SetMissionIcon, MissionIcon) == 0x000000, "Member 'WBP_TooltipInteraction_Mission_C_SetMissionIcon::MissionIcon' has a wrong offset!");

// Function WBP_TooltipInteraction_Mission.WBP_TooltipInteraction_Mission_C.SetMissionName
// 0x0010 (0x0010 - 0x0000)
struct WBP_TooltipInteraction_Mission_C_SetMissionName final
{
public:
	class FText                                   MissionName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_TooltipInteraction_Mission_C_SetMissionName) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Mission_C_SetMissionName");
static_assert(sizeof(WBP_TooltipInteraction_Mission_C_SetMissionName) == 0x000010, "Wrong size on WBP_TooltipInteraction_Mission_C_SetMissionName");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_SetMissionName, MissionName) == 0x000000, "Member 'WBP_TooltipInteraction_Mission_C_SetMissionName::MissionName' has a wrong offset!");

// Function WBP_TooltipInteraction_Mission.WBP_TooltipInteraction_Mission_C.SetRewards
// 0x0008 (0x0008 - 0x0000)
struct WBP_TooltipInteraction_Mission_C_SetRewards final
{
public:
	class UGzMissionData*                         MissionData;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Mission_C_SetRewards) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Mission_C_SetRewards");
static_assert(sizeof(WBP_TooltipInteraction_Mission_C_SetRewards) == 0x000008, "Wrong size on WBP_TooltipInteraction_Mission_C_SetRewards");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_SetRewards, MissionData) == 0x000000, "Member 'WBP_TooltipInteraction_Mission_C_SetRewards::MissionData' has a wrong offset!");

// Function WBP_TooltipInteraction_Mission.WBP_TooltipInteraction_Mission_C.SetRewardsInfo
// 0x0058 (0x0058 - 0x0000)
struct WBP_TooltipInteraction_Mission_C_SetRewardsInfo final
{
public:
	struct FGzMissionRewardWidgetData             Param_Rewards;                                     // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWidget*                                HorizontalBox;                                     // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 RewardImage;                                       // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             RewardText;                                        // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Mission_C_SetRewardsInfo) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Mission_C_SetRewardsInfo");
static_assert(sizeof(WBP_TooltipInteraction_Mission_C_SetRewardsInfo) == 0x000058, "Wrong size on WBP_TooltipInteraction_Mission_C_SetRewardsInfo");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_SetRewardsInfo, Param_Rewards) == 0x000000, "Member 'WBP_TooltipInteraction_Mission_C_SetRewardsInfo::Param_Rewards' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_SetRewardsInfo, HorizontalBox) == 0x000038, "Member 'WBP_TooltipInteraction_Mission_C_SetRewardsInfo::HorizontalBox' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_SetRewardsInfo, RewardImage) == 0x000040, "Member 'WBP_TooltipInteraction_Mission_C_SetRewardsInfo::RewardImage' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_SetRewardsInfo, RewardText) == 0x000048, "Member 'WBP_TooltipInteraction_Mission_C_SetRewardsInfo::RewardText' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_SetRewardsInfo, CallFunc_TextIsEmpty_ReturnValue) == 0x000050, "Member 'WBP_TooltipInteraction_Mission_C_SetRewardsInfo::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_SetRewardsInfo, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000051, "Member 'WBP_TooltipInteraction_Mission_C_SetRewardsInfo::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_SetRewardsInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000052, "Member 'WBP_TooltipInteraction_Mission_C_SetRewardsInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_SetRewardsInfo, CallFunc_BooleanAND_ReturnValue) == 0x000053, "Member 'WBP_TooltipInteraction_Mission_C_SetRewardsInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_TooltipInteraction_Mission.WBP_TooltipInteraction_Mission_C.UpdateActivatedColor
// 0x002C (0x002C - 0x0000)
struct WBP_TooltipInteraction_Mission_C_UpdateActivatedColor final
{
public:
	bool                                          Activated;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C01[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0014(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorById_ReturnValue;                 // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Mission_C_UpdateActivatedColor) == 0x000004, "Wrong alignment on WBP_TooltipInteraction_Mission_C_UpdateActivatedColor");
static_assert(sizeof(WBP_TooltipInteraction_Mission_C_UpdateActivatedColor) == 0x00002C, "Wrong size on WBP_TooltipInteraction_Mission_C_UpdateActivatedColor");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_UpdateActivatedColor, Activated) == 0x000000, "Member 'WBP_TooltipInteraction_Mission_C_UpdateActivatedColor::Activated' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_UpdateActivatedColor, Temp_bool_Variable) == 0x000001, "Member 'WBP_TooltipInteraction_Mission_C_UpdateActivatedColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_UpdateActivatedColor, Temp_name_Variable) == 0x000004, "Member 'WBP_TooltipInteraction_Mission_C_UpdateActivatedColor::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_UpdateActivatedColor, Temp_name_Variable_1) == 0x00000C, "Member 'WBP_TooltipInteraction_Mission_C_UpdateActivatedColor::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_UpdateActivatedColor, K2Node_Select_Default) == 0x000014, "Member 'WBP_TooltipInteraction_Mission_C_UpdateActivatedColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_UpdateActivatedColor, CallFunc_GetColorById_ReturnValue) == 0x00001C, "Member 'WBP_TooltipInteraction_Mission_C_UpdateActivatedColor::CallFunc_GetColorById_ReturnValue' has a wrong offset!");

// Function WBP_TooltipInteraction_Mission.WBP_TooltipInteraction_Mission_C.UpdateMisionTime
// 0x0018 (0x0018 - 0x0000)
struct WBP_TooltipInteraction_Mission_C_UpdateMisionTime final
{
public:
	class UGzMissionData*                         MissionData;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Time;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 MissionClass;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Mission_C_UpdateMisionTime) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Mission_C_UpdateMisionTime");
static_assert(sizeof(WBP_TooltipInteraction_Mission_C_UpdateMisionTime) == 0x000018, "Wrong size on WBP_TooltipInteraction_Mission_C_UpdateMisionTime");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_UpdateMisionTime, MissionData) == 0x000000, "Member 'WBP_TooltipInteraction_Mission_C_UpdateMisionTime::MissionData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_UpdateMisionTime, Time) == 0x000008, "Member 'WBP_TooltipInteraction_Mission_C_UpdateMisionTime::Time' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Mission_C_UpdateMisionTime, MissionClass) == 0x000010, "Member 'WBP_TooltipInteraction_Mission_C_UpdateMisionTime::MissionClass' has a wrong offset!");

}

