#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipInteraction_Backpack_Comparison

#include "Basic.hpp"

#include "WBP_BaseTooltip_Comparison_classes.hpp"
#include "G01_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TooltipInteraction_Backpack_Comparison.WBP_TooltipInteraction_Backpack_Comparison_C
// 0x0020 (0x0310 - 0x02F0)
class UWBP_TooltipInteraction_Backpack_Comparison_C final : public UWBP_BaseTooltip_Comparison_C
{
public:
	class UImage*                                 Arrows_Image;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Quality_Image;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BackpackPocket_C*                  WBP_BackpackPocket;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemImage_C*                       WBP_ItemImage;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void InitItemSetup(class UGzBackpackItemData* BackpackItemData);
	void SetRarity(EGzItemRarity Rarlity);
	void UpdateTooltip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TooltipInteraction_Backpack_Comparison_C">();
	}
	static class UWBP_TooltipInteraction_Backpack_Comparison_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TooltipInteraction_Backpack_Comparison_C>();
	}
};
static_assert(alignof(UWBP_TooltipInteraction_Backpack_Comparison_C) == 0x000008, "Wrong alignment on UWBP_TooltipInteraction_Backpack_Comparison_C");
static_assert(sizeof(UWBP_TooltipInteraction_Backpack_Comparison_C) == 0x000310, "Wrong size on UWBP_TooltipInteraction_Backpack_Comparison_C");
static_assert(offsetof(UWBP_TooltipInteraction_Backpack_Comparison_C, Arrows_Image) == 0x0002F0, "Member 'UWBP_TooltipInteraction_Backpack_Comparison_C::Arrows_Image' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Backpack_Comparison_C, Quality_Image) == 0x0002F8, "Member 'UWBP_TooltipInteraction_Backpack_Comparison_C::Quality_Image' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Backpack_Comparison_C, WBP_BackpackPocket) == 0x000300, "Member 'UWBP_TooltipInteraction_Backpack_Comparison_C::WBP_BackpackPocket' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Backpack_Comparison_C, WBP_ItemImage) == 0x000308, "Member 'UWBP_TooltipInteraction_Backpack_Comparison_C::WBP_ItemImage' has a wrong offset!");

}

