#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameNotification

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "E_EnclaveOps_structs.hpp"


namespace SDK::Params
{

// Function WBP_GameNotification.WBP_GameNotification_C.AddEnclaveMessage
// 0x0058 (0x0058 - 0x0000)
struct WBP_GameNotification_C_AddEnclaveMessage final
{
public:
	class UGzGameMessage*                         Message;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_EnclaveOps                                  Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C7A[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_EnclaveBreached_C*                  K2Node_DynamicCast_AsBP_Enclave_Breached;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C7B[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_EnclaveOpStarted_C*                 K2Node_DynamicCast_AsBP_Enclave_Op_Started;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C7C[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C7D[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateNotifiction_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C7E[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateNotifiction_ReturnValue_1;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameNotification_C_AddEnclaveMessage) == 0x000008, "Wrong alignment on WBP_GameNotification_C_AddEnclaveMessage");
static_assert(sizeof(WBP_GameNotification_C_AddEnclaveMessage) == 0x000058, "Wrong size on WBP_GameNotification_C_AddEnclaveMessage");
static_assert(offsetof(WBP_GameNotification_C_AddEnclaveMessage, Message) == 0x000000, "Member 'WBP_GameNotification_C_AddEnclaveMessage::Message' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddEnclaveMessage, Temp_byte_Variable) == 0x000008, "Member 'WBP_GameNotification_C_AddEnclaveMessage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddEnclaveMessage, K2Node_DynamicCast_AsBP_Enclave_Breached) == 0x000010, "Member 'WBP_GameNotification_C_AddEnclaveMessage::K2Node_DynamicCast_AsBP_Enclave_Breached' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddEnclaveMessage, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_GameNotification_C_AddEnclaveMessage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddEnclaveMessage, K2Node_DynamicCast_AsBP_Enclave_Op_Started) == 0x000020, "Member 'WBP_GameNotification_C_AddEnclaveMessage::K2Node_DynamicCast_AsBP_Enclave_Op_Started' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddEnclaveMessage, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'WBP_GameNotification_C_AddEnclaveMessage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddEnclaveMessage, Temp_name_Variable) == 0x00002C, "Member 'WBP_GameNotification_C_AddEnclaveMessage::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddEnclaveMessage, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000034, "Member 'WBP_GameNotification_C_AddEnclaveMessage::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddEnclaveMessage, Temp_name_Variable_1) == 0x000038, "Member 'WBP_GameNotification_C_AddEnclaveMessage::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddEnclaveMessage, Temp_name_Variable_2) == 0x000040, "Member 'WBP_GameNotification_C_AddEnclaveMessage::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddEnclaveMessage, CallFunc_CreateNotifiction_ReturnValue) == 0x000048, "Member 'WBP_GameNotification_C_AddEnclaveMessage::CallFunc_CreateNotifiction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddEnclaveMessage, K2Node_Select_Default) == 0x00004C, "Member 'WBP_GameNotification_C_AddEnclaveMessage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddEnclaveMessage, CallFunc_CreateNotifiction_ReturnValue_1) == 0x000054, "Member 'WBP_GameNotification_C_AddEnclaveMessage::CallFunc_CreateNotifiction_ReturnValue_1' has a wrong offset!");

// Function WBP_GameNotification.WBP_GameNotification_C.AddGridMessage
// 0x0078 (0x0078 - 0x0000)
struct WBP_GameNotification_C_AddGridMessage final
{
public:
	class UGzGameMessage*                         Message;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzShrinkingZoneStateMessage*           ZoneStateMessage;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzGameNotificationDisplayData*         CallFunc_CreateNotifictionDisplayData_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzShrinkingZoneStateMessage*           K2Node_DynamicCast_AsGz_Shrinking_Zone_State_Message; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateNotifiction_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C7F[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzGameNotificationDisplayData*         CallFunc_CreateNotifictionDisplayData_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzGameNotificationDisplayData*         CallFunc_CreateNotifictionDisplayData_ReturnValue_2; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateNotifiction_ReturnValue_1;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateNotifiction_ReturnValue_2;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C80[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0040(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0050(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_2;            // 0x0060(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameNotification_C_AddGridMessage) == 0x000008, "Wrong alignment on WBP_GameNotification_C_AddGridMessage");
static_assert(sizeof(WBP_GameNotification_C_AddGridMessage) == 0x000078, "Wrong size on WBP_GameNotification_C_AddGridMessage");
static_assert(offsetof(WBP_GameNotification_C_AddGridMessage, Message) == 0x000000, "Member 'WBP_GameNotification_C_AddGridMessage::Message' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridMessage, ZoneStateMessage) == 0x000008, "Member 'WBP_GameNotification_C_AddGridMessage::ZoneStateMessage' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridMessage, CallFunc_CreateNotifictionDisplayData_ReturnValue) == 0x000010, "Member 'WBP_GameNotification_C_AddGridMessage::CallFunc_CreateNotifictionDisplayData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridMessage, K2Node_DynamicCast_AsGz_Shrinking_Zone_State_Message) == 0x000018, "Member 'WBP_GameNotification_C_AddGridMessage::K2Node_DynamicCast_AsGz_Shrinking_Zone_State_Message' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridMessage, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_GameNotification_C_AddGridMessage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridMessage, CallFunc_CreateNotifiction_ReturnValue) == 0x000021, "Member 'WBP_GameNotification_C_AddGridMessage::CallFunc_CreateNotifiction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridMessage, CallFunc_CreateNotifictionDisplayData_ReturnValue_1) == 0x000028, "Member 'WBP_GameNotification_C_AddGridMessage::CallFunc_CreateNotifictionDisplayData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridMessage, CallFunc_CreateNotifictionDisplayData_ReturnValue_2) == 0x000030, "Member 'WBP_GameNotification_C_AddGridMessage::CallFunc_CreateNotifictionDisplayData_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridMessage, CallFunc_CreateNotifiction_ReturnValue_1) == 0x000038, "Member 'WBP_GameNotification_C_AddGridMessage::CallFunc_CreateNotifiction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridMessage, CallFunc_CreateNotifiction_ReturnValue_2) == 0x000039, "Member 'WBP_GameNotification_C_AddGridMessage::CallFunc_CreateNotifiction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridMessage, CallFunc_Conv_NameToText_ReturnValue) == 0x000040, "Member 'WBP_GameNotification_C_AddGridMessage::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridMessage, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000050, "Member 'WBP_GameNotification_C_AddGridMessage::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridMessage, CallFunc_Conv_NameToText_ReturnValue_2) == 0x000060, "Member 'WBP_GameNotification_C_AddGridMessage::CallFunc_Conv_NameToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridMessage, CallFunc_Not_PreBool_ReturnValue) == 0x000070, "Member 'WBP_GameNotification_C_AddGridMessage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_GameNotification.WBP_GameNotification_C.AddGridTimeMessage
// 0x0150 (0x0150 - 0x0000)
struct WBP_GameNotification_C_AddGridTimeMessage final
{
public:
	class UGzGameMessage*                         Message;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         StageRemainingTime;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NotificationRowName;                               // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C81[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMultiStageGameState*                 GameStage;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzStageEndsSoonMessage*                K2Node_DynamicCast_AsGz_Stage_Ends_Soon_Message;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C82[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzGameNotificationDisplayData*         CallFunc_CreateNotifictionDisplayData_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateNotifiction_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C83[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzGameNotificationSpec                CallFunc_GetNotificationSpec_ReturnValue;          // 0x0050(0x00A0)(ConstParm)
	double                                        CallFunc_CalculateShowTime_ReturnValue;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStageRemainingTime_ReturnValue;        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C84[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ExtractionRoyaleGameState_C*        K2Node_DynamicCast_AsBP_Extraction_Royale_Game_State; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNextStageShift_ReturnValue;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C85[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzMultiStageGameState*                 K2Node_DynamicCast_AsGz_Multi_Stage_Game_State;    // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C86[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_CalculateShowTime_EventRemainingTime_ImplicitCast; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDisplayShowTime_Value_ImplicitCast;    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C87[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_StageRemainingTime_ImplicitCast; // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameNotification_C_AddGridTimeMessage) == 0x000008, "Wrong alignment on WBP_GameNotification_C_AddGridTimeMessage");
static_assert(sizeof(WBP_GameNotification_C_AddGridTimeMessage) == 0x000150, "Wrong size on WBP_GameNotification_C_AddGridTimeMessage");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, Message) == 0x000000, "Member 'WBP_GameNotification_C_AddGridTimeMessage::Message' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, StageRemainingTime) == 0x000008, "Member 'WBP_GameNotification_C_AddGridTimeMessage::StageRemainingTime' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, NotificationRowName) == 0x00000C, "Member 'WBP_GameNotification_C_AddGridTimeMessage::NotificationRowName' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, GameStage) == 0x000018, "Member 'WBP_GameNotification_C_AddGridTimeMessage::GameStage' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, CallFunc_GetGameState_ReturnValue) == 0x000020, "Member 'WBP_GameNotification_C_AddGridTimeMessage::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, K2Node_DynamicCast_AsGz_Stage_Ends_Soon_Message) == 0x000028, "Member 'WBP_GameNotification_C_AddGridTimeMessage::K2Node_DynamicCast_AsGz_Stage_Ends_Soon_Message' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_GameNotification_C_AddGridTimeMessage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000038, "Member 'WBP_GameNotification_C_AddGridTimeMessage::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, CallFunc_CreateNotifictionDisplayData_ReturnValue) == 0x000040, "Member 'WBP_GameNotification_C_AddGridTimeMessage::CallFunc_CreateNotifictionDisplayData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, CallFunc_CreateNotifiction_ReturnValue) == 0x000048, "Member 'WBP_GameNotification_C_AddGridTimeMessage::CallFunc_CreateNotifiction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, CallFunc_GetNotificationSpec_ReturnValue) == 0x000050, "Member 'WBP_GameNotification_C_AddGridTimeMessage::CallFunc_GetNotificationSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, CallFunc_CalculateShowTime_ReturnValue) == 0x0000F0, "Member 'WBP_GameNotification_C_AddGridTimeMessage::CallFunc_CalculateShowTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, CallFunc_GetStageRemainingTime_ReturnValue) == 0x0000F8, "Member 'WBP_GameNotification_C_AddGridTimeMessage::CallFunc_GetStageRemainingTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000100, "Member 'WBP_GameNotification_C_AddGridTimeMessage::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, K2Node_DynamicCast_AsBP_Extraction_Royale_Game_State) == 0x000108, "Member 'WBP_GameNotification_C_AddGridTimeMessage::K2Node_DynamicCast_AsBP_Extraction_Royale_Game_State' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'WBP_GameNotification_C_AddGridTimeMessage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, CallFunc_IsNextStageShift_ReturnValue) == 0x000111, "Member 'WBP_GameNotification_C_AddGridTimeMessage::CallFunc_IsNextStageShift_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, CallFunc_GetGameState_ReturnValue_1) == 0x000118, "Member 'WBP_GameNotification_C_AddGridTimeMessage::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, K2Node_DynamicCast_AsGz_Multi_Stage_Game_State) == 0x000120, "Member 'WBP_GameNotification_C_AddGridTimeMessage::K2Node_DynamicCast_AsGz_Multi_Stage_Game_State' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'WBP_GameNotification_C_AddGridTimeMessage::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, CallFunc_CalculateShowTime_EventRemainingTime_ImplicitCast) == 0x000130, "Member 'WBP_GameNotification_C_AddGridTimeMessage::CallFunc_CalculateShowTime_EventRemainingTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, CallFunc_SetDisplayShowTime_Value_ImplicitCast) == 0x000138, "Member 'WBP_GameNotification_C_AddGridTimeMessage::CallFunc_SetDisplayShowTime_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000140, "Member 'WBP_GameNotification_C_AddGridTimeMessage::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddGridTimeMessage, K2Node_VariableSet_StageRemainingTime_ImplicitCast) == 0x000148, "Member 'WBP_GameNotification_C_AddGridTimeMessage::K2Node_VariableSet_StageRemainingTime_ImplicitCast' has a wrong offset!");

// Function WBP_GameNotification.WBP_GameNotification_C.AddHexExtractionStartMessage
// 0x0290 (0x0290 - 0x0000)
struct WBP_GameNotification_C_AddHexExtractionStartMessage final
{
public:
	class UGzGameMessage*                         Message;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc;                                               // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TerminalRegion;                                    // 0x0020(0x0010)(Edit, BlueprintVisible)
	class FName                                   RegionNameLayer;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzHexExtractionStartedMessage*         K2Node_DynamicCast_AsGz_Hex_Extraction_Started_Message; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C88[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzItemData*                            CallFunc_GetItemData_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTime_ReturnValue;                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C89[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetRarityColor_ReturnValue;               // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTerminalLocation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzItemData*                            CallFunc_GetItemData_ReturnValue_1;                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzGameNotificationDisplayData*         CallFunc_CreateNotifictionDisplayData_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_LoadIcon_Texture;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateNotifiction_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C8A[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzGameNotificationDisplayData*         CallFunc_CreateNotifictionDisplayData_ReturnValue_1; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateNotifiction_ReturnValue_1;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C8B[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzGameNotificationSpec                CallFunc_GetNotificationSpec_ReturnValue;          // 0x00C8(0x00A0)(ConstParm)
	double                                        CallFunc_CalculateShowTime_ReturnValue;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzWorldZonesSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue;            // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         K2Node_DynamicCast_AsGz_Player_State;              // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C8C[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGzWorldZone*                     CallFunc_GetZoneByPosition_ReturnValue;            // 0x01B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExtractionTeam_ReturnValue;             // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C8D[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetWorldZoneNotificationTag_Tag;          // 0x01C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C8E[0x3];                                     // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01D0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0218(0x0010)(ReferenceParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C8F[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0230(0x0010)()
	class UGzWorldZonesSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0248(0x0010)()
	class FText                                   CallFunc_GetZoneDisplayName_ReturnValue;           // 0x0258(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C90[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0270(0x0010)()
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRemainingTime_Value_ImplicitCast;      // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDisplayShowTime_Value_ImplicitCast;    // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameNotification_C_AddHexExtractionStartMessage) == 0x000008, "Wrong alignment on WBP_GameNotification_C_AddHexExtractionStartMessage");
static_assert(sizeof(WBP_GameNotification_C_AddHexExtractionStartMessage) == 0x000290, "Wrong size on WBP_GameNotification_C_AddHexExtractionStartMessage");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, Message) == 0x000000, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::Message' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, Loc) == 0x000008, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::Loc' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, TerminalRegion) == 0x000020, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::TerminalRegion' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, RegionNameLayer) == 0x000030, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::RegionNameLayer' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_GetGameState_ReturnValue) == 0x000038, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, K2Node_DynamicCast_AsGz_Hex_Extraction_Started_Message) == 0x000040, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::K2Node_DynamicCast_AsGz_Hex_Extraction_Started_Message' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000050, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_GetItemData_ReturnValue) == 0x000058, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_GetTime_ReturnValue) == 0x000060, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_GetTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_GetRarityColor_ReturnValue) == 0x000070, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_GetRarityColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_GetTerminalLocation_ReturnValue) == 0x000080, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_GetTerminalLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_GetItemData_ReturnValue_1) == 0x000098, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_GetItemData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_CreateNotifictionDisplayData_ReturnValue) == 0x0000A0, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_CreateNotifictionDisplayData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_LoadIcon_Texture) == 0x0000A8, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_LoadIcon_Texture' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_CreateNotifiction_ReturnValue) == 0x0000B0, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_CreateNotifiction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_IsValid_ReturnValue) == 0x0000B1, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_CreateNotifictionDisplayData_ReturnValue_1) == 0x0000B8, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_CreateNotifictionDisplayData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_CreateNotifiction_ReturnValue_1) == 0x0000C0, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_CreateNotifiction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_GetNotificationSpec_ReturnValue) == 0x0000C8, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_GetNotificationSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_CalculateShowTime_ReturnValue) == 0x000168, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_CalculateShowTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_BreakVector_X) == 0x000170, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_BreakVector_Y) == 0x000178, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_BreakVector_Z) == 0x000180, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000188, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_MakeVector2D_ReturnValue) == 0x000190, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_GetWorldSubsystem_ReturnValue) == 0x0001A0, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, K2Node_DynamicCast_AsGz_Player_State) == 0x0001A8, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::K2Node_DynamicCast_AsGz_Player_State' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, K2Node_DynamicCast_bSuccess_1) == 0x0001B0, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_GetZoneByPosition_ReturnValue) == 0x0001B8, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_GetZoneByPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_IsExtractionTeam_ReturnValue) == 0x0001C0, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_IsExtractionTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_GetWorldZoneNotificationTag_Tag) == 0x0001C4, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_GetWorldZoneNotificationTag_Tag' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_IsValid_ReturnValue_1) == 0x0001CC, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, K2Node_MakeStruct_FormatArgumentData) == 0x0001D0, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, K2Node_MakeArray_Array) == 0x000218, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_TextIsEmpty_ReturnValue) == 0x000228, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_Format_ReturnValue) == 0x000230, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000240, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, Temp_text_Variable) == 0x000248, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_GetZoneDisplayName_ReturnValue) == 0x000258, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_GetZoneDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, Temp_bool_Variable) == 0x000268, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, K2Node_Select_Default) == 0x000270, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000280, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_SetRemainingTime_Value_ImplicitCast) == 0x000288, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_SetRemainingTime_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexExtractionStartMessage, CallFunc_SetDisplayShowTime_Value_ImplicitCast) == 0x00028C, "Member 'WBP_GameNotification_C_AddHexExtractionStartMessage::CallFunc_SetDisplayShowTime_Value_ImplicitCast' has a wrong offset!");

// Function WBP_GameNotification.WBP_GameNotification_C.AddHexHackedMessage
// 0x0078 (0x0078 - 0x0000)
struct WBP_GameNotification_C_AddHexHackedMessage final
{
public:
	class UGzGameMessage*                         Message;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   NotificationID;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzHexExtractionHackedMessage*          K2Node_DynamicCast_AsGz_Hex_Extraction_Hacked_Message; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C91[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzItemData*                            CallFunc_GetItemData_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHackedTeamMessage_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C92[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetRarityColor_ReturnValue;               // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C93[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_LoadIcon_Texture;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C94[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzGameNotificationDisplayData*         CallFunc_CreateNotifictionDisplayData_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateNotifiction_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C95[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameNotification_C_AddHexHackedMessage) == 0x000008, "Wrong alignment on WBP_GameNotification_C_AddHexHackedMessage");
static_assert(sizeof(WBP_GameNotification_C_AddHexHackedMessage) == 0x000078, "Wrong size on WBP_GameNotification_C_AddHexHackedMessage");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, Message) == 0x000000, "Member 'WBP_GameNotification_C_AddHexHackedMessage::Message' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, NotificationID) == 0x000008, "Member 'WBP_GameNotification_C_AddHexHackedMessage::NotificationID' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, Temp_name_Variable) == 0x000010, "Member 'WBP_GameNotification_C_AddHexHackedMessage::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, K2Node_DynamicCast_AsGz_Hex_Extraction_Hacked_Message) == 0x000018, "Member 'WBP_GameNotification_C_AddHexHackedMessage::K2Node_DynamicCast_AsGz_Hex_Extraction_Hacked_Message' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_GameNotification_C_AddHexHackedMessage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, CallFunc_GetItemData_ReturnValue) == 0x000028, "Member 'WBP_GameNotification_C_AddHexHackedMessage::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, CallFunc_IsHackedTeamMessage_ReturnValue) == 0x000030, "Member 'WBP_GameNotification_C_AddHexHackedMessage::CallFunc_IsHackedTeamMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, CallFunc_GetRarityColor_ReturnValue) == 0x000034, "Member 'WBP_GameNotification_C_AddHexHackedMessage::CallFunc_GetRarityColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, CallFunc_LoadIcon_Texture) == 0x000048, "Member 'WBP_GameNotification_C_AddHexHackedMessage::CallFunc_LoadIcon_Texture' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_GameNotification_C_AddHexHackedMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, CallFunc_CreateNotifictionDisplayData_ReturnValue) == 0x000058, "Member 'WBP_GameNotification_C_AddHexHackedMessage::CallFunc_CreateNotifictionDisplayData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, Temp_name_Variable_1) == 0x000060, "Member 'WBP_GameNotification_C_AddHexHackedMessage::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, CallFunc_CreateNotifiction_ReturnValue) == 0x000068, "Member 'WBP_GameNotification_C_AddHexHackedMessage::CallFunc_CreateNotifiction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, Temp_bool_Variable) == 0x000069, "Member 'WBP_GameNotification_C_AddHexHackedMessage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexHackedMessage, K2Node_Select_Default) == 0x00006C, "Member 'WBP_GameNotification_C_AddHexHackedMessage::K2Node_Select_Default' has a wrong offset!");

// Function WBP_GameNotification.WBP_GameNotification_C.AddHexSucceedMessage
// 0x0048 (0x0048 - 0x0000)
struct WBP_GameNotification_C_AddHexSucceedMessage final
{
public:
	class UGzGameMessage*                         Message;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzGameNotificationDisplayData*         CallFunc_CreateNotifictionDisplayData_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzHexExtractionCompletedMessage*       K2Node_DynamicCast_AsGz_Hex_Extraction_Completed_Message; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateNotifiction_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C96[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzItemData*                            CallFunc_GetItemData_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_LoadIcon_Texture;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetRarityColor_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameNotification_C_AddHexSucceedMessage) == 0x000008, "Wrong alignment on WBP_GameNotification_C_AddHexSucceedMessage");
static_assert(sizeof(WBP_GameNotification_C_AddHexSucceedMessage) == 0x000048, "Wrong size on WBP_GameNotification_C_AddHexSucceedMessage");
static_assert(offsetof(WBP_GameNotification_C_AddHexSucceedMessage, Message) == 0x000000, "Member 'WBP_GameNotification_C_AddHexSucceedMessage::Message' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexSucceedMessage, CallFunc_CreateNotifictionDisplayData_ReturnValue) == 0x000008, "Member 'WBP_GameNotification_C_AddHexSucceedMessage::CallFunc_CreateNotifictionDisplayData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexSucceedMessage, K2Node_DynamicCast_AsGz_Hex_Extraction_Completed_Message) == 0x000010, "Member 'WBP_GameNotification_C_AddHexSucceedMessage::K2Node_DynamicCast_AsGz_Hex_Extraction_Completed_Message' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexSucceedMessage, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_GameNotification_C_AddHexSucceedMessage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexSucceedMessage, CallFunc_CreateNotifiction_ReturnValue) == 0x000019, "Member 'WBP_GameNotification_C_AddHexSucceedMessage::CallFunc_CreateNotifiction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexSucceedMessage, CallFunc_GetItemData_ReturnValue) == 0x000020, "Member 'WBP_GameNotification_C_AddHexSucceedMessage::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexSucceedMessage, CallFunc_LoadIcon_Texture) == 0x000028, "Member 'WBP_GameNotification_C_AddHexSucceedMessage::CallFunc_LoadIcon_Texture' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexSucceedMessage, CallFunc_GetRarityColor_ReturnValue) == 0x000030, "Member 'WBP_GameNotification_C_AddHexSucceedMessage::CallFunc_GetRarityColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameNotification_C_AddHexSucceedMessage, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_GameNotification_C_AddHexSucceedMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_GameNotification.WBP_GameNotification_C.AddMessageHexReconstituted
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_GameNotification_C_AddMessageHexReconstituted final
{
public:
	class UGzGameMessage*                         Message;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   NotificationID;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RemainingTime;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtructionTime;                                    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C97[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzSessionGameModeSettings*             GameModeSettings;                                  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzItemData*                            ItemData;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          EnemyMsg;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C98[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzHexExtractionReconstitutedMessage*   K2Node_DynamicCast_AsGz_Hex_Extraction_Reconstituted_Message; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C99[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetExtractionProgressTime_ReturnValue;    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_LoadIcon_Texture;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
