#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsEntry_Discrete

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SettingsEntry_Discrete.WBP_SettingsEntry_Discrete_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_SettingsEntry_Discrete_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SettingsEntry_Discrete_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_SettingsEntry_Discrete_C_OnMouseLeave");
static_assert(sizeof(WBP_SettingsEntry_Discrete_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_SettingsEntry_Discrete_C_OnMouseLeave");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_SettingsEntry_Discrete_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_SettingsEntry_Discrete.WBP_SettingsEntry_Discrete_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_SettingsEntry_Discrete_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SettingsEntry_Discrete_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_SettingsEntry_Discrete_C_OnMouseEnter");
static_assert(sizeof(WBP_SettingsEntry_Discrete_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_SettingsEntry_Discrete_C_OnMouseEnter");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_SettingsEntry_Discrete_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_SettingsEntry_Discrete_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_SettingsEntry_Discrete.WBP_SettingsEntry_Discrete_C.GetPrimaryGamepadFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsEntry_Discrete_C_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsEntry_Discrete_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong alignment on WBP_SettingsEntry_Discrete_C_GetPrimaryGamepadFocusWidget");
static_assert(sizeof(WBP_SettingsEntry_Discrete_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong size on WBP_SettingsEntry_Discrete_C_GetPrimaryGamepadFocusWidget");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_GetPrimaryGamepadFocusWidget, ReturnValue) == 0x000000, "Member 'WBP_SettingsEntry_Discrete_C_GetPrimaryGamepadFocusWidget::ReturnValue' has a wrong offset!");

// Function WBP_SettingsEntry_Discrete.WBP_SettingsEntry_Discrete_C.ExecuteUbergraph_WBP_SettingsEntry_Discrete
// 0x0150 (0x0150 - 0x0000)
struct WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D0F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0008(0x0078)(ConstParm)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00A0(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00D8(0x0078)(ConstParm)
};
static_assert(alignof(WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete) == 0x000008, "Wrong alignment on WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete");
static_assert(sizeof(WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete) == 0x000150, "Wrong size on WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete, EntryPoint) == 0x000000, "Member 'WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete, K2Node_Event_MouseEvent) == 0x000008, "Member 'WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete, K2Node_ComponentBoundEvent_Button_3) == 0x000080, "Member 'WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete, K2Node_ComponentBoundEvent_Button_2) == 0x000088, "Member 'WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete, K2Node_ComponentBoundEvent_Button_1) == 0x000090, "Member 'WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete, K2Node_ComponentBoundEvent_Button) == 0x000098, "Member 'WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete, K2Node_Event_MyGeometry) == 0x0000A0, "Member 'WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete, K2Node_Event_MouseEvent_1) == 0x0000D8, "Member 'WBP_SettingsEntry_Discrete_C_ExecuteUbergraph_WBP_SettingsEntry_Discrete::K2Node_Event_MouseEvent_1' has a wrong offset!");

// Function WBP_SettingsEntry_Discrete.WBP_SettingsEntry_Discrete_C.BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SettingsEntry_Discrete.WBP_SettingsEntry_Discrete_C.BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SettingsEntry_Discrete.WBP_SettingsEntry_Discrete_C.BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SettingsEntry_Discrete.WBP_SettingsEntry_Discrete_C.BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SettingsEntry_Discrete_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

}

