#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tooltip_Weapon_Comparison

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_BaseTooltip_Comparison_classes.hpp"
#include "G01_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Tooltip_Weapon_Comparison.WBP_Tooltip_Weapon_Comparison_C
// 0x0030 (0x0320 - 0x02F0)
class UWBP_Tooltip_Weapon_Comparison_C final : public UWBP_BaseTooltip_Comparison_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Arrows_Image;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Quality_Image;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemImage_C*                       WBP_ItemImage;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WeaponAmmo_Image;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           WeaponType_GzText;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Tooltip_Weapon_Comparison(int32 EntryPoint);
	void InitWeaponSetup(class UGzWeaponItemData* WeaponData);
	void PreConstruct(bool IsDesignTime);
	void SetWeaponIcon(class UGzWeaponItemData* WeaponData);
	void SetWeaponType(class UGzWeaponItemData* WeaponData);
	void UpdateShortRarity(class UGzWeaponItemData* WeaponData);
	void UpdateTooltip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Tooltip_Weapon_Comparison_C">();
	}
	static class UWBP_Tooltip_Weapon_Comparison_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Tooltip_Weapon_Comparison_C>();
	}
};
static_assert(alignof(UWBP_Tooltip_Weapon_Comparison_C) == 0x000008, "Wrong alignment on UWBP_Tooltip_Weapon_Comparison_C");
static_assert(sizeof(UWBP_Tooltip_Weapon_Comparison_C) == 0x000320, "Wrong size on UWBP_Tooltip_Weapon_Comparison_C");
static_assert(offsetof(UWBP_Tooltip_Weapon_Comparison_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Tooltip_Weapon_Comparison_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_Weapon_Comparison_C, Arrows_Image) == 0x0002F8, "Member 'UWBP_Tooltip_Weapon_Comparison_C::Arrows_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_Weapon_Comparison_C, Quality_Image) == 0x000300, "Member 'UWBP_Tooltip_Weapon_Comparison_C::Quality_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_Weapon_Comparison_C, WBP_ItemImage) == 0x000308, "Member 'UWBP_Tooltip_Weapon_Comparison_C::WBP_ItemImage' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_Weapon_Comparison_C, WeaponAmmo_Image) == 0x000310, "Member 'UWBP_Tooltip_Weapon_Comparison_C::WeaponAmmo_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_Weapon_Comparison_C, WeaponType_GzText) == 0x000318, "Member 'UWBP_Tooltip_Weapon_Comparison_C::WeaponType_GzText' has a wrong offset!");

}

