#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HEX_DiegeticWidget_Parent

#include "Basic.hpp"

#include "E_HexUIExtractionStates_structs.hpp"


namespace SDK::Params
{

// Function WBP_HEX_DiegeticWidget_Parent.WBP_HEX_DiegeticWidget_Parent_C.ShowGridNoise
// 0x0001 (0x0001 - 0x0000)
struct WBP_HEX_DiegeticWidget_Parent_C_ShowGridNoise final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HEX_DiegeticWidget_Parent_C_ShowGridNoise) == 0x000001, "Wrong alignment on WBP_HEX_DiegeticWidget_Parent_C_ShowGridNoise");
static_assert(sizeof(WBP_HEX_DiegeticWidget_Parent_C_ShowGridNoise) == 0x000001, "Wrong size on WBP_HEX_DiegeticWidget_Parent_C_ShowGridNoise");
static_assert(offsetof(WBP_HEX_DiegeticWidget_Parent_C_ShowGridNoise, Show) == 0x000000, "Member 'WBP_HEX_DiegeticWidget_Parent_C_ShowGridNoise::Show' has a wrong offset!");

// Function WBP_HEX_DiegeticWidget_Parent.WBP_HEX_DiegeticWidget_Parent_C.SetStateStyle
// 0x0001 (0x0001 - 0x0000)
struct WBP_HEX_DiegeticWidget_Parent_C_SetStateStyle final
{
public:
	E_HexUIExtractionStates                       NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HEX_DiegeticWidget_Parent_C_SetStateStyle) == 0x000001, "Wrong alignment on WBP_HEX_DiegeticWidget_Parent_C_SetStateStyle");
static_assert(sizeof(WBP_HEX_DiegeticWidget_Parent_C_SetStateStyle) == 0x000001, "Wrong size on WBP_HEX_DiegeticWidget_Parent_C_SetStateStyle");
static_assert(offsetof(WBP_HEX_DiegeticWidget_Parent_C_SetStateStyle, NewState) == 0x000000, "Member 'WBP_HEX_DiegeticWidget_Parent_C_SetStateStyle::NewState' has a wrong offset!");

// Function WBP_HEX_DiegeticWidget_Parent.WBP_HEX_DiegeticWidget_Parent_C.SetStartExtractionState
// 0x0008 (0x0008 - 0x0000)
struct WBP_HEX_DiegeticWidget_Parent_C_SetStartExtractionState final
{
public:
	class UGzItemData*                            ItemData;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HEX_DiegeticWidget_Parent_C_SetStartExtractionState) == 0x000008, "Wrong alignment on WBP_HEX_DiegeticWidget_Parent_C_SetStartExtractionState");
static_assert(sizeof(WBP_HEX_DiegeticWidget_Parent_C_SetStartExtractionState) == 0x000008, "Wrong size on WBP_HEX_DiegeticWidget_Parent_C_SetStartExtractionState");
static_assert(offsetof(WBP_HEX_DiegeticWidget_Parent_C_SetStartExtractionState, ItemData) == 0x000000, "Member 'WBP_HEX_DiegeticWidget_Parent_C_SetStartExtractionState::ItemData' has a wrong offset!");

// Function WBP_HEX_DiegeticWidget_Parent.WBP_HEX_DiegeticWidget_Parent_C.SetPercent
// 0x0008 (0x0008 - 0x0000)
struct WBP_HEX_DiegeticWidget_Parent_C_SetPercent final
{
public:
	double                                        Percent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HEX_DiegeticWidget_Parent_C_SetPercent) == 0x000008, "Wrong alignment on WBP_HEX_DiegeticWidget_Parent_C_SetPercent");
static_assert(sizeof(WBP_HEX_DiegeticWidget_Parent_C_SetPercent) == 0x000008, "Wrong size on WBP_HEX_DiegeticWidget_Parent_C_SetPercent");
static_assert(offsetof(WBP_HEX_DiegeticWidget_Parent_C_SetPercent, Percent) == 0x000000, "Member 'WBP_HEX_DiegeticWidget_Parent_C_SetPercent::Percent' has a wrong offset!");

}

