#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainNotification_SecondaryTimerSecond

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainNotification_SecondaryTimerSecond.WBP_MainNotification_SecondaryTimerSecond_C.ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond
// 0x0108 (0x0108 - 0x0000)
struct WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_587D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_587E[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0038(0x0010)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0048(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_587F[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x0068(0x0010)()
	class FText                                   CallFunc_GetText_ReturnValue_3;                    // 0x0078(0x0010)()
	bool                                          CallFunc_NotEqual_TextText_ReturnValue_1;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5880[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_4;                    // 0x00A0(0x0010)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5881[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_5;                    // 0x00B8(0x0010)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5882[0x2];                                     // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5883[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond");
static_assert(sizeof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond) == 0x000108, "Wrong size on WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, EntryPoint) == 0x000000, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_FMax_ReturnValue) == 0x000018, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_FMax_ReturnValue_1) == 0x000020, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000029, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x00002A, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_PlayAnimationForward_ReturnValue) == 0x000030, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_GetText_ReturnValue) == 0x000038, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_GetText_ReturnValue_1) == 0x000048, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000058, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_NotEqual_TextText_ReturnValue) == 0x000060, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_GetText_ReturnValue_2) == 0x000068, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_GetText_ReturnValue_3) == 0x000078, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_GetText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_NotEqual_TextText_ReturnValue_1) == 0x000088, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_NotEqual_TextText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000090, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000098, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_GetText_ReturnValue_4) == 0x0000A0, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_GetText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0000B0, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_GetText_ReturnValue_5) == 0x0000B8, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_GetText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_EqualEqual_TextText_ReturnValue_1) == 0x0000C8, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_EqualEqual_TextText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_BooleanAND_ReturnValue) == 0x0000C9, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, K2Node_CreateDelegate_OutputDelegate) == 0x0000CC, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000DC, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000EC, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000100, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerSecond::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function WBP_MainNotification_SecondaryTimerSecond.WBP_MainNotification_SecondaryTimerSecond_C.ResetTime
// 0x0020 (0x0020 - 0x0000)
struct WBP_MainNotification_SecondaryTimerSecond_C_ResetTime final
{
public:
	class UTextBlock*                             NextTimeText;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CurrTimeText;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0010(0x0010)()
};
static_assert(alignof(WBP_MainNotification_SecondaryTimerSecond_C_ResetTime) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryTimerSecond_C_ResetTime");
static_assert(sizeof(WBP_MainNotification_SecondaryTimerSecond_C_ResetTime) == 0x000020, "Wrong size on WBP_MainNotification_SecondaryTimerSecond_C_ResetTime");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ResetTime, NextTimeText) == 0x000000, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ResetTime::NextTimeText' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ResetTime, CurrTimeText) == 0x000008, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ResetTime::CurrTimeText' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_ResetTime, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_ResetTime::CallFunc_GetText_ReturnValue' has a wrong offset!");

// Function WBP_MainNotification_SecondaryTimerSecond.WBP_MainNotification_SecondaryTimerSecond_C.SetText
// 0x0020 (0x0020 - 0x0000)
struct WBP_MainNotification_SecondaryTimerSecond_C_SetText final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UGzTextBlock*                           FirstNumber;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzTextBlock*                           SecondaryNumber;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainNotification_SecondaryTimerSecond_C_SetText) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryTimerSecond_C_SetText");
static_assert(sizeof(WBP_MainNotification_SecondaryTimerSecond_C_SetText) == 0x000020, "Wrong size on WBP_MainNotification_SecondaryTimerSecond_C_SetText");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_SetText, Text) == 0x000000, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_SetText::Text' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_SetText, FirstNumber) == 0x000010, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_SetText::FirstNumber' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_SetText, SecondaryNumber) == 0x000018, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_SetText::SecondaryNumber' has a wrong offset!");

// Function WBP_MainNotification_SecondaryTimerSecond.WBP_MainNotification_SecondaryTimerSecond_C.SetTime
// 0x0050 (0x0050 - 0x0000)
struct WBP_MainNotification_SecondaryTimerSecond_C_SetTime final
{
public:
	double                                        Param_Time;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_PlayAnimation;                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5884[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5885[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5886[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainNotification_SecondaryTimerSecond_C_SetTime) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryTimerSecond_C_SetTime");
static_assert(sizeof(WBP_MainNotification_SecondaryTimerSecond_C_SetTime) == 0x000050, "Wrong size on WBP_MainNotification_SecondaryTimerSecond_C_SetTime");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_SetTime, Param_Time) == 0x000000, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_SetTime::Param_Time' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_SetTime, Param_PlayAnimation) == 0x000008, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_SetTime::Param_PlayAnimation' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_SetTime, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_SetTime::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_SetTime, Temp_bool_Variable) == 0x000018, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_SetTime::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_SetTime, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000020, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_SetTime::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_SetTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_SetTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_SetTime, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_SetTime::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_SetTime, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000038, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_SetTime::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_SetTime, K2Node_Select_Default) == 0x000040, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_SetTime::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_SetTime, CallFunc_FMax_ReturnValue) == 0x000048, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_SetTime::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function WBP_MainNotification_SecondaryTimerSecond.WBP_MainNotification_SecondaryTimerSecond_C.TryUpdateTimeNumber
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber final
{
public:
	class FString                                 Param_Time;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         StartIndex;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5887[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzTextBlock*                           GzText;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 NewElement;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5888[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5889[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0010)()
};
static_assert(alignof(WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber");
static_assert(sizeof(WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber) == 0x0000C8, "Wrong size on WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber, Param_Time) == 0x000000, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber::Param_Time' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber, StartIndex) == 0x000010, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber::StartIndex' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber, GzText) == 0x000018, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber::GzText' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber, NewElement) == 0x000020, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber::NewElement' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber, CallFunc_GetSubstring_ReturnValue) == 0x000030, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber, CallFunc_Conv_StringToInt_ReturnValue) == 0x000098, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber, K2Node_MakeArray_Array) == 0x0000A0, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000B0, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_TryUpdateTimeNumber::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_MainNotification_SecondaryTimerSecond.WBP_MainNotification_SecondaryTimerSecond_C.UpdateNotificationData
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_MainNotification_SecondaryTimerSecond_C_UpdateNotificationData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_588A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzGameNotificationSpec                CallFunc_GetNotificationSpec_ReturnValue;          // 0x0008(0x00A0)(ConstParm)
	double                                        CallFunc_SetTime_Time_ImplicitCast;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainNotification_SecondaryTimerSecond_C_UpdateNotificationData) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryTimerSecond_C_UpdateNotificationData");
static_assert(sizeof(WBP_MainNotification_SecondaryTimerSecond_C_UpdateNotificationData) == 0x0000B0, "Wrong size on WBP_MainNotification_SecondaryTimerSecond_C_UpdateNotificationData");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_UpdateNotificationData, ReturnValue) == 0x000000, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_UpdateNotificationData::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_UpdateNotificationData, CallFunc_GetNotificationSpec_ReturnValue) == 0x000008, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_UpdateNotificationData::CallFunc_GetNotificationSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_UpdateNotificationData, CallFunc_SetTime_Time_ImplicitCast) == 0x0000A8, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_UpdateNotificationData::CallFunc_SetTime_Time_ImplicitCast' has a wrong offset!");

// Function WBP_MainNotification_SecondaryTimerSecond.WBP_MainNotification_SecondaryTimerSecond_C.UpdateNumbers
// 0x0090 (0x0090 - 0x0000)
struct WBP_MainNotification_SecondaryTimerSecond_C_UpdateNumbers final
{
public:
	bool                                          bIgnoreUpdateStart;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_588B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Seconds;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Minutes;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_588C[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTimeInMinutesSecondToString_Minutes;   // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTimeInMinutesSecondToString_Seconds;   // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTimeInMinutesSecondToString_Minutes_1; // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTimeInMinutesSecondToString_Seconds_1; // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeInMinutesSecondToString_InSeconds_ImplicitCast; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeInMinutesSecondToString_InSeconds_ImplicitCast_1; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainNotification_SecondaryTimerSecond_C_UpdateNumbers) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryTimerSecond_C_UpdateNumbers");
static_assert(sizeof(WBP_MainNotification_SecondaryTimerSecond_C_UpdateNumbers) == 0x000090, "Wrong size on WBP_MainNotification_SecondaryTimerSecond_C_UpdateNumbers");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_UpdateNumbers, bIgnoreUpdateStart) == 0x000000, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_UpdateNumbers::bIgnoreUpdateStart' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerSecond_C_UpdateNumbers, Seconds) == 0x000008, "Member 'WBP_MainNotification_SecondaryTimerSecond_C_UpdateNumbers::Seconds' has a wrong offset!");
