#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HoldInteractionTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HoldInteractionTooltip.WBP_HoldInteractionTooltip_C
// 0x0048 (0x0388 - 0x0340)
class UWBP_HoldInteractionTooltip_C final : public UGzHUDComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzActionWidget*                        ActionHint;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Playback_Speed;                                    // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A39[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TooltipContainer_DOS_C*            TooltipContainerRef;                               // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        InteractionDuration;                               // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInteracting;                                      // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A3A[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AccumulatedHoldTime;                               // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InitialInteractionProgress;                        // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResetProgressBarOnRelease;                        // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_HoldInteractionTooltip(int32 EntryPoint);
	void OnInitialized();
	void OnInteracting(bool bWasAdded);
	void ResetHolding();
	void SetTooltipStyle();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateHolding(double Param_InitialInteractionProgress);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HoldInteractionTooltip_C">();
	}
	static class UWBP_HoldInteractionTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HoldInteractionTooltip_C>();
	}
};
static_assert(alignof(UWBP_HoldInteractionTooltip_C) == 0x000008, "Wrong alignment on UWBP_HoldInteractionTooltip_C");
static_assert(sizeof(UWBP_HoldInteractionTooltip_C) == 0x000388, "Wrong size on UWBP_HoldInteractionTooltip_C");
static_assert(offsetof(UWBP_HoldInteractionTooltip_C, UberGraphFrame) == 0x000340, "Member 'UWBP_HoldInteractionTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HoldInteractionTooltip_C, ActionHint) == 0x000348, "Member 'UWBP_HoldInteractionTooltip_C::ActionHint' has a wrong offset!");
static_assert(offsetof(UWBP_HoldInteractionTooltip_C, Playback_Speed) == 0x000350, "Member 'UWBP_HoldInteractionTooltip_C::Playback_Speed' has a wrong offset!");
static_assert(offsetof(UWBP_HoldInteractionTooltip_C, TooltipContainerRef) == 0x000358, "Member 'UWBP_HoldInteractionTooltip_C::TooltipContainerRef' has a wrong offset!");
static_assert(offsetof(UWBP_HoldInteractionTooltip_C, InteractionDuration) == 0x000360, "Member 'UWBP_HoldInteractionTooltip_C::InteractionDuration' has a wrong offset!");
static_assert(offsetof(UWBP_HoldInteractionTooltip_C, bInteracting) == 0x000368, "Member 'UWBP_HoldInteractionTooltip_C::bInteracting' has a wrong offset!");
static_assert(offsetof(UWBP_HoldInteractionTooltip_C, AccumulatedHoldTime) == 0x000370, "Member 'UWBP_HoldInteractionTooltip_C::AccumulatedHoldTime' has a wrong offset!");
static_assert(offsetof(UWBP_HoldInteractionTooltip_C, InitialInteractionProgress) == 0x000378, "Member 'UWBP_HoldInteractionTooltip_C::InitialInteractionProgress' has a wrong offset!");
static_assert(offsetof(UWBP_HoldInteractionTooltip_C, bResetProgressBarOnRelease) == 0x000380, "Member 'UWBP_HoldInteractionTooltip_C::bResetProgressBarOnRelease' has a wrong offset!");

}

