#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Jetpack_Overlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Jetpack_Overlay.WBP_Jetpack_Overlay_C
// 0x0090 (0x03D0 - 0x0340)
class UWBP_Jetpack_Overlay_C final : public UGzHUDComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_End;                                          // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGzTextBlock*                           Altitude_Amount_GzText;                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ArrowAngle;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BarElements;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Main;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Info_Box_Left;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Info_Box_Right;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RotatingCenter;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Speed_Amount_GzText;                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  PlayerCharacter;                                   // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        MaxAltitude;                                       // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_Update;                                      // 0x03A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotatingCenterAngle;                               // 0x03B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Initialized;                                       // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Destruct();
	void ExecuteUbergraph_WBP_Jetpack_Overlay(int32 EntryPoint);
	double GetAltitudeProgressBarValue();
	void GetSetAltitude();
	void Hide();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnViewTargetChanged(class APawn* ViewTarget);
	void Show();
	void Update_Center_Rotation();
	void UpdateAltitude();
	void UpdateAngle();
	void UpdateSpeed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Jetpack_Overlay_C">();
	}
	static class UWBP_Jetpack_Overlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Jetpack_Overlay_C>();
	}
};
static_assert(alignof(UWBP_Jetpack_Overlay_C) == 0x000008, "Wrong alignment on UWBP_Jetpack_Overlay_C");
static_assert(sizeof(UWBP_Jetpack_Overlay_C) == 0x0003D0, "Wrong size on UWBP_Jetpack_Overlay_C");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, UberGraphFrame) == 0x000340, "Member 'UWBP_Jetpack_Overlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, Anim_End) == 0x000348, "Member 'UWBP_Jetpack_Overlay_C::Anim_End' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, Anim_Appear) == 0x000350, "Member 'UWBP_Jetpack_Overlay_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, Altitude_Amount_GzText) == 0x000358, "Member 'UWBP_Jetpack_Overlay_C::Altitude_Amount_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, ArrowAngle) == 0x000360, "Member 'UWBP_Jetpack_Overlay_C::ArrowAngle' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, BarElements) == 0x000368, "Member 'UWBP_Jetpack_Overlay_C::BarElements' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, CanvasPanel_Main) == 0x000370, "Member 'UWBP_Jetpack_Overlay_C::CanvasPanel_Main' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, Info_Box_Left) == 0x000378, "Member 'UWBP_Jetpack_Overlay_C::Info_Box_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, Info_Box_Right) == 0x000380, "Member 'UWBP_Jetpack_Overlay_C::Info_Box_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, RotatingCenter) == 0x000388, "Member 'UWBP_Jetpack_Overlay_C::RotatingCenter' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, Speed_Amount_GzText) == 0x000390, "Member 'UWBP_Jetpack_Overlay_C::Speed_Amount_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, PlayerCharacter) == 0x000398, "Member 'UWBP_Jetpack_Overlay_C::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, MaxAltitude) == 0x0003A0, "Member 'UWBP_Jetpack_Overlay_C::MaxAltitude' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, Timer_Update) == 0x0003A8, "Member 'UWBP_Jetpack_Overlay_C::Timer_Update' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, RotatingCenterAngle) == 0x0003B0, "Member 'UWBP_Jetpack_Overlay_C::RotatingCenterAngle' has a wrong offset!");
static_assert(offsetof(UWBP_Jetpack_Overlay_C, Initialized) == 0x0003C8, "Member 'UWBP_Jetpack_Overlay_C::Initialized' has a wrong offset!");

}

