#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_XPLog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_XPLog.WBP_XPLog_C
// 0x0040 (0x03D0 - 0x0390)
class UWBP_XPLog_C final : public UGzXPLogWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowAnimation;                                     // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAnimation;                                  // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         RootContainer;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_XPLogEntry_C*                      WBP_XPLogEntry;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_XPLogEntry_C*                      WBP_XPLogEntry_57;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_XPLogEntry_C*                      WBP_XPLogEntry_176;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         XPCounterBox;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_XPLog(int32 EntryPoint);
	void Finished_C052A61F426AF6595294BF9DE6617A56();
	void FlushLog();
	void OnLogEmpty();
	void OnNewEntryShowed(class UGzBaseLogEntryWidget* Entry);
	void OnViewTargetChanged(class APawn* ViewTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_XPLog_C">();
	}
	static class UWBP_XPLog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_XPLog_C>();
	}
};
static_assert(alignof(UWBP_XPLog_C) == 0x000010, "Wrong alignment on UWBP_XPLog_C");
static_assert(sizeof(UWBP_XPLog_C) == 0x0003D0, "Wrong size on UWBP_XPLog_C");
static_assert(offsetof(UWBP_XPLog_C, UberGraphFrame) == 0x000390, "Member 'UWBP_XPLog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_XPLog_C, ShowAnimation) == 0x000398, "Member 'UWBP_XPLog_C::ShowAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_XPLog_C, FadeOutAnimation) == 0x0003A0, "Member 'UWBP_XPLog_C::FadeOutAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_XPLog_C, RootContainer) == 0x0003A8, "Member 'UWBP_XPLog_C::RootContainer' has a wrong offset!");
static_assert(offsetof(UWBP_XPLog_C, WBP_XPLogEntry) == 0x0003B0, "Member 'UWBP_XPLog_C::WBP_XPLogEntry' has a wrong offset!");
static_assert(offsetof(UWBP_XPLog_C, WBP_XPLogEntry_57) == 0x0003B8, "Member 'UWBP_XPLog_C::WBP_XPLogEntry_57' has a wrong offset!");
static_assert(offsetof(UWBP_XPLog_C, WBP_XPLogEntry_176) == 0x0003C0, "Member 'UWBP_XPLog_C::WBP_XPLogEntry_176' has a wrong offset!");
static_assert(offsetof(UWBP_XPLog_C, XPCounterBox) == 0x0003C8, "Member 'UWBP_XPLog_C::XPCounterBox' has a wrong offset!");

}

