#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BackpackTooltipAttributeBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_BackpackTooltipAttributeBase.WBP_BackpackTooltipAttributeBase_C.ExecuteUbergraph_WBP_BackpackTooltipAttributeBase
// 0x0008 (0x0008 - 0x0000)
struct WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InitSetup_Result;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase) == 0x000004, "Wrong alignment on WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase");
static_assert(sizeof(WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase) == 0x000008, "Wrong size on WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase");
static_assert(offsetof(WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase, EntryPoint) == 0x000000, "Member 'WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase, CallFunc_NotEqual_GameplayTag_ReturnValue) == 0x000006, "Member 'WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase::CallFunc_NotEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase, CallFunc_InitSetup_Result) == 0x000007, "Member 'WBP_BackpackTooltipAttributeBase_C_ExecuteUbergraph_WBP_BackpackTooltipAttributeBase::CallFunc_InitSetup_Result' has a wrong offset!");

// Function WBP_BackpackTooltipAttributeBase.WBP_BackpackTooltipAttributeBase_C.InitSetup
// 0x0001 (0x0001 - 0x0000)
struct WBP_BackpackTooltipAttributeBase_C_InitSetup final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BackpackTooltipAttributeBase_C_InitSetup) == 0x000001, "Wrong alignment on WBP_BackpackTooltipAttributeBase_C_InitSetup");
static_assert(sizeof(WBP_BackpackTooltipAttributeBase_C_InitSetup) == 0x000001, "Wrong size on WBP_BackpackTooltipAttributeBase_C_InitSetup");
static_assert(offsetof(WBP_BackpackTooltipAttributeBase_C_InitSetup, Result) == 0x000000, "Member 'WBP_BackpackTooltipAttributeBase_C_InitSetup::Result' has a wrong offset!");

}

