#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RespawnTimeReductionLog

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_RespawnTimeReductionLog.WBP_RespawnTimeReductionLog_C.ExecuteUbergraph_WBP_RespawnTimeReductionLog
// 0x0030 (0x0030 - 0x0000)
struct WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DBC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerController*                    K2Node_DynamicCast_AsGz_Player_Controller;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DBD[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float TimeBonus)>              K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog) == 0x000008, "Wrong alignment on WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog");
static_assert(sizeof(WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog) == 0x000030, "Wrong size on WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog");
static_assert(offsetof(WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog, EntryPoint) == 0x000000, "Member 'WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog, K2Node_DynamicCast_AsGz_Player_Controller) == 0x000010, "Member 'WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog::K2Node_DynamicCast_AsGz_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_RespawnTimeReductionLog_C_ExecuteUbergraph_WBP_RespawnTimeReductionLog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_RespawnTimeReductionLog.WBP_RespawnTimeReductionLog_C.UpdateLog
// 0x0098 (0x0098 - 0x0000)
struct WBP_RespawnTimeReductionLog_C_UpdateLog final
{
public:
	float                                         TimeBonus;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DBE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RespawnTimeReductionLog_C_UpdateLog) == 0x000008, "Wrong alignment on WBP_RespawnTimeReductionLog_C_UpdateLog");
static_assert(sizeof(WBP_RespawnTimeReductionLog_C_UpdateLog) == 0x000098, "Wrong size on WBP_RespawnTimeReductionLog_C_UpdateLog");
static_assert(offsetof(WBP_RespawnTimeReductionLog_C_UpdateLog, TimeBonus) == 0x000000, "Member 'WBP_RespawnTimeReductionLog_C_UpdateLog::TimeBonus' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimeReductionLog_C_UpdateLog, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'WBP_RespawnTimeReductionLog_C_UpdateLog::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimeReductionLog_C_UpdateLog, K2Node_MakeArray_Array) == 0x000050, "Member 'WBP_RespawnTimeReductionLog_C_UpdateLog::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimeReductionLog_C_UpdateLog, CallFunc_PlayAnimation_ReturnValue) == 0x000060, "Member 'WBP_RespawnTimeReductionLog_C_UpdateLog::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimeReductionLog_C_UpdateLog, CallFunc_Format_ReturnValue) == 0x000068, "Member 'WBP_RespawnTimeReductionLog_C_UpdateLog::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimeReductionLog_C_UpdateLog, CallFunc_PlayAnimation_ReturnValue_1) == 0x000078, "Member 'WBP_RespawnTimeReductionLog_C_UpdateLog::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimeReductionLog_C_UpdateLog, CallFunc_PlayAnimation_ReturnValue_2) == 0x000080, "Member 'WBP_RespawnTimeReductionLog_C_UpdateLog::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimeReductionLog_C_UpdateLog, CallFunc_PlayAnimation_ReturnValue_3) == 0x000088, "Member 'WBP_RespawnTimeReductionLog_C_UpdateLog::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RespawnTimeReductionLog_C_UpdateLog, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000090, "Member 'WBP_RespawnTimeReductionLog_C_UpdateLog::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

}

