#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Crosshair_Pistol

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Crosshair_Pistol.WBP_Crosshair_Pistol_C
// 0x0038 (0x0368 - 0x0330)
class UWBP_Crosshair_Pistol_C final : public UGzWeaponCrosshair
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CrosshairLeaf_C*                   Bottom;                                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MiddleDot;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CrosshairLeaf_C*                   Left;                                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CrosshairLeaf_C*                   Right;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CrosshairLeaf_C*                   Top;                                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Crosshair_Pistol(int32 EntryPoint);
	void OnAdsUpdated(bool bIsInAds);
	void OnUpdatedMaxPrecisionStateBP(bool bEnable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Crosshair_Pistol_C">();
	}
	static class UWBP_Crosshair_Pistol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Crosshair_Pistol_C>();
	}
};
static_assert(alignof(UWBP_Crosshair_Pistol_C) == 0x000008, "Wrong alignment on UWBP_Crosshair_Pistol_C");
static_assert(sizeof(UWBP_Crosshair_Pistol_C) == 0x000368, "Wrong size on UWBP_Crosshair_Pistol_C");
static_assert(offsetof(UWBP_Crosshair_Pistol_C, UberGraphFrame) == 0x000330, "Member 'UWBP_Crosshair_Pistol_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Pistol_C, Bottom) == 0x000338, "Member 'UWBP_Crosshair_Pistol_C::Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Pistol_C, CanvasPanel_0) == 0x000340, "Member 'UWBP_Crosshair_Pistol_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Pistol_C, Image_MiddleDot) == 0x000348, "Member 'UWBP_Crosshair_Pistol_C::Image_MiddleDot' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Pistol_C, Left) == 0x000350, "Member 'UWBP_Crosshair_Pistol_C::Left' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Pistol_C, Right) == 0x000358, "Member 'UWBP_Crosshair_Pistol_C::Right' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Pistol_C, Top) == 0x000360, "Member 'UWBP_Crosshair_Pistol_C::Top' has a wrong offset!");

}

