#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Crosshair_CyberLimbs_PhosphorousDart_New

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function WBP_Crosshair_CyberLimbs_PhosphorousDart_New.WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C.CustomEvent
// 0x0001 (0x0001 - 0x0000)
struct WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_CustomEvent final
{
public:
	bool                                          bWasCancled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_CustomEvent) == 0x000001, "Wrong alignment on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_CustomEvent");
static_assert(sizeof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_CustomEvent) == 0x000001, "Wrong size on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_CustomEvent");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_CustomEvent, bWasCancled) == 0x000000, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_CustomEvent::bWasCancled' has a wrong offset!");

// Function WBP_Crosshair_CyberLimbs_PhosphorousDart_New.WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C.ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6261[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_BP_GetAbilityComponent_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzPhosphorDartComponent*               K2Node_DynamicCast_AsGz_Phosphor_Dart_Component;   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6262[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   K2Node_Event_LimbType;                             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzLimbType                                   K2Node_Event_LimbType_1;                           // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6263[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzLimbGaugeData                       K2Node_Event_GaugeData;                            // 0x0060(0x0028)(ConstParm, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasCancled;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6264[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzGA_PhosphorousDart*                  K2Node_DynamicCast_AsGz_GA_Phosphorous_Dart;       // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New) == 0x000008, "Wrong alignment on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New");
static_assert(sizeof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New) == 0x0000A0, "Wrong size on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, EntryPoint) == 0x000000, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, CallFunc_BP_GetAbilityComponent_ReturnValue) == 0x000008, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::CallFunc_BP_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, K2Node_DynamicCast_AsGz_Phosphor_Dart_Component) == 0x000020, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::K2Node_DynamicCast_AsGz_Phosphor_Dart_Component' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, K2Node_CreateDelegate_OutputDelegate_3) == 0x00004C, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, K2Node_Event_LimbType) == 0x00005C, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::K2Node_Event_LimbType' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, K2Node_Event_LimbType_1) == 0x00005D, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::K2Node_Event_LimbType_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, K2Node_Event_GaugeData) == 0x000060, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::K2Node_Event_GaugeData' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, K2Node_CustomEvent_bWasCancled) == 0x000088, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::K2Node_CustomEvent_bWasCancled' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, K2Node_DynamicCast_AsGz_GA_Phosphorous_Dart) == 0x000090, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::K2Node_DynamicCast_AsGz_GA_Phosphorous_Dart' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New, CallFunc_IsValid_ReturnValue) == 0x000099, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ExecuteUbergraph_WBP_Crosshair_CyberLimbs_PhosphorousDart_New::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Crosshair_CyberLimbs_PhosphorousDart_New.WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C.Init Dart Hold
// 0x0060 (0x0060 - 0x0000)
struct WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold final
{
public:
	EGzLimbType                                   Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6265[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6266[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold) == 0x000008, "Wrong alignment on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold");
static_assert(sizeof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold) == 0x000060, "Wrong size on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold, Temp_byte_Variable) == 0x000000, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold, Temp_object_Variable) == 0x000008, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold, Temp_object_Variable_1) == 0x000010, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold, Temp_object_Variable_2) == 0x000018, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold, K2Node_Select_Default) == 0x000020, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000030, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold, CallFunc_SafeDivide_ReturnValue) == 0x000038, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000048, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x000058, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_Dart_Hold::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");

// Function WBP_Crosshair_CyberLimbs_PhosphorousDart_New.WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C.Init DartReload
// 0x0048 (0x0048 - 0x0000)
struct WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload final
{
public:
	EGzLimbType                                   Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6267[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload) == 0x000008, "Wrong alignment on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload");
static_assert(sizeof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload) == 0x000048, "Wrong size on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload, Temp_byte_Variable) == 0x000000, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload, Temp_object_Variable) == 0x000008, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload, Temp_object_Variable_1) == 0x000010, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload, Temp_object_Variable_2) == 0x000018, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload, K2Node_Select_Default) == 0x000020, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_Init_DartReload::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_Crosshair_CyberLimbs_PhosphorousDart_New.WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C.InitDartCharge
// 0x0048 (0x0048 - 0x0000)
struct WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge final
{
public:
	EGzLimbType                                   Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6268[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge) == 0x000008, "Wrong alignment on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge");
static_assert(sizeof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge) == 0x000048, "Wrong size on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge, Temp_byte_Variable) == 0x000000, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge, Temp_object_Variable) == 0x000008, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge, Temp_object_Variable_1) == 0x000010, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge, Temp_object_Variable_2) == 0x000018, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge, K2Node_Select_Default) == 0x000020, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge, CallFunc_SafeDivide_ReturnValue) == 0x000028, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge, CallFunc_SafeDivide_B_ImplicitCast) == 0x000038, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge::CallFunc_SafeDivide_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x000040, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_InitDartCharge::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");

// Function WBP_Crosshair_CyberLimbs_PhosphorousDart_New.WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C.OnLimbActivated
// 0x0030 (0x0030 - 0x0000)
struct WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivated final
{
public:
	EGzLimbType                                   LimbType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6269[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzLimbGaugeData                       GaugeData;                                         // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivated) == 0x000008, "Wrong alignment on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivated");
static_assert(sizeof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivated) == 0x000030, "Wrong size on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivated");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivated, LimbType) == 0x000000, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivated::LimbType' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivated, GaugeData) == 0x000008, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivated::GaugeData' has a wrong offset!");

// Function WBP_Crosshair_CyberLimbs_PhosphorousDart_New.WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C.OnLimbActivationEnded
// 0x0001 (0x0001 - 0x0000)
struct WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivationEnded final
{
public:
	EGzLimbType                                   LimbType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivationEnded) == 0x000001, "Wrong alignment on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivationEnded");
static_assert(sizeof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivationEnded) == 0x000001, "Wrong size on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivationEnded");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivationEnded, LimbType) == 0x000000, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnLimbActivationEnded::LimbType' has a wrong offset!");

// Function WBP_Crosshair_CyberLimbs_PhosphorousDart_New.WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C.OnReloadAnimationFinished
// 0x0010 (0x0010 - 0x0000)
struct WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnReloadAnimationFinished final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnReloadAnimationFinished) == 0x000004, "Wrong alignment on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnReloadAnimationFinished");
static_assert(sizeof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnReloadAnimationFinished) == 0x000010, "Wrong size on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnReloadAnimationFinished");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnReloadAnimationFinished, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_OnReloadAnimationFinished::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_Crosshair_CyberLimbs_PhosphorousDart_New.WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C.ReloadDart
// 0x0028 (0x0028 - 0x0000)
struct WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ReloadDart final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ReloadDart) == 0x000008, "Wrong alignment on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ReloadDart");
static_assert(sizeof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ReloadDart) == 0x000028, "Wrong size on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ReloadDart");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ReloadDart, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ReloadDart::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ReloadDart, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ReloadDart::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ReloadDart, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_ReloadDart::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Crosshair_CyberLimbs_PhosphorousDart_New.WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C.SetReloadVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility) == 0x000001, "Wrong alignment on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility");
static_assert(sizeof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility) == 0x000005, "Wrong size on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility, bShow) == 0x000000, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility::bShow' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility, Temp_byte_Variable) == 0x000002, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_SetReloadVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Crosshair_CyberLimbs_PhosphorousDart_New.WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C.StopAnyAnimation
// 0x0002 (0x0002 - 0x0000)
struct WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_StopAnyAnimation final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_StopAnyAnimation) == 0x000001, "Wrong alignment on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_StopAnyAnimation");
static_assert(sizeof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_StopAnyAnimation) == 0x000002, "Wrong size on WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_StopAnyAnimation");
static_assert(offsetof(WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_StopAnyAnimation, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'WBP_Crosshair_CyberLimbs_PhosphorousDart_New_C_StopAnyAnimation::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
