#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerStat

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerStat.WBP_PlayerStat_C.UpdateValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerStat_C_UpdateValue final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerStat_C_UpdateValue) == 0x000008, "Wrong alignment on WBP_PlayerStat_C_UpdateValue");
static_assert(sizeof(WBP_PlayerStat_C_UpdateValue) == 0x000008, "Wrong size on WBP_PlayerStat_C_UpdateValue");
static_assert(offsetof(WBP_PlayerStat_C_UpdateValue, Value) == 0x000000, "Member 'WBP_PlayerStat_C_UpdateValue::Value' has a wrong offset!");

// Function WBP_PlayerStat.WBP_PlayerStat_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlayerStat_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerStat_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PlayerStat_C_PreConstruct");
static_assert(sizeof(WBP_PlayerStat_C_PreConstruct) == 0x000001, "Wrong size on WBP_PlayerStat_C_PreConstruct");
static_assert(offsetof(WBP_PlayerStat_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PlayerStat_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PlayerStat.WBP_PlayerStat_C.ExecuteUbergraph_WBP_PlayerStat
// 0x0098 (0x0098 - 0x0000)
struct WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66E7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0050(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
	double                                        K2Node_CustomEvent_Value;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0088(0x0010)()
};
static_assert(alignof(WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat) == 0x000008, "Wrong alignment on WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat");
static_assert(sizeof(WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat) == 0x000098, "Wrong size on WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat");
static_assert(offsetof(WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat, EntryPoint) == 0x000000, "Member 'WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000050, "Member 'WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat, CallFunc_Format_ReturnValue) == 0x000070, "Member 'WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat, K2Node_CustomEvent_Value) == 0x000080, "Member 'WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000088, "Member 'WBP_PlayerStat_C_ExecuteUbergraph_WBP_PlayerStat::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");

}

