#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsEntry_ControllerProfiles

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SettingsEntry_ControllerProfiles.WBP_SettingsEntry_ControllerProfiles_C
// 0x0038 (0x03A8 - 0x0370)
class UWBP_SettingsEntry_ControllerProfiles_C final : public UGzSettingControllerProfileWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background_Image;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Image_1;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           UnhoverColor;                                      // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverColor;                                        // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	class UWidget* GetPrimaryGamepadFocusWidget();
	void ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SettingsEntry_ControllerProfiles_C">();
	}
	static class UWBP_SettingsEntry_ControllerProfiles_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SettingsEntry_ControllerProfiles_C>();
	}
};
static_assert(alignof(UWBP_SettingsEntry_ControllerProfiles_C) == 0x000008, "Wrong alignment on UWBP_SettingsEntry_ControllerProfiles_C");
static_assert(sizeof(UWBP_SettingsEntry_ControllerProfiles_C) == 0x0003A8, "Wrong size on UWBP_SettingsEntry_ControllerProfiles_C");
static_assert(offsetof(UWBP_SettingsEntry_ControllerProfiles_C, UberGraphFrame) == 0x000370, "Member 'UWBP_SettingsEntry_ControllerProfiles_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsEntry_ControllerProfiles_C, Background_Image) == 0x000378, "Member 'UWBP_SettingsEntry_ControllerProfiles_C::Background_Image' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsEntry_ControllerProfiles_C, Background_Image_1) == 0x000380, "Member 'UWBP_SettingsEntry_ControllerProfiles_C::Background_Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsEntry_ControllerProfiles_C, UnhoverColor) == 0x000388, "Member 'UWBP_SettingsEntry_ControllerProfiles_C::UnhoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsEntry_ControllerProfiles_C, HoverColor) == 0x000398, "Member 'UWBP_SettingsEntry_ControllerProfiles_C::HoverColor' has a wrong offset!");

}

