#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainNotification_SecondaryElementPlayerText

#include "Basic.hpp"

#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainNotification_SecondaryElementPlayerText.WBP_MainNotification_SecondaryElementPlayerText_C
// 0x0018 (0x0320 - 0x0308)
class UWBP_MainNotification_SecondaryElementPlayerText_C final : public UGzGameNotificationHeader
{
public:
	class UGzTextBlock*                           Message_GzText;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PlayerColor_Border;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           PlayerName_GzText;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UGzTextBlock* GetNotificationText();
	bool UpdateHeaderNotification(const class UGzGameNotificationDisplayData* InNotificationData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainNotification_SecondaryElementPlayerText_C">();
	}
	static class UWBP_MainNotification_SecondaryElementPlayerText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainNotification_SecondaryElementPlayerText_C>();
	}
};
static_assert(alignof(UWBP_MainNotification_SecondaryElementPlayerText_C) == 0x000008, "Wrong alignment on UWBP_MainNotification_SecondaryElementPlayerText_C");
static_assert(sizeof(UWBP_MainNotification_SecondaryElementPlayerText_C) == 0x000320, "Wrong size on UWBP_MainNotification_SecondaryElementPlayerText_C");
static_assert(offsetof(UWBP_MainNotification_SecondaryElementPlayerText_C, Message_GzText) == 0x000308, "Member 'UWBP_MainNotification_SecondaryElementPlayerText_C::Message_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryElementPlayerText_C, PlayerColor_Border) == 0x000310, "Member 'UWBP_MainNotification_SecondaryElementPlayerText_C::PlayerColor_Border' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryElementPlayerText_C, PlayerName_GzText) == 0x000318, "Member 'UWBP_MainNotification_SecondaryElementPlayerText_C::PlayerName_GzText' has a wrong offset!");

}

