#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PaymentBrowser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GzPaymentBrowser_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PaymentBrowser.WBP_PaymentBrowser_C
// 0x0020 (0x0310 - 0x02F0)
class UWBP_PaymentBrowser_C final : public UGzPaymentBrowserContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                BackButton;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ExitButton;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWebBrowser*                            WebBrowser;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PaymentBrowser_BackButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_PaymentBrowser_ExitButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_PaymentBrowser(int32 EntryPoint);
	void OpenUrlRequested(const class FString& NewURL);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PaymentBrowser_C">();
	}
	static class UWBP_PaymentBrowser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PaymentBrowser_C>();
	}
};
static_assert(alignof(UWBP_PaymentBrowser_C) == 0x000008, "Wrong alignment on UWBP_PaymentBrowser_C");
static_assert(sizeof(UWBP_PaymentBrowser_C) == 0x000310, "Wrong size on UWBP_PaymentBrowser_C");
static_assert(offsetof(UWBP_PaymentBrowser_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_PaymentBrowser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PaymentBrowser_C, BackButton) == 0x0002F8, "Member 'UWBP_PaymentBrowser_C::BackButton' has a wrong offset!");
static_assert(offsetof(UWBP_PaymentBrowser_C, ExitButton) == 0x000300, "Member 'UWBP_PaymentBrowser_C::ExitButton' has a wrong offset!");
static_assert(offsetof(UWBP_PaymentBrowser_C, WebBrowser) == 0x000308, "Member 'UWBP_PaymentBrowser_C::WebBrowser' has a wrong offset!");

}

