#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSelection_Item

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoadoutSelection_Item.WBP_LoadoutSelection_Item_C
// 0x0070 (0x0350 - 0x02E0)
class UWBP_LoadoutSelection_Item_C final : public UUserWidget
{
public:
	class UOverlay*                               Empty;                                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Gz_Label_Empty;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Gz_Label_Text;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Gz_Quantity;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Image;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Icon_SizeBox;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ItemSwitcher;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                LoadoutItem_Border;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LoadoutItem_Overlay;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MasterSizeBox;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Quality_Empty;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Quality_Image;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shared_Animated_Background_C*      WBP_Shared_Animated_Background;                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EGzLoadoutSlots                               LoadoutSlotType;                                   // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShowItem(const struct FGzInvItem& Item);
	void SetInactive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoadoutSelection_Item_C">();
	}
	static class UWBP_LoadoutSelection_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoadoutSelection_Item_C>();
	}
};
static_assert(alignof(UWBP_LoadoutSelection_Item_C) == 0x000008, "Wrong alignment on UWBP_LoadoutSelection_Item_C");
static_assert(sizeof(UWBP_LoadoutSelection_Item_C) == 0x000350, "Wrong size on UWBP_LoadoutSelection_Item_C");
static_assert(offsetof(UWBP_LoadoutSelection_Item_C, Empty) == 0x0002E0, "Member 'UWBP_LoadoutSelection_Item_C::Empty' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Item_C, Gz_Label_Empty) == 0x0002E8, "Member 'UWBP_LoadoutSelection_Item_C::Gz_Label_Empty' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Item_C, Gz_Label_Text) == 0x0002F0, "Member 'UWBP_LoadoutSelection_Item_C::Gz_Label_Text' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Item_C, Gz_Quantity) == 0x0002F8, "Member 'UWBP_LoadoutSelection_Item_C::Gz_Quantity' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Item_C, Icon_Image) == 0x000300, "Member 'UWBP_LoadoutSelection_Item_C::Icon_Image' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Item_C, Icon_SizeBox) == 0x000308, "Member 'UWBP_LoadoutSelection_Item_C::Icon_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Item_C, ItemSwitcher) == 0x000310, "Member 'UWBP_LoadoutSelection_Item_C::ItemSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Item_C, LoadoutItem_Border) == 0x000318, "Member 'UWBP_LoadoutSelection_Item_C::LoadoutItem_Border' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Item_C, LoadoutItem_Overlay) == 0x000320, "Member 'UWBP_LoadoutSelection_Item_C::LoadoutItem_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Item_C, MasterSizeBox) == 0x000328, "Member 'UWBP_LoadoutSelection_Item_C::MasterSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Item_C, Quality_Empty) == 0x000330, "Member 'UWBP_LoadoutSelection_Item_C::Quality_Empty' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Item_C, Quality_Image) == 0x000338, "Member 'UWBP_LoadoutSelection_Item_C::Quality_Image' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Item_C, WBP_Shared_Animated_Background) == 0x000340, "Member 'UWBP_LoadoutSelection_Item_C::WBP_Shared_Animated_Background' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Item_C, LoadoutSlotType) == 0x000348, "Member 'UWBP_LoadoutSelection_Item_C::LoadoutSlotType' has a wrong offset!");

}

