#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RedeploymentBackpack_Container

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RedeploymentBackpack_Container.WBP_RedeploymentBackpack_Container_C
// 0x0020 (0x0390 - 0x0370)
class UWBP_RedeploymentBackpack_Container_C final : public UGzRedeploymentContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           Container;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    TagAddedAsyncTask;                                 // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_RedeploymentBackpack_C*            RedeploymentBackpackWidget;                        // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CreateRedeploymentWidget();
	void CreateWidget();
	void ExecuteUbergraph_WBP_RedeploymentBackpack_Container(int32 EntryPoint);
	void HideWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RedeploymentBackpack_Container_C">();
	}
	static class UWBP_RedeploymentBackpack_Container_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RedeploymentBackpack_Container_C>();
	}
};
static_assert(alignof(UWBP_RedeploymentBackpack_Container_C) == 0x000008, "Wrong alignment on UWBP_RedeploymentBackpack_Container_C");
static_assert(sizeof(UWBP_RedeploymentBackpack_Container_C) == 0x000390, "Wrong size on UWBP_RedeploymentBackpack_Container_C");
static_assert(offsetof(UWBP_RedeploymentBackpack_Container_C, UberGraphFrame) == 0x000370, "Member 'UWBP_RedeploymentBackpack_Container_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RedeploymentBackpack_Container_C, Container) == 0x000378, "Member 'UWBP_RedeploymentBackpack_Container_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_RedeploymentBackpack_Container_C, TagAddedAsyncTask) == 0x000380, "Member 'UWBP_RedeploymentBackpack_Container_C::TagAddedAsyncTask' has a wrong offset!");
static_assert(offsetof(UWBP_RedeploymentBackpack_Container_C, RedeploymentBackpackWidget) == 0x000388, "Member 'UWBP_RedeploymentBackpack_Container_C::RedeploymentBackpackWidget' has a wrong offset!");

}

