#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hitmark_V2_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hitmark_V2_Base.WBP_Hitmark_V2_Base_C
// 0x0018 (0x0308 - 0x02F0)
class UWBP_Hitmark_V2_Base_C : public UGzHitmark
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        FadeInEndTime;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PlaybackSpeed;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hitmark_V2_Base(int32 EntryPoint);
	void Play();

	class UWidgetAnimation* GetDisplayAnimation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hitmark_V2_Base_C">();
	}
	static class UWBP_Hitmark_V2_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hitmark_V2_Base_C>();
	}
};
static_assert(alignof(UWBP_Hitmark_V2_Base_C) == 0x000008, "Wrong alignment on UWBP_Hitmark_V2_Base_C");
static_assert(sizeof(UWBP_Hitmark_V2_Base_C) == 0x000308, "Wrong size on UWBP_Hitmark_V2_Base_C");
static_assert(offsetof(UWBP_Hitmark_V2_Base_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Hitmark_V2_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hitmark_V2_Base_C, FadeInEndTime) == 0x0002F8, "Member 'UWBP_Hitmark_V2_Base_C::FadeInEndTime' has a wrong offset!");
static_assert(offsetof(UWBP_Hitmark_V2_Base_C, PlaybackSpeed) == 0x000300, "Member 'UWBP_Hitmark_V2_Base_C::PlaybackSpeed' has a wrong offset!");

}

