#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SquadScreen

#include "Basic.hpp"

#include "G01_structs.hpp"


namespace SDK::Params
{

// Function WBP_SquadScreen.WBP_SquadScreen_C.ExecuteUbergraph_WBP_SquadScreen
// 0x0038 (0x0038 - 0x0000)
struct WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60A0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSoloGamemode_bIsSolos;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60A1[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         K2Node_DynamicCast_AsGz_Player_State;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60A2[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGzTeamMember>                  K2Node_Event_TeamMembers;                          // 0x0028(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen) == 0x000008, "Wrong alignment on WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen");
static_assert(sizeof(WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen) == 0x000038, "Wrong size on WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen");
static_assert(offsetof(WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen, EntryPoint) == 0x000000, "Member 'WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen, CallFunc_IsSoloGamemode_bIsSolos) == 0x000010, "Member 'WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen::CallFunc_IsSoloGamemode_bIsSolos' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen, K2Node_DynamicCast_AsGz_Player_State) == 0x000018, "Member 'WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen::K2Node_DynamicCast_AsGz_Player_State' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen, K2Node_Event_TeamMembers) == 0x000028, "Member 'WBP_SquadScreen_C_ExecuteUbergraph_WBP_SquadScreen::K2Node_Event_TeamMembers' has a wrong offset!");

// Function WBP_SquadScreen.WBP_SquadScreen_C.OnTeammatesUpdated
// 0x0010 (0x0010 - 0x0000)
struct WBP_SquadScreen_C_OnTeammatesUpdated final
{
public:
	TArray<struct FGzTeamMember>                  TeamMembers;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SquadScreen_C_OnTeammatesUpdated) == 0x000008, "Wrong alignment on WBP_SquadScreen_C_OnTeammatesUpdated");
static_assert(sizeof(WBP_SquadScreen_C_OnTeammatesUpdated) == 0x000010, "Wrong size on WBP_SquadScreen_C_OnTeammatesUpdated");
static_assert(offsetof(WBP_SquadScreen_C_OnTeammatesUpdated, TeamMembers) == 0x000000, "Member 'WBP_SquadScreen_C_OnTeammatesUpdated::TeamMembers' has a wrong offset!");

// Function WBP_SquadScreen.WBP_SquadScreen_C.FillEntries
// 0x0068 (0x0068 - 0x0000)
struct WBP_SquadScreen_C_FillEntries final
{
public:
	struct FGzItemChangeHandle                    Handle;                                            // 0x0000(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlayerProfileItem_C*               CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlayerProfileItem_C*               CallFunc_Create_ReturnValue_1;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGzTeamMember>                  CallFunc_GetViewTargetTeamMembers_ReturnValue;     // 0x0038(0x0010)(ReferenceParm)
	class AGzPlayerState*                         K2Node_DynamicCast_AsGz_Player_State;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60A3[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzTeamMember                          CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SquadScreen_C_FillEntries) == 0x000008, "Wrong alignment on WBP_SquadScreen_C_FillEntries");
static_assert(sizeof(WBP_SquadScreen_C_FillEntries) == 0x000068, "Wrong size on WBP_SquadScreen_C_FillEntries");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, Handle) == 0x000000, "Member 'WBP_SquadScreen_C_FillEntries::Handle' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_SquadScreen_C_FillEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_SquadScreen_C_FillEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_SquadScreen_C_FillEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_SquadScreen_C_FillEntries::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000020, "Member 'WBP_SquadScreen_C_FillEntries::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_SquadScreen_C_FillEntries::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, CallFunc_Create_ReturnValue_1) == 0x000030, "Member 'WBP_SquadScreen_C_FillEntries::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, CallFunc_GetViewTargetTeamMembers_ReturnValue) == 0x000038, "Member 'WBP_SquadScreen_C_FillEntries::CallFunc_GetViewTargetTeamMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, K2Node_DynamicCast_AsGz_Player_State) == 0x000048, "Member 'WBP_SquadScreen_C_FillEntries::K2Node_DynamicCast_AsGz_Player_State' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_SquadScreen_C_FillEntries::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_SquadScreen_C_FillEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_SquadScreen_C_FillEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'WBP_SquadScreen_C_FillEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, CallFunc_IsValid_ReturnValue) == 0x000065, "Member 'WBP_SquadScreen_C_FillEntries::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_FillEntries, CallFunc_Array_IsEmpty_ReturnValue) == 0x000066, "Member 'WBP_SquadScreen_C_FillEntries::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_SquadScreen.WBP_SquadScreen_C.Init Entry
// 0x0018 (0x0018 - 0x0000)
struct WBP_SquadScreen_C_Init_Entry final
{
public:
	class UWBP_PlayerProfileItem_C*               InEntry;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60A4[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SquadScreen_C_Init_Entry) == 0x000008, "Wrong alignment on WBP_SquadScreen_C_Init_Entry");
static_assert(sizeof(WBP_SquadScreen_C_Init_Entry) == 0x000018, "Wrong size on WBP_SquadScreen_C_Init_Entry");
static_assert(offsetof(WBP_SquadScreen_C_Init_Entry, InEntry) == 0x000000, "Member 'WBP_SquadScreen_C_Init_Entry::InEntry' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_Init_Entry, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'WBP_SquadScreen_C_Init_Entry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadScreen_C_Init_Entry, CallFunc_AddChild_ReturnValue) == 0x000010, "Member 'WBP_SquadScreen_C_Init_Entry::CallFunc_AddChild_ReturnValue' has a wrong offset!");

}

