#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainNotification_SecondaryElementNextStageTime

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainNotification_SecondaryElementNextStageTime.WBP_MainNotification_SecondaryElementNextStageTime_C.ExecuteUbergraph_WBP_MainNotification_SecondaryElementNextStageTime
// 0x0004 (0x0004 - 0x0000)
struct WBP_MainNotification_SecondaryElementNextStageTime_C_ExecuteUbergraph_WBP_MainNotification_SecondaryElementNextStageTime final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainNotification_SecondaryElementNextStageTime_C_ExecuteUbergraph_WBP_MainNotification_SecondaryElementNextStageTime) == 0x000004, "Wrong alignment on WBP_MainNotification_SecondaryElementNextStageTime_C_ExecuteUbergraph_WBP_MainNotification_SecondaryElementNextStageTime");
static_assert(sizeof(WBP_MainNotification_SecondaryElementNextStageTime_C_ExecuteUbergraph_WBP_MainNotification_SecondaryElementNextStageTime) == 0x000004, "Wrong size on WBP_MainNotification_SecondaryElementNextStageTime_C_ExecuteUbergraph_WBP_MainNotification_SecondaryElementNextStageTime");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_ExecuteUbergraph_WBP_MainNotification_SecondaryElementNextStageTime, EntryPoint) == 0x000000, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_ExecuteUbergraph_WBP_MainNotification_SecondaryElementNextStageTime::EntryPoint' has a wrong offset!");

// Function WBP_MainNotification_SecondaryElementNextStageTime.WBP_MainNotification_SecondaryElementNextStageTime_C.GetNotificationText
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainNotification_SecondaryElementNextStageTime_C_GetNotificationText final
{
public:
	class UGzTextBlock*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainNotification_SecondaryElementNextStageTime_C_GetNotificationText) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryElementNextStageTime_C_GetNotificationText");
static_assert(sizeof(WBP_MainNotification_SecondaryElementNextStageTime_C_GetNotificationText) == 0x000008, "Wrong size on WBP_MainNotification_SecondaryElementNextStageTime_C_GetNotificationText");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_GetNotificationText, ReturnValue) == 0x000000, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_GetNotificationText::ReturnValue' has a wrong offset!");

// Function WBP_MainNotification_SecondaryElementNextStageTime.WBP_MainNotification_SecondaryElementNextStageTime_C.UpdateHeaderNotification
// 0x0038 (0x0038 - 0x0000)
struct WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification final
{
public:
	const class UGzGameNotificationDisplayData*   InNotificationData;                                // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BF1[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BF2[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDefaultHeaderText_ReturnValue;         // 0x0028(0x0010)()
};
static_assert(alignof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification");
static_assert(sizeof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification) == 0x000038, "Wrong size on WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification, InNotificationData) == 0x000000, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification::InNotificationData' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification, ReturnValue) == 0x000008, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification, CallFunc_GetDefaultHeaderText_ReturnValue) == 0x000028, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateHeaderNotification::CallFunc_GetDefaultHeaderText_ReturnValue' has a wrong offset!");

// Function WBP_MainNotification_SecondaryElementNextStageTime.WBP_MainNotification_SecondaryElementNextStageTime_C.UpdateTimer
// 0x0040 (0x0040 - 0x0000)
struct WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzMultiStageGameState*                 K2Node_DynamicCast_AsGz_Multi_Stage_Game_State;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BF3[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStageRemainingTime_ReturnValue;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTimeInMinutesSecondFormatText_Result;  // 0x0020(0x0010)()
	double                                        CallFunc_MakeLiteralDouble_Value_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeInMinutesSecondFormatText_InSeconds_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer");
static_assert(sizeof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer) == 0x000040, "Wrong size on WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer, K2Node_DynamicCast_AsGz_Multi_Stage_Game_State) == 0x000008, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer::K2Node_DynamicCast_AsGz_Multi_Stage_Game_State' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer, CallFunc_GetStageRemainingTime_ReturnValue) == 0x000014, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer::CallFunc_GetStageRemainingTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000018, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer, CallFunc_GetTimeInMinutesSecondFormatText_Result) == 0x000020, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer::CallFunc_GetTimeInMinutesSecondFormatText_Result' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer, CallFunc_MakeLiteralDouble_Value_ImplicitCast) == 0x000030, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer::CallFunc_MakeLiteralDouble_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer, CallFunc_GetTimeInMinutesSecondFormatText_InSeconds_ImplicitCast) == 0x000038, "Member 'WBP_MainNotification_SecondaryElementNextStageTime_C_UpdateTimer::CallFunc_GetTimeInMinutesSecondFormatText_InSeconds_ImplicitCast' has a wrong offset!");

}

