#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_XRCurrentZoneWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_XRCurrentZoneWidget.WBP_XRCurrentZoneWidget_C
// 0x0038 (0x0378 - 0x0340)
class UWBP_XRCurrentZoneWidget_C final : public UGzRingMapDecoration
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnShrinking;                                       // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShrinkingColor;                                    // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InactiveColor;                                     // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzMultiStageGameState*                 As_Gz_Multi_Stage_Game_State;                      // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_XRCurrentZoneWidget(int32 EntryPoint);
	void OnStageChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_XRCurrentZoneWidget_C">();
	}
	static class UWBP_XRCurrentZoneWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_XRCurrentZoneWidget_C>();
	}
};
static_assert(alignof(UWBP_XRCurrentZoneWidget_C) == 0x000008, "Wrong alignment on UWBP_XRCurrentZoneWidget_C");
static_assert(sizeof(UWBP_XRCurrentZoneWidget_C) == 0x000378, "Wrong size on UWBP_XRCurrentZoneWidget_C");
static_assert(offsetof(UWBP_XRCurrentZoneWidget_C, UberGraphFrame) == 0x000340, "Member 'UWBP_XRCurrentZoneWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_XRCurrentZoneWidget_C, OnShrinking) == 0x000348, "Member 'UWBP_XRCurrentZoneWidget_C::OnShrinking' has a wrong offset!");
static_assert(offsetof(UWBP_XRCurrentZoneWidget_C, ShrinkingColor) == 0x000350, "Member 'UWBP_XRCurrentZoneWidget_C::ShrinkingColor' has a wrong offset!");
static_assert(offsetof(UWBP_XRCurrentZoneWidget_C, InactiveColor) == 0x000360, "Member 'UWBP_XRCurrentZoneWidget_C::InactiveColor' has a wrong offset!");
static_assert(offsetof(UWBP_XRCurrentZoneWidget_C, As_Gz_Multi_Stage_Game_State) == 0x000370, "Member 'UWBP_XRCurrentZoneWidget_C::As_Gz_Multi_Stage_Game_State' has a wrong offset!");

}

