#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSelection_Capture

#include "Basic.hpp"

#include "G01_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoadoutSelection_Capture.WBP_LoadoutSelection_Capture_C.OnLoadoutSlotReady_BP
// 0x0020 (0x0020 - 0x0000)
struct WBP_LoadoutSelection_Capture_C_OnLoadoutSlotReady_BP final
{
public:
	struct FGzLoadoutSelectionInitializeData      LoadoutInitializeData;                             // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_LoadoutSelection_Capture_C_OnLoadoutSlotReady_BP) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_Capture_C_OnLoadoutSlotReady_BP");
static_assert(sizeof(WBP_LoadoutSelection_Capture_C_OnLoadoutSlotReady_BP) == 0x000020, "Wrong size on WBP_LoadoutSelection_Capture_C_OnLoadoutSlotReady_BP");
static_assert(offsetof(WBP_LoadoutSelection_Capture_C_OnLoadoutSlotReady_BP, LoadoutInitializeData) == 0x000000, "Member 'WBP_LoadoutSelection_Capture_C_OnLoadoutSlotReady_BP::LoadoutInitializeData' has a wrong offset!");

// Function WBP_LoadoutSelection_Capture.WBP_LoadoutSelection_Capture_C.ExecuteUbergraph_WBP_LoadoutSelection_Capture
// 0x0030 (0x0030 - 0x0000)
struct WBP_LoadoutSelection_Capture_C_ExecuteUbergraph_WBP_LoadoutSelection_Capture final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66E6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzLoadoutSelectionInitializeData      K2Node_Event_LoadoutInitializeData;                // 0x0008(0x0020)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelection_Capture_C_ExecuteUbergraph_WBP_LoadoutSelection_Capture) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_Capture_C_ExecuteUbergraph_WBP_LoadoutSelection_Capture");
static_assert(sizeof(WBP_LoadoutSelection_Capture_C_ExecuteUbergraph_WBP_LoadoutSelection_Capture) == 0x000030, "Wrong size on WBP_LoadoutSelection_Capture_C_ExecuteUbergraph_WBP_LoadoutSelection_Capture");
static_assert(offsetof(WBP_LoadoutSelection_Capture_C_ExecuteUbergraph_WBP_LoadoutSelection_Capture, EntryPoint) == 0x000000, "Member 'WBP_LoadoutSelection_Capture_C_ExecuteUbergraph_WBP_LoadoutSelection_Capture::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Capture_C_ExecuteUbergraph_WBP_LoadoutSelection_Capture, K2Node_Event_LoadoutInitializeData) == 0x000008, "Member 'WBP_LoadoutSelection_Capture_C_ExecuteUbergraph_WBP_LoadoutSelection_Capture::K2Node_Event_LoadoutInitializeData' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Capture_C_ExecuteUbergraph_WBP_LoadoutSelection_Capture, CallFunc_TextIsEmpty_ReturnValue) == 0x000028, "Member 'WBP_LoadoutSelection_Capture_C_ExecuteUbergraph_WBP_LoadoutSelection_Capture::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

}

