#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LobbyUsername

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.ExecuteUbergraph_WBP_LobbyUsername
// 0x0004 (0x0004 - 0x0000)
struct WBP_LobbyUsername_C_ExecuteUbergraph_WBP_LobbyUsername final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LobbyUsername_C_ExecuteUbergraph_WBP_LobbyUsername) == 0x000004, "Wrong alignment on WBP_LobbyUsername_C_ExecuteUbergraph_WBP_LobbyUsername");
static_assert(sizeof(WBP_LobbyUsername_C_ExecuteUbergraph_WBP_LobbyUsername) == 0x000004, "Wrong size on WBP_LobbyUsername_C_ExecuteUbergraph_WBP_LobbyUsername");
static_assert(offsetof(WBP_LobbyUsername_C_ExecuteUbergraph_WBP_LobbyUsername, EntryPoint) == 0x000000, "Member 'WBP_LobbyUsername_C_ExecuteUbergraph_WBP_LobbyUsername::EntryPoint' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.Initialize
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_LobbyUsername_C_Initialize final
{
public:
	TDelegate<void(class AGzCharacter* Character, struct FGzPartyMemberMiscData& Data)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzCharacter* Character, bool bIsMuted)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bInParty)>                K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzCharacter* Character, bool bStatus)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzCharacter* Character, bool bTalkingState)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzCharacter* Character)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPartyCustomization*                  CallFunc_GetActorOfClass_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ED2[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0090(0x0010)()
};
static_assert(alignof(WBP_LobbyUsername_C_Initialize) == 0x000008, "Wrong alignment on WBP_LobbyUsername_C_Initialize");
static_assert(sizeof(WBP_LobbyUsername_C_Initialize) == 0x0000A0, "Wrong size on WBP_LobbyUsername_C_Initialize");
static_assert(offsetof(WBP_LobbyUsername_C_Initialize, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_LobbyUsername_C_Initialize::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_Initialize, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_LobbyUsername_C_Initialize::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_Initialize, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'WBP_LobbyUsername_C_Initialize::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_Initialize, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'WBP_LobbyUsername_C_Initialize::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_Initialize, K2Node_CreateDelegate_OutputDelegate_4) == 0x000040, "Member 'WBP_LobbyUsername_C_Initialize::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_Initialize, K2Node_CreateDelegate_OutputDelegate_5) == 0x000050, "Member 'WBP_LobbyUsername_C_Initialize::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_Initialize, CallFunc_GetActorOfClass_ReturnValue) == 0x000060, "Member 'WBP_LobbyUsername_C_Initialize::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_Initialize, CallFunc_GetOwner_ReturnValue) == 0x000068, "Member 'WBP_LobbyUsername_C_Initialize::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_Initialize, K2Node_DynamicCast_AsGz_Character) == 0x000070, "Member 'WBP_LobbyUsername_C_Initialize::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_LobbyUsername_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_Initialize, CallFunc_GetDisplayName_ReturnValue) == 0x000080, "Member 'WBP_LobbyUsername_C_Initialize::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_Initialize, CallFunc_Conv_StringToText_ReturnValue) == 0x000090, "Member 'WBP_LobbyUsername_C_Initialize::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.OnClanTagUpdated
// 0x0018 (0x0018 - 0x0000)
struct WBP_LobbyUsername_C_OnClanTagUpdated final
{
public:
	const class AGzCharacter*                     Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Param_ClanTag;                                     // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LobbyUsername_C_OnClanTagUpdated) == 0x000008, "Wrong alignment on WBP_LobbyUsername_C_OnClanTagUpdated");
static_assert(sizeof(WBP_LobbyUsername_C_OnClanTagUpdated) == 0x000018, "Wrong size on WBP_LobbyUsername_C_OnClanTagUpdated");
static_assert(offsetof(WBP_LobbyUsername_C_OnClanTagUpdated, Character) == 0x000000, "Member 'WBP_LobbyUsername_C_OnClanTagUpdated::Character' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnClanTagUpdated, Param_ClanTag) == 0x000008, "Member 'WBP_LobbyUsername_C_OnClanTagUpdated::Param_ClanTag' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.OnMatchmakingStatusChanged
// 0x0030 (0x0030 - 0x0000)
struct WBP_LobbyUsername_C_OnMatchmakingStatusChanged final
{
public:
	class AGzCharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bStatus;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ED3[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInParty_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ED4[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LobbyUsername_C_OnMatchmakingStatusChanged) == 0x000008, "Wrong alignment on WBP_LobbyUsername_C_OnMatchmakingStatusChanged");
static_assert(sizeof(WBP_LobbyUsername_C_OnMatchmakingStatusChanged) == 0x000030, "Wrong size on WBP_LobbyUsername_C_OnMatchmakingStatusChanged");
static_assert(offsetof(WBP_LobbyUsername_C_OnMatchmakingStatusChanged, Character) == 0x000000, "Member 'WBP_LobbyUsername_C_OnMatchmakingStatusChanged::Character' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnMatchmakingStatusChanged, bStatus) == 0x000008, "Member 'WBP_LobbyUsername_C_OnMatchmakingStatusChanged::bStatus' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnMatchmakingStatusChanged, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'WBP_LobbyUsername_C_OnMatchmakingStatusChanged::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnMatchmakingStatusChanged, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'WBP_LobbyUsername_C_OnMatchmakingStatusChanged::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnMatchmakingStatusChanged, CallFunc_IsInParty_ReturnValue) == 0x000019, "Member 'WBP_LobbyUsername_C_OnMatchmakingStatusChanged::CallFunc_IsInParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnMatchmakingStatusChanged, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'WBP_LobbyUsername_C_OnMatchmakingStatusChanged::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnMatchmakingStatusChanged, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000028, "Member 'WBP_LobbyUsername_C_OnMatchmakingStatusChanged::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.OnMiscDataUpdated
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_LobbyUsername_C_OnMiscDataUpdated final
{
public:
	const class AGzCharacter*                     Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGzPartyMemberMiscData                 Data;                                              // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LobbyUsername_C_OnMiscDataUpdated) == 0x000008, "Wrong alignment on WBP_LobbyUsername_C_OnMiscDataUpdated");
static_assert(sizeof(WBP_LobbyUsername_C_OnMiscDataUpdated) == 0x0000A8, "Wrong size on WBP_LobbyUsername_C_OnMiscDataUpdated");
static_assert(offsetof(WBP_LobbyUsername_C_OnMiscDataUpdated, Character) == 0x000000, "Member 'WBP_LobbyUsername_C_OnMiscDataUpdated::Character' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnMiscDataUpdated, Data) == 0x000008, "Member 'WBP_LobbyUsername_C_OnMiscDataUpdated::Data' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnMiscDataUpdated, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'WBP_LobbyUsername_C_OnMiscDataUpdated::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnMiscDataUpdated, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'WBP_LobbyUsername_C_OnMiscDataUpdated::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnMiscDataUpdated, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_LobbyUsername_C_OnMiscDataUpdated::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnMiscDataUpdated, CallFunc_Format_ReturnValue) == 0x000088, "Member 'WBP_LobbyUsername_C_OnMiscDataUpdated::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnMiscDataUpdated, CallFunc_GetOwner_ReturnValue) == 0x000098, "Member 'WBP_LobbyUsername_C_OnMiscDataUpdated::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnMiscDataUpdated, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000A0, "Member 'WBP_LobbyUsername_C_OnMiscDataUpdated::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.OnPartyMembershipStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_LobbyUsername_C_OnPartyMembershipStateChanged final
{
public:
	bool                                          bState;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LobbyUsername_C_OnPartyMembershipStateChanged) == 0x000001, "Wrong alignment on WBP_LobbyUsername_C_OnPartyMembershipStateChanged");
static_assert(sizeof(WBP_LobbyUsername_C_OnPartyMembershipStateChanged) == 0x000001, "Wrong size on WBP_LobbyUsername_C_OnPartyMembershipStateChanged");
static_assert(offsetof(WBP_LobbyUsername_C_OnPartyMembershipStateChanged, bState) == 0x000000, "Member 'WBP_LobbyUsername_C_OnPartyMembershipStateChanged::bState' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.OnPlayerNameUpdated
// 0x0018 (0x0018 - 0x0000)
struct WBP_LobbyUsername_C_OnPlayerNameUpdated final
{
public:
	const class AGzCharacter*                     Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LobbyUsername_C_OnPlayerNameUpdated) == 0x000008, "Wrong alignment on WBP_LobbyUsername_C_OnPlayerNameUpdated");
static_assert(sizeof(WBP_LobbyUsername_C_OnPlayerNameUpdated) == 0x000018, "Wrong size on WBP_LobbyUsername_C_OnPlayerNameUpdated");
static_assert(offsetof(WBP_LobbyUsername_C_OnPlayerNameUpdated, Character) == 0x000000, "Member 'WBP_LobbyUsername_C_OnPlayerNameUpdated::Character' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnPlayerNameUpdated, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'WBP_LobbyUsername_C_OnPlayerNameUpdated::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnPlayerNameUpdated, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_LobbyUsername_C_OnPlayerNameUpdated::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.OnSubscriptionStatusUpdated
// 0x0020 (0x0020 - 0x0000)
struct WBP_LobbyUsername_C_OnSubscriptionStatusUpdated final
{
public:
	const class AGzCharacter*                     Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasOtgPro;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ED5[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LobbyUsername_C_OnSubscriptionStatusUpdated) == 0x000008, "Wrong alignment on WBP_LobbyUsername_C_OnSubscriptionStatusUpdated");
static_assert(sizeof(WBP_LobbyUsername_C_OnSubscriptionStatusUpdated) == 0x000020, "Wrong size on WBP_LobbyUsername_C_OnSubscriptionStatusUpdated");
static_assert(offsetof(WBP_LobbyUsername_C_OnSubscriptionStatusUpdated, Character) == 0x000000, "Member 'WBP_LobbyUsername_C_OnSubscriptionStatusUpdated::Character' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnSubscriptionStatusUpdated, bHasOtgPro) == 0x000008, "Member 'WBP_LobbyUsername_C_OnSubscriptionStatusUpdated::bHasOtgPro' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnSubscriptionStatusUpdated, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'WBP_LobbyUsername_C_OnSubscriptionStatusUpdated::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnSubscriptionStatusUpdated, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'WBP_LobbyUsername_C_OnSubscriptionStatusUpdated::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.OnTalkingStateChanged
// 0x0020 (0x0020 - 0x0000)
struct WBP_LobbyUsername_C_OnTalkingStateChanged final
{
public:
	const class AGzCharacter*                     Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bState;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ED6[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LobbyUsername_C_OnTalkingStateChanged) == 0x000008, "Wrong alignment on WBP_LobbyUsername_C_OnTalkingStateChanged");
static_assert(sizeof(WBP_LobbyUsername_C_OnTalkingStateChanged) == 0x000020, "Wrong size on WBP_LobbyUsername_C_OnTalkingStateChanged");
static_assert(offsetof(WBP_LobbyUsername_C_OnTalkingStateChanged, Character) == 0x000000, "Member 'WBP_LobbyUsername_C_OnTalkingStateChanged::Character' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnTalkingStateChanged, bState) == 0x000008, "Member 'WBP_LobbyUsername_C_OnTalkingStateChanged::bState' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnTalkingStateChanged, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'WBP_LobbyUsername_C_OnTalkingStateChanged::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnTalkingStateChanged, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'WBP_LobbyUsername_C_OnTalkingStateChanged::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.OnVoiceChatStateChanged
// 0x0020 (0x0020 - 0x0000)
struct WBP_LobbyUsername_C_OnVoiceChatStateChanged final
{
public:
	const class AGzCharacter*                     Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          VoiceChatState;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ED7[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LobbyUsername_C_OnVoiceChatStateChanged) == 0x000008, "Wrong alignment on WBP_LobbyUsername_C_OnVoiceChatStateChanged");
static_assert(sizeof(WBP_LobbyUsername_C_OnVoiceChatStateChanged) == 0x000020, "Wrong size on WBP_LobbyUsername_C_OnVoiceChatStateChanged");
static_assert(offsetof(WBP_LobbyUsername_C_OnVoiceChatStateChanged, Character) == 0x000000, "Member 'WBP_LobbyUsername_C_OnVoiceChatStateChanged::Character' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnVoiceChatStateChanged, VoiceChatState) == 0x000008, "Member 'WBP_LobbyUsername_C_OnVoiceChatStateChanged::VoiceChatState' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnVoiceChatStateChanged, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'WBP_LobbyUsername_C_OnVoiceChatStateChanged::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_OnVoiceChatStateChanged, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'WBP_LobbyUsername_C_OnVoiceChatStateChanged::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.SetMatchmakingStatus
// 0x0070 (0x0070 - 0x0000)
struct WBP_LobbyUsername_C_SetMatchmakingStatus final
{
public:
	bool                                          bStatus;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ED8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NotReadyText;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReadyText;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            ReadyColor;                                        // 0x0028(0x0014)(Edit, BlueprintVisible)
	struct FSlateColor                            NotReadyColor;                                     // 0x003C(0x0014)(Edit, BlueprintVisible)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0060(0x0010)()
};
static_assert(alignof(WBP_LobbyUsername_C_SetMatchmakingStatus) == 0x000008, "Wrong alignment on WBP_LobbyUsername_C_SetMatchmakingStatus");
static_assert(sizeof(WBP_LobbyUsername_C_SetMatchmakingStatus) == 0x000070, "Wrong size on WBP_LobbyUsername_C_SetMatchmakingStatus");
static_assert(offsetof(WBP_LobbyUsername_C_SetMatchmakingStatus, bStatus) == 0x000000, "Member 'WBP_LobbyUsername_C_SetMatchmakingStatus::bStatus' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_SetMatchmakingStatus, NotReadyText) == 0x000008, "Member 'WBP_LobbyUsername_C_SetMatchmakingStatus::NotReadyText' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_SetMatchmakingStatus, ReadyText) == 0x000018, "Member 'WBP_LobbyUsername_C_SetMatchmakingStatus::ReadyText' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_SetMatchmakingStatus, ReadyColor) == 0x000028, "Member 'WBP_LobbyUsername_C_SetMatchmakingStatus::ReadyColor' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_SetMatchmakingStatus, NotReadyColor) == 0x00003C, "Member 'WBP_LobbyUsername_C_SetMatchmakingStatus::NotReadyColor' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_SetMatchmakingStatus, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'WBP_LobbyUsername_C_SetMatchmakingStatus::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_SetMatchmakingStatus, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000060, "Member 'WBP_LobbyUsername_C_SetMatchmakingStatus::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.SetMatchmakingStatusVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_LobbyUsername_C_SetMatchmakingStatusVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LobbyUsername_C_SetMatchmakingStatusVisibility) == 0x000001, "Wrong alignment on WBP_LobbyUsername_C_SetMatchmakingStatusVisibility");
static_assert(sizeof(WBP_LobbyUsername_C_SetMatchmakingStatusVisibility) == 0x000001, "Wrong size on WBP_LobbyUsername_C_SetMatchmakingStatusVisibility");
static_assert(offsetof(WBP_LobbyUsername_C_SetMatchmakingStatusVisibility, bVisible) == 0x000000, "Member 'WBP_LobbyUsername_C_SetMatchmakingStatusVisibility::bVisible' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.SetSubscribtionStatus
// 0x0001 (0x0001 - 0x0000)
struct WBP_LobbyUsername_C_SetSubscribtionStatus final
{
public:
	bool                                          bHasOtgPro;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LobbyUsername_C_SetSubscribtionStatus) == 0x000001, "Wrong alignment on WBP_LobbyUsername_C_SetSubscribtionStatus");
static_assert(sizeof(WBP_LobbyUsername_C_SetSubscribtionStatus) == 0x000001, "Wrong size on WBP_LobbyUsername_C_SetSubscribtionStatus");
static_assert(offsetof(WBP_LobbyUsername_C_SetSubscribtionStatus, bHasOtgPro) == 0x000000, "Member 'WBP_LobbyUsername_C_SetSubscribtionStatus::bHasOtgPro' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.SetTalkingStatusState
// 0x0028 (0x0028 - 0x0000)
struct WBP_LobbyUsername_C_SetTalkingStatusState final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ED9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TalkingText;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
};
static_assert(alignof(WBP_LobbyUsername_C_SetTalkingStatusState) == 0x000008, "Wrong alignment on WBP_LobbyUsername_C_SetTalkingStatusState");
static_assert(sizeof(WBP_LobbyUsername_C_SetTalkingStatusState) == 0x000028, "Wrong size on WBP_LobbyUsername_C_SetTalkingStatusState");
static_assert(offsetof(WBP_LobbyUsername_C_SetTalkingStatusState, State) == 0x000000, "Member 'WBP_LobbyUsername_C_SetTalkingStatusState::State' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_SetTalkingStatusState, TalkingText) == 0x000008, "Member 'WBP_LobbyUsername_C_SetTalkingStatusState::TalkingText' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_SetTalkingStatusState, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_LobbyUsername_C_SetTalkingStatusState::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.SetVoiceChatState
// 0x0028 (0x0028 - 0x0000)
struct WBP_LobbyUsername_C_SetVoiceChatState final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EDA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DeafenText;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
};
static_assert(alignof(WBP_LobbyUsername_C_SetVoiceChatState) == 0x000008, "Wrong alignment on WBP_LobbyUsername_C_SetVoiceChatState");
static_assert(sizeof(WBP_LobbyUsername_C_SetVoiceChatState) == 0x000028, "Wrong size on WBP_LobbyUsername_C_SetVoiceChatState");
static_assert(offsetof(WBP_LobbyUsername_C_SetVoiceChatState, NewState) == 0x000000, "Member 'WBP_LobbyUsername_C_SetVoiceChatState::NewState' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_SetVoiceChatState, DeafenText) == 0x000008, "Member 'WBP_LobbyUsername_C_SetVoiceChatState::DeafenText' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_SetVoiceChatState, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_LobbyUsername_C_SetVoiceChatState::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_LobbyUsername.WBP_LobbyUsername_C.UpdateName
// 0x0088 (0x0088 - 0x0000)
struct WBP_LobbyUsername_C_UpdateName final
{
public:
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EDB[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPartyCustomization*                  CallFunc_GetActorOfClass_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EDC[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0010)()
};
static_assert(alignof(WBP_LobbyUsername_C_UpdateName) == 0x000008, "Wrong alignment on WBP_LobbyUsername_C_UpdateName");
static_assert(sizeof(WBP_LobbyUsername_C_UpdateName) == 0x000088, "Wrong size on WBP_LobbyUsername_C_UpdateName");
static_assert(offsetof(WBP_LobbyUsername_C_UpdateName, CallFunc_Concat_StrStr_ReturnValue) == 0x000000, "Member 'WBP_LobbyUsername_C_UpdateName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_UpdateName, CallFunc_IsEmpty_ReturnValue) == 0x000010, "Member 'WBP_LobbyUsername_C_UpdateName::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyUsername_C_UpdateName, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000018, "Member 'WBP_LobbyUsername_C_UpdateName::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
