#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipInteraction_Limb_DOS

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "G01_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TooltipInteraction_Limb_DOS.WBP_TooltipInteraction_Limb_DOS_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_TooltipInteraction_Limb_DOS_C final : public UUserWidget
{
public:
	class UWBP_Tooltip_Limb_DOS_C*                WBP_Tooltip_Limb;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tooltip_Limb_Comparison_C*         WBP_Tooltip_Limb_Comparison;                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bEnableComparison;                                 // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class UGzItemData* FindEqupedLimbByType(EGzLimbType LimbType);
	void InitLimbSetup(class UGzBodyPartItemData* BodyPartItemData);
	void UpdateInteractBlock(bool bCanInteract);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TooltipInteraction_Limb_DOS_C">();
	}
	static class UWBP_TooltipInteraction_Limb_DOS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TooltipInteraction_Limb_DOS_C>();
	}
};
static_assert(alignof(UWBP_TooltipInteraction_Limb_DOS_C) == 0x000008, "Wrong alignment on UWBP_TooltipInteraction_Limb_DOS_C");
static_assert(sizeof(UWBP_TooltipInteraction_Limb_DOS_C) == 0x0002F8, "Wrong size on UWBP_TooltipInteraction_Limb_DOS_C");
static_assert(offsetof(UWBP_TooltipInteraction_Limb_DOS_C, WBP_Tooltip_Limb) == 0x0002E0, "Member 'UWBP_TooltipInteraction_Limb_DOS_C::WBP_Tooltip_Limb' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Limb_DOS_C, WBP_Tooltip_Limb_Comparison) == 0x0002E8, "Member 'UWBP_TooltipInteraction_Limb_DOS_C::WBP_Tooltip_Limb_Comparison' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Limb_DOS_C, bEnableComparison) == 0x0002F0, "Member 'UWBP_TooltipInteraction_Limb_DOS_C::bEnableComparison' has a wrong offset!");

}

