#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSelection_Grid

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoadoutSelection_Grid.WBP_LoadoutSelection_Grid_C
// 0x0068 (0x0448 - 0x03E0)
class UWBP_LoadoutSelection_Grid_C final : public UGzLoadoutsGrid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUniformGridPanel*                      LoadoutSlots_UniformGridPanel;                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSelection_Item_C*           WBP_LoadoutSelection_Item;                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSelection_Item_C*           WBP_LoadoutSelection_Item_1;                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSelection_Item_C*           WBP_LoadoutSelection_Item_2;                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSelection_Item_C*           WBP_LoadoutSelection_Item_3;                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSelection_Item_C*           WBP_LoadoutSelection_Item_4;                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSelection_Item_C*           WBP_LoadoutSelection_Item_5;                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSelection_Item_C*           WBP_LoadoutSelection_Item_6;                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSelection_Item_C*           WBP_LoadoutSelection_Item_7;                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ElementsPerGridRow;                                // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66A0[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EGzLoadoutSlots>                       Slots;                                             // 0x0438(0x0010)(Edit, BlueprintVisible)

public:
	void SetDataToSlot(const struct FGzLoadoutDataConfig& LoadoutConfig);
	void RecreateLoadoutSlotsWithLoadout(const TMap<EGzLoadoutSlots, struct FGzInvItem>& LoadoutPreset);
	void Recreate_Loadout_Slots_with_Guid(const struct FGuid& LoadoutGuid);
	void ExecuteUbergraph_WBP_LoadoutSelection_Grid(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoadoutSelection_Grid_C">();
	}
	static class UWBP_LoadoutSelection_Grid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoadoutSelection_Grid_C>();
	}
};
static_assert(alignof(UWBP_LoadoutSelection_Grid_C) == 0x000008, "Wrong alignment on UWBP_LoadoutSelection_Grid_C");
static_assert(sizeof(UWBP_LoadoutSelection_Grid_C) == 0x000448, "Wrong size on UWBP_LoadoutSelection_Grid_C");
static_assert(offsetof(UWBP_LoadoutSelection_Grid_C, UberGraphFrame) == 0x0003E0, "Member 'UWBP_LoadoutSelection_Grid_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Grid_C, LoadoutSlots_UniformGridPanel) == 0x0003E8, "Member 'UWBP_LoadoutSelection_Grid_C::LoadoutSlots_UniformGridPanel' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Grid_C, WBP_LoadoutSelection_Item) == 0x0003F0, "Member 'UWBP_LoadoutSelection_Grid_C::WBP_LoadoutSelection_Item' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Grid_C, WBP_LoadoutSelection_Item_1) == 0x0003F8, "Member 'UWBP_LoadoutSelection_Grid_C::WBP_LoadoutSelection_Item_1' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Grid_C, WBP_LoadoutSelection_Item_2) == 0x000400, "Member 'UWBP_LoadoutSelection_Grid_C::WBP_LoadoutSelection_Item_2' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Grid_C, WBP_LoadoutSelection_Item_3) == 0x000408, "Member 'UWBP_LoadoutSelection_Grid_C::WBP_LoadoutSelection_Item_3' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Grid_C, WBP_LoadoutSelection_Item_4) == 0x000410, "Member 'UWBP_LoadoutSelection_Grid_C::WBP_LoadoutSelection_Item_4' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Grid_C, WBP_LoadoutSelection_Item_5) == 0x000418, "Member 'UWBP_LoadoutSelection_Grid_C::WBP_LoadoutSelection_Item_5' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Grid_C, WBP_LoadoutSelection_Item_6) == 0x000420, "Member 'UWBP_LoadoutSelection_Grid_C::WBP_LoadoutSelection_Item_6' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Grid_C, WBP_LoadoutSelection_Item_7) == 0x000428, "Member 'UWBP_LoadoutSelection_Grid_C::WBP_LoadoutSelection_Item_7' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Grid_C, ElementsPerGridRow) == 0x000430, "Member 'UWBP_LoadoutSelection_Grid_C::ElementsPerGridRow' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_Grid_C, Slots) == 0x000438, "Member 'UWBP_LoadoutSelection_Grid_C::Slots' has a wrong offset!");

}

