#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DynamicSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DynamicSlot.WBP_DynamicSlot_C
// 0x0048 (0x03A0 - 0x0358)
class UWBP_DynamicSlot_C final : public UGzDefaultPocketWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Hover;                                        // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               Bar_Box;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Gz_QuantityText;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Master_Box;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QualityBar_Image;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Stack_ProgressBar;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTag                           CubeItem;                                          // 0x0398(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddColorForIconIfHexCube(const struct FGzInvItem& Item);
	void BndEvt__WBP_DynamicSlot_PocketButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_DynamicSlot(int32 EntryPoint);
	void HandleEmptyItem();
	void HandleValidItem(const struct FGzInvItem& Item);
	void OnPocketChanged_BP(const struct FGzInvItem& NewItem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DynamicSlot_C">();
	}
	static class UWBP_DynamicSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DynamicSlot_C>();
	}
};
static_assert(alignof(UWBP_DynamicSlot_C) == 0x000008, "Wrong alignment on UWBP_DynamicSlot_C");
static_assert(sizeof(UWBP_DynamicSlot_C) == 0x0003A0, "Wrong size on UWBP_DynamicSlot_C");
static_assert(offsetof(UWBP_DynamicSlot_C, UberGraphFrame) == 0x000358, "Member 'UWBP_DynamicSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DynamicSlot_C, Anim_Hover) == 0x000360, "Member 'UWBP_DynamicSlot_C::Anim_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_DynamicSlot_C, Bar_Box) == 0x000368, "Member 'UWBP_DynamicSlot_C::Bar_Box' has a wrong offset!");
static_assert(offsetof(UWBP_DynamicSlot_C, Gz_QuantityText) == 0x000370, "Member 'UWBP_DynamicSlot_C::Gz_QuantityText' has a wrong offset!");
static_assert(offsetof(UWBP_DynamicSlot_C, Master_Box) == 0x000378, "Member 'UWBP_DynamicSlot_C::Master_Box' has a wrong offset!");
static_assert(offsetof(UWBP_DynamicSlot_C, QualityBar_Image) == 0x000380, "Member 'UWBP_DynamicSlot_C::QualityBar_Image' has a wrong offset!");
static_assert(offsetof(UWBP_DynamicSlot_C, Stack_ProgressBar) == 0x000388, "Member 'UWBP_DynamicSlot_C::Stack_ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_DynamicSlot_C, WBP_ItemIcon) == 0x000390, "Member 'UWBP_DynamicSlot_C::WBP_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_DynamicSlot_C, CubeItem) == 0x000398, "Member 'UWBP_DynamicSlot_C::CubeItem' has a wrong offset!");

}

