#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Notifications

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_Notifications.WBP_HUD_Notifications_C
// 0x0040 (0x0320 - 0x02E0)
class UWBP_HUD_Notifications_C final : public UUserWidget
{
public:
	class UWBP_KillLog_C*                         WBP_KillLog;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameNotification_C*                WBP_MatchNotifications;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PickUpLog_C*                       WBP_PickUpLog;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ProgressLog_C*                     WBP_ProgressLog;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RespawnTimer_C*                    WBP_RespawnTimer;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RespawnTimeReductionLog_C*         WBP_RespawnTimeReductionLog;                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Progress_SelfReviveKit_C*          WBP_SelfReviveKit;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_XPLog_C*                           WBP_XPLog;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_Notifications_C">();
	}
	static class UWBP_HUD_Notifications_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_Notifications_C>();
	}
};
static_assert(alignof(UWBP_HUD_Notifications_C) == 0x000008, "Wrong alignment on UWBP_HUD_Notifications_C");
static_assert(sizeof(UWBP_HUD_Notifications_C) == 0x000320, "Wrong size on UWBP_HUD_Notifications_C");
static_assert(offsetof(UWBP_HUD_Notifications_C, WBP_KillLog) == 0x0002E0, "Member 'UWBP_HUD_Notifications_C::WBP_KillLog' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Notifications_C, WBP_MatchNotifications) == 0x0002E8, "Member 'UWBP_HUD_Notifications_C::WBP_MatchNotifications' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Notifications_C, WBP_PickUpLog) == 0x0002F0, "Member 'UWBP_HUD_Notifications_C::WBP_PickUpLog' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Notifications_C, WBP_ProgressLog) == 0x0002F8, "Member 'UWBP_HUD_Notifications_C::WBP_ProgressLog' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Notifications_C, WBP_RespawnTimer) == 0x000300, "Member 'UWBP_HUD_Notifications_C::WBP_RespawnTimer' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Notifications_C, WBP_RespawnTimeReductionLog) == 0x000308, "Member 'UWBP_HUD_Notifications_C::WBP_RespawnTimeReductionLog' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Notifications_C, WBP_SelfReviveKit) == 0x000310, "Member 'UWBP_HUD_Notifications_C::WBP_SelfReviveKit' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Notifications_C, WBP_XPLog) == 0x000318, "Member 'UWBP_HUD_Notifications_C::WBP_XPLog' has a wrong offset!");

}

