#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SquadInfoHUDComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SquadInfoHUDComponent.WBP_SquadInfoHUDComponent_C.ExecuteUbergraph_WBP_SquadInfoHUDComponent
// 0x0028 (0x0028 - 0x0000)
struct WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E18[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetViewTarget_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E19[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_ViewTarget;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent) == 0x000008, "Wrong alignment on WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent");
static_assert(sizeof(WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent) == 0x000028, "Wrong size on WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent");
static_assert(offsetof(WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent, EntryPoint) == 0x000000, "Member 'WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent, CallFunc_GetViewTarget_ReturnValue) == 0x000008, "Member 'WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent, K2Node_Event_ViewTarget) == 0x000018, "Member 'WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent::K2Node_Event_ViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'WBP_SquadInfoHUDComponent_C_ExecuteUbergraph_WBP_SquadInfoHUDComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_SquadInfoHUDComponent.WBP_SquadInfoHUDComponent_C.Init
// 0x0038 (0x0038 - 0x0000)
struct WBP_SquadInfoHUDComponent_C_Init final
{
public:
	class UObject*                                ViewTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGzPlayerViewTargetInterface> K2Node_DynamicCast_AsGz_Player_View_Target_Interface; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E1A[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetViewTargetPlayerState_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SquadInfoHUDComponent_C_Init) == 0x000008, "Wrong alignment on WBP_SquadInfoHUDComponent_C_Init");
static_assert(sizeof(WBP_SquadInfoHUDComponent_C_Init) == 0x000038, "Wrong size on WBP_SquadInfoHUDComponent_C_Init");
static_assert(offsetof(WBP_SquadInfoHUDComponent_C_Init, ViewTarget) == 0x000000, "Member 'WBP_SquadInfoHUDComponent_C_Init::ViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_SquadInfoHUDComponent_C_Init, Temp_object_Variable) == 0x000008, "Member 'WBP_SquadInfoHUDComponent_C_Init::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SquadInfoHUDComponent_C_Init, K2Node_DynamicCast_AsGz_Player_View_Target_Interface) == 0x000010, "Member 'WBP_SquadInfoHUDComponent_C_Init::K2Node_DynamicCast_AsGz_Player_View_Target_Interface' has a wrong offset!");
static_assert(offsetof(WBP_SquadInfoHUDComponent_C_Init, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_SquadInfoHUDComponent_C_Init::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SquadInfoHUDComponent_C_Init, CallFunc_GetViewTargetPlayerState_ReturnValue) == 0x000028, "Member 'WBP_SquadInfoHUDComponent_C_Init::CallFunc_GetViewTargetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadInfoHUDComponent_C_Init, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_SquadInfoHUDComponent_C_Init::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadInfoHUDComponent_C_Init, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'WBP_SquadInfoHUDComponent_C_Init::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_SquadInfoHUDComponent.WBP_SquadInfoHUDComponent_C.OnViewTargetChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_SquadInfoHUDComponent_C_OnViewTargetChanged final
{
public:
	class APawn*                                  ViewTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SquadInfoHUDComponent_C_OnViewTargetChanged) == 0x000008, "Wrong alignment on WBP_SquadInfoHUDComponent_C_OnViewTargetChanged");
static_assert(sizeof(WBP_SquadInfoHUDComponent_C_OnViewTargetChanged) == 0x000008, "Wrong size on WBP_SquadInfoHUDComponent_C_OnViewTargetChanged");
static_assert(offsetof(WBP_SquadInfoHUDComponent_C_OnViewTargetChanged, ViewTarget) == 0x000000, "Member 'WBP_SquadInfoHUDComponent_C_OnViewTargetChanged::ViewTarget' has a wrong offset!");

}

