#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RadialReloadProgress

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_RadialReloadProgress.WBP_RadialReloadProgress_C.ExecuteUbergraph_WBP_RadialReloadProgress
// 0x0028 (0x0028 - 0x0000)
struct WBP_RadialReloadProgress_C_ExecuteUbergraph_WBP_RadialReloadProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D0[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_ViewTarget;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bWasAdded)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialReloadProgress_C_ExecuteUbergraph_WBP_RadialReloadProgress) == 0x000008, "Wrong alignment on WBP_RadialReloadProgress_C_ExecuteUbergraph_WBP_RadialReloadProgress");
static_assert(sizeof(WBP_RadialReloadProgress_C_ExecuteUbergraph_WBP_RadialReloadProgress) == 0x000028, "Wrong size on WBP_RadialReloadProgress_C_ExecuteUbergraph_WBP_RadialReloadProgress");
static_assert(offsetof(WBP_RadialReloadProgress_C_ExecuteUbergraph_WBP_RadialReloadProgress, EntryPoint) == 0x000000, "Member 'WBP_RadialReloadProgress_C_ExecuteUbergraph_WBP_RadialReloadProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_ExecuteUbergraph_WBP_RadialReloadProgress, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000004, "Member 'WBP_RadialReloadProgress_C_ExecuteUbergraph_WBP_RadialReloadProgress::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_ExecuteUbergraph_WBP_RadialReloadProgress, K2Node_Event_ViewTarget) == 0x000010, "Member 'WBP_RadialReloadProgress_C_ExecuteUbergraph_WBP_RadialReloadProgress::K2Node_Event_ViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_ExecuteUbergraph_WBP_RadialReloadProgress, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_RadialReloadProgress_C_ExecuteUbergraph_WBP_RadialReloadProgress::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_RadialReloadProgress.WBP_RadialReloadProgress_C.GetEquippedWeapon
// 0x0048 (0x0048 - 0x0000)
struct WBP_RadialReloadProgress_C_GetEquippedWeapon final
{
public:
	class UGzWeaponComponent*                     WeaponComponent;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetViewTarget_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D1[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzCombatComponent*                     CallFunc_GetCombatComponent_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D2[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzWeaponActor*                         CallFunc_GetEquippedWeapon_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzWeaponComponent*                     CallFunc_GetWeaponComponent_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialReloadProgress_C_GetEquippedWeapon) == 0x000008, "Wrong alignment on WBP_RadialReloadProgress_C_GetEquippedWeapon");
static_assert(sizeof(WBP_RadialReloadProgress_C_GetEquippedWeapon) == 0x000048, "Wrong size on WBP_RadialReloadProgress_C_GetEquippedWeapon");
static_assert(offsetof(WBP_RadialReloadProgress_C_GetEquippedWeapon, WeaponComponent) == 0x000000, "Member 'WBP_RadialReloadProgress_C_GetEquippedWeapon::WeaponComponent' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_GetEquippedWeapon, CallFunc_GetViewTarget_ReturnValue) == 0x000008, "Member 'WBP_RadialReloadProgress_C_GetEquippedWeapon::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_GetEquippedWeapon, K2Node_DynamicCast_AsGz_Character) == 0x000010, "Member 'WBP_RadialReloadProgress_C_GetEquippedWeapon::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_GetEquippedWeapon, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_RadialReloadProgress_C_GetEquippedWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_GetEquippedWeapon, CallFunc_GetCombatComponent_ReturnValue) == 0x000020, "Member 'WBP_RadialReloadProgress_C_GetEquippedWeapon::CallFunc_GetCombatComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_GetEquippedWeapon, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_RadialReloadProgress_C_GetEquippedWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_GetEquippedWeapon, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'WBP_RadialReloadProgress_C_GetEquippedWeapon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_GetEquippedWeapon, CallFunc_GetEquippedWeapon_ReturnValue) == 0x000030, "Member 'WBP_RadialReloadProgress_C_GetEquippedWeapon::CallFunc_GetEquippedWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_GetEquippedWeapon, CallFunc_GetWeaponComponent_ReturnValue) == 0x000038, "Member 'WBP_RadialReloadProgress_C_GetEquippedWeapon::CallFunc_GetWeaponComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_GetEquippedWeapon, CallFunc_IsValid_ReturnValue_2) == 0x000040, "Member 'WBP_RadialReloadProgress_C_GetEquippedWeapon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_RadialReloadProgress.WBP_RadialReloadProgress_C.OnReloadTagChanged
// 0x0040 (0x0040 - 0x0000)
struct WBP_RadialReloadProgress_C_OnReloadTagChanged final
{
public:
	bool                                          bWasAdded;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzWeaponComponent*                     CallFunc_GetEquippedWeapon_WeaponComponent;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetViewTarget_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D4[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetReloadTimeSeconds_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialReloadProgress_C_OnReloadTagChanged) == 0x000008, "Wrong alignment on WBP_RadialReloadProgress_C_OnReloadTagChanged");
static_assert(sizeof(WBP_RadialReloadProgress_C_OnReloadTagChanged) == 0x000040, "Wrong size on WBP_RadialReloadProgress_C_OnReloadTagChanged");
static_assert(offsetof(WBP_RadialReloadProgress_C_OnReloadTagChanged, bWasAdded) == 0x000000, "Member 'WBP_RadialReloadProgress_C_OnReloadTagChanged::bWasAdded' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_OnReloadTagChanged, Temp_byte_Variable) == 0x000001, "Member 'WBP_RadialReloadProgress_C_OnReloadTagChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_OnReloadTagChanged, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_RadialReloadProgress_C_OnReloadTagChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_OnReloadTagChanged, Temp_bool_Variable) == 0x000003, "Member 'WBP_RadialReloadProgress_C_OnReloadTagChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_OnReloadTagChanged, CallFunc_GetEquippedWeapon_WeaponComponent) == 0x000008, "Member 'WBP_RadialReloadProgress_C_OnReloadTagChanged::CallFunc_GetEquippedWeapon_WeaponComponent' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_OnReloadTagChanged, CallFunc_GetViewTarget_ReturnValue) == 0x000010, "Member 'WBP_RadialReloadProgress_C_OnReloadTagChanged::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_OnReloadTagChanged, K2Node_Select_Default) == 0x000018, "Member 'WBP_RadialReloadProgress_C_OnReloadTagChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_OnReloadTagChanged, CallFunc_GetReloadTimeSeconds_ReturnValue) == 0x00001C, "Member 'WBP_RadialReloadProgress_C_OnReloadTagChanged::CallFunc_GetReloadTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_OnReloadTagChanged, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_RadialReloadProgress_C_OnReloadTagChanged::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_OnReloadTagChanged, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_RadialReloadProgress_C_OnReloadTagChanged::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_OnReloadTagChanged, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000030, "Member 'WBP_RadialReloadProgress_C_OnReloadTagChanged::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_RadialReloadProgress_C_OnReloadTagChanged, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x000038, "Member 'WBP_RadialReloadProgress_C_OnReloadTagChanged::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");

// Function WBP_RadialReloadProgress.WBP_RadialReloadProgress_C.OnViewTargetChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_RadialReloadProgress_C_OnViewTargetChanged final
{
public:
	class APawn*                                  ViewTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialReloadProgress_C_OnViewTargetChanged) == 0x000008, "Wrong alignment on WBP_RadialReloadProgress_C_OnViewTargetChanged");
static_assert(sizeof(WBP_RadialReloadProgress_C_OnViewTargetChanged) == 0x000008, "Wrong size on WBP_RadialReloadProgress_C_OnViewTargetChanged");
static_assert(offsetof(WBP_RadialReloadProgress_C_OnViewTargetChanged, ViewTarget) == 0x000000, "Member 'WBP_RadialReloadProgress_C_OnViewTargetChanged::ViewTarget' has a wrong offset!");

}

