#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReportPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"
#include "SlateCore_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReportPlayer.WBP_ReportPlayer_C
// 0x0048 (0x0570 - 0x0528)
class UWBP_ReportPlayer_C final : public UGzNavigationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_NavigationButton_Action_C*         Back_NavButton;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      UniformGridPanel_37;                               // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AGzPlayerState*                         KillerPlayingState;                                // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AGzPlayerState*                         OwningPlayerState;                                 // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         In_Row;                                            // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_682B[0x4];                                     // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         ButtonPlayerState;                                 // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         NewReportPlayer;                                   // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_ReportScreen_C*                    ReportScreen;                                      // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ReportPlayer_Back_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void CreatePlayerEntry(int32 PlayerStateIndex);
	void Destruct();
	class UWidget* DoCustomNavigation(EUINavigation Param_Navigation);
	void ExecuteUbergraph_WBP_ReportPlayer(int32 EntryPoint);
	ETeamAttitude GetPlayerInformation(int32 PlayerStateIndex, bool* bIsNotOwner, class AGzPlayerState** PlayerState);
	void GetPlayerNames(class AGzPlayerState* Target, class FText* ClanTag, class FText* PlayerName);
	void InitializeList();
	void InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnBackAction();
	void OnButtonClicked(class AGzPlayerState* PlayerState);
	void OnPlayerRespawned(class APawn* OldPawn, class APawn* NewPawn);
	void SetOwningPlayerState();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReportPlayer_C">();
	}
	static class UWBP_ReportPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReportPlayer_C>();
	}
};
static_assert(alignof(UWBP_ReportPlayer_C) == 0x000008, "Wrong alignment on UWBP_ReportPlayer_C");
static_assert(sizeof(UWBP_ReportPlayer_C) == 0x000570, "Wrong size on UWBP_ReportPlayer_C");
static_assert(offsetof(UWBP_ReportPlayer_C, UberGraphFrame) == 0x000528, "Member 'UWBP_ReportPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ReportPlayer_C, Back_NavButton) == 0x000530, "Member 'UWBP_ReportPlayer_C::Back_NavButton' has a wrong offset!");
static_assert(offsetof(UWBP_ReportPlayer_C, UniformGridPanel_37) == 0x000538, "Member 'UWBP_ReportPlayer_C::UniformGridPanel_37' has a wrong offset!");
static_assert(offsetof(UWBP_ReportPlayer_C, KillerPlayingState) == 0x000540, "Member 'UWBP_ReportPlayer_C::KillerPlayingState' has a wrong offset!");
static_assert(offsetof(UWBP_ReportPlayer_C, OwningPlayerState) == 0x000548, "Member 'UWBP_ReportPlayer_C::OwningPlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_ReportPlayer_C, In_Row) == 0x000550, "Member 'UWBP_ReportPlayer_C::In_Row' has a wrong offset!");
static_assert(offsetof(UWBP_ReportPlayer_C, ButtonPlayerState) == 0x000558, "Member 'UWBP_ReportPlayer_C::ButtonPlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_ReportPlayer_C, NewReportPlayer) == 0x000560, "Member 'UWBP_ReportPlayer_C::NewReportPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_ReportPlayer_C, ReportScreen) == 0x000568, "Member 'UWBP_ReportPlayer_C::ReportScreen' has a wrong offset!");

}

