#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SquadScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SquadScreen.WBP_SquadScreen_C
// 0x0038 (0x0330 - 0x02F8)
class UWBP_SquadScreen_C final : public UGzSquadPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         AllMembers;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           GzTextBlock_303;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Enable_Waiting_Create;                             // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_609F[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnEntriesUpdated;                                  // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Disable_Squad_Screen_Focus;                        // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SquadScreen(int32 EntryPoint);
	void OnEntriesUpdated__DelegateSignature();
	void OnTeammatesUpdated(const TArray<struct FGzTeamMember>& TeamMembers);
	void Construct();
	void OnInitialized();
	void FillEntries();
	void Init_Entry(class UWBP_PlayerProfileItem_C* InEntry);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SquadScreen_C">();
	}
	static class UWBP_SquadScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SquadScreen_C>();
	}
};
static_assert(alignof(UWBP_SquadScreen_C) == 0x000008, "Wrong alignment on UWBP_SquadScreen_C");
static_assert(sizeof(UWBP_SquadScreen_C) == 0x000330, "Wrong size on UWBP_SquadScreen_C");
static_assert(offsetof(UWBP_SquadScreen_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_SquadScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SquadScreen_C, AllMembers) == 0x000300, "Member 'UWBP_SquadScreen_C::AllMembers' has a wrong offset!");
static_assert(offsetof(UWBP_SquadScreen_C, GzTextBlock_303) == 0x000308, "Member 'UWBP_SquadScreen_C::GzTextBlock_303' has a wrong offset!");
static_assert(offsetof(UWBP_SquadScreen_C, Enable_Waiting_Create) == 0x000310, "Member 'UWBP_SquadScreen_C::Enable_Waiting_Create' has a wrong offset!");
static_assert(offsetof(UWBP_SquadScreen_C, OnEntriesUpdated) == 0x000318, "Member 'UWBP_SquadScreen_C::OnEntriesUpdated' has a wrong offset!");
static_assert(offsetof(UWBP_SquadScreen_C, Disable_Squad_Screen_Focus) == 0x000328, "Member 'UWBP_SquadScreen_C::Disable_Squad_Screen_Focus' has a wrong offset!");

}

