#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSelectionScreen_PreMatch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoadoutSelectionScreen_PreMatch.WBP_LoadoutSelectionScreen_PreMatch_C
// 0x0068 (0x06F0 - 0x0688)
class UWBP_LoadoutSelectionScreen_PreMatch_C final : public UGzLoadoutSelectionSpawning
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_LoadoutSelection_Capture_C*        LoadoutSelectionCapture;                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSelection_ScreenDescription_C* WBP_LoadoutSelection_ScreenDescription;            // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shared_LabelHeader_C*              WBP_Shared_LabelHeader;                            // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shared_LabelHeader_C*              WBP_Shared_LabelHeader_1;                          // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shared_LabelHeader_C*              WBP_Shared_LabelHeader_2;                          // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bConfirmed;                                        // 0x06B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_588D[0x7];                                     // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           MenuCloseTimerHandle;                              // 0x06C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_ConfirmSelectionButton_C*          CastedConfirmButton;                               // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   ConfirmSelectionText;                              // 0x06D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        EndSelectionTime;                                  // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartSelectionTime;                                // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTimers();
	void SetTimer();
	void OnConfirmed_BP(class AGzPlayerController* ConfirmedBy, const struct FGzLoadoutDataConfig& LoadoutConfig);
	void InitializeLoadoutSlots();
	void Finish_Loadout_Selection(const struct FGuid& LoadoutGuid);
	void ExecuteUbergraph_WBP_LoadoutSelectionScreen_PreMatch(int32 EntryPoint);
	void BP_OnDeactivated();
	void BP_OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoadoutSelectionScreen_PreMatch_C">();
	}
	static class UWBP_LoadoutSelectionScreen_PreMatch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoadoutSelectionScreen_PreMatch_C>();
	}
};
static_assert(alignof(UWBP_LoadoutSelectionScreen_PreMatch_C) == 0x000008, "Wrong alignment on UWBP_LoadoutSelectionScreen_PreMatch_C");
static_assert(sizeof(UWBP_LoadoutSelectionScreen_PreMatch_C) == 0x0006F0, "Wrong size on UWBP_LoadoutSelectionScreen_PreMatch_C");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_PreMatch_C, UberGraphFrame) == 0x000688, "Member 'UWBP_LoadoutSelectionScreen_PreMatch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_PreMatch_C, LoadoutSelectionCapture) == 0x000690, "Member 'UWBP_LoadoutSelectionScreen_PreMatch_C::LoadoutSelectionCapture' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_PreMatch_C, WBP_LoadoutSelection_ScreenDescription) == 0x000698, "Member 'UWBP_LoadoutSelectionScreen_PreMatch_C::WBP_LoadoutSelection_ScreenDescription' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_PreMatch_C, WBP_Shared_LabelHeader) == 0x0006A0, "Member 'UWBP_LoadoutSelectionScreen_PreMatch_C::WBP_Shared_LabelHeader' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_PreMatch_C, WBP_Shared_LabelHeader_1) == 0x0006A8, "Member 'UWBP_LoadoutSelectionScreen_PreMatch_C::WBP_Shared_LabelHeader_1' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_PreMatch_C, WBP_Shared_LabelHeader_2) == 0x0006B0, "Member 'UWBP_LoadoutSelectionScreen_PreMatch_C::WBP_Shared_LabelHeader_2' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_PreMatch_C, bConfirmed) == 0x0006B8, "Member 'UWBP_LoadoutSelectionScreen_PreMatch_C::bConfirmed' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_PreMatch_C, MenuCloseTimerHandle) == 0x0006C0, "Member 'UWBP_LoadoutSelectionScreen_PreMatch_C::MenuCloseTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_PreMatch_C, CastedConfirmButton) == 0x0006C8, "Member 'UWBP_LoadoutSelectionScreen_PreMatch_C::CastedConfirmButton' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_PreMatch_C, ConfirmSelectionText) == 0x0006D0, "Member 'UWBP_LoadoutSelectionScreen_PreMatch_C::ConfirmSelectionText' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_PreMatch_C, EndSelectionTime) == 0x0006E0, "Member 'UWBP_LoadoutSelectionScreen_PreMatch_C::EndSelectionTime' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelectionScreen_PreMatch_C, StartSelectionTime) == 0x0006E8, "Member 'UWBP_LoadoutSelectionScreen_PreMatch_C::StartSelectionTime' has a wrong offset!");

}

