#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusEffrctSlotBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_StatusEffrctSlotBase.WBP_StatusEffrctSlotBase_C.BlinkingAnimation
// 0x0010 (0x0010 - 0x0000)
struct WBP_StatusEffrctSlotBase_C_BlinkingAnimation final
{
public:
	class UWidgetAnimation*                       InAnimation;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffrctSlotBase_C_BlinkingAnimation) == 0x000008, "Wrong alignment on WBP_StatusEffrctSlotBase_C_BlinkingAnimation");
static_assert(sizeof(WBP_StatusEffrctSlotBase_C_BlinkingAnimation) == 0x000010, "Wrong size on WBP_StatusEffrctSlotBase_C_BlinkingAnimation");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_BlinkingAnimation, InAnimation) == 0x000000, "Member 'WBP_StatusEffrctSlotBase_C_BlinkingAnimation::InAnimation' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_BlinkingAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_StatusEffrctSlotBase_C_BlinkingAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_StatusEffrctSlotBase.WBP_StatusEffrctSlotBase_C.DebugPrint
// 0x0010 (0x0010 - 0x0000)
struct WBP_StatusEffrctSlotBase_C_DebugPrint final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffrctSlotBase_C_DebugPrint) == 0x000008, "Wrong alignment on WBP_StatusEffrctSlotBase_C_DebugPrint");
static_assert(sizeof(WBP_StatusEffrctSlotBase_C_DebugPrint) == 0x000010, "Wrong size on WBP_StatusEffrctSlotBase_C_DebugPrint");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_DebugPrint, InString) == 0x000000, "Member 'WBP_StatusEffrctSlotBase_C_DebugPrint::InString' has a wrong offset!");

// Function WBP_StatusEffrctSlotBase.WBP_StatusEffrctSlotBase_C.ExecuteUbergraph_WBP_StatusEffrctSlotBase
// 0x0018 (0x0018 - 0x0000)
struct WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C56[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase) == 0x000008, "Wrong alignment on WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase");
static_assert(sizeof(WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase) == 0x000018, "Wrong size on WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase, EntryPoint) == 0x000000, "Member 'WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase, K2Node_Event_Animation) == 0x000008, "Member 'WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000011, "Member 'WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000012, "Member 'WBP_StatusEffrctSlotBase_C_ExecuteUbergraph_WBP_StatusEffrctSlotBase::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");

// Function WBP_StatusEffrctSlotBase.WBP_StatusEffrctSlotBase_C.FinishedBlinkingAnim
// 0x0001 (0x0001 - 0x0000)
struct WBP_StatusEffrctSlotBase_C_FinishedBlinkingAnim final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffrctSlotBase_C_FinishedBlinkingAnim) == 0x000001, "Wrong alignment on WBP_StatusEffrctSlotBase_C_FinishedBlinkingAnim");
static_assert(sizeof(WBP_StatusEffrctSlotBase_C_FinishedBlinkingAnim) == 0x000001, "Wrong size on WBP_StatusEffrctSlotBase_C_FinishedBlinkingAnim");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_FinishedBlinkingAnim, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'WBP_StatusEffrctSlotBase_C_FinishedBlinkingAnim::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function WBP_StatusEffrctSlotBase.WBP_StatusEffrctSlotBase_C.HideEffect
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatusEffrctSlotBase_C_HideEffect final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffrctSlotBase_C_HideEffect) == 0x000008, "Wrong alignment on WBP_StatusEffrctSlotBase_C_HideEffect");
static_assert(sizeof(WBP_StatusEffrctSlotBase_C_HideEffect) == 0x000008, "Wrong size on WBP_StatusEffrctSlotBase_C_HideEffect");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_HideEffect, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_StatusEffrctSlotBase_C_HideEffect::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_StatusEffrctSlotBase.WBP_StatusEffrctSlotBase_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatusEffrctSlotBase_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffrctSlotBase_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_StatusEffrctSlotBase_C_OnAnimationFinished");
static_assert(sizeof(WBP_StatusEffrctSlotBase_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_StatusEffrctSlotBase_C_OnAnimationFinished");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_StatusEffrctSlotBase_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_StatusEffrctSlotBase.WBP_StatusEffrctSlotBase_C.OnFinishedBlinking__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatusEffrctSlotBase_C_OnFinishedBlinking__DelegateSignature final
{
public:
	class UWBP_StatusEffrctSlotBase_C*            Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffrctSlotBase_C_OnFinishedBlinking__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StatusEffrctSlotBase_C_OnFinishedBlinking__DelegateSignature");
static_assert(sizeof(WBP_StatusEffrctSlotBase_C_OnFinishedBlinking__DelegateSignature) == 0x000008, "Wrong size on WBP_StatusEffrctSlotBase_C_OnFinishedBlinking__DelegateSignature");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_OnFinishedBlinking__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_StatusEffrctSlotBase_C_OnFinishedBlinking__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_StatusEffrctSlotBase.WBP_StatusEffrctSlotBase_C.OnFinishedHideAnim__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatusEffrctSlotBase_C_OnFinishedHideAnim__DelegateSignature final
{
public:
	class UWBP_StatusEffrctSlotBase_C*            Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffrctSlotBase_C_OnFinishedHideAnim__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StatusEffrctSlotBase_C_OnFinishedHideAnim__DelegateSignature");
static_assert(sizeof(WBP_StatusEffrctSlotBase_C_OnFinishedHideAnim__DelegateSignature) == 0x000008, "Wrong size on WBP_StatusEffrctSlotBase_C_OnFinishedHideAnim__DelegateSignature");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_OnFinishedHideAnim__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_StatusEffrctSlotBase_C_OnFinishedHideAnim__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_StatusEffrctSlotBase.WBP_StatusEffrctSlotBase_C.OnStartedBlinking__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatusEffrctSlotBase_C_OnStartedBlinking__DelegateSignature final
{
public:
	class UWBP_StatusEffrctSlotBase_C*            Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffrctSlotBase_C_OnStartedBlinking__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StatusEffrctSlotBase_C_OnStartedBlinking__DelegateSignature");
static_assert(sizeof(WBP_StatusEffrctSlotBase_C_OnStartedBlinking__DelegateSignature) == 0x000008, "Wrong size on WBP_StatusEffrctSlotBase_C_OnStartedBlinking__DelegateSignature");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_OnStartedBlinking__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_StatusEffrctSlotBase_C_OnStartedBlinking__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_StatusEffrctSlotBase.WBP_StatusEffrctSlotBase_C.SetIconTexture
// 0x0028 (0x0028 - 0x0000)
struct WBP_StatusEffrctSlotBase_C_SetIconTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              SoftTexture;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffrctSlotBase_C_SetIconTexture) == 0x000008, "Wrong alignment on WBP_StatusEffrctSlotBase_C_SetIconTexture");
static_assert(sizeof(WBP_StatusEffrctSlotBase_C_SetIconTexture) == 0x000028, "Wrong size on WBP_StatusEffrctSlotBase_C_SetIconTexture");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_SetIconTexture, SoftTexture) == 0x000000, "Member 'WBP_StatusEffrctSlotBase_C_SetIconTexture::SoftTexture' has a wrong offset!");

// Function WBP_StatusEffrctSlotBase.WBP_StatusEffrctSlotBase_C.SetPercent
// 0x0004 (0x0004 - 0x0000)
struct WBP_StatusEffrctSlotBase_C_SetPercent final
{
public:
	float                                         InPercent;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffrctSlotBase_C_SetPercent) == 0x000004, "Wrong alignment on WBP_StatusEffrctSlotBase_C_SetPercent");
static_assert(sizeof(WBP_StatusEffrctSlotBase_C_SetPercent) == 0x000004, "Wrong size on WBP_StatusEffrctSlotBase_C_SetPercent");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_SetPercent, InPercent) == 0x000000, "Member 'WBP_StatusEffrctSlotBase_C_SetPercent::InPercent' has a wrong offset!");

// Function WBP_StatusEffrctSlotBase.WBP_StatusEffrctSlotBase_C.SetSlotID
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatusEffrctSlotBase_C_SetSlotID final
{
public:
	class FName                                   Param_SlotID;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffrctSlotBase_C_SetSlotID) == 0x000004, "Wrong alignment on WBP_StatusEffrctSlotBase_C_SetSlotID");
static_assert(sizeof(WBP_StatusEffrctSlotBase_C_SetSlotID) == 0x000008, "Wrong size on WBP_StatusEffrctSlotBase_C_SetSlotID");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_SetSlotID, Param_SlotID) == 0x000000, "Member 'WBP_StatusEffrctSlotBase_C_SetSlotID::Param_SlotID' has a wrong offset!");

// Function WBP_StatusEffrctSlotBase.WBP_StatusEffrctSlotBase_C.ShowEffect
// 0x0010 (0x0010 - 0x0000)
struct WBP_StatusEffrctSlotBase_C_ShowEffect final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C57[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffrctSlotBase_C_ShowEffect) == 0x000008, "Wrong alignment on WBP_StatusEffrctSlotBase_C_ShowEffect");
static_assert(sizeof(WBP_StatusEffrctSlotBase_C_ShowEffect) == 0x000010, "Wrong size on WBP_StatusEffrctSlotBase_C_ShowEffect");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_ShowEffect, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'WBP_StatusEffrctSlotBase_C_ShowEffect::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_ShowEffect, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_StatusEffrctSlotBase_C_ShowEffect::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_StatusEffrctSlotBase.WBP_StatusEffrctSlotBase_C.StartBlinkingAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatusEffrctSlotBase_C_StartBlinkingAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffrctSlotBase_C_StartBlinkingAnim) == 0x000008, "Wrong alignment on WBP_StatusEffrctSlotBase_C_StartBlinkingAnim");
static_assert(sizeof(WBP_StatusEffrctSlotBase_C_StartBlinkingAnim) == 0x000008, "Wrong size on WBP_StatusEffrctSlotBase_C_StartBlinkingAnim");
static_assert(offsetof(WBP_StatusEffrctSlotBase_C_StartBlinkingAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_StatusEffrctSlotBase_C_StartBlinkingAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

