#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsEntry_ActionRemapping

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SettingsEntry_ActionRemapping.WBP_SettingsEntry_ActionRemapping_C.GetPrimaryGamepadFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsEntry_ActionRemapping_C_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsEntry_ActionRemapping_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong alignment on WBP_SettingsEntry_ActionRemapping_C_GetPrimaryGamepadFocusWidget");
static_assert(sizeof(WBP_SettingsEntry_ActionRemapping_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong size on WBP_SettingsEntry_ActionRemapping_C_GetPrimaryGamepadFocusWidget");
static_assert(offsetof(WBP_SettingsEntry_ActionRemapping_C_GetPrimaryGamepadFocusWidget, ReturnValue) == 0x000000, "Member 'WBP_SettingsEntry_ActionRemapping_C_GetPrimaryGamepadFocusWidget::ReturnValue' has a wrong offset!");

// Function WBP_SettingsEntry_ActionRemapping.WBP_SettingsEntry_ActionRemapping_C.ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66EA[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetInputBrushFromKeySlot_OutBrush;        // 0x0010(0x00D0)()
	bool                                          CallFunc_GetInputBrushFromKeySlot_ReturnValue;     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66EB[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_KeyboardBinding_Button_C*          K2Node_DynamicCast_AsWBP_Keyboard_Binding_Button;  // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66EC[0xF];                                     // 0x00F1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetInputBrushFromKeySlot_OutBrush_1;      // 0x0100(0x00D0)()
	bool                                          CallFunc_GetInputBrushFromKeySlot_ReturnValue_1;   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66ED[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_KeyboardBinding_Button_C*          K2Node_DynamicCast_AsWBP_Keyboard_Binding_Button_1; // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping) == 0x000010, "Wrong alignment on WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping");
static_assert(sizeof(WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping) == 0x0001F0, "Wrong size on WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping");
static_assert(offsetof(WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping, EntryPoint) == 0x000000, "Member 'WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping, CallFunc_GetInputBrushFromKeySlot_OutBrush) == 0x000010, "Member 'WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping::CallFunc_GetInputBrushFromKeySlot_OutBrush' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping, CallFunc_GetInputBrushFromKeySlot_ReturnValue) == 0x0000E0, "Member 'WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping::CallFunc_GetInputBrushFromKeySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping, K2Node_DynamicCast_AsWBP_Keyboard_Binding_Button) == 0x0000E8, "Member 'WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping::K2Node_DynamicCast_AsWBP_Keyboard_Binding_Button' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping, CallFunc_GetInputBrushFromKeySlot_OutBrush_1) == 0x000100, "Member 'WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping::CallFunc_GetInputBrushFromKeySlot_OutBrush_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping, CallFunc_GetInputBrushFromKeySlot_ReturnValue_1) == 0x0001D0, "Member 'WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping::CallFunc_GetInputBrushFromKeySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping, K2Node_DynamicCast_AsWBP_Keyboard_Binding_Button_1) == 0x0001D8, "Member 'WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping::K2Node_DynamicCast_AsWBP_Keyboard_Binding_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping, K2Node_DynamicCast_bSuccess_1) == 0x0001E0, "Member 'WBP_SettingsEntry_ActionRemapping_C_ExecuteUbergraph_WBP_SettingsEntry_ActionRemapping::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

