#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ZoomLevel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ZoomLevel.WBP_ZoomLevel_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_ZoomLevel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzTextBlock*                           ScopeValue_Text;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzWeaponComponent*                     WeaponComponent;                                   // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     PlayerCharacter;                                   // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   FontStyle;                                         // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOverrideBaseColor;                                // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5E95[0x3];                                     // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ColorNameOverride;                                 // 0x030C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ETextJustify                                  TextAlignment;                                     // 0x0314(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_ZoomLevel(int32 EntryPoint);
	void OnMagnificationChanged();
	void OverrideTextColor();
	void UpdateZoomLevel(int32 NewMagnification);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ZoomLevel_C">();
	}
	static class UWBP_ZoomLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ZoomLevel_C>();
	}
};
static_assert(alignof(UWBP_ZoomLevel_C) == 0x000008, "Wrong alignment on UWBP_ZoomLevel_C");
static_assert(sizeof(UWBP_ZoomLevel_C) == 0x000318, "Wrong size on UWBP_ZoomLevel_C");
static_assert(offsetof(UWBP_ZoomLevel_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ZoomLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ZoomLevel_C, ScopeValue_Text) == 0x0002E8, "Member 'UWBP_ZoomLevel_C::ScopeValue_Text' has a wrong offset!");
static_assert(offsetof(UWBP_ZoomLevel_C, WeaponComponent) == 0x0002F0, "Member 'UWBP_ZoomLevel_C::WeaponComponent' has a wrong offset!");
static_assert(offsetof(UWBP_ZoomLevel_C, PlayerCharacter) == 0x0002F8, "Member 'UWBP_ZoomLevel_C::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_ZoomLevel_C, FontStyle) == 0x000300, "Member 'UWBP_ZoomLevel_C::FontStyle' has a wrong offset!");
static_assert(offsetof(UWBP_ZoomLevel_C, bOverrideBaseColor) == 0x000308, "Member 'UWBP_ZoomLevel_C::bOverrideBaseColor' has a wrong offset!");
static_assert(offsetof(UWBP_ZoomLevel_C, ColorNameOverride) == 0x00030C, "Member 'UWBP_ZoomLevel_C::ColorNameOverride' has a wrong offset!");
static_assert(offsetof(UWBP_ZoomLevel_C, TextAlignment) == 0x000314, "Member 'UWBP_ZoomLevel_C::TextAlignment' has a wrong offset!");

}

