#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConfirmReport

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "Engine_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_ConfirmReport.WBP_ConfirmReport_C.BndEvt__WBP_ConfirmReport_Back_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConfirmReport_C_BndEvt__WBP_ConfirmReport_Back_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConfirmReport_C_BndEvt__WBP_ConfirmReport_Back_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ConfirmReport_C_BndEvt__WBP_ConfirmReport_Back_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ConfirmReport_C_BndEvt__WBP_ConfirmReport_Back_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ConfirmReport_C_BndEvt__WBP_ConfirmReport_Back_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ConfirmReport_C_BndEvt__WBP_ConfirmReport_Back_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ConfirmReport_C_BndEvt__WBP_ConfirmReport_Back_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ConfirmReport.WBP_ConfirmReport_C.BndEvt__WBP_ConfirmReport_Confirm_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConfirmReport_C_BndEvt__WBP_ConfirmReport_Confirm_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConfirmReport_C_BndEvt__WBP_ConfirmReport_Confirm_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ConfirmReport_C_BndEvt__WBP_ConfirmReport_Confirm_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ConfirmReport_C_BndEvt__WBP_ConfirmReport_Confirm_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ConfirmReport_C_BndEvt__WBP_ConfirmReport_Confirm_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ConfirmReport_C_BndEvt__WBP_ConfirmReport_Confirm_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ConfirmReport_C_BndEvt__WBP_ConfirmReport_Confirm_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ConfirmReport.WBP_ConfirmReport_C.ExecuteUbergraph_WBP_ConfirmReport
// 0x0110 (0x0110 - 0x0000)
struct WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6630[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6631[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0010)(ConstParm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6632[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6633[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0048(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6634[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_ReportScreen_C*>            CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_ReportScreen_C*                    CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6635[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6636[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6637[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APawn* OldPawn, class APawn* NewPawn)> K2Node_CreateDelegate_OutputDelegate;              // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_OldPawn;                        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_NewPawn;                        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APawn* OldPawn, class APawn* NewPawn)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport) == 0x000008, "Wrong alignment on WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport");
static_assert(sizeof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport) == 0x000110, "Wrong size on WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, EntryPoint) == 0x000000, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, Temp_object_Variable) == 0x000008, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, Temp_real_Variable) == 0x000010, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, Temp_real_Variable_1) == 0x000018, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, Temp_bool_Variable) == 0x000020, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, Temp_text_Variable) == 0x000028, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, Temp_bool_True_if_break_was_hit_Variable) == 0x000038, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000048, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000068, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00006C, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000070, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, Temp_real_Variable_0) == 0x000078, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, Temp_real_Variable_1_0) == 0x000080, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000088, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, K2Node_ComponentBoundEvent_Button_1) == 0x000090, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, K2Node_ComponentBoundEvent_Button) == 0x000098, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0000A0, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, CallFunc_IsValid_ReturnValue) == 0x0000BC, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, CallFunc_Add_IntInt_ReturnValue) == 0x0000C8, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, CallFunc_BooleanAND_ReturnValue) == 0x0000CC, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000D0, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, K2Node_CreateDelegate_OutputDelegate) == 0x0000D8, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, K2Node_CustomEvent_OldPawn) == 0x0000E8, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::K2Node_CustomEvent_OldPawn' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, K2Node_CustomEvent_NewPawn) == 0x0000F0, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::K2Node_CustomEvent_NewPawn' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000F8, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport, K2Node_CreateDelegate_OutputDelegate_1) == 0x000100, "Member 'WBP_ConfirmReport_C_ExecuteUbergraph_WBP_ConfirmReport::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_ConfirmReport.WBP_ConfirmReport_C.FormatReportReason
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_ConfirmReport_C_FormatReportReason final
{
public:
	EGzReportReason                               Enumerator;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6638[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
	EGzReportReason                               Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6639[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0030(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0040(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0010)()
	class FText                                   Temp_text_Variable_4;                              // 0x0060(0x0010)()
	class FText                                   Temp_text_Variable_5;                              // 0x0070(0x0010)()
	class FText                                   Temp_text_Variable_6;                              // 0x0080(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0090(0x0010)()
};
static_assert(alignof(WBP_ConfirmReport_C_FormatReportReason) == 0x000008, "Wrong alignment on WBP_ConfirmReport_C_FormatReportReason");
static_assert(sizeof(WBP_ConfirmReport_C_FormatReportReason) == 0x0000A0, "Wrong size on WBP_ConfirmReport_C_FormatReportReason");
static_assert(offsetof(WBP_ConfirmReport_C_FormatReportReason, Enumerator) == 0x000000, "Member 'WBP_ConfirmReport_C_FormatReportReason::Enumerator' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_FormatReportReason, ReturnValue) == 0x000008, "Member 'WBP_ConfirmReport_C_FormatReportReason::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_FormatReportReason, Temp_byte_Variable) == 0x000018, "Member 'WBP_ConfirmReport_C_FormatReportReason::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_FormatReportReason, Temp_text_Variable) == 0x000020, "Member 'WBP_ConfirmReport_C_FormatReportReason::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_FormatReportReason, Temp_text_Variable_1) == 0x000030, "Member 'WBP_ConfirmReport_C_FormatReportReason::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_FormatReportReason, Temp_text_Variable_2) == 0x000040, "Member 'WBP_ConfirmReport_C_FormatReportReason::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_FormatReportReason, Temp_text_Variable_3) == 0x000050, "Member 'WBP_ConfirmReport_C_FormatReportReason::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_FormatReportReason, Temp_text_Variable_4) == 0x000060, "Member 'WBP_ConfirmReport_C_FormatReportReason::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_FormatReportReason, Temp_text_Variable_5) == 0x000070, "Member 'WBP_ConfirmReport_C_FormatReportReason::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_FormatReportReason, Temp_text_Variable_6) == 0x000080, "Member 'WBP_ConfirmReport_C_FormatReportReason::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_FormatReportReason, K2Node_Select_Default) == 0x000090, "Member 'WBP_ConfirmReport_C_FormatReportReason::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ConfirmReport.WBP_ConfirmReport_C.InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_ConfirmReport_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConfirmReport_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_ConfirmReport_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_ConfirmReport_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_ConfirmReport_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_ConfirmReport_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_ConfirmReport_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_ConfirmReport_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_ConfirmReport_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_ConfirmReport_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_ConfirmReport.WBP_ConfirmReport_C.OnPlayerSpawned
// 0x0010 (0x0010 - 0x0000)
struct WBP_ConfirmReport_C_OnPlayerSpawned final
{
public:
	class APawn*                                  OldPawn;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConfirmReport_C_OnPlayerSpawned) == 0x000008, "Wrong alignment on WBP_ConfirmReport_C_OnPlayerSpawned");
static_assert(sizeof(WBP_ConfirmReport_C_OnPlayerSpawned) == 0x000010, "Wrong size on WBP_ConfirmReport_C_OnPlayerSpawned");
static_assert(offsetof(WBP_ConfirmReport_C_OnPlayerSpawned, OldPawn) == 0x000000, "Member 'WBP_ConfirmReport_C_OnPlayerSpawned::OldPawn' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_OnPlayerSpawned, NewPawn) == 0x000008, "Member 'WBP_ConfirmReport_C_OnPlayerSpawned::NewPawn' has a wrong offset!");

// Function WBP_ConfirmReport.WBP_ConfirmReport_C.SetPlayerName
// 0x0178 (0x0178 - 0x0000)
struct WBP_ConfirmReport_C_SetPlayerName final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_663A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetPlayerClanTag_ReturnValue;             // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00F8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0108(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_663B[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0158(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0168(0x0010)()
};
static_assert(alignof(WBP_ConfirmReport_C_SetPlayerName) == 0x000008, "Wrong alignment on WBP_ConfirmReport_C_SetPlayerName");
static_assert(sizeof(WBP_ConfirmReport_C_SetPlayerName) == 0x000178, "Wrong size on WBP_ConfirmReport_C_SetPlayerName");
static_assert(offsetof(WBP_ConfirmReport_C_SetPlayerName, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_ConfirmReport_C_SetPlayerName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetPlayerName, CallFunc_GetPlayerName_ReturnValue) == 0x000008, "Member 'WBP_ConfirmReport_C_SetPlayerName::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetPlayerName, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_ConfirmReport_C_SetPlayerName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetPlayerName, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000028, "Member 'WBP_ConfirmReport_C_SetPlayerName::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetPlayerName, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_ConfirmReport_C_SetPlayerName::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetPlayerName, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'WBP_ConfirmReport_C_SetPlayerName::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetPlayerName, K2Node_MakeArray_Array) == 0x0000C8, "Member 'WBP_ConfirmReport_C_SetPlayerName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetPlayerName, CallFunc_GetPlayerClanTag_ReturnValue) == 0x0000D8, "Member 'WBP_ConfirmReport_C_SetPlayerName::CallFunc_GetPlayerClanTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetPlayerName, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'WBP_ConfirmReport_C_SetPlayerName::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetPlayerName, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000F8, "Member 'WBP_ConfirmReport_C_SetPlayerName::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetPlayerName, K2Node_MakeStruct_FormatArgumentData_2) == 0x000108, "Member 'WBP_ConfirmReport_C_SetPlayerName::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetPlayerName, CallFunc_IsEmpty_ReturnValue) == 0x000150, "Member 'WBP_ConfirmReport_C_SetPlayerName::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetPlayerName, K2Node_MakeArray_Array_1) == 0x000158, "Member 'WBP_ConfirmReport_C_SetPlayerName::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetPlayerName, CallFunc_Format_ReturnValue_1) == 0x000168, "Member 'WBP_ConfirmReport_C_SetPlayerName::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function WBP_ConfirmReport.WBP_ConfirmReport_C.SetReportReasons
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_ConfirmReport_C_SetReportReasons final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_663C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzReportReason                               CallFunc_Array_Get_Item;                           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_663D[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatReportReason_ReturnValue;           // 0x0060(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0010)()
};
static_assert(alignof(WBP_ConfirmReport_C_SetReportReasons) == 0x000008, "Wrong alignment on WBP_ConfirmReport_C_SetReportReasons");
static_assert(sizeof(WBP_ConfirmReport_C_SetReportReasons) == 0x0000D8, "Wrong size on WBP_ConfirmReport_C_SetReportReasons");
static_assert(offsetof(WBP_ConfirmReport_C_SetReportReasons, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_ConfirmReport_C_SetReportReasons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetReportReasons, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_ConfirmReport_C_SetReportReasons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetReportReasons, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_ConfirmReport_C_SetReportReasons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetReportReasons, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_ConfirmReport_C_SetReportReasons::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetReportReasons, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_ConfirmReport_C_SetReportReasons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetReportReasons, CallFunc_Array_Get_Item) == 0x00005C, "Member 'WBP_ConfirmReport_C_SetReportReasons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetReportReasons, CallFunc_Less_IntInt_ReturnValue) == 0x00005D, "Member 'WBP_ConfirmReport_C_SetReportReasons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetReportReasons, CallFunc_FormatReportReason_ReturnValue) == 0x000060, "Member 'WBP_ConfirmReport_C_SetReportReasons::CallFunc_FormatReportReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetReportReasons, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'WBP_ConfirmReport_C_SetReportReasons::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetReportReasons, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_ConfirmReport_C_SetReportReasons::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmReport_C_SetReportReasons, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'WBP_ConfirmReport_C_SetReportReasons::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_ConfirmReport.WBP_ConfirmReport_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConfirmReport_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConfirmReport_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_ConfirmReport_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_ConfirmReport_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_ConfirmReport_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_ConfirmReport_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_ConfirmReport_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

