#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WinnerScreenStatEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_WinnerScreenStatEntry.WBP_WinnerScreenStatEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_WinnerScreenStatEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WinnerScreenStatEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_WinnerScreenStatEntry_C_PreConstruct");
static_assert(sizeof(WBP_WinnerScreenStatEntry_C_PreConstruct) == 0x000001, "Wrong size on WBP_WinnerScreenStatEntry_C_PreConstruct");
static_assert(offsetof(WBP_WinnerScreenStatEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_WinnerScreenStatEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_WinnerScreenStatEntry.WBP_WinnerScreenStatEntry_C.ExecuteUbergraph_WBP_WinnerScreenStatEntry
// 0x0070 (0x0070 - 0x0000)
struct WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66FF[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0060(0x0010)()
};
static_assert(alignof(WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry) == 0x000008, "Wrong alignment on WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry");
static_assert(sizeof(WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry) == 0x000070, "Wrong size on WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry");
static_assert(offsetof(WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry, EntryPoint) == 0x000000, "Member 'WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry, K2Node_MakeArray_Array) == 0x000050, "Member 'WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry, CallFunc_Format_ReturnValue) == 0x000060, "Member 'WBP_WinnerScreenStatEntry_C_ExecuteUbergraph_WBP_WinnerScreenStatEntry::CallFunc_Format_ReturnValue' has a wrong offset!");

}

