#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Spectate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Spectate.WBP_Spectate_C
// 0x01C0 (0x06E8 - 0x0528)
class UWBP_Spectate_C final : public UGzNavigationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RespawnBackgroundFlashing;                         // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RespawnBoostFadeIn;                                // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         ComebackArena_Time_RichText;                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Controls_HorizontalBox;                            // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ComebackInfo;                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           KillerName_Text;                                   // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           KillerTag_GzText;                                  // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KillSource_Image;                                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               KillSourceSizeBox;                                 // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NavigationButton_Action_C*         LeaveMatch_NavButton;                              // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzActionWidget*                        NextButton_GzActionWidget;                         // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NavigationButton_C*                NextPlayer_NavButton;                              // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NavigationButton_Action_C*         PingTerminal_NavButton;                            // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           PlayerName_GzText;                                 // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           PlayerTag_GzText;                                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzActionWidget*                        PrevButton_GzActionWidget;                         // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NavigationButton_C*                PreviousPlayer_NavButton;                          // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NavigationButton_Action_C*         ReportPlayer_Button;                               // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           RespawnBoostTime_GzText;                           // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           RespawnTimer;                                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RespawnVerticalBox;                                // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MatchResultBanner_C*               WBP_MatchResultBanner;                             // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TeamGameOver_C*                    WBP_TeamGameOver;                                  // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcherContent;                             // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AGzPlayerState*                         SpectatedPlayer;                                   // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle_InitializeSpectatedPlayer;             // 0x0600(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         MatchmakingTime;                                   // 0x0608(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57DC[0x4];                                     // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer;                                             // 0x0610(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         Player_State;                                      // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           TerminalPingType;                                  // 0x0620(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     RedeploymentTerminalClass;                         // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         BoostTimeBuffer;                                   // 0x0630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57DD[0x4];                                     // 0x0634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NoViewTargetText;                                  // 0x0638(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AGzPlayerController*                    As_Gz_Player_Controller;                           // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   DefeatText;                                        // 0x0650(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StillAliveText;                                    // 0x0660(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CanSpectateSomebodyElse;                           // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57DE[0x3];                                     // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzInputActionBindingHandle            NextPlayerHandle;                                  // 0x0674(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FGzInputActionBindingHandle            PrevPlayerHandle;                                  // 0x0678(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_57DF[0x4];                                     // 0x067C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, class UTexture2D*>  DamageSourceDefaultTextures;                       // 0x0680(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             KillSourceTexture;                                 // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         KillerPlayerState;                                 // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_ReportScreen_C*                    ReportScreen;                                      // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Spectate_LeaveMatch_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Spectate_NextPlayer_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Spectate_PingTerminal_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Spectate_PreviousPlayer_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Spectate_ReportPlayer_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void Check_Come_Back_Arena_Info();
	void Construct();
	void Destruct();
	void DisablePingTerminal(const class UGzGameMessage* Message);
	void ExecuteUbergraph_WBP_Spectate(int32 EntryPoint);
	void Finished_C82C7601428225AB0CAACCACF6F72893();
	void InpActEvt_IA_Spectator_LeaveMatch_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Spectator_PingClosestTerminal_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_ReportPlayer_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void MatchResultBannerEndDelegat_Event();
	void NextPlayerInput();
	void On_Match_Result_Set(const class AGzPlayerController* PlayerController);
	void OnBackAction();
	void OnReady_38D442F146A5135D1F239C84F84D5D46(class AGzGameModeSubsystem* Subsystem);
	void OnRespawnTimeChanged(class AGzPlayerState* PlayerState);
	void OnSpectatedPlayerChanged(class APawn* Pawn);
	void OnSpectatedPlayerNameChanged(class AGzPlayerState* PlayerState);
	void OnTeamDied(class AGzTeam* Team);
	void PlayRespawnBoostAnimation();
	void PrevPlayerInput();
	void SetKillSource();
	void SetNoViewTarget();
	void SetPlayerNameText(class AGzPlayerState* InPlayerState);
	void SetRespawnTime();
	void SpectatingKiller(bool bSpectatingKiller);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TrySpectatingNewPlayer(bool bPreviousPlayer);
	void TryUpdatingSpectatedPlayer();
	void UpdateComebackTime();
	void UpdateReportVisibility(bool bInIsLocked);
	void UpdateRespawnText(double RespawnTime);
	void UpdateSpectatedPlayer();
	void UpdateTeamLost();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Spectate_C">();
	}
	static class UWBP_Spectate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Spectate_C>();
	}
};
static_assert(alignof(UWBP_Spectate_C) == 0x000008, "Wrong alignment on UWBP_Spectate_C");
static_assert(sizeof(UWBP_Spectate_C) == 0x0006E8, "Wrong size on UWBP_Spectate_C");
static_assert(offsetof(UWBP_Spectate_C, UberGraphFrame) == 0x000528, "Member 'UWBP_Spectate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, RespawnBackgroundFlashing) == 0x000530, "Member 'UWBP_Spectate_C::RespawnBackgroundFlashing' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, RespawnBoostFadeIn) == 0x000538, "Member 'UWBP_Spectate_C::RespawnBoostFadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, CanvasPanel_0) == 0x000540, "Member 'UWBP_Spectate_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, ComebackArena_Time_RichText) == 0x000548, "Member 'UWBP_Spectate_C::ComebackArena_Time_RichText' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, Controls_HorizontalBox) == 0x000550, "Member 'UWBP_Spectate_C::Controls_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, HorizontalBox_ComebackInfo) == 0x000558, "Member 'UWBP_Spectate_C::HorizontalBox_ComebackInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, KillerName_Text) == 0x000560, "Member 'UWBP_Spectate_C::KillerName_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, KillerTag_GzText) == 0x000568, "Member 'UWBP_Spectate_C::KillerTag_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, KillSource_Image) == 0x000570, "Member 'UWBP_Spectate_C::KillSource_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, KillSourceSizeBox) == 0x000578, "Member 'UWBP_Spectate_C::KillSourceSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, LeaveMatch_NavButton) == 0x000580, "Member 'UWBP_Spectate_C::LeaveMatch_NavButton' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, NextButton_GzActionWidget) == 0x000588, "Member 'UWBP_Spectate_C::NextButton_GzActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, NextPlayer_NavButton) == 0x000590, "Member 'UWBP_Spectate_C::NextPlayer_NavButton' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, PingTerminal_NavButton) == 0x000598, "Member 'UWBP_Spectate_C::PingTerminal_NavButton' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, PlayerName_GzText) == 0x0005A0, "Member 'UWBP_Spectate_C::PlayerName_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, PlayerTag_GzText) == 0x0005A8, "Member 'UWBP_Spectate_C::PlayerTag_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, PrevButton_GzActionWidget) == 0x0005B0, "Member 'UWBP_Spectate_C::PrevButton_GzActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, PreviousPlayer_NavButton) == 0x0005B8, "Member 'UWBP_Spectate_C::PreviousPlayer_NavButton' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, ReportPlayer_Button) == 0x0005C0, "Member 'UWBP_Spectate_C::ReportPlayer_Button' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, RespawnBoostTime_GzText) == 0x0005C8, "Member 'UWBP_Spectate_C::RespawnBoostTime_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, RespawnTimer) == 0x0005D0, "Member 'UWBP_Spectate_C::RespawnTimer' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, RespawnVerticalBox) == 0x0005D8, "Member 'UWBP_Spectate_C::RespawnVerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, WBP_MatchResultBanner) == 0x0005E0, "Member 'UWBP_Spectate_C::WBP_MatchResultBanner' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, WBP_TeamGameOver) == 0x0005E8, "Member 'UWBP_Spectate_C::WBP_TeamGameOver' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, WidgetSwitcherContent) == 0x0005F0, "Member 'UWBP_Spectate_C::WidgetSwitcherContent' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, SpectatedPlayer) == 0x0005F8, "Member 'UWBP_Spectate_C::SpectatedPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, TimerHandle_InitializeSpectatedPlayer) == 0x000600, "Member 'UWBP_Spectate_C::TimerHandle_InitializeSpectatedPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, MatchmakingTime) == 0x000608, "Member 'UWBP_Spectate_C::MatchmakingTime' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, Timer) == 0x000610, "Member 'UWBP_Spectate_C::Timer' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, Player_State) == 0x000618, "Member 'UWBP_Spectate_C::Player_State' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, TerminalPingType) == 0x000620, "Member 'UWBP_Spectate_C::TerminalPingType' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, RedeploymentTerminalClass) == 0x000628, "Member 'UWBP_Spectate_C::RedeploymentTerminalClass' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, BoostTimeBuffer) == 0x000630, "Member 'UWBP_Spectate_C::BoostTimeBuffer' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, NoViewTargetText) == 0x000638, "Member 'UWBP_Spectate_C::NoViewTargetText' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, As_Gz_Player_Controller) == 0x000648, "Member 'UWBP_Spectate_C::As_Gz_Player_Controller' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, DefeatText) == 0x000650, "Member 'UWBP_Spectate_C::DefeatText' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, StillAliveText) == 0x000660, "Member 'UWBP_Spectate_C::StillAliveText' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, CanSpectateSomebodyElse) == 0x000670, "Member 'UWBP_Spectate_C::CanSpectateSomebodyElse' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, NextPlayerHandle) == 0x000674, "Member 'UWBP_Spectate_C::NextPlayerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, PrevPlayerHandle) == 0x000678, "Member 'UWBP_Spectate_C::PrevPlayerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, DamageSourceDefaultTextures) == 0x000680, "Member 'UWBP_Spectate_C::DamageSourceDefaultTextures' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, KillSourceTexture) == 0x0006D0, "Member 'UWBP_Spectate_C::KillSourceTexture' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, KillerPlayerState) == 0x0006D8, "Member 'UWBP_Spectate_C::KillerPlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_Spectate_C, ReportScreen) == 0x0006E0, "Member 'UWBP_Spectate_C::ReportScreen' has a wrong offset!");

}

