#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapRegionName

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MapRegionName.WBP_MapRegionName_C.ExecuteUbergraph_WBP_MapRegionName
// 0x0018 (0x0018 - 0x0000)
struct WBP_MapRegionName_C_ExecuteUbergraph_WBP_MapRegionName final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AE4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InText;                               // 0x0008(0x0010)(ConstParm)
};
static_assert(alignof(WBP_MapRegionName_C_ExecuteUbergraph_WBP_MapRegionName) == 0x000008, "Wrong alignment on WBP_MapRegionName_C_ExecuteUbergraph_WBP_MapRegionName");
static_assert(sizeof(WBP_MapRegionName_C_ExecuteUbergraph_WBP_MapRegionName) == 0x000018, "Wrong size on WBP_MapRegionName_C_ExecuteUbergraph_WBP_MapRegionName");
static_assert(offsetof(WBP_MapRegionName_C_ExecuteUbergraph_WBP_MapRegionName, EntryPoint) == 0x000000, "Member 'WBP_MapRegionName_C_ExecuteUbergraph_WBP_MapRegionName::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MapRegionName_C_ExecuteUbergraph_WBP_MapRegionName, K2Node_Event_InText) == 0x000008, "Member 'WBP_MapRegionName_C_ExecuteUbergraph_WBP_MapRegionName::K2Node_Event_InText' has a wrong offset!");

// Function WBP_MapRegionName.WBP_MapRegionName_C.OnTextSet
// 0x0010 (0x0010 - 0x0000)
struct WBP_MapRegionName_C_OnTextSet final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_MapRegionName_C_OnTextSet) == 0x000008, "Wrong alignment on WBP_MapRegionName_C_OnTextSet");
static_assert(sizeof(WBP_MapRegionName_C_OnTextSet) == 0x000010, "Wrong size on WBP_MapRegionName_C_OnTextSet");
static_assert(offsetof(WBP_MapRegionName_C_OnTextSet, InText) == 0x000000, "Member 'WBP_MapRegionName_C_OnTextSet::InText' has a wrong offset!");

}

