#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipInteraction_Mission

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TooltipInteraction_Mission.WBP_TooltipInteraction_Mission_C
// 0x00B0 (0x0390 - 0x02E0)
class UWBP_TooltipInteraction_Mission_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               ClockContainer;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Description_GzText;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Description_SizeBox;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Image;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           MissionName_GzText;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           MissionTimeGzText;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OpportunitySpecialBorder_Image;                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardTooltipContainer_C*          WBP_RewardTooltipContainer;                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGzMissionRewardWidgetData             Rewards;                                           // 0x0328(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UGzMissionData*                         CurrMissionData;                                   // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGzNotificationSettingsAsset*           NotificationSettingsAsset;                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ActivatedColor;                                    // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ActivatedDefault;                                  // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void CustomEvent(const class UGzGameMessage* Message);
	void ExecuteUbergraph_WBP_TooltipInteraction_Mission(int32 EntryPoint);
	void InitItemSetup(class UGzMissionData* MissionData);
	void OnReady_40AF62C64648AFF30BACB3BDADBC7852(class AGzGameModeSubsystem* Subsystem);
	void SetMissionDescription(const class FText& Description);
	void SetMissionIcon(TSoftObjectPtr<class UTexture2D> MissionIcon);
	void SetMissionName(const class FText& MissionName);
	void SetRewards(class UGzMissionData* MissionData);
	void SetRewardsInfo(const struct FGzMissionRewardWidgetData& Param_Rewards, class UWidget* HorizontalBox, class UImage* RewardImage, class UTextBlock* RewardText);
	void UpdateActivatedColor(bool Activated);
	void UpdateMisionTime(class UGzMissionData* MissionData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TooltipInteraction_Mission_C">();
	}
	static class UWBP_TooltipInteraction_Mission_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TooltipInteraction_Mission_C>();
	}
};
static_assert(alignof(UWBP_TooltipInteraction_Mission_C) == 0x000008, "Wrong alignment on UWBP_TooltipInteraction_Mission_C");
static_assert(sizeof(UWBP_TooltipInteraction_Mission_C) == 0x000390, "Wrong size on UWBP_TooltipInteraction_Mission_C");
static_assert(offsetof(UWBP_TooltipInteraction_Mission_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_TooltipInteraction_Mission_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Mission_C, ClockContainer) == 0x0002E8, "Member 'UWBP_TooltipInteraction_Mission_C::ClockContainer' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Mission_C, Description_GzText) == 0x0002F0, "Member 'UWBP_TooltipInteraction_Mission_C::Description_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Mission_C, Description_SizeBox) == 0x0002F8, "Member 'UWBP_TooltipInteraction_Mission_C::Description_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Mission_C, Icon_Image) == 0x000300, "Member 'UWBP_TooltipInteraction_Mission_C::Icon_Image' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Mission_C, MissionName_GzText) == 0x000308, "Member 'UWBP_TooltipInteraction_Mission_C::MissionName_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Mission_C, MissionTimeGzText) == 0x000310, "Member 'UWBP_TooltipInteraction_Mission_C::MissionTimeGzText' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Mission_C, OpportunitySpecialBorder_Image) == 0x000318, "Member 'UWBP_TooltipInteraction_Mission_C::OpportunitySpecialBorder_Image' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Mission_C, WBP_RewardTooltipContainer) == 0x000320, "Member 'UWBP_TooltipInteraction_Mission_C::WBP_RewardTooltipContainer' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Mission_C, Rewards) == 0x000328, "Member 'UWBP_TooltipInteraction_Mission_C::Rewards' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Mission_C, CurrMissionData) == 0x000360, "Member 'UWBP_TooltipInteraction_Mission_C::CurrMissionData' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Mission_C, NotificationSettingsAsset) == 0x000368, "Member 'UWBP_TooltipInteraction_Mission_C::NotificationSettingsAsset' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Mission_C, ActivatedColor) == 0x000370, "Member 'UWBP_TooltipInteraction_Mission_C::ActivatedColor' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_Mission_C, ActivatedDefault) == 0x000380, "Member 'UWBP_TooltipInteraction_Mission_C::ActivatedDefault' has a wrong offset!");

}

