#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SquadInfoContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SquadInfoContainer.WBP_SquadInfoContainer_C
// 0x0038 (0x0330 - 0x02F8)
class UWBP_SquadInfoContainer_C final : public UGzSquadPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           Container_VerticalBox;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          EnableWaitingCreate;                               // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FA2[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_SquadPanelEntry_C*>         Widgets;                                           // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UGzSessionGameModeSettings*             GameModeSettings;                                  // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowInventory;                                     // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void CreateSquadSlots();
	void ExecuteUbergraph_WBP_SquadInfoContainer(int32 EntryPoint);
	void OnTeammatesUpdated(const TArray<struct FGzTeamMember>& TeamMembers);
	void SetupGameModeSettings();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SquadInfoContainer_C">();
	}
	static class UWBP_SquadInfoContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SquadInfoContainer_C>();
	}
};
static_assert(alignof(UWBP_SquadInfoContainer_C) == 0x000008, "Wrong alignment on UWBP_SquadInfoContainer_C");
static_assert(sizeof(UWBP_SquadInfoContainer_C) == 0x000330, "Wrong size on UWBP_SquadInfoContainer_C");
static_assert(offsetof(UWBP_SquadInfoContainer_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_SquadInfoContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SquadInfoContainer_C, Container_VerticalBox) == 0x000300, "Member 'UWBP_SquadInfoContainer_C::Container_VerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_SquadInfoContainer_C, EnableWaitingCreate) == 0x000308, "Member 'UWBP_SquadInfoContainer_C::EnableWaitingCreate' has a wrong offset!");
static_assert(offsetof(UWBP_SquadInfoContainer_C, Widgets) == 0x000310, "Member 'UWBP_SquadInfoContainer_C::Widgets' has a wrong offset!");
static_assert(offsetof(UWBP_SquadInfoContainer_C, GameModeSettings) == 0x000320, "Member 'UWBP_SquadInfoContainer_C::GameModeSettings' has a wrong offset!");
static_assert(offsetof(UWBP_SquadInfoContainer_C, ShowInventory) == 0x000328, "Member 'UWBP_SquadInfoContainer_C::ShowInventory' has a wrong offset!");

}

