#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MortarLegs_MapCursor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MortarLegs_MapCursor.WBP_MortarLegs_MapCursor_C
// 0x0068 (0x0348 - 0x02E0)
class UWBP_MortarLegs_MapCursor_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TargetSelected;                                    // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OutOfRangeBlinking;                                // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Crosshair;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Invalid_GzText;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           InvalidCanvasPanel;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InvalidTargetCross;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InvalidTextBG;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           AvailableColor_Target;                             // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ErrorColor_Target;                                 // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLaunchAvailable;                                  // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_MortarLegs_MapCursor(int32 EntryPoint);
	void OnTargetSelected();
	void SetIsAvailable(bool bAvailable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MortarLegs_MapCursor_C">();
	}
	static class UWBP_MortarLegs_MapCursor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MortarLegs_MapCursor_C>();
	}
};
static_assert(alignof(UWBP_MortarLegs_MapCursor_C) == 0x000008, "Wrong alignment on UWBP_MortarLegs_MapCursor_C");
static_assert(sizeof(UWBP_MortarLegs_MapCursor_C) == 0x000348, "Wrong size on UWBP_MortarLegs_MapCursor_C");
static_assert(offsetof(UWBP_MortarLegs_MapCursor_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_MortarLegs_MapCursor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_MapCursor_C, TargetSelected) == 0x0002E8, "Member 'UWBP_MortarLegs_MapCursor_C::TargetSelected' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_MapCursor_C, OutOfRangeBlinking) == 0x0002F0, "Member 'UWBP_MortarLegs_MapCursor_C::OutOfRangeBlinking' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_MapCursor_C, Crosshair) == 0x0002F8, "Member 'UWBP_MortarLegs_MapCursor_C::Crosshair' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_MapCursor_C, Invalid_GzText) == 0x000300, "Member 'UWBP_MortarLegs_MapCursor_C::Invalid_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_MapCursor_C, InvalidCanvasPanel) == 0x000308, "Member 'UWBP_MortarLegs_MapCursor_C::InvalidCanvasPanel' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_MapCursor_C, InvalidTargetCross) == 0x000310, "Member 'UWBP_MortarLegs_MapCursor_C::InvalidTargetCross' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_MapCursor_C, InvalidTextBG) == 0x000318, "Member 'UWBP_MortarLegs_MapCursor_C::InvalidTextBG' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_MapCursor_C, AvailableColor_Target) == 0x000320, "Member 'UWBP_MortarLegs_MapCursor_C::AvailableColor_Target' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_MapCursor_C, ErrorColor_Target) == 0x000330, "Member 'UWBP_MortarLegs_MapCursor_C::ErrorColor_Target' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_MapCursor_C, bLaunchAvailable) == 0x000340, "Member 'UWBP_MortarLegs_MapCursor_C::bLaunchAvailable' has a wrong offset!");

}

