#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HEX_Extractor_3DWidget_Side_Parent

#include "Basic.hpp"

#include "E_HexUIExtractionStates_structs.hpp"
#include "Engine_structs.hpp"
#include "WBP_HEX_DiegeticWidget_Parent_classes.hpp"
#include "UMG_structs.hpp"
#include "G01_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HEX_Extractor_3DWidget_Side_Parent.WBP_HEX_Extractor_3DWidget_Side_Parent_C
// 0x0058 (0x0348 - 0x02F0)
class UWBP_HEX_Extractor_3DWidget_Side_Parent_C : public UWBP_HEX_DiegeticWidget_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PausedHackAnim;                                    // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PausedProgressAnim;                                // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IdleAnimation;                                     // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 GridNoise_Image;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HEXIcon_Image;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Main_WidgetSwitcher;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Pause_ProgressBar;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextAnimation_Image;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          MonitorRightSide;                                  // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_6785[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               HexMaterial;                                       // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetStartExtractionState(class UGzItemData* ItemData);
	void SetPercent(double Percent);
	void ShowGridNoise(bool Show);
	void SetPauseState();
	void SetStateStyle(E_HexUIExtractionStates NewState);
	void SetHackingState();
	void ResetInfo();
	void ExtractionCompleteInfo();
	void OnInitialized();
	void ExtractingState();
	void HackingCompleteInfo();
	void ExecuteUbergraph_WBP_HEX_Extractor_3DWidget_Side_Parent(int32 EntryPoint);
	void CompleteExtraction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HEX_Extractor_3DWidget_Side_Parent_C">();
	}
	static class UWBP_HEX_Extractor_3DWidget_Side_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HEX_Extractor_3DWidget_Side_Parent_C>();
	}
};
static_assert(alignof(UWBP_HEX_Extractor_3DWidget_Side_Parent_C) == 0x000008, "Wrong alignment on UWBP_HEX_Extractor_3DWidget_Side_Parent_C");
static_assert(sizeof(UWBP_HEX_Extractor_3DWidget_Side_Parent_C) == 0x000348, "Wrong size on UWBP_HEX_Extractor_3DWidget_Side_Parent_C");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_Side_Parent_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_HEX_Extractor_3DWidget_Side_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_Side_Parent_C, PausedHackAnim) == 0x0002F8, "Member 'UWBP_HEX_Extractor_3DWidget_Side_Parent_C::PausedHackAnim' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_Side_Parent_C, PausedProgressAnim) == 0x000300, "Member 'UWBP_HEX_Extractor_3DWidget_Side_Parent_C::PausedProgressAnim' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_Side_Parent_C, IdleAnimation) == 0x000308, "Member 'UWBP_HEX_Extractor_3DWidget_Side_Parent_C::IdleAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_Side_Parent_C, GridNoise_Image) == 0x000310, "Member 'UWBP_HEX_Extractor_3DWidget_Side_Parent_C::GridNoise_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_Side_Parent_C, HEXIcon_Image) == 0x000318, "Member 'UWBP_HEX_Extractor_3DWidget_Side_Parent_C::HEXIcon_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_Side_Parent_C, Main_WidgetSwitcher) == 0x000320, "Member 'UWBP_HEX_Extractor_3DWidget_Side_Parent_C::Main_WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_Side_Parent_C, Pause_ProgressBar) == 0x000328, "Member 'UWBP_HEX_Extractor_3DWidget_Side_Parent_C::Pause_ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_Side_Parent_C, TextAnimation_Image) == 0x000330, "Member 'UWBP_HEX_Extractor_3DWidget_Side_Parent_C::TextAnimation_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_Side_Parent_C, MonitorRightSide) == 0x000338, "Member 'UWBP_HEX_Extractor_3DWidget_Side_Parent_C::MonitorRightSide' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_Side_Parent_C, HexMaterial) == 0x000340, "Member 'UWBP_HEX_Extractor_3DWidget_Side_Parent_C::HexMaterial' has a wrong offset!");

}

