#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CrosshairLeaf

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CrosshairLeaf.WBP_CrosshairLeaf_C
// 0x0018 (0x0300 - 0x02E8)
class UWBP_CrosshairLeaf_C final : public UGzCrosshairLeaf
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 LeafImage;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             ReticleTexture;                                    // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CrosshairLeaf(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CrosshairLeaf_C">();
	}
	static class UWBP_CrosshairLeaf_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CrosshairLeaf_C>();
	}
};
static_assert(alignof(UWBP_CrosshairLeaf_C) == 0x000008, "Wrong alignment on UWBP_CrosshairLeaf_C");
static_assert(sizeof(UWBP_CrosshairLeaf_C) == 0x000300, "Wrong size on UWBP_CrosshairLeaf_C");
static_assert(offsetof(UWBP_CrosshairLeaf_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_CrosshairLeaf_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CrosshairLeaf_C, LeafImage) == 0x0002F0, "Member 'UWBP_CrosshairLeaf_C::LeafImage' has a wrong offset!");
static_assert(offsetof(UWBP_CrosshairLeaf_C, ReticleTexture) == 0x0002F8, "Member 'UWBP_CrosshairLeaf_C::ReticleTexture' has a wrong offset!");

}

