#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SettingsMenu.WBP_SettingsMenu_C
// 0x0058 (0x0548 - 0x04F0)
class UWBP_SettingsMenu_C final : public UGzSettingsMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_80;                                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyImage;                                          // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                NotificationContainer;                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           NotificationText;                                  // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   UnmappedActionName;                                // 0x0518(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MappedActionName;                                  // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         NotificationsDelay;                                // 0x0538(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60B2[0x4];                                     // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_EscapeMenu_C*                      ParrentEscMenu;                                    // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void TabSelected(class FName TabId);
	void OnResetToDefaultCanceled();
	void OnResetToDefaultApplied();
	void OnInitialized();
	void Init(class UWBP_EscapeMenu_C* Param_ParrentEscMenu);
	void HideNotification();
	void HandleApplySettings();
	void FocusList();
	void FocusFirstItem();
	void FlushActionNames();
	void ExecuteUbergraph_WBP_SettingsMenu(int32 EntryPoint);
	void Construct();
	void BP_OnActivated();
	void AddMappingUpdateNotification(const TArray<struct FGzInputActionMappingChange>& InputActionMappingChanges);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SettingsMenu_C">();
	}
	static class UWBP_SettingsMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SettingsMenu_C>();
	}
};
static_assert(alignof(UWBP_SettingsMenu_C) == 0x000008, "Wrong alignment on UWBP_SettingsMenu_C");
static_assert(sizeof(UWBP_SettingsMenu_C) == 0x000548, "Wrong size on UWBP_SettingsMenu_C");
static_assert(offsetof(UWBP_SettingsMenu_C, UberGraphFrame) == 0x0004F0, "Member 'UWBP_SettingsMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsMenu_C, Image_80) == 0x0004F8, "Member 'UWBP_SettingsMenu_C::Image_80' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsMenu_C, KeyImage) == 0x000500, "Member 'UWBP_SettingsMenu_C::KeyImage' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsMenu_C, NotificationContainer) == 0x000508, "Member 'UWBP_SettingsMenu_C::NotificationContainer' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsMenu_C, NotificationText) == 0x000510, "Member 'UWBP_SettingsMenu_C::NotificationText' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsMenu_C, UnmappedActionName) == 0x000518, "Member 'UWBP_SettingsMenu_C::UnmappedActionName' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsMenu_C, MappedActionName) == 0x000528, "Member 'UWBP_SettingsMenu_C::MappedActionName' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsMenu_C, NotificationsDelay) == 0x000538, "Member 'UWBP_SettingsMenu_C::NotificationsDelay' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsMenu_C, ParrentEscMenu) == 0x000540, "Member 'UWBP_SettingsMenu_C::ParrentEscMenu' has a wrong offset!");

// WidgetBlueprintGeneratedClass WBP_SettingsMenu.WBP_SettingsMenu1_C
// 0x0000 (0x04F0 - 0x04F0)
class UWBP_SettingsMenu1_C final : public UGzSettingsMenuWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SettingsMenu1_C">();
	}
	static class UWBP_SettingsMenu1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SettingsMenu1_C>();
	}
};
static_assert(alignof(UWBP_SettingsMenu1_C) == 0x000008, "Wrong alignment on UWBP_SettingsMenu1_C");
static_assert(sizeof(UWBP_SettingsMenu1_C) == 0x0004F0, "Wrong size on UWBP_SettingsMenu1_C");

}

