#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HEX_DiegeticWidget_Parent

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "E_HexUIExtractionStates_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HEX_DiegeticWidget_Parent.WBP_HEX_DiegeticWidget_Parent_C
// 0x0010 (0x02F0 - 0x02E0)
class UWBP_HEX_DiegeticWidget_Parent_C : public UUserWidget
{
public:
	bool                                          IsHacking;                                         // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExtracting;                                      // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589D[0x6];                                     // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CompleteShowTime;                                  // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShowGridNoise(bool Show);
	void SetStateStyle(E_HexUIExtractionStates NewState);
	void SetStartExtractionState(class UGzItemData* ItemData);
	void SetPercent(double Percent);
	void SetPauseState();
	void SetHackingState();
	void ResetInfo();
	void ExtractingState();
	void CompleteExtraction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HEX_DiegeticWidget_Parent_C">();
	}
	static class UWBP_HEX_DiegeticWidget_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HEX_DiegeticWidget_Parent_C>();
	}
};
static_assert(alignof(UWBP_HEX_DiegeticWidget_Parent_C) == 0x000008, "Wrong alignment on UWBP_HEX_DiegeticWidget_Parent_C");
static_assert(sizeof(UWBP_HEX_DiegeticWidget_Parent_C) == 0x0002F0, "Wrong size on UWBP_HEX_DiegeticWidget_Parent_C");
static_assert(offsetof(UWBP_HEX_DiegeticWidget_Parent_C, IsHacking) == 0x0002E0, "Member 'UWBP_HEX_DiegeticWidget_Parent_C::IsHacking' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_DiegeticWidget_Parent_C, IsExtracting) == 0x0002E1, "Member 'UWBP_HEX_DiegeticWidget_Parent_C::IsExtracting' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_DiegeticWidget_Parent_C, CompleteShowTime) == 0x0002E8, "Member 'UWBP_HEX_DiegeticWidget_Parent_C::CompleteShowTime' has a wrong offset!");

}

