#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Redeployment_MemberButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_Redeployment_PlayerState_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Redeployment_MemberButton.WBP_Redeployment_MemberButton_C
// 0x00E0 (0x1710 - 0x1630)
class UWBP_Redeployment_MemberButton_C final : public UGzCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ButtonBackground_Image;                            // 0x1638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Cost_GzText;                                       // 0x1640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cost_Image;                                        // 0x1648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerImage;                                       // 0x1650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerImage_Background;                            // 0x1658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           PlayerName_GzText;                                 // 0x1660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           PlayerTag_GzText;                                  // 0x1668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Redeploy_HorizontalBox;                            // 0x1670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           RespawnTime_GzText;                                // 0x1678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WarningRedeployment_WidgetSwitcher;                // 0x1680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Warnings_Text;                                     // 0x1688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AGzPlayerState*                         TeammatePlayerState;                               // 0x1690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         PlayerCurrecy;                                     // 0x1698(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         RedeploymentCostValue;                             // 0x169C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             RedeployPlayer;                                    // 0x16A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<ENUM_Redeployment_PlayerState, class FText> PlayerStateTextDescrption;                         // 0x16B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           RespawnTimerUpdate;                                // 0x1700(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CanInteract;                                       // 0x1708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateRespawnTime();
	void UpdateRedeploymentCost();
	void UpdatePlayerCurrency(int32 Param_PlayerCurrecy);
	void RedeployPlayer__DelegateSignature(class AGzPlayerState* PlayerState, class UWBP_Redeployment_MemberButton_C* RedeploymentButton);
	void OnTeammateAlive(class AGzPlayerState* PlayerState);
	void GetRemainingRespawnTime(class FText* Text, double* Float);
	void GetPlayerLifeState(ENUM_Redeployment_PlayerState* PlayerLifeState);
	void ExecuteUbergraph_WBP_Redeployment_MemberButton(int32 EntryPoint);
	void Construct();
	void ButtonSetUp();
	void ButtonHover(bool IsButtonHover);
	void BP_OnUnhovered();
	void BP_OnPressed();
	void BP_OnHovered();
	void BP_OnFocusReceived();
	void BP_OnFocusLost();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Redeployment_MemberButton_C">();
	}
	static class UWBP_Redeployment_MemberButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Redeployment_MemberButton_C>();
	}
};
static_assert(alignof(UWBP_Redeployment_MemberButton_C) == 0x000010, "Wrong alignment on UWBP_Redeployment_MemberButton_C");
static_assert(sizeof(UWBP_Redeployment_MemberButton_C) == 0x001710, "Wrong size on UWBP_Redeployment_MemberButton_C");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, UberGraphFrame) == 0x001630, "Member 'UWBP_Redeployment_MemberButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, ButtonBackground_Image) == 0x001638, "Member 'UWBP_Redeployment_MemberButton_C::ButtonBackground_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, Cost_GzText) == 0x001640, "Member 'UWBP_Redeployment_MemberButton_C::Cost_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, Cost_Image) == 0x001648, "Member 'UWBP_Redeployment_MemberButton_C::Cost_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, PlayerImage) == 0x001650, "Member 'UWBP_Redeployment_MemberButton_C::PlayerImage' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, PlayerImage_Background) == 0x001658, "Member 'UWBP_Redeployment_MemberButton_C::PlayerImage_Background' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, PlayerName_GzText) == 0x001660, "Member 'UWBP_Redeployment_MemberButton_C::PlayerName_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, PlayerTag_GzText) == 0x001668, "Member 'UWBP_Redeployment_MemberButton_C::PlayerTag_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, Redeploy_HorizontalBox) == 0x001670, "Member 'UWBP_Redeployment_MemberButton_C::Redeploy_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, RespawnTime_GzText) == 0x001678, "Member 'UWBP_Redeployment_MemberButton_C::RespawnTime_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, WarningRedeployment_WidgetSwitcher) == 0x001680, "Member 'UWBP_Redeployment_MemberButton_C::WarningRedeployment_WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, Warnings_Text) == 0x001688, "Member 'UWBP_Redeployment_MemberButton_C::Warnings_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, TeammatePlayerState) == 0x001690, "Member 'UWBP_Redeployment_MemberButton_C::TeammatePlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, PlayerCurrecy) == 0x001698, "Member 'UWBP_Redeployment_MemberButton_C::PlayerCurrecy' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, RedeploymentCostValue) == 0x00169C, "Member 'UWBP_Redeployment_MemberButton_C::RedeploymentCostValue' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, RedeployPlayer) == 0x0016A0, "Member 'UWBP_Redeployment_MemberButton_C::RedeployPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, PlayerStateTextDescrption) == 0x0016B0, "Member 'UWBP_Redeployment_MemberButton_C::PlayerStateTextDescrption' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, RespawnTimerUpdate) == 0x001700, "Member 'UWBP_Redeployment_MemberButton_C::RespawnTimerUpdate' has a wrong offset!");
static_assert(offsetof(UWBP_Redeployment_MemberButton_C, CanInteract) == 0x001708, "Member 'UWBP_Redeployment_MemberButton_C::CanInteract' has a wrong offset!");

}

