#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerStat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerStat.WBP_PlayerStat_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_PlayerStat_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzTextBlock*                           Text_Stat;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Text_Value;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   StatName;                                          // 0x02F8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        StatValue;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UpdateValue(double Value);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_PlayerStat(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerStat_C">();
	}
	static class UWBP_PlayerStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerStat_C>();
	}
};
static_assert(alignof(UWBP_PlayerStat_C) == 0x000008, "Wrong alignment on UWBP_PlayerStat_C");
static_assert(sizeof(UWBP_PlayerStat_C) == 0x000310, "Wrong size on UWBP_PlayerStat_C");
static_assert(offsetof(UWBP_PlayerStat_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_PlayerStat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerStat_C, Text_Stat) == 0x0002E8, "Member 'UWBP_PlayerStat_C::Text_Stat' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerStat_C, Text_Value) == 0x0002F0, "Member 'UWBP_PlayerStat_C::Text_Value' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerStat_C, StatName) == 0x0002F8, "Member 'UWBP_PlayerStat_C::StatName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerStat_C, StatValue) == 0x000308, "Member 'UWBP_PlayerStat_C::StatValue' has a wrong offset!");

}

