#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainNotification_SecondaryTimerCount

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainNotification_SecondaryTimerCount.WBP_MainNotification_SecondaryTimerCount_C
// 0x0088 (0x0410 - 0x0388)
class UWBP_MainNotification_SecondaryTimerCount_C final : public UGzGameNotificationBody
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HundredsMovement;                                  // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TenMovement;                                       // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnitMovement;                                      // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGzTextBlock*                           CurrentHundredNumber_GzText;                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           CurrentTenNumber_GzText;                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           CurrentUnitNumber_GzText;                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               HundredsOverlay;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           NextHundredNumber_GzText;                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           NextTenNumber_GzText;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           NextUnitNumber_GzText;                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TenOverlay;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               UnitOverlay;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Time;                                              // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     NewVar;                                            // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateTimer;                                       // 0x0400(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableAutoAnimation;                              // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnabledFirstShowFilter;                            // 0x0409(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimationEndUnits();
	void CheckForHundreds();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount(int32 EntryPoint);
	void PlayNumberAnimation();
	void ResetAnimationOffsets();
	void SetText(class UGzTextBlock* Widget, int32 Text);
	void SetTime(double Param_Time, bool Param_PlayAnimation);
	bool UpdateNotificationData();
	void UpdateNumbers();
	void UpdateTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainNotification_SecondaryTimerCount_C">();
	}
	static class UWBP_MainNotification_SecondaryTimerCount_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainNotification_SecondaryTimerCount_C>();
	}
};
static_assert(alignof(UWBP_MainNotification_SecondaryTimerCount_C) == 0x000008, "Wrong alignment on UWBP_MainNotification_SecondaryTimerCount_C");
static_assert(sizeof(UWBP_MainNotification_SecondaryTimerCount_C) == 0x000410, "Wrong size on UWBP_MainNotification_SecondaryTimerCount_C");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, UberGraphFrame) == 0x000388, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, HundredsMovement) == 0x000390, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::HundredsMovement' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, TenMovement) == 0x000398, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::TenMovement' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, UnitMovement) == 0x0003A0, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::UnitMovement' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, CurrentHundredNumber_GzText) == 0x0003A8, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::CurrentHundredNumber_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, CurrentTenNumber_GzText) == 0x0003B0, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::CurrentTenNumber_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, CurrentUnitNumber_GzText) == 0x0003B8, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::CurrentUnitNumber_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, HundredsOverlay) == 0x0003C0, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::HundredsOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, NextHundredNumber_GzText) == 0x0003C8, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::NextHundredNumber_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, NextTenNumber_GzText) == 0x0003D0, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::NextTenNumber_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, NextUnitNumber_GzText) == 0x0003D8, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::NextUnitNumber_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, TenOverlay) == 0x0003E0, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::TenOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, UnitOverlay) == 0x0003E8, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::UnitOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, Time) == 0x0003F0, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::Time' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, NewVar) == 0x0003F8, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::NewVar' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, UpdateTimer) == 0x000400, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::UpdateTimer' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, bEnableAutoAnimation) == 0x000408, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::bEnableAutoAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerCount_C, EnabledFirstShowFilter) == 0x000409, "Member 'UWBP_MainNotification_SecondaryTimerCount_C::EnabledFirstShowFilter' has a wrong offset!");

}

