#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoiceChatUIState

#include "Basic.hpp"

#include "EVoiceChatUIState_structs.hpp"
#include "Engine_structs.hpp"
#include "FVoiceChatUIStateData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "G01_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VoiceChatUIState.WBP_VoiceChatUIState_C
// 0x00B0 (0x0390 - 0x02E0)
class UWBP_VoiceChatUIState_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimSpeaking;                                      // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               Voice_SizeBox;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Voice_WidgetSwitcher;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VoiceStatic_Image;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EVoiceChatUIState, struct FFVoiceChatUIStateData> StateSettings;                                     // 0x0318(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	EVoiceChatUIState                             CurrentVisualState;                                // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB0[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         AssignedPlayerState;                               // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EVoiceChatUIState                             PlayerVCState;                                     // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB1[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           UpdateTimer;                                       // 0x0380(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         UpdateTimerTime;                                   // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindEvents();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_VoiceChatUIState(int32 EntryPoint);
	void IsVoiceChatDisabled(bool* Disabled);
	void PreConstruct(bool IsDesignTime);
	void SetPlayerState(class AGzPlayerState* Param_AssignedPlayerState);
	void SetState(EVoiceChatUIState VoiceChatState);
	void UnbindEvents();
	void Update();
	void UpdateAll();
	void UpdateVisuals();
	void UpdateVoiceChatEnabled(const class FString& PlayFabId, bool bIsMuted);
	void UpdateVoiceChatMuted(const class FString& PlayFabId, bool bIsMuted);
	void UpdateVoiceChatTalking(const class FString& EpicProductUserId, bool bTalkingState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VoiceChatUIState_C">();
	}
	static class UWBP_VoiceChatUIState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VoiceChatUIState_C>();
	}
};
static_assert(alignof(UWBP_VoiceChatUIState_C) == 0x000008, "Wrong alignment on UWBP_VoiceChatUIState_C");
static_assert(sizeof(UWBP_VoiceChatUIState_C) == 0x000390, "Wrong size on UWBP_VoiceChatUIState_C");
static_assert(offsetof(UWBP_VoiceChatUIState_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_VoiceChatUIState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatUIState_C, AnimSpeaking) == 0x0002E8, "Member 'UWBP_VoiceChatUIState_C::AnimSpeaking' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatUIState_C, Voice_SizeBox) == 0x0002F0, "Member 'UWBP_VoiceChatUIState_C::Voice_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatUIState_C, Voice_WidgetSwitcher) == 0x0002F8, "Member 'UWBP_VoiceChatUIState_C::Voice_WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatUIState_C, VoiceStatic_Image) == 0x000300, "Member 'UWBP_VoiceChatUIState_C::VoiceStatic_Image' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatUIState_C, Size) == 0x000308, "Member 'UWBP_VoiceChatUIState_C::Size' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatUIState_C, StateSettings) == 0x000318, "Member 'UWBP_VoiceChatUIState_C::StateSettings' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatUIState_C, CurrentVisualState) == 0x000368, "Member 'UWBP_VoiceChatUIState_C::CurrentVisualState' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatUIState_C, AssignedPlayerState) == 0x000370, "Member 'UWBP_VoiceChatUIState_C::AssignedPlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatUIState_C, PlayerVCState) == 0x000378, "Member 'UWBP_VoiceChatUIState_C::PlayerVCState' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatUIState_C, UpdateTimer) == 0x000380, "Member 'UWBP_VoiceChatUIState_C::UpdateTimer' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatUIState_C, UpdateTimerTime) == 0x000388, "Member 'UWBP_VoiceChatUIState_C::UpdateTimerTime' has a wrong offset!");

}

