#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OutsidePlayableAreaNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function WBP_OutsidePlayableAreaNotification.WBP_OutsidePlayableAreaNotification_C.ExecuteUbergraph_WBP_OutsidePlayableAreaNotification
// 0x0100 (0x0100 - 0x0000)
struct WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_2;                          // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x003C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0054(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1D[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAbilitySystemComponent*              K2Node_DynamicCast_AsGz_Ability_System_Component;  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1E[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffectsWithAllTags_ReturnValue;  // 0x0088(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1F[0x2];                                     // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A20[0x1];                                     // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A21[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_NewViewTarget;                        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_OldViewTarget;                        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A22[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_ViewTarget;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character_1;        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A23[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag_3;                          // 0x00F4(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification) == 0x000008, "Wrong alignment on WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification");
static_assert(sizeof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification) == 0x000100, "Wrong size on WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, EntryPoint) == 0x000000, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_CustomEvent_Tag_2) == 0x000004, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_CustomEvent_Tag_2' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, Temp_struct_Variable) == 0x00001C, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_CustomEvent_Tag_1) == 0x000034, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_CustomEvent_Tag) == 0x00003C, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, Temp_struct_Variable_1) == 0x000054, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000060, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_DynamicCast_AsGz_Ability_System_Component) == 0x000068, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_DynamicCast_AsGz_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue) == 0x000078, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000080, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, CallFunc_GetActiveEffectsWithAllTags_ReturnValue) == 0x000088, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::CallFunc_GetActiveEffectsWithAllTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, CallFunc_IsValid_ReturnValue) == 0x00009C, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, CallFunc_Greater_IntInt_ReturnValue) == 0x00009D, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1) == 0x0000A0, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, CallFunc_IsValid_ReturnValue_2) == 0x0000A9, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, CallFunc_IsValid_ReturnValue_3) == 0x0000AA, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000AC, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_Event_NewViewTarget) == 0x0000C0, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_Event_NewViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_Event_OldViewTarget) == 0x0000C8, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_Event_OldViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_DynamicCast_AsGz_Player_Character) == 0x0000D0, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_Event_ViewTarget) == 0x0000E0, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_Event_ViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_DynamicCast_AsGz_Player_Character_1) == 0x0000E8, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_DynamicCast_AsGz_Player_Character_1' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification, K2Node_CustomEvent_Tag_3) == 0x0000F4, "Member 'WBP_OutsidePlayableAreaNotification_C_ExecuteUbergraph_WBP_OutsidePlayableAreaNotification::K2Node_CustomEvent_Tag_3' has a wrong offset!");

// Function WBP_OutsidePlayableAreaNotification.WBP_OutsidePlayableAreaNotification_C.FindAnimationTime
// 0x0020 (0x0020 - 0x0000)
struct WBP_OutsidePlayableAreaNotification_C_FindAnimationTime final
{
public:
	int32                                         Time;                                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A24[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOngoingEffectDuration_ReturnValue;     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaNotification_C_FindAnimationTime) == 0x000008, "Wrong alignment on WBP_OutsidePlayableAreaNotification_C_FindAnimationTime");
static_assert(sizeof(WBP_OutsidePlayableAreaNotification_C_FindAnimationTime) == 0x000020, "Wrong size on WBP_OutsidePlayableAreaNotification_C_FindAnimationTime");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_FindAnimationTime, Time) == 0x000000, "Member 'WBP_OutsidePlayableAreaNotification_C_FindAnimationTime::Time' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_FindAnimationTime, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_OutsidePlayableAreaNotification_C_FindAnimationTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_FindAnimationTime, CallFunc_GetGzAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'WBP_OutsidePlayableAreaNotification_C_FindAnimationTime::CallFunc_GetGzAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_FindAnimationTime, CallFunc_GetOngoingEffectDuration_ReturnValue) == 0x000010, "Member 'WBP_OutsidePlayableAreaNotification_C_FindAnimationTime::CallFunc_GetOngoingEffectDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_FindAnimationTime, CallFunc_FTrunc_ReturnValue) == 0x000014, "Member 'WBP_OutsidePlayableAreaNotification_C_FindAnimationTime::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_FindAnimationTime, CallFunc_FTrunc_A_ImplicitCast) == 0x000018, "Member 'WBP_OutsidePlayableAreaNotification_C_FindAnimationTime::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function WBP_OutsidePlayableAreaNotification.WBP_OutsidePlayableAreaNotification_C.HandleActive
// 0x0018 (0x0018 - 0x0000)
struct WBP_OutsidePlayableAreaNotification_C_HandleActive final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaNotification_C_HandleActive) == 0x000008, "Wrong alignment on WBP_OutsidePlayableAreaNotification_C_HandleActive");
static_assert(sizeof(WBP_OutsidePlayableAreaNotification_C_HandleActive) == 0x000018, "Wrong size on WBP_OutsidePlayableAreaNotification_C_HandleActive");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_HandleActive, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_OutsidePlayableAreaNotification_C_HandleActive::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_HandleActive, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_OutsidePlayableAreaNotification_C_HandleActive::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_OutsidePlayableAreaNotification.WBP_OutsidePlayableAreaNotification_C.HideNotification
// 0x0010 (0x0010 - 0x0000)
struct WBP_OutsidePlayableAreaNotification_C_HideNotification final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaNotification_C_HideNotification) == 0x000004, "Wrong alignment on WBP_OutsidePlayableAreaNotification_C_HideNotification");
static_assert(sizeof(WBP_OutsidePlayableAreaNotification_C_HideNotification) == 0x000010, "Wrong size on WBP_OutsidePlayableAreaNotification_C_HideNotification");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_HideNotification, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_OutsidePlayableAreaNotification_C_HideNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_OutsidePlayableAreaNotification.WBP_OutsidePlayableAreaNotification_C.OnTagAdded_B47965D24A0F3AE31C9BFBA07E7145F1
// 0x0008 (0x0008 - 0x0000)
struct WBP_OutsidePlayableAreaNotification_C_OnTagAdded_B47965D24A0F3AE31C9BFBA07E7145F1 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaNotification_C_OnTagAdded_B47965D24A0F3AE31C9BFBA07E7145F1) == 0x000004, "Wrong alignment on WBP_OutsidePlayableAreaNotification_C_OnTagAdded_B47965D24A0F3AE31C9BFBA07E7145F1");
static_assert(sizeof(WBP_OutsidePlayableAreaNotification_C_OnTagAdded_B47965D24A0F3AE31C9BFBA07E7145F1) == 0x000008, "Wrong size on WBP_OutsidePlayableAreaNotification_C_OnTagAdded_B47965D24A0F3AE31C9BFBA07E7145F1");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_OnTagAdded_B47965D24A0F3AE31C9BFBA07E7145F1, Tag) == 0x000000, "Member 'WBP_OutsidePlayableAreaNotification_C_OnTagAdded_B47965D24A0F3AE31C9BFBA07E7145F1::Tag' has a wrong offset!");

// Function WBP_OutsidePlayableAreaNotification.WBP_OutsidePlayableAreaNotification_C.OnTagAdded_FFDCF30D464E1E83B0CE72A6E88A91C5
// 0x0008 (0x0008 - 0x0000)
struct WBP_OutsidePlayableAreaNotification_C_OnTagAdded_FFDCF30D464E1E83B0CE72A6E88A91C5 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaNotification_C_OnTagAdded_FFDCF30D464E1E83B0CE72A6E88A91C5) == 0x000004, "Wrong alignment on WBP_OutsidePlayableAreaNotification_C_OnTagAdded_FFDCF30D464E1E83B0CE72A6E88A91C5");
static_assert(sizeof(WBP_OutsidePlayableAreaNotification_C_OnTagAdded_FFDCF30D464E1E83B0CE72A6E88A91C5) == 0x000008, "Wrong size on WBP_OutsidePlayableAreaNotification_C_OnTagAdded_FFDCF30D464E1E83B0CE72A6E88A91C5");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_OnTagAdded_FFDCF30D464E1E83B0CE72A6E88A91C5, Tag) == 0x000000, "Member 'WBP_OutsidePlayableAreaNotification_C_OnTagAdded_FFDCF30D464E1E83B0CE72A6E88A91C5::Tag' has a wrong offset!");

// Function WBP_OutsidePlayableAreaNotification.WBP_OutsidePlayableAreaNotification_C.OnTagRemoved_B47965D24A0F3AE31C9BFBA07E7145F1
// 0x0008 (0x0008 - 0x0000)
struct WBP_OutsidePlayableAreaNotification_C_OnTagRemoved_B47965D24A0F3AE31C9BFBA07E7145F1 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaNotification_C_OnTagRemoved_B47965D24A0F3AE31C9BFBA07E7145F1) == 0x000004, "Wrong alignment on WBP_OutsidePlayableAreaNotification_C_OnTagRemoved_B47965D24A0F3AE31C9BFBA07E7145F1");
static_assert(sizeof(WBP_OutsidePlayableAreaNotification_C_OnTagRemoved_B47965D24A0F3AE31C9BFBA07E7145F1) == 0x000008, "Wrong size on WBP_OutsidePlayableAreaNotification_C_OnTagRemoved_B47965D24A0F3AE31C9BFBA07E7145F1");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_OnTagRemoved_B47965D24A0F3AE31C9BFBA07E7145F1, Tag) == 0x000000, "Member 'WBP_OutsidePlayableAreaNotification_C_OnTagRemoved_B47965D24A0F3AE31C9BFBA07E7145F1::Tag' has a wrong offset!");

// Function WBP_OutsidePlayableAreaNotification.WBP_OutsidePlayableAreaNotification_C.OnTagRemoved_FFDCF30D464E1E83B0CE72A6E88A91C5
// 0x0008 (0x0008 - 0x0000)
struct WBP_OutsidePlayableAreaNotification_C_OnTagRemoved_FFDCF30D464E1E83B0CE72A6E88A91C5 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaNotification_C_OnTagRemoved_FFDCF30D464E1E83B0CE72A6E88A91C5) == 0x000004, "Wrong alignment on WBP_OutsidePlayableAreaNotification_C_OnTagRemoved_FFDCF30D464E1E83B0CE72A6E88A91C5");
static_assert(sizeof(WBP_OutsidePlayableAreaNotification_C_OnTagRemoved_FFDCF30D464E1E83B0CE72A6E88A91C5) == 0x000008, "Wrong size on WBP_OutsidePlayableAreaNotification_C_OnTagRemoved_FFDCF30D464E1E83B0CE72A6E88A91C5");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_OnTagRemoved_FFDCF30D464E1E83B0CE72A6E88A91C5, Tag) == 0x000000, "Member 'WBP_OutsidePlayableAreaNotification_C_OnTagRemoved_FFDCF30D464E1E83B0CE72A6E88A91C5::Tag' has a wrong offset!");

// Function WBP_OutsidePlayableAreaNotification.WBP_OutsidePlayableAreaNotification_C.OnViewTargetChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_OutsidePlayableAreaNotification_C_OnViewTargetChanged final
{
public:
	class APawn*                                  ViewTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaNotification_C_OnViewTargetChanged) == 0x000008, "Wrong alignment on WBP_OutsidePlayableAreaNotification_C_OnViewTargetChanged");
static_assert(sizeof(WBP_OutsidePlayableAreaNotification_C_OnViewTargetChanged) == 0x000008, "Wrong size on WBP_OutsidePlayableAreaNotification_C_OnViewTargetChanged");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_OnViewTargetChanged, ViewTarget) == 0x000000, "Member 'WBP_OutsidePlayableAreaNotification_C_OnViewTargetChanged::ViewTarget' has a wrong offset!");

// Function WBP_OutsidePlayableAreaNotification.WBP_OutsidePlayableAreaNotification_C.Play on Hide
// 0x0030 (0x0030 - 0x0000)
struct WBP_OutsidePlayableAreaNotification_C_Play_on_Hide final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A25[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A26[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaNotification_C_Play_on_Hide) == 0x000008, "Wrong alignment on WBP_OutsidePlayableAreaNotification_C_Play_on_Hide");
static_assert(sizeof(WBP_OutsidePlayableAreaNotification_C_Play_on_Hide) == 0x000030, "Wrong size on WBP_OutsidePlayableAreaNotification_C_Play_on_Hide");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_Play_on_Hide, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_OutsidePlayableAreaNotification_C_Play_on_Hide::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_Play_on_Hide, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000010, "Member 'WBP_OutsidePlayableAreaNotification_C_Play_on_Hide::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_Play_on_Hide, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_OutsidePlayableAreaNotification_C_Play_on_Hide::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_Play_on_Hide, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'WBP_OutsidePlayableAreaNotification_C_Play_on_Hide::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_OutsidePlayableAreaNotification.WBP_OutsidePlayableAreaNotification_C.ReceiveBindEvents
// 0x0008 (0x0008 - 0x0000)
struct WBP_OutsidePlayableAreaNotification_C_ReceiveBindEvents final
{
public:
	class APawn*                                  NewViewTarget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaNotification_C_ReceiveBindEvents) == 0x000008, "Wrong alignment on WBP_OutsidePlayableAreaNotification_C_ReceiveBindEvents");
static_assert(sizeof(WBP_OutsidePlayableAreaNotification_C_ReceiveBindEvents) == 0x000008, "Wrong size on WBP_OutsidePlayableAreaNotification_C_ReceiveBindEvents");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ReceiveBindEvents, NewViewTarget) == 0x000000, "Member 'WBP_OutsidePlayableAreaNotification_C_ReceiveBindEvents::NewViewTarget' has a wrong offset!");

// Function WBP_OutsidePlayableAreaNotification.WBP_OutsidePlayableAreaNotification_C.ReceiveUnbindEvents
// 0x0008 (0x0008 - 0x0000)
struct WBP_OutsidePlayableAreaNotification_C_ReceiveUnbindEvents final
{
public:
	class APawn*                                  OldViewTarget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaNotification_C_ReceiveUnbindEvents) == 0x000008, "Wrong alignment on WBP_OutsidePlayableAreaNotification_C_ReceiveUnbindEvents");
static_assert(sizeof(WBP_OutsidePlayableAreaNotification_C_ReceiveUnbindEvents) == 0x000008, "Wrong size on WBP_OutsidePlayableAreaNotification_C_ReceiveUnbindEvents");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ReceiveUnbindEvents, OldViewTarget) == 0x000000, "Member 'WBP_OutsidePlayableAreaNotification_C_ReceiveUnbindEvents::OldViewTarget' has a wrong offset!");

// Function WBP_OutsidePlayableAreaNotification.WBP_OutsidePlayableAreaNotification_C.SetTimerTime
// 0x0048 (0x0048 - 0x0000)
struct WBP_OutsidePlayableAreaNotification_C_SetTimerTime final
{
public:
	bool                                          IgnoreDecrement;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_PlayAnimation;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A27[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A28[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A29[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A2A[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime) == 0x000008, "Wrong alignment on WBP_OutsidePlayableAreaNotification_C_SetTimerTime");
static_assert(sizeof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime) == 0x000048, "Wrong size on WBP_OutsidePlayableAreaNotification_C_SetTimerTime");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime, IgnoreDecrement) == 0x000000, "Member 'WBP_OutsidePlayableAreaNotification_C_SetTimerTime::IgnoreDecrement' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime, Param_PlayAnimation) == 0x000001, "Member 'WBP_OutsidePlayableAreaNotification_C_SetTimerTime::Param_PlayAnimation' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime, Temp_int_Variable) == 0x000004, "Member 'WBP_OutsidePlayableAreaNotification_C_SetTimerTime::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime, Temp_int_Variable_1) == 0x000008, "Member 'WBP_OutsidePlayableAreaNotification_C_SetTimerTime::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime, Temp_int_Variable_2) == 0x00000C, "Member 'WBP_OutsidePlayableAreaNotification_C_SetTimerTime::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'WBP_OutsidePlayableAreaNotification_C_SetTimerTime::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000018, "Member 'WBP_OutsidePlayableAreaNotification_C_SetTimerTime::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime, Temp_bool_Variable) == 0x000020, "Member 'WBP_OutsidePlayableAreaNotification_C_SetTimerTime::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'WBP_OutsidePlayableAreaNotification_C_SetTimerTime::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime, K2Node_Select_Default) == 0x000030, "Member 'WBP_OutsidePlayableAreaNotification_C_SetTimerTime::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'WBP_OutsidePlayableAreaNotification_C_SetTimerTime::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_OutsidePlayableAreaNotification_C_SetTimerTime::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_SetTimerTime, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'WBP_OutsidePlayableAreaNotification_C_SetTimerTime::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_OutsidePlayableAreaNotification.WBP_OutsidePlayableAreaNotification_C.ShowNotification
// 0x0050 (0x0050 - 0x0000)
struct WBP_OutsidePlayableAreaNotification_C_ShowNotification final
{
public:
	bool                                          ForcePlay;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A2B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindAnimationTime_Time;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A2C[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaNotification_C_ShowNotification) == 0x000008, "Wrong alignment on WBP_OutsidePlayableAreaNotification_C_ShowNotification");
static_assert(sizeof(WBP_OutsidePlayableAreaNotification_C_ShowNotification) == 0x000050, "Wrong size on WBP_OutsidePlayableAreaNotification_C_ShowNotification");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ShowNotification, ForcePlay) == 0x000000, "Member 'WBP_OutsidePlayableAreaNotification_C_ShowNotification::ForcePlay' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaNotification_C_ShowNotification, Temp_delegate_Variable) == 0x000004, "Member 'WBP_OutsidePlayableAreaNotification_C_ShowNotification::Temp_delegate_Variable' has a wrong offset!");
