#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HexSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HexSlot.WBP_HexSlot_C
// 0x0038 (0x0398 - 0x0360)
class UWBP_HexSlot_C final : public UGzEquipmentPocketWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Hover;                                        // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_30;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QualityBar_Image_1;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           GridArmorChangeAsyncTask;                          // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_BackpackSlot_PocketButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_HexSlot(int32 EntryPoint);
	void HandleEmptyItem();
	void HandleValidItem(const struct FGzInvItem& Item);
	void OnPocketChanged_BP(const struct FGzInvItem& NewItem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HexSlot_C">();
	}
	static class UWBP_HexSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HexSlot_C>();
	}
};
static_assert(alignof(UWBP_HexSlot_C) == 0x000008, "Wrong alignment on UWBP_HexSlot_C");
static_assert(sizeof(UWBP_HexSlot_C) == 0x000398, "Wrong size on UWBP_HexSlot_C");
static_assert(offsetof(UWBP_HexSlot_C, UberGraphFrame) == 0x000360, "Member 'UWBP_HexSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HexSlot_C, Anim_Hover) == 0x000368, "Member 'UWBP_HexSlot_C::Anim_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_HexSlot_C, Image_30) == 0x000370, "Member 'UWBP_HexSlot_C::Image_30' has a wrong offset!");
static_assert(offsetof(UWBP_HexSlot_C, QualityBar_Image_1) == 0x000378, "Member 'UWBP_HexSlot_C::QualityBar_Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_HexSlot_C, WBP_ItemIcon) == 0x000380, "Member 'UWBP_HexSlot_C::WBP_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_HexSlot_C, WidgetSwitcher_0) == 0x000388, "Member 'UWBP_HexSlot_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_HexSlot_C, GridArmorChangeAsyncTask) == 0x000390, "Member 'UWBP_HexSlot_C::GridArmorChangeAsyncTask' has a wrong offset!");

}

