#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RewardTooltipSlot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RewardTooltipSlot.WBP_RewardTooltipSlot_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_RewardTooltipSlot_C final : public UUserWidget
{
public:
	class UImage*                                 Reward_Image;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RewardContainer;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           RewardDescription1_GzText;                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetReward(const struct FGzMissionRewardWidgetData& Rewards);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RewardTooltipSlot_C">();
	}
	static class UWBP_RewardTooltipSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RewardTooltipSlot_C>();
	}
};
static_assert(alignof(UWBP_RewardTooltipSlot_C) == 0x000008, "Wrong alignment on UWBP_RewardTooltipSlot_C");
static_assert(sizeof(UWBP_RewardTooltipSlot_C) == 0x0002F8, "Wrong size on UWBP_RewardTooltipSlot_C");
static_assert(offsetof(UWBP_RewardTooltipSlot_C, Reward_Image) == 0x0002E0, "Member 'UWBP_RewardTooltipSlot_C::Reward_Image' has a wrong offset!");
static_assert(offsetof(UWBP_RewardTooltipSlot_C, RewardContainer) == 0x0002E8, "Member 'UWBP_RewardTooltipSlot_C::RewardContainer' has a wrong offset!");
static_assert(offsetof(UWBP_RewardTooltipSlot_C, RewardDescription1_GzText) == 0x0002F0, "Member 'UWBP_RewardTooltipSlot_C::RewardDescription1_GzText' has a wrong offset!");

}

