#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Inventory_Attachment

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Inventory_Attachment.WBP_Inventory_Attachment_C.ExecuteUbergraph_WBP_Inventory_Attachment
// 0x0040 (0x0040 - 0x0000)
struct WBP_Inventory_Attachment_C_ExecuteUbergraph_WBP_Inventory_Attachment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B42[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B43[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Attachment_C_ExecuteUbergraph_WBP_Inventory_Attachment) == 0x000008, "Wrong alignment on WBP_Inventory_Attachment_C_ExecuteUbergraph_WBP_Inventory_Attachment");
static_assert(sizeof(WBP_Inventory_Attachment_C_ExecuteUbergraph_WBP_Inventory_Attachment) == 0x000040, "Wrong size on WBP_Inventory_Attachment_C_ExecuteUbergraph_WBP_Inventory_Attachment");
static_assert(offsetof(WBP_Inventory_Attachment_C_ExecuteUbergraph_WBP_Inventory_Attachment, EntryPoint) == 0x000000, "Member 'WBP_Inventory_Attachment_C_ExecuteUbergraph_WBP_Inventory_Attachment::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Attachment_C_ExecuteUbergraph_WBP_Inventory_Attachment, CallFunc_Map_Find_Value) == 0x000008, "Member 'WBP_Inventory_Attachment_C_ExecuteUbergraph_WBP_Inventory_Attachment::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Attachment_C_ExecuteUbergraph_WBP_Inventory_Attachment, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'WBP_Inventory_Attachment_C_ExecuteUbergraph_WBP_Inventory_Attachment::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Attachment_C_ExecuteUbergraph_WBP_Inventory_Attachment, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000018, "Member 'WBP_Inventory_Attachment_C_ExecuteUbergraph_WBP_Inventory_Attachment::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");

}

