#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MatchResultBanner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MatchResultBanner.WBP_MatchResultBanner_C
// 0x00B8 (0x0398 - 0x02E0)
class UWBP_MatchResultBanner_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzTextBlock*                           GzTextBlock_0;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MatchResultBG;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           MatchResultText;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PlacementBorder;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           PlaceNumText;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SquadZeroedSizeBox;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           TeamNumText;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Rank;                                              // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A7[0x4];                                     // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnEnd;                                             // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLinearColor                           VictoryBGColor;                                    // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefeateBGColor;                                    // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TeamsCount;                                        // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bEnableStartAnimation;                             // 0x035C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A8[0x3];                                     // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LoseDisplayText;                                   // 0x0360(0x0010)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnStartAnimation;                                  // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         BannerTime;                                        // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableStartTimerOnStart;                           // 0x0384(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A9[0x3];                                     // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HideSquadZeroedPanelTime;                          // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50AA[0x4];                                     // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           HidePanelTimer;                                    // 0x0390(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTeamTextForSolos();
	void StartBannerTimer();
	void OnStartAnimation__DelegateSignature();
	void OnInitialized();
	void OnEnd__DelegateSignature();
	void OnBannerEnd();
	void InitBanner(const struct FGzMatchResult& MatchResult);
	void HideSquadZeroedPanel();
	void GetBannerDuration(double* Duration);
	void ExecuteUbergraph_WBP_MatchResultBanner(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MatchResultBanner_C">();
	}
	static class UWBP_MatchResultBanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MatchResultBanner_C>();
	}
};
static_assert(alignof(UWBP_MatchResultBanner_C) == 0x000008, "Wrong alignment on UWBP_MatchResultBanner_C");
static_assert(sizeof(UWBP_MatchResultBanner_C) == 0x000398, "Wrong size on UWBP_MatchResultBanner_C");
static_assert(offsetof(UWBP_MatchResultBanner_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_MatchResultBanner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, GzTextBlock_0) == 0x0002E8, "Member 'UWBP_MatchResultBanner_C::GzTextBlock_0' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, MatchResultBG) == 0x0002F0, "Member 'UWBP_MatchResultBanner_C::MatchResultBG' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, MatchResultText) == 0x0002F8, "Member 'UWBP_MatchResultBanner_C::MatchResultText' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, PlacementBorder) == 0x000300, "Member 'UWBP_MatchResultBanner_C::PlacementBorder' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, PlaceNumText) == 0x000308, "Member 'UWBP_MatchResultBanner_C::PlaceNumText' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, SquadZeroedSizeBox) == 0x000310, "Member 'UWBP_MatchResultBanner_C::SquadZeroedSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, TeamNumText) == 0x000318, "Member 'UWBP_MatchResultBanner_C::TeamNumText' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, Rank) == 0x000320, "Member 'UWBP_MatchResultBanner_C::Rank' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, OnEnd) == 0x000328, "Member 'UWBP_MatchResultBanner_C::OnEnd' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, VictoryBGColor) == 0x000338, "Member 'UWBP_MatchResultBanner_C::VictoryBGColor' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, DefeateBGColor) == 0x000348, "Member 'UWBP_MatchResultBanner_C::DefeateBGColor' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, TeamsCount) == 0x000358, "Member 'UWBP_MatchResultBanner_C::TeamsCount' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, bEnableStartAnimation) == 0x00035C, "Member 'UWBP_MatchResultBanner_C::bEnableStartAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, LoseDisplayText) == 0x000360, "Member 'UWBP_MatchResultBanner_C::LoseDisplayText' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, OnStartAnimation) == 0x000370, "Member 'UWBP_MatchResultBanner_C::OnStartAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, BannerTime) == 0x000380, "Member 'UWBP_MatchResultBanner_C::BannerTime' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, EnableStartTimerOnStart) == 0x000384, "Member 'UWBP_MatchResultBanner_C::EnableStartTimerOnStart' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, HideSquadZeroedPanelTime) == 0x000388, "Member 'UWBP_MatchResultBanner_C::HideSquadZeroedPanelTime' has a wrong offset!");
static_assert(offsetof(UWBP_MatchResultBanner_C, HidePanelTimer) == 0x000390, "Member 'UWBP_MatchResultBanner_C::HidePanelTimer' has a wrong offset!");

}

