#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Scope_MidRange

#include "Basic.hpp"

#include "WBP_Scope_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Scope_MidRange.WBP_Scope_MidRange_C
// 0x0080 (0x0390 - 0x0310)
class UWBP_Scope_MidRange_C final : public UWBP_Scope_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Scope_MidRange_C;               // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BulletDrop_B;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BulletDrop_B_G;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BulletDrop_M;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BulletDrop_M_G;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BulletDrop_T;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BulletDrop_T_G;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CenterDot;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CenterDot_G;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GreenLine_L;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GreenLine_L_G;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GreenLine_R;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GreenLine_R_G;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RangeIndicator_C*                  WBP_RangeIndicator;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SwitchZoomHint_C*                  WBP_SwitchZoomHint;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ZoomLevel_C*                       WBP_ZoomLevel;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Scope_MidRange(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Scope_MidRange_C">();
	}
	static class UWBP_Scope_MidRange_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Scope_MidRange_C>();
	}
};
static_assert(alignof(UWBP_Scope_MidRange_C) == 0x000008, "Wrong alignment on UWBP_Scope_MidRange_C");
static_assert(sizeof(UWBP_Scope_MidRange_C) == 0x000390, "Wrong size on UWBP_Scope_MidRange_C");
static_assert(offsetof(UWBP_Scope_MidRange_C, UberGraphFrame_WBP_Scope_MidRange_C) == 0x000310, "Member 'UWBP_Scope_MidRange_C::UberGraphFrame_WBP_Scope_MidRange_C' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, BulletDrop_B) == 0x000318, "Member 'UWBP_Scope_MidRange_C::BulletDrop_B' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, BulletDrop_B_G) == 0x000320, "Member 'UWBP_Scope_MidRange_C::BulletDrop_B_G' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, BulletDrop_M) == 0x000328, "Member 'UWBP_Scope_MidRange_C::BulletDrop_M' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, BulletDrop_M_G) == 0x000330, "Member 'UWBP_Scope_MidRange_C::BulletDrop_M_G' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, BulletDrop_T) == 0x000338, "Member 'UWBP_Scope_MidRange_C::BulletDrop_T' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, BulletDrop_T_G) == 0x000340, "Member 'UWBP_Scope_MidRange_C::BulletDrop_T_G' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, CenterDot) == 0x000348, "Member 'UWBP_Scope_MidRange_C::CenterDot' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, CenterDot_G) == 0x000350, "Member 'UWBP_Scope_MidRange_C::CenterDot_G' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, GreenLine_L) == 0x000358, "Member 'UWBP_Scope_MidRange_C::GreenLine_L' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, GreenLine_L_G) == 0x000360, "Member 'UWBP_Scope_MidRange_C::GreenLine_L_G' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, GreenLine_R) == 0x000368, "Member 'UWBP_Scope_MidRange_C::GreenLine_R' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, GreenLine_R_G) == 0x000370, "Member 'UWBP_Scope_MidRange_C::GreenLine_R_G' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, WBP_RangeIndicator) == 0x000378, "Member 'UWBP_Scope_MidRange_C::WBP_RangeIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, WBP_SwitchZoomHint) == 0x000380, "Member 'UWBP_Scope_MidRange_C::WBP_SwitchZoomHint' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_MidRange_C, WBP_ZoomLevel) == 0x000388, "Member 'UWBP_Scope_MidRange_C::WBP_ZoomLevel' has a wrong offset!");

}

