#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSelectionScreen_QuickOrder

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoadoutSelectionScreen_QuickOrder.WBP_LoadoutSelectionScreen_QuickOrder_C.Event On Set QuickOrder Cooldown
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoadoutSelectionScreen_QuickOrder_C_Event_On_Set_QuickOrder_Cooldown final
{
public:
	class AGzCharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelectionScreen_QuickOrder_C_Event_On_Set_QuickOrder_Cooldown) == 0x000008, "Wrong alignment on WBP_LoadoutSelectionScreen_QuickOrder_C_Event_On_Set_QuickOrder_Cooldown");
static_assert(sizeof(WBP_LoadoutSelectionScreen_QuickOrder_C_Event_On_Set_QuickOrder_Cooldown) == 0x000008, "Wrong size on WBP_LoadoutSelectionScreen_QuickOrder_C_Event_On_Set_QuickOrder_Cooldown");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_Event_On_Set_QuickOrder_Cooldown, Character) == 0x000000, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_Event_On_Set_QuickOrder_Cooldown::Character' has a wrong offset!");

// Function WBP_LoadoutSelectionScreen_QuickOrder.WBP_LoadoutSelectionScreen_QuickOrder_C.EventCheck
// 0x0030 (0x0030 - 0x0000)
struct WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventActive_IsActive;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A2E[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_IsEventActive_ExpireTime;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck) == 0x000008, "Wrong alignment on WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck");
static_assert(sizeof(WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck) == 0x000030, "Wrong size on WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck, Temp_byte_Variable) == 0x000000, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck, CallFunc_IsEventActive_IsActive) == 0x000002, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck::CallFunc_IsEventActive_IsActive' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck, CallFunc_IsEventActive_ExpireTime) == 0x000008, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck::CallFunc_IsEventActive_ExpireTime' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck, Temp_bool_Variable) == 0x000028, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000029, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck, K2Node_Select_Default) == 0x00002A, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_EventCheck::K2Node_Select_Default' has a wrong offset!");

// Function WBP_LoadoutSelectionScreen_QuickOrder.WBP_LoadoutSelectionScreen_QuickOrder_C.ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder
// 0x0218 (0x0218 - 0x0000)
struct WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A2F[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzGameNotificationSubsystem*           CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotificationID, EGzNotificationStageType StageType, const struct FGzEventNotificationData& NotificationData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGzLoadoutDataConfig                   K2Node_Event_LoadoutConfig_2;                      // 0x0030(0x0070)(ConstParm, ContainsInstancedReference)
	struct FGzLoadoutDataConfig                   K2Node_Event_LoadoutConfig_1;                      // 0x00A0(0x0070)(ConstParm, ContainsInstancedReference)
	class AGzPlayerController*                    K2Node_Event_ConfirmedBy;                          // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGzLoadoutDataConfig                   K2Node_Event_LoadoutConfig;                        // 0x0118(0x0070)(ConstParm, ContainsInstancedReference)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A30[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzCharacter*                           K2Node_CustomEvent_Character;                      // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_QuickOrderComponent_C*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDroneRemainingCooldown_ReturnValue;    // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A31[0x3];                                     // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A32[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A33[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ConfirmSelectionButton_C*          K2Node_DynamicCast_AsWBP_Confirm_Selection_Button; // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzQuickOrderCallValidationFailReason         K2Node_Event_FailReason;                           // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A34[0x1];                                     // 0x01E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotificationID;                 // 0x01E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzNotificationStageType                      K2Node_CustomEvent_StageType;                      // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A35[0x3];                                     // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzEventNotificationData               K2Node_CustomEvent_NotificationData;               // 0x01F0(0x0010)(NoDestructor)
	double                                        CallFunc_SetCountDownWithText_Cooldown_ImplicitCast; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetCountDownWithText_Cooldown_ImplicitCast_1; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder) == 0x000008, "Wrong alignment on WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder");
static_assert(sizeof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder) == 0x000218, "Wrong size on WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, EntryPoint) == 0x000000, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, Temp_delegate_Variable) == 0x000004, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000018, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, K2Node_Event_LoadoutConfig_2) == 0x000030, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::K2Node_Event_LoadoutConfig_2' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, K2Node_Event_LoadoutConfig_1) == 0x0000A0, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::K2Node_Event_LoadoutConfig_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, K2Node_Event_ConfirmedBy) == 0x000110, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::K2Node_Event_ConfirmedBy' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, K2Node_Event_LoadoutConfig) == 0x000118, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::K2Node_Event_LoadoutConfig' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, CallFunc_PostEvent_ReturnValue) == 0x000188, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, K2Node_CustomEvent_Character) == 0x000190, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, CallFunc_GetComponentByClass_ReturnValue) == 0x000198, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, CallFunc_GetDroneRemainingCooldown_ReturnValue) == 0x0001A0, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::CallFunc_GetDroneRemainingCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A4, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001B4, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001B8, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x0001C0, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, CallFunc_Array_Add_ReturnValue) == 0x0001C4, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, CallFunc_Array_Add_ReturnValue_1) == 0x0001C8, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, CallFunc_Array_Add_ReturnValue_2) == 0x0001CC, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, CallFunc_Array_Add_ReturnValue_3) == 0x0001D0, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, K2Node_DynamicCast_AsWBP_Confirm_Selection_Button) == 0x0001D8, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::K2Node_DynamicCast_AsWBP_Confirm_Selection_Button' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, K2Node_Event_FailReason) == 0x0001E1, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::K2Node_Event_FailReason' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, K2Node_SwitchEnum_CmpSuccess) == 0x0001E2, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, K2Node_CustomEvent_NotificationID) == 0x0001E4, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::K2Node_CustomEvent_NotificationID' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, K2Node_CustomEvent_StageType) == 0x0001EC, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::K2Node_CustomEvent_StageType' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, K2Node_CustomEvent_NotificationData) == 0x0001F0, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::K2Node_CustomEvent_NotificationData' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, CallFunc_SetCountDownWithText_Cooldown_ImplicitCast) == 0x000200, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::CallFunc_SetCountDownWithText_Cooldown_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, CallFunc_SetCountDownWithText_Cooldown_ImplicitCast_1) == 0x000208, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::CallFunc_SetCountDownWithText_Cooldown_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000210, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_QuickOrder::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_LoadoutSelectionScreen_QuickOrder.WBP_LoadoutSelectionScreen_QuickOrder_C.OnConfirmed_BP
// 0x0078 (0x0078 - 0x0000)
struct WBP_LoadoutSelectionScreen_QuickOrder_C_OnConfirmed_BP final
{
public:
	class AGzPlayerController*                    ConfirmedBy;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGzLoadoutDataConfig                   LoadoutConfig;                                     // 0x0008(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnConfirmed_BP) == 0x000008, "Wrong alignment on WBP_LoadoutSelectionScreen_QuickOrder_C_OnConfirmed_BP");
static_assert(sizeof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnConfirmed_BP) == 0x000078, "Wrong size on WBP_LoadoutSelectionScreen_QuickOrder_C_OnConfirmed_BP");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnConfirmed_BP, ConfirmedBy) == 0x000000, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_OnConfirmed_BP::ConfirmedBy' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnConfirmed_BP, LoadoutConfig) == 0x000008, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_OnConfirmed_BP::LoadoutConfig' has a wrong offset!");

// Function WBP_LoadoutSelectionScreen_QuickOrder.WBP_LoadoutSelectionScreen_QuickOrder_C.OnEventNotificationStageDelegat
// 0x001C (0x001C - 0x0000)
struct WBP_LoadoutSelectionScreen_QuickOrder_C_OnEventNotificationStageDelegat final
{
public:
	class FName                                   NotificationID;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzNotificationStageType                      StageType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A36[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzEventNotificationData               NotificationData;                                  // 0x000C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnEventNotificationStageDelegat) == 0x000004, "Wrong alignment on WBP_LoadoutSelectionScreen_QuickOrder_C_OnEventNotificationStageDelegat");
static_assert(sizeof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnEventNotificationStageDelegat) == 0x00001C, "Wrong size on WBP_LoadoutSelectionScreen_QuickOrder_C_OnEventNotificationStageDelegat");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnEventNotificationStageDelegat, NotificationID) == 0x000000, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_OnEventNotificationStageDelegat::NotificationID' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnEventNotificationStageDelegat, StageType) == 0x000008, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_OnEventNotificationStageDelegat::StageType' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnEventNotificationStageDelegat, NotificationData) == 0x00000C, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_OnEventNotificationStageDelegat::NotificationData' has a wrong offset!");

// Function WBP_LoadoutSelectionScreen_QuickOrder.WBP_LoadoutSelectionScreen_QuickOrder_C.OnLoadoutButtonClicked_BP
// 0x0070 (0x0070 - 0x0000)
struct WBP_LoadoutSelectionScreen_QuickOrder_C_OnLoadoutButtonClicked_BP final
{
public:
	struct FGzLoadoutDataConfig                   LoadoutConfig;                                     // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnLoadoutButtonClicked_BP) == 0x000008, "Wrong alignment on WBP_LoadoutSelectionScreen_QuickOrder_C_OnLoadoutButtonClicked_BP");
static_assert(sizeof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnLoadoutButtonClicked_BP) == 0x000070, "Wrong size on WBP_LoadoutSelectionScreen_QuickOrder_C_OnLoadoutButtonClicked_BP");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnLoadoutButtonClicked_BP, LoadoutConfig) == 0x000000, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_OnLoadoutButtonClicked_BP::LoadoutConfig' has a wrong offset!");

// Function WBP_LoadoutSelectionScreen_QuickOrder.WBP_LoadoutSelectionScreen_QuickOrder_C.OnLoadoutButtonHovered_BP
// 0x0070 (0x0070 - 0x0000)
struct WBP_LoadoutSelectionScreen_QuickOrder_C_OnLoadoutButtonHovered_BP final
{
public:
	struct FGzLoadoutDataConfig                   LoadoutConfig;                                     // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnLoadoutButtonHovered_BP) == 0x000008, "Wrong alignment on WBP_LoadoutSelectionScreen_QuickOrder_C_OnLoadoutButtonHovered_BP");
static_assert(sizeof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnLoadoutButtonHovered_BP) == 0x000070, "Wrong size on WBP_LoadoutSelectionScreen_QuickOrder_C_OnLoadoutButtonHovered_BP");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnLoadoutButtonHovered_BP, LoadoutConfig) == 0x000000, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_OnLoadoutButtonHovered_BP::LoadoutConfig' has a wrong offset!");

// Function WBP_LoadoutSelectionScreen_QuickOrder.WBP_LoadoutSelectionScreen_QuickOrder_C.OnValidationFailed
// 0x0001 (0x0001 - 0x0000)
struct WBP_LoadoutSelectionScreen_QuickOrder_C_OnValidationFailed final
{
public:
	EGzQuickOrderCallValidationFailReason         FailReason;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnValidationFailed) == 0x000001, "Wrong alignment on WBP_LoadoutSelectionScreen_QuickOrder_C_OnValidationFailed");
static_assert(sizeof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnValidationFailed) == 0x000001, "Wrong size on WBP_LoadoutSelectionScreen_QuickOrder_C_OnValidationFailed");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_OnValidationFailed, FailReason) == 0x000000, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_OnValidationFailed::FailReason' has a wrong offset!");

// Function WBP_LoadoutSelectionScreen_QuickOrder.WBP_LoadoutSelectionScreen_QuickOrder_C.UpdateEventTime
// 0x0038 (0x0038 - 0x0000)
struct WBP_LoadoutSelectionScreen_QuickOrder_C_UpdateEventTime final
{
public:
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A37[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTimeInMinutesSecondFormatText_Result;  // 0x0010(0x0010)()
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A38[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeInMinutesSecondFormatText_InSeconds_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelectionScreen_QuickOrder_C_UpdateEventTime) == 0x000008, "Wrong alignment on WBP_LoadoutSelectionScreen_QuickOrder_C_UpdateEventTime");
static_assert(sizeof(WBP_LoadoutSelectionScreen_QuickOrder_C_UpdateEventTime) == 0x000038, "Wrong size on WBP_LoadoutSelectionScreen_QuickOrder_C_UpdateEventTime");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_UpdateEventTime, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000000, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_UpdateEventTime::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_QuickOrder_C_UpdateEventTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_LoadoutSelectionScreen_QuickOrder_C_UpdateEventTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
