#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PaymentBrowser

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PaymentBrowser.WBP_PaymentBrowser_C.ExecuteUbergraph_WBP_PaymentBrowser
// 0x0018 (0x0018 - 0x0000)
struct WBP_PaymentBrowser_C_ExecuteUbergraph_WBP_PaymentBrowser final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_507A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_NewURL;                               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaymentBrowser_C_ExecuteUbergraph_WBP_PaymentBrowser) == 0x000008, "Wrong alignment on WBP_PaymentBrowser_C_ExecuteUbergraph_WBP_PaymentBrowser");
static_assert(sizeof(WBP_PaymentBrowser_C_ExecuteUbergraph_WBP_PaymentBrowser) == 0x000018, "Wrong size on WBP_PaymentBrowser_C_ExecuteUbergraph_WBP_PaymentBrowser");
static_assert(offsetof(WBP_PaymentBrowser_C_ExecuteUbergraph_WBP_PaymentBrowser, EntryPoint) == 0x000000, "Member 'WBP_PaymentBrowser_C_ExecuteUbergraph_WBP_PaymentBrowser::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PaymentBrowser_C_ExecuteUbergraph_WBP_PaymentBrowser, K2Node_Event_NewURL) == 0x000008, "Member 'WBP_PaymentBrowser_C_ExecuteUbergraph_WBP_PaymentBrowser::K2Node_Event_NewURL' has a wrong offset!");

// Function WBP_PaymentBrowser.WBP_PaymentBrowser_C.OpenUrlRequested
// 0x0010 (0x0010 - 0x0000)
struct WBP_PaymentBrowser_C_OpenUrlRequested final
{
public:
	class FString                                 NewURL;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaymentBrowser_C_OpenUrlRequested) == 0x000008, "Wrong alignment on WBP_PaymentBrowser_C_OpenUrlRequested");
static_assert(sizeof(WBP_PaymentBrowser_C_OpenUrlRequested) == 0x000010, "Wrong size on WBP_PaymentBrowser_C_OpenUrlRequested");
static_assert(offsetof(WBP_PaymentBrowser_C_OpenUrlRequested, NewURL) == 0x000000, "Member 'WBP_PaymentBrowser_C_OpenUrlRequested::NewURL' has a wrong offset!");

}

