#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Navigation_DarkBG_Button

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "G01_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Navigation_DarkBG_Button.WBP_Navigation_DarkBG_Button_C
// 0x00D0 (0x1700 - 0x1630)
class UWBP_Navigation_DarkBG_Button_C final : public UGzCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzTagSwitcherHorizontal*               TagSwitcher;                                       // 0x1638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x1640(0x0010)(Edit, BlueprintVisible)
	class UClass*                                 TextStyle;                                         // 0x1650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         TextStyles;                                        // 0x1658(0x0010)(Edit, BlueprintVisible)
	struct FLinearColor                           IconColor;                                         // 0x1668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Icon_ColorGray;                                    // 0x1678(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Icon_ColorBlue;                                    // 0x1688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Icon_ColorWhite;                                   // 0x1698(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGzTagVisibilitySettings               TagSettings;                                       // 0x16A8(0x0050)(Edit, BlueprintVisible)

public:
	void SetWhiteTextStyle();
	void SetText(const class FText& InText);
	void SetGrayTextStyle();
	void SetDefaultText(class UCommonButtonBase* Button);
	void SetBlueTextStyle();
	void Set_TextStyle();
	void PreConstruct(bool IsDesignTime);
	void OnInitialized();
	void ExecuteUbergraph_WBP_Navigation_DarkBG_Button(int32 EntryPoint);
	void Construct();
	void BP_OnUnhovered();
	void BP_OnSelected();
	void BP_OnReleased();
	void BP_OnPressed();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Navigation_DarkBG_Button_C">();
	}
	static class UWBP_Navigation_DarkBG_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Navigation_DarkBG_Button_C>();
	}
};
static_assert(alignof(UWBP_Navigation_DarkBG_Button_C) == 0x000010, "Wrong alignment on UWBP_Navigation_DarkBG_Button_C");
static_assert(sizeof(UWBP_Navigation_DarkBG_Button_C) == 0x001700, "Wrong size on UWBP_Navigation_DarkBG_Button_C");
static_assert(offsetof(UWBP_Navigation_DarkBG_Button_C, UberGraphFrame) == 0x001630, "Member 'UWBP_Navigation_DarkBG_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_DarkBG_Button_C, TagSwitcher) == 0x001638, "Member 'UWBP_Navigation_DarkBG_Button_C::TagSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_DarkBG_Button_C, ButtonText) == 0x001640, "Member 'UWBP_Navigation_DarkBG_Button_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_DarkBG_Button_C, TextStyle) == 0x001650, "Member 'UWBP_Navigation_DarkBG_Button_C::TextStyle' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_DarkBG_Button_C, TextStyles) == 0x001658, "Member 'UWBP_Navigation_DarkBG_Button_C::TextStyles' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_DarkBG_Button_C, IconColor) == 0x001668, "Member 'UWBP_Navigation_DarkBG_Button_C::IconColor' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_DarkBG_Button_C, Icon_ColorGray) == 0x001678, "Member 'UWBP_Navigation_DarkBG_Button_C::Icon_ColorGray' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_DarkBG_Button_C, Icon_ColorBlue) == 0x001688, "Member 'UWBP_Navigation_DarkBG_Button_C::Icon_ColorBlue' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_DarkBG_Button_C, Icon_ColorWhite) == 0x001698, "Member 'UWBP_Navigation_DarkBG_Button_C::Icon_ColorWhite' has a wrong offset!");
static_assert(offsetof(UWBP_Navigation_DarkBG_Button_C, TagSettings) == 0x0016A8, "Member 'UWBP_Navigation_DarkBG_Button_C::TagSettings' has a wrong offset!");

}

