#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HoldBreathProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function WBP_HoldBreathProgress.WBP_HoldBreathProgress_C.ExecuteUbergraph_WBP_HoldBreathProgress
// 0x0188 (0x0188 - 0x0000)
struct WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E56[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E57[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_CurrentStamina;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_MaxStamina;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float CurrentStamina, float MaxStamina)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E58[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0058(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0048)(HasGetValueTypeHash)
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue;  // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayAbilitySpecHandle>     CallFunc_GetAllAbilities_OutAbilityHandles;        // 0x00B8(0x0010)(ReferenceParm)
	struct FGameplayAbilitySpecHandle             CallFunc_Array_Get_Item;                           // 0x00C8(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E59[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameplayAbility*                 CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue; // 0x00D8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E5A[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzGA_WeaponAim*                        K2Node_DynamicCast_AsGz_GA_Weapon_Aim;             // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E5B[0x6];                                     // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00F8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0108(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0160(0x0010)()
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress) == 0x000008, "Wrong alignment on WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress");
static_assert(sizeof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress) == 0x000188, "Wrong size on WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, EntryPoint) == 0x000000, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, K2Node_Event_IsDesignTime) == 0x00000D, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, K2Node_CustomEvent_CurrentStamina) == 0x000020, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::K2Node_CustomEvent_CurrentStamina' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, K2Node_CustomEvent_MaxStamina) == 0x000024, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::K2Node_CustomEvent_MaxStamina' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_Lerp_ReturnValue) == 0x000048, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000058, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_GetGzAbilitySystemComponent_ReturnValue) == 0x0000B0, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_GetGzAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_GetAllAbilities_OutAbilityHandles) == 0x0000B8, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_GetAllAbilities_OutAbilityHandles' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_Array_Length_ReturnValue) == 0x0000CC, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance) == 0x0000D0, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue) == 0x0000D8, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_Less_IntInt_ReturnValue) == 0x0000E0, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, K2Node_DynamicCast_AsGz_GA_Weapon_Aim) == 0x0000E8, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::K2Node_DynamicCast_AsGz_GA_Weapon_Aim' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_BooleanAND_ReturnValue) == 0x0000F1, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_MakeLiteralText_ReturnValue) == 0x0000F8, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, K2Node_MakeStruct_FormatArgumentData_1) == 0x000108, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, K2Node_MakeArray_Array) == 0x000150, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_Format_ReturnValue) == 0x000160, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000170, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000178, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000180, "Member 'WBP_HoldBreathProgress_C_ExecuteUbergraph_WBP_HoldBreathProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_HoldBreathProgress.WBP_HoldBreathProgress_C.GetCurrentPercent
// 0x0040 (0x0040 - 0x0000)
struct WBP_HoldBreathProgress_C_GetCurrentPercent final
{
public:
	double                                        HoldBreathMaxTime;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Interval;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentPercentage;                                 // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_CurrentHoldTime;                             // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E5C[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HoldBreathProgress_C_GetCurrentPercent) == 0x000008, "Wrong alignment on WBP_HoldBreathProgress_C_GetCurrentPercent");
static_assert(sizeof(WBP_HoldBreathProgress_C_GetCurrentPercent) == 0x000040, "Wrong size on WBP_HoldBreathProgress_C_GetCurrentPercent");
static_assert(offsetof(WBP_HoldBreathProgress_C_GetCurrentPercent, HoldBreathMaxTime) == 0x000000, "Member 'WBP_HoldBreathProgress_C_GetCurrentPercent::HoldBreathMaxTime' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_GetCurrentPercent, Interval) == 0x000008, "Member 'WBP_HoldBreathProgress_C_GetCurrentPercent::Interval' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_GetCurrentPercent, CurrentPercentage) == 0x000010, "Member 'WBP_HoldBreathProgress_C_GetCurrentPercent::CurrentPercentage' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_GetCurrentPercent, Param_CurrentHoldTime) == 0x000018, "Member 'WBP_HoldBreathProgress_C_GetCurrentPercent::Param_CurrentHoldTime' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_GetCurrentPercent, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'WBP_HoldBreathProgress_C_GetCurrentPercent::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_GetCurrentPercent, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_HoldBreathProgress_C_GetCurrentPercent::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_GetCurrentPercent, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_HoldBreathProgress_C_GetCurrentPercent::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_GetCurrentPercent, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'WBP_HoldBreathProgress_C_GetCurrentPercent::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_HoldBreathProgress.WBP_HoldBreathProgress_C.OnStaminaChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_HoldBreathProgress_C_OnStaminaChanged final
{
public:
	float                                         CurrentStamina;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxStamina;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HoldBreathProgress_C_OnStaminaChanged) == 0x000004, "Wrong alignment on WBP_HoldBreathProgress_C_OnStaminaChanged");
static_assert(sizeof(WBP_HoldBreathProgress_C_OnStaminaChanged) == 0x000008, "Wrong size on WBP_HoldBreathProgress_C_OnStaminaChanged");
static_assert(offsetof(WBP_HoldBreathProgress_C_OnStaminaChanged, CurrentStamina) == 0x000000, "Member 'WBP_HoldBreathProgress_C_OnStaminaChanged::CurrentStamina' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_OnStaminaChanged, MaxStamina) == 0x000004, "Member 'WBP_HoldBreathProgress_C_OnStaminaChanged::MaxStamina' has a wrong offset!");

// Function WBP_HoldBreathProgress.WBP_HoldBreathProgress_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_HoldBreathProgress_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HoldBreathProgress_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_HoldBreathProgress_C_PreConstruct");
static_assert(sizeof(WBP_HoldBreathProgress_C_PreConstruct) == 0x000001, "Wrong size on WBP_HoldBreathProgress_C_PreConstruct");
static_assert(offsetof(WBP_HoldBreathProgress_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_HoldBreathProgress_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_HoldBreathProgress.WBP_HoldBreathProgress_C.SetPlayerCharacter
// 0x0018 (0x0018 - 0x0000)
struct WBP_HoldBreathProgress_C_SetPlayerCharacter final
{
public:
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HoldBreathProgress_C_SetPlayerCharacter) == 0x000008, "Wrong alignment on WBP_HoldBreathProgress_C_SetPlayerCharacter");
static_assert(sizeof(WBP_HoldBreathProgress_C_SetPlayerCharacter) == 0x000018, "Wrong size on WBP_HoldBreathProgress_C_SetPlayerCharacter");
static_assert(offsetof(WBP_HoldBreathProgress_C_SetPlayerCharacter, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000000, "Member 'WBP_HoldBreathProgress_C_SetPlayerCharacter::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_SetPlayerCharacter, K2Node_DynamicCast_AsGz_Player_Character) == 0x000008, "Member 'WBP_HoldBreathProgress_C_SetPlayerCharacter::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(WBP_HoldBreathProgress_C_SetPlayerCharacter, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_HoldBreathProgress_C_SetPlayerCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

