#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HoldInteractionTooltip

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_HoldInteractionTooltip.WBP_HoldInteractionTooltip_C.ExecuteUbergraph_WBP_HoldInteractionTooltip
// 0x0090 (0x0090 - 0x0000)
struct WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bWasAdded)>               K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWasAdded;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A3B[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A3C[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetActionProgress_ProgressValue_ImplicitCast; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip) == 0x000008, "Wrong alignment on WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip");
static_assert(sizeof(WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip) == 0x000090, "Wrong size on WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip, EntryPoint) == 0x000000, "Member 'WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000004, "Member 'WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip, K2Node_CustomEvent_bWasAdded) == 0x00001C, "Member 'WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip::K2Node_CustomEvent_bWasAdded' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip, K2Node_Event_MyGeometry) == 0x000020, "Member 'WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip, K2Node_Event_InDeltaTime) == 0x000058, "Member 'WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip, CallFunc_FMax_ReturnValue) == 0x000068, "Member 'WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000070, "Member 'WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip, CallFunc_FClamp_ReturnValue) == 0x000078, "Member 'WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip, CallFunc_SetActionProgress_ProgressValue_ImplicitCast) == 0x000088, "Member 'WBP_HoldInteractionTooltip_C_ExecuteUbergraph_WBP_HoldInteractionTooltip::CallFunc_SetActionProgress_ProgressValue_ImplicitCast' has a wrong offset!");

// Function WBP_HoldInteractionTooltip.WBP_HoldInteractionTooltip_C.OnInteracting
// 0x0001 (0x0001 - 0x0000)
struct WBP_HoldInteractionTooltip_C_OnInteracting final
{
public:
	bool                                          bWasAdded;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HoldInteractionTooltip_C_OnInteracting) == 0x000001, "Wrong alignment on WBP_HoldInteractionTooltip_C_OnInteracting");
static_assert(sizeof(WBP_HoldInteractionTooltip_C_OnInteracting) == 0x000001, "Wrong size on WBP_HoldInteractionTooltip_C_OnInteracting");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_OnInteracting, bWasAdded) == 0x000000, "Member 'WBP_HoldInteractionTooltip_C_OnInteracting::bWasAdded' has a wrong offset!");

// Function WBP_HoldInteractionTooltip.WBP_HoldInteractionTooltip_C.ResetHolding
// 0x0030 (0x0030 - 0x0000)
struct WBP_HoldInteractionTooltip_C_ResetHolding final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A3D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A3E[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetActionProgress_ProgressValue_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HoldInteractionTooltip_C_ResetHolding) == 0x000008, "Wrong alignment on WBP_HoldInteractionTooltip_C_ResetHolding");
static_assert(sizeof(WBP_HoldInteractionTooltip_C_ResetHolding) == 0x000030, "Wrong size on WBP_HoldInteractionTooltip_C_ResetHolding");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ResetHolding, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'WBP_HoldInteractionTooltip_C_ResetHolding::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ResetHolding, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000004, "Member 'WBP_HoldInteractionTooltip_C_ResetHolding::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ResetHolding, CallFunc_FMax_ReturnValue) == 0x000010, "Member 'WBP_HoldInteractionTooltip_C_ResetHolding::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ResetHolding, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_HoldInteractionTooltip_C_ResetHolding::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ResetHolding, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_HoldInteractionTooltip_C_ResetHolding::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_ResetHolding, CallFunc_SetActionProgress_ProgressValue_ImplicitCast) == 0x000028, "Member 'WBP_HoldInteractionTooltip_C_ResetHolding::CallFunc_SetActionProgress_ProgressValue_ImplicitCast' has a wrong offset!");

// Function WBP_HoldInteractionTooltip.WBP_HoldInteractionTooltip_C.SetTooltipStyle
// 0x0018 (0x0018 - 0x0000)
struct WBP_HoldInteractionTooltip_C_SetTooltipStyle final
{
public:
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A3F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Playback_Speed_ImplicitCast;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HoldInteractionTooltip_C_SetTooltipStyle) == 0x000008, "Wrong alignment on WBP_HoldInteractionTooltip_C_SetTooltipStyle");
static_assert(sizeof(WBP_HoldInteractionTooltip_C_SetTooltipStyle) == 0x000018, "Wrong size on WBP_HoldInteractionTooltip_C_SetTooltipStyle");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_SetTooltipStyle, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000000, "Member 'WBP_HoldInteractionTooltip_C_SetTooltipStyle::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_SetTooltipStyle, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_HoldInteractionTooltip_C_SetTooltipStyle::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_SetTooltipStyle, K2Node_VariableSet_Playback_Speed_ImplicitCast) == 0x000010, "Member 'WBP_HoldInteractionTooltip_C_SetTooltipStyle::K2Node_VariableSet_Playback_Speed_ImplicitCast' has a wrong offset!");

// Function WBP_HoldInteractionTooltip.WBP_HoldInteractionTooltip_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_HoldInteractionTooltip_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HoldInteractionTooltip_C_Tick) == 0x000004, "Wrong alignment on WBP_HoldInteractionTooltip_C_Tick");
static_assert(sizeof(WBP_HoldInteractionTooltip_C_Tick) == 0x00003C, "Wrong size on WBP_HoldInteractionTooltip_C_Tick");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_HoldInteractionTooltip_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_HoldInteractionTooltip_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_HoldInteractionTooltip.WBP_HoldInteractionTooltip_C.UpdateHolding
// 0x0018 (0x0018 - 0x0000)
struct WBP_HoldInteractionTooltip_C_UpdateHolding final
{
public:
	double                                        Param_InitialInteractionProgress;                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetActionProgress_ProgressValue_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HoldInteractionTooltip_C_UpdateHolding) == 0x000008, "Wrong alignment on WBP_HoldInteractionTooltip_C_UpdateHolding");
static_assert(sizeof(WBP_HoldInteractionTooltip_C_UpdateHolding) == 0x000018, "Wrong size on WBP_HoldInteractionTooltip_C_UpdateHolding");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_UpdateHolding, Param_InitialInteractionProgress) == 0x000000, "Member 'WBP_HoldInteractionTooltip_C_UpdateHolding::Param_InitialInteractionProgress' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_UpdateHolding, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_HoldInteractionTooltip_C_UpdateHolding::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HoldInteractionTooltip_C_UpdateHolding, CallFunc_SetActionProgress_ProgressValue_ImplicitCast) == 0x000010, "Member 'WBP_HoldInteractionTooltip_C_UpdateHolding::CallFunc_SetActionProgress_ProgressValue_ImplicitCast' has a wrong offset!");

}

