#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSlots_LIst_PreMatch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoadoutSlots_LIst_PreMatch.WBP_LoadoutSlots_LIst_PreMatch_C
// 0x0040 (0x04B8 - 0x0478)
class UWBP_LoadoutSlots_LIst_PreMatch_C final : public UGzLoadoutListPreMatch
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_3;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_11;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_110;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnClear();
	void OnButtonCreated(class UGzLoadoutSelectionButton* NewButton);
	void ExecuteUbergraph_WBP_LoadoutSlots_LIst_PreMatch(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoadoutSlots_LIst_PreMatch_C">();
	}
	static class UWBP_LoadoutSlots_LIst_PreMatch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoadoutSlots_LIst_PreMatch_C>();
	}
};
static_assert(alignof(UWBP_LoadoutSlots_LIst_PreMatch_C) == 0x000008, "Wrong alignment on UWBP_LoadoutSlots_LIst_PreMatch_C");
static_assert(sizeof(UWBP_LoadoutSlots_LIst_PreMatch_C) == 0x0004B8, "Wrong size on UWBP_LoadoutSlots_LIst_PreMatch_C");
static_assert(offsetof(UWBP_LoadoutSlots_LIst_PreMatch_C, UberGraphFrame) == 0x000478, "Member 'UWBP_LoadoutSlots_LIst_PreMatch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSlots_LIst_PreMatch_C, Image_3) == 0x000480, "Member 'UWBP_LoadoutSlots_LIst_PreMatch_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSlots_LIst_PreMatch_C, Image_4) == 0x000488, "Member 'UWBP_LoadoutSlots_LIst_PreMatch_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSlots_LIst_PreMatch_C, Image_5) == 0x000490, "Member 'UWBP_LoadoutSlots_LIst_PreMatch_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSlots_LIst_PreMatch_C, Image_6) == 0x000498, "Member 'UWBP_LoadoutSlots_LIst_PreMatch_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSlots_LIst_PreMatch_C, Image_11) == 0x0004A0, "Member 'UWBP_LoadoutSlots_LIst_PreMatch_C::Image_11' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSlots_LIst_PreMatch_C, Image_110) == 0x0004A8, "Member 'UWBP_LoadoutSlots_LIst_PreMatch_C::Image_110' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSlots_LIst_PreMatch_C, ScrollBox) == 0x0004B0, "Member 'UWBP_LoadoutSlots_LIst_PreMatch_C::ScrollBox' has a wrong offset!");

}

