#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KillLog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_KillLog.WBP_KillLog_C
// 0x0040 (0x03F0 - 0x03B0)
class UWBP_KillLog_C final : public UGzKillLogWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       KillMarksFadeOutAnimation;                         // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_KillLog_KillMark_C*                WBP_KillLog_KillMark;                              // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KillLog_KillMark_C*                WBP_KillLog_KillMark_45;                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KillLog_KillMark_C*                WBP_KillLog_KillMark_93;                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KillLogEntry_C*                    WBP_KillLogEntry;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KillLogEntry_C*                    WBP_KillLogEntry_41;                               // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void AddKillMark();
	void ExecuteUbergraph_WBP_KillLog(int32 EntryPoint);
	void Finished_9276746A4CA28EEF164290A4ED08D515();
	void OnEntryAddedOrUpdated();
	void OnLogEmpty();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_KillLog_C">();
	}
	static class UWBP_KillLog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_KillLog_C>();
	}
};
static_assert(alignof(UWBP_KillLog_C) == 0x000010, "Wrong alignment on UWBP_KillLog_C");
static_assert(sizeof(UWBP_KillLog_C) == 0x0003F0, "Wrong size on UWBP_KillLog_C");
static_assert(offsetof(UWBP_KillLog_C, UberGraphFrame) == 0x0003B0, "Member 'UWBP_KillLog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_KillLog_C, KillMarksFadeOutAnimation) == 0x0003B8, "Member 'UWBP_KillLog_C::KillMarksFadeOutAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_KillLog_C, WBP_KillLog_KillMark) == 0x0003C0, "Member 'UWBP_KillLog_C::WBP_KillLog_KillMark' has a wrong offset!");
static_assert(offsetof(UWBP_KillLog_C, WBP_KillLog_KillMark_45) == 0x0003C8, "Member 'UWBP_KillLog_C::WBP_KillLog_KillMark_45' has a wrong offset!");
static_assert(offsetof(UWBP_KillLog_C, WBP_KillLog_KillMark_93) == 0x0003D0, "Member 'UWBP_KillLog_C::WBP_KillLog_KillMark_93' has a wrong offset!");
static_assert(offsetof(UWBP_KillLog_C, WBP_KillLogEntry) == 0x0003D8, "Member 'UWBP_KillLog_C::WBP_KillLogEntry' has a wrong offset!");
static_assert(offsetof(UWBP_KillLog_C, WBP_KillLogEntry_41) == 0x0003E0, "Member 'UWBP_KillLog_C::WBP_KillLogEntry_41' has a wrong offset!");

}

