#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Crosshair_Cyberlimbs_Defiler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Crosshair_Cyberlimbs_Defiler.WBP_Crosshair_Cyberlimbs_Defiler_C
// 0x0040 (0x0330 - 0x02F0)
class UWBP_Crosshair_Cyberlimbs_Defiler_C final : public UGzLimbCrosshair
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Crosshair;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Crosshair_1;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Crosshair_2;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_24;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewVar;                                            // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         Charges;                                           // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ChrgesChanged_Event(int32 Param_Charges);
	void ExecuteUbergraph_WBP_Crosshair_Cyberlimbs_Defiler(int32 EntryPoint);
	void OnLimbActivated(EGzLimbType LimbType, const struct FGzLimbGaugeData& GaugeData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Crosshair_Cyberlimbs_Defiler_C">();
	}
	static class UWBP_Crosshair_Cyberlimbs_Defiler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Crosshair_Cyberlimbs_Defiler_C>();
	}
};
static_assert(alignof(UWBP_Crosshair_Cyberlimbs_Defiler_C) == 0x000008, "Wrong alignment on UWBP_Crosshair_Cyberlimbs_Defiler_C");
static_assert(sizeof(UWBP_Crosshair_Cyberlimbs_Defiler_C) == 0x000330, "Wrong size on UWBP_Crosshair_Cyberlimbs_Defiler_C");
static_assert(offsetof(UWBP_Crosshair_Cyberlimbs_Defiler_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Crosshair_Cyberlimbs_Defiler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Cyberlimbs_Defiler_C, Image_Crosshair) == 0x0002F8, "Member 'UWBP_Crosshair_Cyberlimbs_Defiler_C::Image_Crosshair' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Cyberlimbs_Defiler_C, Image_Crosshair_1) == 0x000300, "Member 'UWBP_Crosshair_Cyberlimbs_Defiler_C::Image_Crosshair_1' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Cyberlimbs_Defiler_C, Image_Crosshair_2) == 0x000308, "Member 'UWBP_Crosshair_Cyberlimbs_Defiler_C::Image_Crosshair_2' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Cyberlimbs_Defiler_C, Overlay_24) == 0x000310, "Member 'UWBP_Crosshair_Cyberlimbs_Defiler_C::Overlay_24' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Cyberlimbs_Defiler_C, NewVar) == 0x000318, "Member 'UWBP_Crosshair_Cyberlimbs_Defiler_C::NewVar' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_Cyberlimbs_Defiler_C, Charges) == 0x000320, "Member 'UWBP_Crosshair_Cyberlimbs_Defiler_C::Charges' has a wrong offset!");

}

