#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Scope_Default_LongRange

#include "Basic.hpp"

#include "WBP_Scope_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Scope_Default_LongRange.WBP_Scope_Default_LongRange_C
// 0x0060 (0x0370 - 0x0310)
class UWBP_Scope_Default_LongRange_C final : public UWBP_Scope_Base_C
{
public:
	class UImage*                                 Bar;                                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bar_1;                                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bar_2;                                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bar_3;                                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_L;                                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_L_1;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_L_2;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_L_3;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_R;                                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_R_1;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_R_2;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_R_3;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Scope_Default_LongRange_C">();
	}
	static class UWBP_Scope_Default_LongRange_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Scope_Default_LongRange_C>();
	}
};
static_assert(alignof(UWBP_Scope_Default_LongRange_C) == 0x000008, "Wrong alignment on UWBP_Scope_Default_LongRange_C");
static_assert(sizeof(UWBP_Scope_Default_LongRange_C) == 0x000370, "Wrong size on UWBP_Scope_Default_LongRange_C");
static_assert(offsetof(UWBP_Scope_Default_LongRange_C, Bar) == 0x000310, "Member 'UWBP_Scope_Default_LongRange_C::Bar' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_Default_LongRange_C, Bar_1) == 0x000318, "Member 'UWBP_Scope_Default_LongRange_C::Bar_1' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_Default_LongRange_C, Bar_2) == 0x000320, "Member 'UWBP_Scope_Default_LongRange_C::Bar_2' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_Default_LongRange_C, Bar_3) == 0x000328, "Member 'UWBP_Scope_Default_LongRange_C::Bar_3' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_Default_LongRange_C, Dot_L) == 0x000330, "Member 'UWBP_Scope_Default_LongRange_C::Dot_L' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_Default_LongRange_C, Dot_L_1) == 0x000338, "Member 'UWBP_Scope_Default_LongRange_C::Dot_L_1' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_Default_LongRange_C, Dot_L_2) == 0x000340, "Member 'UWBP_Scope_Default_LongRange_C::Dot_L_2' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_Default_LongRange_C, Dot_L_3) == 0x000348, "Member 'UWBP_Scope_Default_LongRange_C::Dot_L_3' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_Default_LongRange_C, Dot_R) == 0x000350, "Member 'UWBP_Scope_Default_LongRange_C::Dot_R' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_Default_LongRange_C, Dot_R_1) == 0x000358, "Member 'UWBP_Scope_Default_LongRange_C::Dot_R_1' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_Default_LongRange_C, Dot_R_2) == 0x000360, "Member 'UWBP_Scope_Default_LongRange_C::Dot_R_2' has a wrong offset!");
static_assert(offsetof(UWBP_Scope_Default_LongRange_C, Dot_R_3) == 0x000368, "Member 'UWBP_Scope_Default_LongRange_C::Dot_R_3' has a wrong offset!");

}

