#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KillLog

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_KillLog.WBP_KillLog_C.ExecuteUbergraph_WBP_KillLog
// 0x0048 (0x0048 - 0x0000)
struct WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D4F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_KillLog_KillMark_C*                CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D50[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D51[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D52[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog) == 0x000008, "Wrong alignment on WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog");
static_assert(sizeof(WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog) == 0x000048, "Wrong size on WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog");
static_assert(offsetof(WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog, EntryPoint) == 0x000000, "Member 'WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000010, "Member 'WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog, Temp_bool_Has_Been_Initd_Variable) == 0x000011, "Member 'WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog, Temp_bool_IsClosed_Variable) == 0x000012, "Member 'WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000018, "Member 'WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000020, "Member 'WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'WBP_KillLog_C_ExecuteUbergraph_WBP_KillLog::CallFunc_AddChild_ReturnValue' has a wrong offset!");

}

