#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapMarker_Hostile_Location

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_MapMarker_Hostile_Location.WBP_MapMarker_Hostile_Location_C.ExecuteUbergraph_WBP_MapMarker_Hostile_Location
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64E9[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64EA[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue;  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64EB[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64EC[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location) == 0x000008, "Wrong alignment on WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location");
static_assert(sizeof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location) == 0x0000A8, "Wrong size on WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, EntryPoint) == 0x000000, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, K2Node_CustomEvent_Tag_1) == 0x000004, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, K2Node_CustomEvent_Tag) == 0x00001C, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, Temp_struct_Variable) == 0x000034, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, K2Node_DynamicCast_AsGz_Player_Character) == 0x000058, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, CallFunc_GetGzAbilitySystemComponent_ReturnValue) == 0x000068, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::CallFunc_GetGzAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue) == 0x000070, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000080, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000088, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, CallFunc_PlayAnimation_ReturnValue) == 0x000090, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, CallFunc_IsValid_ReturnValue_2) == 0x000098, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000A0, "Member 'WBP_MapMarker_Hostile_Location_C_ExecuteUbergraph_WBP_MapMarker_Hostile_Location::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_MapMarker_Hostile_Location.WBP_MapMarker_Hostile_Location_C.OnTagAdded_D727AAD1471573C9339D9F8F3DB69190
// 0x0008 (0x0008 - 0x0000)
struct WBP_MapMarker_Hostile_Location_C_OnTagAdded_D727AAD1471573C9339D9F8F3DB69190 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Hostile_Location_C_OnTagAdded_D727AAD1471573C9339D9F8F3DB69190) == 0x000004, "Wrong alignment on WBP_MapMarker_Hostile_Location_C_OnTagAdded_D727AAD1471573C9339D9F8F3DB69190");
static_assert(sizeof(WBP_MapMarker_Hostile_Location_C_OnTagAdded_D727AAD1471573C9339D9F8F3DB69190) == 0x000008, "Wrong size on WBP_MapMarker_Hostile_Location_C_OnTagAdded_D727AAD1471573C9339D9F8F3DB69190");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_OnTagAdded_D727AAD1471573C9339D9F8F3DB69190, Tag) == 0x000000, "Member 'WBP_MapMarker_Hostile_Location_C_OnTagAdded_D727AAD1471573C9339D9F8F3DB69190::Tag' has a wrong offset!");

// Function WBP_MapMarker_Hostile_Location.WBP_MapMarker_Hostile_Location_C.OnTagRemoved_D727AAD1471573C9339D9F8F3DB69190
// 0x0008 (0x0008 - 0x0000)
struct WBP_MapMarker_Hostile_Location_C_OnTagRemoved_D727AAD1471573C9339D9F8F3DB69190 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Hostile_Location_C_OnTagRemoved_D727AAD1471573C9339D9F8F3DB69190) == 0x000004, "Wrong alignment on WBP_MapMarker_Hostile_Location_C_OnTagRemoved_D727AAD1471573C9339D9F8F3DB69190");
static_assert(sizeof(WBP_MapMarker_Hostile_Location_C_OnTagRemoved_D727AAD1471573C9339D9F8F3DB69190) == 0x000008, "Wrong size on WBP_MapMarker_Hostile_Location_C_OnTagRemoved_D727AAD1471573C9339D9F8F3DB69190");
static_assert(offsetof(WBP_MapMarker_Hostile_Location_C_OnTagRemoved_D727AAD1471573C9339D9F8F3DB69190, Tag) == 0x000000, "Member 'WBP_MapMarker_Hostile_Location_C_OnTagRemoved_D727AAD1471573C9339D9F8F3DB69190::Tag' has a wrong offset!");

}

