#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipInteraction_Backpack_Comparison

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_TooltipInteraction_Backpack_Comparison.WBP_TooltipInteraction_Backpack_Comparison_C.InitItemSetup
// 0x0010 (0x0010 - 0x0000)
struct WBP_TooltipInteraction_Backpack_Comparison_C_InitItemSetup final
{
public:
	class UGzBackpackItemData*                    BackpackItemData;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBackpackPocketDefsCount_ReturnValue;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzItemRarity                                 CallFunc_GetRarity_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Backpack_Comparison_C_InitItemSetup) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Backpack_Comparison_C_InitItemSetup");
static_assert(sizeof(WBP_TooltipInteraction_Backpack_Comparison_C_InitItemSetup) == 0x000010, "Wrong size on WBP_TooltipInteraction_Backpack_Comparison_C_InitItemSetup");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_Comparison_C_InitItemSetup, BackpackItemData) == 0x000000, "Member 'WBP_TooltipInteraction_Backpack_Comparison_C_InitItemSetup::BackpackItemData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_Comparison_C_InitItemSetup, CallFunc_GetBackpackPocketDefsCount_ReturnValue) == 0x000008, "Member 'WBP_TooltipInteraction_Backpack_Comparison_C_InitItemSetup::CallFunc_GetBackpackPocketDefsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_Comparison_C_InitItemSetup, CallFunc_GetRarity_ReturnValue) == 0x00000C, "Member 'WBP_TooltipInteraction_Backpack_Comparison_C_InitItemSetup::CallFunc_GetRarity_ReturnValue' has a wrong offset!");

// Function WBP_TooltipInteraction_Backpack_Comparison.WBP_TooltipInteraction_Backpack_Comparison_C.SetRarity
// 0x0014 (0x0014 - 0x0000)
struct WBP_TooltipInteraction_Backpack_Comparison_C_SetRarity final
{
public:
	EGzItemRarity                                 Rarlity;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E30[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetRarityColor_ReturnValue;               // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Backpack_Comparison_C_SetRarity) == 0x000004, "Wrong alignment on WBP_TooltipInteraction_Backpack_Comparison_C_SetRarity");
static_assert(sizeof(WBP_TooltipInteraction_Backpack_Comparison_C_SetRarity) == 0x000014, "Wrong size on WBP_TooltipInteraction_Backpack_Comparison_C_SetRarity");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_Comparison_C_SetRarity, Rarlity) == 0x000000, "Member 'WBP_TooltipInteraction_Backpack_Comparison_C_SetRarity::Rarlity' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_Comparison_C_SetRarity, CallFunc_GetRarityColor_ReturnValue) == 0x000004, "Member 'WBP_TooltipInteraction_Backpack_Comparison_C_SetRarity::CallFunc_GetRarityColor_ReturnValue' has a wrong offset!");

// Function WBP_TooltipInteraction_Backpack_Comparison.WBP_TooltipInteraction_Backpack_Comparison_C.UpdateTooltip
// 0x0018 (0x0018 - 0x0000)
struct WBP_TooltipInteraction_Backpack_Comparison_C_UpdateTooltip final
{
public:
	class UGzItemData*                            CallFunc_GetItemDataComparison_ItemData;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzBackpackItemData*                    K2Node_DynamicCast_AsGz_Backpack_Item_Data;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Backpack_Comparison_C_UpdateTooltip) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Backpack_Comparison_C_UpdateTooltip");
static_assert(sizeof(WBP_TooltipInteraction_Backpack_Comparison_C_UpdateTooltip) == 0x000018, "Wrong size on WBP_TooltipInteraction_Backpack_Comparison_C_UpdateTooltip");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_Comparison_C_UpdateTooltip, CallFunc_GetItemDataComparison_ItemData) == 0x000000, "Member 'WBP_TooltipInteraction_Backpack_Comparison_C_UpdateTooltip::CallFunc_GetItemDataComparison_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_Comparison_C_UpdateTooltip, K2Node_DynamicCast_AsGz_Backpack_Item_Data) == 0x000008, "Member 'WBP_TooltipInteraction_Backpack_Comparison_C_UpdateTooltip::K2Node_DynamicCast_AsGz_Backpack_Item_Data' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_Comparison_C_UpdateTooltip, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_TooltipInteraction_Backpack_Comparison_C_UpdateTooltip::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_Comparison_C_UpdateTooltip, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_TooltipInteraction_Backpack_Comparison_C_UpdateTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

