#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CloakArmProgress

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_CloakArmProgress.WBP_CloakArmProgress_C.ExecuteUbergraph_WBP_CloakArmProgress
// 0x0198 (0x0198 - 0x0000)
struct WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E5F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0060(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E60[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00E0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0148(0x0010)()
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E61[0x6];                                     // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_B_ImplicitCast;                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E62[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1;   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress) == 0x000008, "Wrong alignment on WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress");
static_assert(sizeof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress) == 0x000198, "Wrong size on WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, EntryPoint) == 0x000000, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, K2Node_Event_MyGeometry) == 0x000060, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, K2Node_Event_InDeltaTime) == 0x000098, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, K2Node_Event_IsDesignTime) == 0x00009C, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_SafeDivide_ReturnValue) == 0x0000A0, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000A8, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C0, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_FClamp_ReturnValue) == 0x0000D0, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000D8, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0000E0, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F0, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, K2Node_MakeArray_Array) == 0x000138, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_Format_ReturnValue) == 0x000148, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000158, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_BooleanAND_ReturnValue) == 0x000159, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_SafeDivide_B_ImplicitCast) == 0x000160, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_SafeDivide_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_SafeDivide_A_ImplicitCast) == 0x000168, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_SafeDivide_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000170, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000178, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000180, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x000188, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1) == 0x000190, "Member 'WBP_CloakArmProgress_C_ExecuteUbergraph_WBP_CloakArmProgress::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");

// Function WBP_CloakArmProgress.WBP_CloakArmProgress_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CloakArmProgress_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CloakArmProgress_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CloakArmProgress_C_PreConstruct");
static_assert(sizeof(WBP_CloakArmProgress_C_PreConstruct) == 0x000001, "Wrong size on WBP_CloakArmProgress_C_PreConstruct");
static_assert(offsetof(WBP_CloakArmProgress_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CloakArmProgress_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CloakArmProgress.WBP_CloakArmProgress_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_CloakArmProgress_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CloakArmProgress_C_Tick) == 0x000004, "Wrong alignment on WBP_CloakArmProgress_C_Tick");
static_assert(sizeof(WBP_CloakArmProgress_C_Tick) == 0x00003C, "Wrong size on WBP_CloakArmProgress_C_Tick");
static_assert(offsetof(WBP_CloakArmProgress_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_CloakArmProgress_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CloakArmProgress_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_CloakArmProgress_C_Tick::InDeltaTime' has a wrong offset!");

}

