#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TutorialLoadoutButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TutorialLoadoutButton.WBP_TutorialLoadoutButton_C
// 0x0020 (0x0360 - 0x0340)
class UWBP_TutorialLoadoutButton_C final : public UGzHUDComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzActionWidget*                        GzActionWidget;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hint_Icon_Image;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Hint_VerticalBox;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_TutorialLoadoutButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TutorialLoadoutButton_C">();
	}
	static class UWBP_TutorialLoadoutButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TutorialLoadoutButton_C>();
	}
};
static_assert(alignof(UWBP_TutorialLoadoutButton_C) == 0x000008, "Wrong alignment on UWBP_TutorialLoadoutButton_C");
static_assert(sizeof(UWBP_TutorialLoadoutButton_C) == 0x000360, "Wrong size on UWBP_TutorialLoadoutButton_C");
static_assert(offsetof(UWBP_TutorialLoadoutButton_C, UberGraphFrame) == 0x000340, "Member 'UWBP_TutorialLoadoutButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialLoadoutButton_C, GzActionWidget) == 0x000348, "Member 'UWBP_TutorialLoadoutButton_C::GzActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialLoadoutButton_C, Hint_Icon_Image) == 0x000350, "Member 'UWBP_TutorialLoadoutButton_C::Hint_Icon_Image' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialLoadoutButton_C, Hint_VerticalBox) == 0x000358, "Member 'UWBP_TutorialLoadoutButton_C::Hint_VerticalBox' has a wrong offset!");

}

