#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainNotification_SecondaryElementReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainNotification_SecondaryElementReward.WBP_MainNotification_SecondaryElementReward_C
// 0x0018 (0x0320 - 0x0308)
class UWBP_MainNotification_SecondaryElementReward_C final : public UGzGameNotificationHeader
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzTextBlock*                           SecondaryMessage_GzText;                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardTooltipContainer_C*          WBP_RewardTooltipContainer;                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MainNotification_SecondaryElementReward(int32 EntryPoint);
	class UGzTextBlock* GetNotificationText();
	class UGzTextBlock* GetNotificationText_BP();
	bool UpdateHeaderNotification(const class UGzGameNotificationDisplayData* InNotificationData);
	void UpdateHeaderNotification_BP(const class UGzGameNotificationDisplayData* InNotificationData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainNotification_SecondaryElementReward_C">();
	}
	static class UWBP_MainNotification_SecondaryElementReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainNotification_SecondaryElementReward_C>();
	}
};
static_assert(alignof(UWBP_MainNotification_SecondaryElementReward_C) == 0x000008, "Wrong alignment on UWBP_MainNotification_SecondaryElementReward_C");
static_assert(sizeof(UWBP_MainNotification_SecondaryElementReward_C) == 0x000320, "Wrong size on UWBP_MainNotification_SecondaryElementReward_C");
static_assert(offsetof(UWBP_MainNotification_SecondaryElementReward_C, UberGraphFrame) == 0x000308, "Member 'UWBP_MainNotification_SecondaryElementReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryElementReward_C, SecondaryMessage_GzText) == 0x000310, "Member 'UWBP_MainNotification_SecondaryElementReward_C::SecondaryMessage_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryElementReward_C, WBP_RewardTooltipContainer) == 0x000318, "Member 'UWBP_MainNotification_SecondaryElementReward_C::WBP_RewardTooltipContainer' has a wrong offset!");

}

