#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusEffect

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_StatusEffect.WBP_StatusEffect_C.ExecuteUbergraph_WBP_StatusEffect
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C58[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bWasAdded)>               K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_NewViewTarget;                        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C59[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C5A[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWasAdded;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C5B[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0070(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C5C[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_ViewTarget;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C5D[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C5E[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect) == 0x000008, "Wrong alignment on WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect");
static_assert(sizeof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect) == 0x0000E8, "Wrong size on WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, EntryPoint) == 0x000000, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, K2Node_Event_NewViewTarget) == 0x000030, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::K2Node_Event_NewViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, K2Node_Event_IsDesignTime) == 0x000038, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, K2Node_CustomEvent_bWasAdded) == 0x000058, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::K2Node_CustomEvent_bWasAdded' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_Conv_BoolToString_ReturnValue) == 0x000060, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000070, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, K2Node_Event_ViewTarget) == 0x0000A0, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::K2Node_Event_ViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0000A8, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000B8, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_IsValid_ReturnValue_2) == 0x0000B9, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x0000C0, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_IsValid_ReturnValue_3) == 0x0000C8, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x0000D0, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x0000E0, "Member 'WBP_StatusEffect_C_ExecuteUbergraph_WBP_StatusEffect::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");

// Function WBP_StatusEffect.WBP_StatusEffect_C.OnViewTargetChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatusEffect_C_OnViewTargetChanged final
{
public:
	class APawn*                                  ViewTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffect_C_OnViewTargetChanged) == 0x000008, "Wrong alignment on WBP_StatusEffect_C_OnViewTargetChanged");
static_assert(sizeof(WBP_StatusEffect_C_OnViewTargetChanged) == 0x000008, "Wrong size on WBP_StatusEffect_C_OnViewTargetChanged");
static_assert(offsetof(WBP_StatusEffect_C_OnViewTargetChanged, ViewTarget) == 0x000000, "Member 'WBP_StatusEffect_C_OnViewTargetChanged::ViewTarget' has a wrong offset!");

// Function WBP_StatusEffect.WBP_StatusEffect_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_StatusEffect_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffect_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_StatusEffect_C_PreConstruct");
static_assert(sizeof(WBP_StatusEffect_C_PreConstruct) == 0x000001, "Wrong size on WBP_StatusEffect_C_PreConstruct");
static_assert(offsetof(WBP_StatusEffect_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_StatusEffect_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_StatusEffect.WBP_StatusEffect_C.ReceiveBindEvents
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatusEffect_C_ReceiveBindEvents final
{
public:
	class APawn*                                  NewViewTarget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffect_C_ReceiveBindEvents) == 0x000008, "Wrong alignment on WBP_StatusEffect_C_ReceiveBindEvents");
static_assert(sizeof(WBP_StatusEffect_C_ReceiveBindEvents) == 0x000008, "Wrong size on WBP_StatusEffect_C_ReceiveBindEvents");
static_assert(offsetof(WBP_StatusEffect_C_ReceiveBindEvents, NewViewTarget) == 0x000000, "Member 'WBP_StatusEffect_C_ReceiveBindEvents::NewViewTarget' has a wrong offset!");

// Function WBP_StatusEffect.WBP_StatusEffect_C.SetItemTexture
// 0x0060 (0x0060 - 0x0000)
struct WBP_StatusEffect_C_SetItemTexture final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C5F[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C60[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Map_Find_Value;                           // 0x0030(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffect_C_SetItemTexture) == 0x000008, "Wrong alignment on WBP_StatusEffect_C_SetItemTexture");
static_assert(sizeof(WBP_StatusEffect_C_SetItemTexture) == 0x000060, "Wrong size on WBP_StatusEffect_C_SetItemTexture");
static_assert(offsetof(WBP_StatusEffect_C_SetItemTexture, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_StatusEffect_C_SetItemTexture::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_SetItemTexture, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_StatusEffect_C_SetItemTexture::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_SetItemTexture, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_StatusEffect_C_SetItemTexture::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_SetItemTexture, CallFunc_Map_Keys_Keys) == 0x000010, "Member 'WBP_StatusEffect_C_SetItemTexture::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_SetItemTexture, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_StatusEffect_C_SetItemTexture::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_SetItemTexture, CallFunc_Array_Get_Item) == 0x000024, "Member 'WBP_StatusEffect_C_SetItemTexture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_SetItemTexture, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_StatusEffect_C_SetItemTexture::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_SetItemTexture, CallFunc_Map_Find_Value) == 0x000030, "Member 'WBP_StatusEffect_C_SetItemTexture::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_SetItemTexture, CallFunc_Map_Find_ReturnValue) == 0x000058, "Member 'WBP_StatusEffect_C_SetItemTexture::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_SetItemTexture, CallFunc_HasTag_ReturnValue) == 0x000059, "Member 'WBP_StatusEffect_C_SetItemTexture::CallFunc_HasTag_ReturnValue' has a wrong offset!");

// Function WBP_StatusEffect.WBP_StatusEffect_C.TagChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_StatusEffect_C_TagChanged final
{
public:
	bool                                          bWasAdded;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffect_C_TagChanged) == 0x000001, "Wrong alignment on WBP_StatusEffect_C_TagChanged");
static_assert(sizeof(WBP_StatusEffect_C_TagChanged) == 0x000001, "Wrong size on WBP_StatusEffect_C_TagChanged");
static_assert(offsetof(WBP_StatusEffect_C_TagChanged, bWasAdded) == 0x000000, "Member 'WBP_StatusEffect_C_TagChanged::bWasAdded' has a wrong offset!");

// Function WBP_StatusEffect.WBP_StatusEffect_C.UpdatePercent
// 0x02A0 (0x02A0 - 0x0000)
struct WBP_StatusEffect_C_UpdatePercent final
{
public:
	class UAbilitySystemComponent*                AbilitySystem;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C61[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_MatchAnyTags_ReturnValue; // 0x0018(0x0048)()
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x0068(0x0048)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectQuery                   K2Node_MakeStruct_GameplayEffectQuery;             // 0x00B8(0x0198)(ContainsInstancedReference)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffects_ReturnValue;             // 0x0250(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C62[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x0264(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActiveGameplayEffectTotalDuration_ReturnValue; // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActiveGameplayEffectRemainingDuration_ReturnValue; // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C63[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffect_C_UpdatePercent) == 0x000008, "Wrong alignment on WBP_StatusEffect_C_UpdatePercent");
static_assert(sizeof(WBP_StatusEffect_C_UpdatePercent) == 0x0002A0, "Wrong size on WBP_StatusEffect_C_UpdatePercent");
static_assert(offsetof(WBP_StatusEffect_C_UpdatePercent, AbilitySystem) == 0x000000, "Member 'WBP_StatusEffect_C_UpdatePercent::AbilitySystem' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_UpdatePercent, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_StatusEffect_C_UpdatePercent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffect_C_UpdatePercent, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WBP_StatusEffect_C_UpdatePercent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
