#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipInteraction_Backpack_DOS

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function WBP_TooltipInteraction_Backpack_DOS.WBP_TooltipInteraction_Backpack_DOS_C.FindBackpackItem
// 0x0030 (0x0030 - 0x0000)
struct WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem final
{
public:
	class UGzBackpackItemData*                    Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Pawn;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E31[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzBackpackItemData*                    CallFunc_FindItemInPocket_Return;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem");
static_assert(sizeof(WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem) == 0x000030, "Wrong size on WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem, Result) == 0x000000, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem::Result' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem, Pawn) == 0x000008, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem::Pawn' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem, K2Node_DynamicCast_AsGz_Character) == 0x000010, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem, CallFunc_FindItemInPocket_Return) == 0x000020, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem::CallFunc_FindItemInPocket_Return' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000028, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindBackpackItem::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");

// Function WBP_TooltipInteraction_Backpack_DOS.WBP_TooltipInteraction_Backpack_DOS_C.FindItemInPocket
// 0x0088 (0x0088 - 0x0000)
struct WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket final
{
public:
	class AGzBaseCharacter*                       Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SlotTag;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UGzBackpackItemData*                    Return;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzCombatComponent*                     CombatComp;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGzPlayerViewTargetInterface> CallFunc_GetViewTargetInventory_self_CastInput;    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzInvComponent*                        CallFunc_GetViewTargetInventory_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzCombatComponent*                     CallFunc_GetCombatComponent_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGzInvPocket                           CallFunc_GetPocketBySlot_ReturnValue;              // 0x0040(0x0028)(ConstParm)
	class UGzItemData*                            CallFunc_GetItemData_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E32[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzBackpackItemData*                    K2Node_DynamicCast_AsGz_Backpack_Item_Data;        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket");
static_assert(sizeof(WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket) == 0x000088, "Wrong size on WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket, Character) == 0x000000, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket::Character' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket, SlotTag) == 0x000008, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket::SlotTag' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket, Return) == 0x000010, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket::Return' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket, CombatComp) == 0x000018, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket::CombatComp' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket, CallFunc_GetViewTargetInventory_self_CastInput) == 0x000020, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket::CallFunc_GetViewTargetInventory_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket, CallFunc_GetViewTargetInventory_ReturnValue) == 0x000030, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket::CallFunc_GetViewTargetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket, CallFunc_GetCombatComponent_ReturnValue) == 0x000038, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket::CallFunc_GetCombatComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket, CallFunc_GetPocketBySlot_ReturnValue) == 0x000040, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket::CallFunc_GetPocketBySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket, CallFunc_GetItemData_ReturnValue) == 0x000068, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket, K2Node_DynamicCast_AsGz_Backpack_Item_Data) == 0x000078, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket::K2Node_DynamicCast_AsGz_Backpack_Item_Data' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_FindItemInPocket::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_TooltipInteraction_Backpack_DOS.WBP_TooltipInteraction_Backpack_DOS_C.InitBackpackSetup
// 0x0028 (0x0028 - 0x0000)
struct WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup final
{
public:
	class UGzBackpackItemData*                    TooltipBackpackItemData;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPickableBase*                        Pickable;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowComparisonTooltip_ReturnValue;  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E33[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzBackpackItemData*                    CallFunc_FindBackpackItem_Result;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup");
static_assert(sizeof(WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup) == 0x000028, "Wrong size on WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup, TooltipBackpackItemData) == 0x000000, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup::TooltipBackpackItemData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup, Pickable) == 0x000008, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup::Pickable' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup, CallFunc_ShouldShowComparisonTooltip_ReturnValue) == 0x000010, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup::CallFunc_ShouldShowComparisonTooltip_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup, CallFunc_FindBackpackItem_Result) == 0x000018, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup::CallFunc_FindBackpackItem_Result' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'WBP_TooltipInteraction_Backpack_DOS_C_InitBackpackSetup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

