#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LobbyUsername

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LobbyUsername.WBP_LobbyUsername_C
// 0x0048 (0x0328 - 0x02E0)
class UWBP_LobbyUsername_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzTextBlock*                           AccountLevel;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           MatchmakingStatus;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OtgPro;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Talking_Status;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Username_Text;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Lobby_Username_Component_C*        OwnerComponent;                                    // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 ClanTag;                                           // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_LobbyUsername(int32 EntryPoint);
	void Initialize();
	void OnClanTagUpdated(const class AGzCharacter* Character, const class FString& Param_ClanTag);
	void OnMatchmakingStatusChanged(class AGzCharacter* Character, bool bStatus);
	void OnMiscDataUpdated(const class AGzCharacter* Character, const struct FGzPartyMemberMiscData& Data);
	void OnPartyMembershipStateChanged(bool bState);
	void OnPlayerNameUpdated(const class AGzCharacter* Character);
	void OnSubscriptionStatusUpdated(const class AGzCharacter* Character, bool bHasOtgPro);
	void OnTalkingStateChanged(const class AGzCharacter* Character, bool bState);
	void OnVoiceChatStateChanged(const class AGzCharacter* Character, bool VoiceChatState);
	void SetMatchmakingStatus(bool bStatus);
	void SetMatchmakingStatusVisibility(bool bVisible);
	void SetSubscribtionStatus(bool bHasOtgPro);
	void SetTalkingStatusState(bool State);
	void SetVoiceChatState(bool NewState);
	void UpdateName();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LobbyUsername_C">();
	}
	static class UWBP_LobbyUsername_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LobbyUsername_C>();
	}
};
static_assert(alignof(UWBP_LobbyUsername_C) == 0x000008, "Wrong alignment on UWBP_LobbyUsername_C");
static_assert(sizeof(UWBP_LobbyUsername_C) == 0x000328, "Wrong size on UWBP_LobbyUsername_C");
static_assert(offsetof(UWBP_LobbyUsername_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_LobbyUsername_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyUsername_C, AccountLevel) == 0x0002E8, "Member 'UWBP_LobbyUsername_C::AccountLevel' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyUsername_C, MatchmakingStatus) == 0x0002F0, "Member 'UWBP_LobbyUsername_C::MatchmakingStatus' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyUsername_C, OtgPro) == 0x0002F8, "Member 'UWBP_LobbyUsername_C::OtgPro' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyUsername_C, Talking_Status) == 0x000300, "Member 'UWBP_LobbyUsername_C::Talking_Status' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyUsername_C, Username_Text) == 0x000308, "Member 'UWBP_LobbyUsername_C::Username_Text' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyUsername_C, OwnerComponent) == 0x000310, "Member 'UWBP_LobbyUsername_C::OwnerComponent' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyUsername_C, ClanTag) == 0x000318, "Member 'UWBP_LobbyUsername_C::ClanTag' has a wrong offset!");

}

