#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Death

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Death.WBP_Death_C
// 0x0080 (0x03C0 - 0x0340)
class UWBP_Death_C final : public UGzHUDComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_82;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialParameterCollection*           DeathScreenMPC;                                    // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MI;                                                // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterialInstance;                           // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentTime;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationState;                                    // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldAnimate;                                    // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_676A[0x3];                                     // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TextAnimState_0Minus1;                             // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IsStartDeathScreen;                                // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartDeathScreenAnimState;                         // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IsEndDeathScreen;                                  // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EndDeathScreenAnimState;                           // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IsNoticeMaskAnimStart;                             // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartNoticeMaskAnimState;                          // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EndNoticeMaskAnimState;                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimationStepMaxTime;                              // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Death(int32 EntryPoint);
	void GetAnimationTime(double* Time);
	void IncrementAndResetTime();
	void OnTagAdded_32009AEB4941CFA3A7EE8780347B9276(const struct FGameplayTag& Tag);
	void OnTagRemoved_32009AEB4941CFA3A7EE8780347B9276(const struct FGameplayTag& Tag);
	void PreConstruct(bool IsDesignTime);
	void ReceiveBindEvents(class APawn* NewViewTarget);
	void SetDefaultValues();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateAnimationState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Death_C">();
	}
	static class UWBP_Death_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Death_C>();
	}
};
static_assert(alignof(UWBP_Death_C) == 0x000008, "Wrong alignment on UWBP_Death_C");
static_assert(sizeof(UWBP_Death_C) == 0x0003C0, "Wrong size on UWBP_Death_C");
static_assert(offsetof(UWBP_Death_C, UberGraphFrame) == 0x000340, "Member 'UWBP_Death_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, Image_82) == 0x000348, "Member 'UWBP_Death_C::Image_82' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, DeathScreenMPC) == 0x000350, "Member 'UWBP_Death_C::DeathScreenMPC' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, MI) == 0x000358, "Member 'UWBP_Death_C::MI' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, DynamicMaterialInstance) == 0x000360, "Member 'UWBP_Death_C::DynamicMaterialInstance' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, CurrentTime) == 0x000368, "Member 'UWBP_Death_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, AnimationState) == 0x000370, "Member 'UWBP_Death_C::AnimationState' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, bShouldAnimate) == 0x000374, "Member 'UWBP_Death_C::bShouldAnimate' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, TextAnimState_0Minus1) == 0x000378, "Member 'UWBP_Death_C::TextAnimState_0Minus1' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, IsStartDeathScreen) == 0x000380, "Member 'UWBP_Death_C::IsStartDeathScreen' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, StartDeathScreenAnimState) == 0x000388, "Member 'UWBP_Death_C::StartDeathScreenAnimState' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, IsEndDeathScreen) == 0x000390, "Member 'UWBP_Death_C::IsEndDeathScreen' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, EndDeathScreenAnimState) == 0x000398, "Member 'UWBP_Death_C::EndDeathScreenAnimState' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, IsNoticeMaskAnimStart) == 0x0003A0, "Member 'UWBP_Death_C::IsNoticeMaskAnimStart' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, StartNoticeMaskAnimState) == 0x0003A8, "Member 'UWBP_Death_C::StartNoticeMaskAnimState' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, EndNoticeMaskAnimState) == 0x0003B0, "Member 'UWBP_Death_C::EndNoticeMaskAnimState' has a wrong offset!");
static_assert(offsetof(UWBP_Death_C, AnimationStepMaxTime) == 0x0003B8, "Member 'UWBP_Death_C::AnimationStepMaxTime' has a wrong offset!");

}

