#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapLegendEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_MapLegendEntry.WBP_MapLegendEntry_C.ExecuteUbergraph_WBP_MapLegendEntry
// 0x000C (0x000C - 0x0000)
struct WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry) == 0x000004, "Wrong alignment on WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry");
static_assert(sizeof(WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry) == 0x00000C, "Wrong size on WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry");
static_assert(offsetof(WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry, EntryPoint) == 0x000000, "Member 'WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry, Temp_bool_Variable) == 0x000004, "Member 'WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry, Temp_byte_Variable) == 0x000005, "Member 'WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry, K2Node_Event_IsDesignTime) == 0x000007, "Member 'WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry, K2Node_Select_Default) == 0x000008, "Member 'WBP_MapLegendEntry_C_ExecuteUbergraph_WBP_MapLegendEntry::K2Node_Select_Default' has a wrong offset!");

// Function WBP_MapLegendEntry.WBP_MapLegendEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_MapLegendEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapLegendEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_MapLegendEntry_C_PreConstruct");
static_assert(sizeof(WBP_MapLegendEntry_C_PreConstruct) == 0x000001, "Wrong size on WBP_MapLegendEntry_C_PreConstruct");
static_assert(offsetof(WBP_MapLegendEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_MapLegendEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

