#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BaseTooltip_Comparison

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_BaseTooltip_Comparison.WBP_BaseTooltip_Comparison_C.GetItemDataComparison
// 0x0008 (0x0008 - 0x0000)
struct WBP_BaseTooltip_Comparison_C_GetItemDataComparison final
{
public:
	class UGzItemData*                            Param_ItemData;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseTooltip_Comparison_C_GetItemDataComparison) == 0x000008, "Wrong alignment on WBP_BaseTooltip_Comparison_C_GetItemDataComparison");
static_assert(sizeof(WBP_BaseTooltip_Comparison_C_GetItemDataComparison) == 0x000008, "Wrong size on WBP_BaseTooltip_Comparison_C_GetItemDataComparison");
static_assert(offsetof(WBP_BaseTooltip_Comparison_C_GetItemDataComparison, Param_ItemData) == 0x000000, "Member 'WBP_BaseTooltip_Comparison_C_GetItemDataComparison::Param_ItemData' has a wrong offset!");

// Function WBP_BaseTooltip_Comparison.WBP_BaseTooltip_Comparison_C.SetItemDataComparison
// 0x0010 (0x0010 - 0x0000)
struct WBP_BaseTooltip_Comparison_C_SetItemDataComparison final
{
public:
	class UGzItemData*                            Param_ItemData;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreUpdate;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseTooltip_Comparison_C_SetItemDataComparison) == 0x000008, "Wrong alignment on WBP_BaseTooltip_Comparison_C_SetItemDataComparison");
static_assert(sizeof(WBP_BaseTooltip_Comparison_C_SetItemDataComparison) == 0x000010, "Wrong size on WBP_BaseTooltip_Comparison_C_SetItemDataComparison");
static_assert(offsetof(WBP_BaseTooltip_Comparison_C_SetItemDataComparison, Param_ItemData) == 0x000000, "Member 'WBP_BaseTooltip_Comparison_C_SetItemDataComparison::Param_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_BaseTooltip_Comparison_C_SetItemDataComparison, IgnoreUpdate) == 0x000008, "Member 'WBP_BaseTooltip_Comparison_C_SetItemDataComparison::IgnoreUpdate' has a wrong offset!");

}

