#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EscapeMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "G01_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EscapeMenu.WBP_EscapeMenu_C
// 0x0088 (0x05B0 - 0x0528)
class UWBP_EscapeMenu_C final : public UGzNavigationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBoundActionBar*                  ActionBar;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NavigationButton_C*                BackScoreboard;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ChallengeComponent_C*              WBP_ChallengeComponent;                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EscapeMenu_LeftVBox_C*             WBP_EscapeMenu_LeftVBox;                           // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scoreboard_DM_C*                   WBP_Scoreboard_DM;                                 // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScreenBackground_C*                WBP_ScreenBackground;                              // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SettingsMenu_C*                    WBP_SettingsMenu;                                  // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SquadScreen_C*                     WBP_SquadScreen;                                   // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              WidgetSwitcher;                                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSettingsResolved;                                // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FGameplayTagContainer                  PrematchTags;                                      // 0x0590(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool ShouldFlushInputOnOpening();
	void SaveSettings();
	void ResetToCurrentSettings();
	void ResetSettings();
	void OnSettingsResolved__DelegateSignature();
	void OnGameStateStageChanged();
	void OnCloseAction();
	void OnBackAction();
	void InitVideoSettingsChangedWarning(class UGzNavigationWidget* NavigationWidget);
	void InitSettingsChangedWarning(class UGzNavigationWidget* NavigationWidget);
	void ExecuteUbergraph_WBP_EscapeMenu(int32 EntryPoint);
	void Destruct();
	void Construct();
	void CloseAction();
	void BndEvt__WBP_EscapeMenu_BackScoreboard_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BackAction();
	void ApplySettings();
	void TryApplySettings();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EscapeMenu_C">();
	}
	static class UWBP_EscapeMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EscapeMenu_C>();
	}
};
static_assert(alignof(UWBP_EscapeMenu_C) == 0x000008, "Wrong alignment on UWBP_EscapeMenu_C");
static_assert(sizeof(UWBP_EscapeMenu_C) == 0x0005B0, "Wrong size on UWBP_EscapeMenu_C");
static_assert(offsetof(UWBP_EscapeMenu_C, UberGraphFrame) == 0x000528, "Member 'UWBP_EscapeMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EscapeMenu_C, ActionBar) == 0x000530, "Member 'UWBP_EscapeMenu_C::ActionBar' has a wrong offset!");
static_assert(offsetof(UWBP_EscapeMenu_C, BackgroundBlur) == 0x000538, "Member 'UWBP_EscapeMenu_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UWBP_EscapeMenu_C, BackScoreboard) == 0x000540, "Member 'UWBP_EscapeMenu_C::BackScoreboard' has a wrong offset!");
static_assert(offsetof(UWBP_EscapeMenu_C, WBP_ChallengeComponent) == 0x000548, "Member 'UWBP_EscapeMenu_C::WBP_ChallengeComponent' has a wrong offset!");
static_assert(offsetof(UWBP_EscapeMenu_C, WBP_EscapeMenu_LeftVBox) == 0x000550, "Member 'UWBP_EscapeMenu_C::WBP_EscapeMenu_LeftVBox' has a wrong offset!");
static_assert(offsetof(UWBP_EscapeMenu_C, WBP_Scoreboard_DM) == 0x000558, "Member 'UWBP_EscapeMenu_C::WBP_Scoreboard_DM' has a wrong offset!");
static_assert(offsetof(UWBP_EscapeMenu_C, WBP_ScreenBackground) == 0x000560, "Member 'UWBP_EscapeMenu_C::WBP_ScreenBackground' has a wrong offset!");
static_assert(offsetof(UWBP_EscapeMenu_C, WBP_SettingsMenu) == 0x000568, "Member 'UWBP_EscapeMenu_C::WBP_SettingsMenu' has a wrong offset!");
static_assert(offsetof(UWBP_EscapeMenu_C, WBP_SquadScreen) == 0x000570, "Member 'UWBP_EscapeMenu_C::WBP_SquadScreen' has a wrong offset!");
static_assert(offsetof(UWBP_EscapeMenu_C, WidgetSwitcher) == 0x000578, "Member 'UWBP_EscapeMenu_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_EscapeMenu_C, OnSettingsResolved) == 0x000580, "Member 'UWBP_EscapeMenu_C::OnSettingsResolved' has a wrong offset!");
static_assert(offsetof(UWBP_EscapeMenu_C, PrematchTags) == 0x000590, "Member 'UWBP_EscapeMenu_C::PrematchTags' has a wrong offset!");

}

