#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsMenu

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_SettingsMenu.WBP_SettingsMenu_C.TabSelected
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsMenu_C_TabSelected final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsMenu_C_TabSelected) == 0x000004, "Wrong alignment on WBP_SettingsMenu_C_TabSelected");
static_assert(sizeof(WBP_SettingsMenu_C_TabSelected) == 0x000008, "Wrong size on WBP_SettingsMenu_C_TabSelected");
static_assert(offsetof(WBP_SettingsMenu_C_TabSelected, TabId) == 0x000000, "Member 'WBP_SettingsMenu_C_TabSelected::TabId' has a wrong offset!");

// Function WBP_SettingsMenu.WBP_SettingsMenu_C.Init
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsMenu_C_Init final
{
public:
	class UWBP_EscapeMenu_C*                      Param_ParrentEscMenu;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsMenu_C_Init) == 0x000008, "Wrong alignment on WBP_SettingsMenu_C_Init");
static_assert(sizeof(WBP_SettingsMenu_C_Init) == 0x000008, "Wrong size on WBP_SettingsMenu_C_Init");
static_assert(offsetof(WBP_SettingsMenu_C_Init, Param_ParrentEscMenu) == 0x000000, "Member 'WBP_SettingsMenu_C_Init::Param_ParrentEscMenu' has a wrong offset!");

// Function WBP_SettingsMenu.WBP_SettingsMenu_C.FocusList
// 0x0018 (0x0018 - 0x0000)
struct WBP_SettingsMenu_C_FocusList final
{
public:
	class UWBP_SettingsPanel_C*                   K2Node_DynamicCast_AsWBP_Settings_Panel;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60B3[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingListView*                   CallFunc_GetListView_Settings_List;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsMenu_C_FocusList) == 0x000008, "Wrong alignment on WBP_SettingsMenu_C_FocusList");
static_assert(sizeof(WBP_SettingsMenu_C_FocusList) == 0x000018, "Wrong size on WBP_SettingsMenu_C_FocusList");
static_assert(offsetof(WBP_SettingsMenu_C_FocusList, K2Node_DynamicCast_AsWBP_Settings_Panel) == 0x000000, "Member 'WBP_SettingsMenu_C_FocusList::K2Node_DynamicCast_AsWBP_Settings_Panel' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_FocusList, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'WBP_SettingsMenu_C_FocusList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_FocusList, CallFunc_GetListView_Settings_List) == 0x000010, "Member 'WBP_SettingsMenu_C_FocusList::CallFunc_GetListView_Settings_List' has a wrong offset!");

// Function WBP_SettingsMenu.WBP_SettingsMenu_C.FocusFirstItem
// 0x0038 (0x0038 - 0x0000)
struct WBP_SettingsMenu_C_FocusFirstItem final
{
public:
	class UWBP_SettingsPanel_C*                   K2Node_DynamicCast_AsWBP_Settings_Panel;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60B4[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingListView*                   CallFunc_GetListView_Settings_List;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsMenu_C_FocusFirstItem) == 0x000008, "Wrong alignment on WBP_SettingsMenu_C_FocusFirstItem");
static_assert(sizeof(WBP_SettingsMenu_C_FocusFirstItem) == 0x000038, "Wrong size on WBP_SettingsMenu_C_FocusFirstItem");
static_assert(offsetof(WBP_SettingsMenu_C_FocusFirstItem, K2Node_DynamicCast_AsWBP_Settings_Panel) == 0x000000, "Member 'WBP_SettingsMenu_C_FocusFirstItem::K2Node_DynamicCast_AsWBP_Settings_Panel' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_FocusFirstItem, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'WBP_SettingsMenu_C_FocusFirstItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_FocusFirstItem, CallFunc_GetListView_Settings_List) == 0x000010, "Member 'WBP_SettingsMenu_C_FocusFirstItem::CallFunc_GetListView_Settings_List' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_FocusFirstItem, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x000018, "Member 'WBP_SettingsMenu_C_FocusFirstItem::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_FocusFirstItem, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_SettingsMenu_C_FocusFirstItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_FocusFirstItem, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_SettingsMenu_C_FocusFirstItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_SettingsMenu.WBP_SettingsMenu_C.ExecuteUbergraph_WBP_SettingsMenu
// 0x0260 (0x0260 - 0x0000)
struct WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName TabId)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGzInputActionMappingChange>    K2Node_Event_InputActionMappingChanges;            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	struct FGzInputActionMappingChange            CallFunc_Array_Get_Item;                           // 0x0030(0x0048)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60B5[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetKeyBrush_OutBrush;                     // 0x0080(0x00D0)()
	bool                                          CallFunc_GetKeyBrush_ReturnValue;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsValid_ReturnValue;                  // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60B6[0x5];                                     // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0158(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01A0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01F8(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0208(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60B7[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0220(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60B8[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_EscapeMenu_C*                      K2Node_CustomEvent_ParrentEscMenu;                 // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_TabId;                          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsPanel_C*                   K2Node_DynamicCast_AsWBP_Settings_Panel;           // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60B9[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingListView*                   CallFunc_GetListView_Settings_List;                // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu) == 0x000010, "Wrong alignment on WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu");
static_assert(sizeof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu) == 0x000260, "Wrong size on WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, EntryPoint) == 0x000000, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, K2Node_Event_InputActionMappingChanges) == 0x000020, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::K2Node_Event_InputActionMappingChanges' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_GetKeyBrush_OutBrush) == 0x000080, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_GetKeyBrush_OutBrush' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_GetKeyBrush_ReturnValue) == 0x000150, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_GetKeyBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_Key_IsValid_ReturnValue) == 0x000151, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_Key_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000152, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, K2Node_MakeStruct_FormatArgumentData) == 0x000158, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001A0, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, K2Node_MakeArray_Array) == 0x0001E8, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_Format_ReturnValue) == 0x0001F8, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000208, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_TextIsEmpty_ReturnValue) == 0x000218, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000220, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_Not_PreBool_ReturnValue_1) == 0x000228, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000229, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_Not_PreBool_ReturnValue_2) == 0x00022A, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_BooleanAND_ReturnValue) == 0x00022B, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, K2Node_CustomEvent_ParrentEscMenu) == 0x000230, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::K2Node_CustomEvent_ParrentEscMenu' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, K2Node_CustomEvent_TabId) == 0x000238, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::K2Node_CustomEvent_TabId' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, K2Node_DynamicCast_AsWBP_Settings_Panel) == 0x000240, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::K2Node_DynamicCast_AsWBP_Settings_Panel' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, K2Node_DynamicCast_bSuccess) == 0x000248, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu, CallFunc_GetListView_Settings_List) == 0x000250, "Member 'WBP_SettingsMenu_C_ExecuteUbergraph_WBP_SettingsMenu::CallFunc_GetListView_Settings_List' has a wrong offset!");

// Function WBP_SettingsMenu.WBP_SettingsMenu_C.AddMappingUpdateNotification
// 0x0010 (0x0010 - 0x0000)
struct WBP_SettingsMenu_C_AddMappingUpdateNotification final
{
public:
	TArray<struct FGzInputActionMappingChange>    InputActionMappingChanges;                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SettingsMenu_C_AddMappingUpdateNotification) == 0x000008, "Wrong alignment on WBP_SettingsMenu_C_AddMappingUpdateNotification");
static_assert(sizeof(WBP_SettingsMenu_C_AddMappingUpdateNotification) == 0x000010, "Wrong size on WBP_SettingsMenu_C_AddMappingUpdateNotification");
static_assert(offsetof(WBP_SettingsMenu_C_AddMappingUpdateNotification, InputActionMappingChanges) == 0x000000, "Member 'WBP_SettingsMenu_C_AddMappingUpdateNotification::InputActionMappingChanges' has a wrong offset!");

// Function WBP_SettingsMenu.WBP_SettingsMenu_C.BP_GetDesiredFocusTarget
// 0x0038 (0x0038 - 0x0000)
struct WBP_SettingsMenu_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsPanel_C*                   K2Node_DynamicCast_AsWBP_Settings_Panel;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60BA[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingListView*                   CallFunc_GetListView_Settings_List;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0020(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsMenu_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_SettingsMenu_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_SettingsMenu_C_BP_GetDesiredFocusTarget) == 0x000038, "Wrong size on WBP_SettingsMenu_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_SettingsMenu_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_SettingsMenu_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_AsWBP_Settings_Panel) == 0x000008, "Member 'WBP_SettingsMenu_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_AsWBP_Settings_Panel' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_SettingsMenu_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_BP_GetDesiredFocusTarget, CallFunc_GetListView_Settings_List) == 0x000018, "Member 'WBP_SettingsMenu_C_BP_GetDesiredFocusTarget::CallFunc_GetListView_Settings_List' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_BP_GetDesiredFocusTarget, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x000020, "Member 'WBP_SettingsMenu_C_BP_GetDesiredFocusTarget::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenu_C_BP_GetDesiredFocusTarget, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_SettingsMenu_C_BP_GetDesiredFocusTarget::CallFunc_Array_Get_Item' has a wrong offset!");

}

