#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSelection_PlayerCurrency

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoadoutSelection_PlayerCurrency.WBP_LoadoutSelection_PlayerCurrency_C
// 0x0020 (0x0400 - 0x03E0)
class UWBP_LoadoutSelection_PlayerCurrency_C final : public UGzLoadoutSlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CurrencyIcon_1_Image;                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CurrencyOwned_HorizontalBox;                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           CurrencyOwned_Text;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency(int32 EntryPoint);
	void OnLoadoutSlotReady_BP(const struct FGzLoadoutSelectionInitializeData& LoadoutInitializeData);
	void OnUpdateInventory();
	void SetCurrencyIcons();
	void Show();
	void UpdatePlayerCurrency(class AGzCharacter* Character);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoadoutSelection_PlayerCurrency_C">();
	}
	static class UWBP_LoadoutSelection_PlayerCurrency_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoadoutSelection_PlayerCurrency_C>();
	}
};
static_assert(alignof(UWBP_LoadoutSelection_PlayerCurrency_C) == 0x000008, "Wrong alignment on UWBP_LoadoutSelection_PlayerCurrency_C");
static_assert(sizeof(UWBP_LoadoutSelection_PlayerCurrency_C) == 0x000400, "Wrong size on UWBP_LoadoutSelection_PlayerCurrency_C");
static_assert(offsetof(UWBP_LoadoutSelection_PlayerCurrency_C, UberGraphFrame) == 0x0003E0, "Member 'UWBP_LoadoutSelection_PlayerCurrency_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_PlayerCurrency_C, CurrencyIcon_1_Image) == 0x0003E8, "Member 'UWBP_LoadoutSelection_PlayerCurrency_C::CurrencyIcon_1_Image' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_PlayerCurrency_C, CurrencyOwned_HorizontalBox) == 0x0003F0, "Member 'UWBP_LoadoutSelection_PlayerCurrency_C::CurrencyOwned_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_PlayerCurrency_C, CurrencyOwned_Text) == 0x0003F8, "Member 'UWBP_LoadoutSelection_PlayerCurrency_C::CurrencyOwned_Text' has a wrong offset!");

}

