#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CyberlimbsPanel_DOS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CyberlimbsPanel_DOS.WBP_CyberlimbsPanel_DOS_C
// 0x0070 (0x03B0 - 0x0340)
class UWBP_CyberlimbsPanel_DOS_C final : public UGzHUDComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CollapsedDamageTaken;                              // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         Cyberlimbs_HorizontalBox;                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CyberlimbsPanel_Limb_DOS_C*        WBP_CharacterPanel_Limb_LeftArm;                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CyberlimbsPanel_Limb_DOS_C*        WBP_CharacterPanel_Limb_Legs;                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CyberlimbsPanel_Limb_DOS_C*        WBP_CharacterPanel_Limb_RightArm;                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTag                           KnockdownTag;                                      // 0x0370(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           AttributeAsyncTask;                                // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    JetpackAsyncTask;                                  // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBlocked;                                         // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C56[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Tags;                                              // 0x0390(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BlockedTagChange(bool bLocked);
	void DamageReceiveVisibilityCheck(class AActor* Damager, EGzDamageIndicatorType Type, float Damage, bool bCrit);
	void ExecuteUbergraph_WBP_CyberlimbsPanel_DOS(int32 EntryPoint);
	void OnKnockdownStateChanged(bool bBecomeKnocked);
	void ReceiveBindEvents(class APawn* NewViewTarget);
	void ReceiveUnbindEvents(class APawn* OldViewTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CyberlimbsPanel_DOS_C">();
	}
	static class UWBP_CyberlimbsPanel_DOS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CyberlimbsPanel_DOS_C>();
	}
};
static_assert(alignof(UWBP_CyberlimbsPanel_DOS_C) == 0x000008, "Wrong alignment on UWBP_CyberlimbsPanel_DOS_C");
static_assert(sizeof(UWBP_CyberlimbsPanel_DOS_C) == 0x0003B0, "Wrong size on UWBP_CyberlimbsPanel_DOS_C");
static_assert(offsetof(UWBP_CyberlimbsPanel_DOS_C, UberGraphFrame) == 0x000340, "Member 'UWBP_CyberlimbsPanel_DOS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CyberlimbsPanel_DOS_C, CollapsedDamageTaken) == 0x000348, "Member 'UWBP_CyberlimbsPanel_DOS_C::CollapsedDamageTaken' has a wrong offset!");
static_assert(offsetof(UWBP_CyberlimbsPanel_DOS_C, Cyberlimbs_HorizontalBox) == 0x000350, "Member 'UWBP_CyberlimbsPanel_DOS_C::Cyberlimbs_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_CyberlimbsPanel_DOS_C, WBP_CharacterPanel_Limb_LeftArm) == 0x000358, "Member 'UWBP_CyberlimbsPanel_DOS_C::WBP_CharacterPanel_Limb_LeftArm' has a wrong offset!");
static_assert(offsetof(UWBP_CyberlimbsPanel_DOS_C, WBP_CharacterPanel_Limb_Legs) == 0x000360, "Member 'UWBP_CyberlimbsPanel_DOS_C::WBP_CharacterPanel_Limb_Legs' has a wrong offset!");
static_assert(offsetof(UWBP_CyberlimbsPanel_DOS_C, WBP_CharacterPanel_Limb_RightArm) == 0x000368, "Member 'UWBP_CyberlimbsPanel_DOS_C::WBP_CharacterPanel_Limb_RightArm' has a wrong offset!");
static_assert(offsetof(UWBP_CyberlimbsPanel_DOS_C, KnockdownTag) == 0x000370, "Member 'UWBP_CyberlimbsPanel_DOS_C::KnockdownTag' has a wrong offset!");
static_assert(offsetof(UWBP_CyberlimbsPanel_DOS_C, AttributeAsyncTask) == 0x000378, "Member 'UWBP_CyberlimbsPanel_DOS_C::AttributeAsyncTask' has a wrong offset!");
static_assert(offsetof(UWBP_CyberlimbsPanel_DOS_C, JetpackAsyncTask) == 0x000380, "Member 'UWBP_CyberlimbsPanel_DOS_C::JetpackAsyncTask' has a wrong offset!");
static_assert(offsetof(UWBP_CyberlimbsPanel_DOS_C, IsBlocked) == 0x000388, "Member 'UWBP_CyberlimbsPanel_DOS_C::IsBlocked' has a wrong offset!");
static_assert(offsetof(UWBP_CyberlimbsPanel_DOS_C, Tags) == 0x000390, "Member 'UWBP_CyberlimbsPanel_DOS_C::Tags' has a wrong offset!");

}

