#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoiceChatUIState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EVoiceChatUIState_structs.hpp"
#include "G01_structs.hpp"
#include "FVoiceChatUIStateData_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_VoiceChatUIState.WBP_VoiceChatUIState_C.BindEvents
// 0x0040 (0x0040 - 0x0000)
struct WBP_VoiceChatUIState_C_BindEvents final
{
public:
	TDelegate<void(const class FString& ProductUserId, bool bIsBlocked)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& PlayFabId, bool bIsMuted)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& PlayFabId, bool bTalkingState)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzVoiceChatBlueprintEventsComponent*   CallFunc_GetVoiceChatEvents_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatUIState_C_BindEvents) == 0x000008, "Wrong alignment on WBP_VoiceChatUIState_C_BindEvents");
static_assert(sizeof(WBP_VoiceChatUIState_C_BindEvents) == 0x000040, "Wrong size on WBP_VoiceChatUIState_C_BindEvents");
static_assert(offsetof(WBP_VoiceChatUIState_C_BindEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_VoiceChatUIState_C_BindEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_BindEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_VoiceChatUIState_C_BindEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_BindEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'WBP_VoiceChatUIState_C_BindEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_BindEvents, CallFunc_GetVoiceChatEvents_ReturnValue) == 0x000030, "Member 'WBP_VoiceChatUIState_C_BindEvents::CallFunc_GetVoiceChatEvents_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_BindEvents, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_VoiceChatUIState_C_BindEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_VoiceChatUIState.WBP_VoiceChatUIState_C.ExecuteUbergraph_WBP_VoiceChatUIState
// 0x0020 (0x0020 - 0x0000)
struct WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB2[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState) == 0x000008, "Wrong alignment on WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState");
static_assert(sizeof(WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState) == 0x000020, "Wrong size on WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState");
static_assert(offsetof(WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState, EntryPoint) == 0x000000, "Member 'WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState, CallFunc_BreakVector2D_X) == 0x000008, "Member 'WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000018, "Member 'WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00001C, "Member 'WBP_VoiceChatUIState_C_ExecuteUbergraph_WBP_VoiceChatUIState::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function WBP_VoiceChatUIState.WBP_VoiceChatUIState_C.IsVoiceChatDisabled
// 0x0018 (0x0018 - 0x0000)
struct WBP_VoiceChatUIState_C_IsVoiceChatDisabled final
{
public:
	bool                                          Disabled;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzGameUserSettings*                    CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzVoiceChatState                             CallFunc_GetVoiceChatState_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatUIState_C_IsVoiceChatDisabled) == 0x000008, "Wrong alignment on WBP_VoiceChatUIState_C_IsVoiceChatDisabled");
static_assert(sizeof(WBP_VoiceChatUIState_C_IsVoiceChatDisabled) == 0x000018, "Wrong size on WBP_VoiceChatUIState_C_IsVoiceChatDisabled");
static_assert(offsetof(WBP_VoiceChatUIState_C_IsVoiceChatDisabled, Disabled) == 0x000000, "Member 'WBP_VoiceChatUIState_C_IsVoiceChatDisabled::Disabled' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_IsVoiceChatDisabled, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'WBP_VoiceChatUIState_C_IsVoiceChatDisabled::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_IsVoiceChatDisabled, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_VoiceChatUIState_C_IsVoiceChatDisabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_IsVoiceChatDisabled, CallFunc_GetVoiceChatState_ReturnValue) == 0x000011, "Member 'WBP_VoiceChatUIState_C_IsVoiceChatDisabled::CallFunc_GetVoiceChatState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_IsVoiceChatDisabled, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'WBP_VoiceChatUIState_C_IsVoiceChatDisabled::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_VoiceChatUIState.WBP_VoiceChatUIState_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_VoiceChatUIState_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatUIState_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_VoiceChatUIState_C_PreConstruct");
static_assert(sizeof(WBP_VoiceChatUIState_C_PreConstruct) == 0x000001, "Wrong size on WBP_VoiceChatUIState_C_PreConstruct");
static_assert(offsetof(WBP_VoiceChatUIState_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_VoiceChatUIState_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_VoiceChatUIState.WBP_VoiceChatUIState_C.SetPlayerState
// 0x0010 (0x0010 - 0x0000)
struct WBP_VoiceChatUIState_C_SetPlayerState final
{
public:
	class AGzPlayerState*                         Param_AssignedPlayerState;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatUIState_C_SetPlayerState) == 0x000008, "Wrong alignment on WBP_VoiceChatUIState_C_SetPlayerState");
static_assert(sizeof(WBP_VoiceChatUIState_C_SetPlayerState) == 0x000010, "Wrong size on WBP_VoiceChatUIState_C_SetPlayerState");
static_assert(offsetof(WBP_VoiceChatUIState_C_SetPlayerState, Param_AssignedPlayerState) == 0x000000, "Member 'WBP_VoiceChatUIState_C_SetPlayerState::Param_AssignedPlayerState' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_SetPlayerState, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_VoiceChatUIState_C_SetPlayerState::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_VoiceChatUIState.WBP_VoiceChatUIState_C.SetState
// 0x0002 (0x0002 - 0x0000)
struct WBP_VoiceChatUIState_C_SetState final
{
public:
	EVoiceChatUIState                             VoiceChatState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatUIState_C_SetState) == 0x000001, "Wrong alignment on WBP_VoiceChatUIState_C_SetState");
static_assert(sizeof(WBP_VoiceChatUIState_C_SetState) == 0x000002, "Wrong size on WBP_VoiceChatUIState_C_SetState");
static_assert(offsetof(WBP_VoiceChatUIState_C_SetState, VoiceChatState) == 0x000000, "Member 'WBP_VoiceChatUIState_C_SetState::VoiceChatState' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_SetState, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_VoiceChatUIState_C_SetState::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_VoiceChatUIState.WBP_VoiceChatUIState_C.UnbindEvents
// 0x0040 (0x0040 - 0x0000)
struct WBP_VoiceChatUIState_C_UnbindEvents final
{
public:
	TDelegate<void(const class FString& ProductUserId, bool bIsBlocked)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& PlayFabId, bool bIsMuted)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& PlayFabId, bool bTalkingState)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzVoiceChatBlueprintEventsComponent*   CallFunc_GetVoiceChatEvents_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatUIState_C_UnbindEvents) == 0x000008, "Wrong alignment on WBP_VoiceChatUIState_C_UnbindEvents");
static_assert(sizeof(WBP_VoiceChatUIState_C_UnbindEvents) == 0x000040, "Wrong size on WBP_VoiceChatUIState_C_UnbindEvents");
static_assert(offsetof(WBP_VoiceChatUIState_C_UnbindEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_VoiceChatUIState_C_UnbindEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UnbindEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_VoiceChatUIState_C_UnbindEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UnbindEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'WBP_VoiceChatUIState_C_UnbindEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UnbindEvents, CallFunc_GetVoiceChatEvents_ReturnValue) == 0x000030, "Member 'WBP_VoiceChatUIState_C_UnbindEvents::CallFunc_GetVoiceChatEvents_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UnbindEvents, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_VoiceChatUIState_C_UnbindEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_VoiceChatUIState.WBP_VoiceChatUIState_C.UpdateVisuals
// 0x0090 (0x0090 - 0x0000)
struct WBP_VoiceChatUIState_C_UpdateVisuals final
{
public:
	bool                                          HasValidState;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFVoiceChatUIStateData                 State;                                             // 0x0008(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB5[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB6[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB7[0x1];                                     // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFVoiceChatUIStateData                 CallFunc_Map_Find_Value;                           // 0x0060(0x0018)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB8[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatUIState_C_UpdateVisuals) == 0x000008, "Wrong alignment on WBP_VoiceChatUIState_C_UpdateVisuals");
static_assert(sizeof(WBP_VoiceChatUIState_C_UpdateVisuals) == 0x000090, "Wrong size on WBP_VoiceChatUIState_C_UpdateVisuals");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, HasValidState) == 0x000000, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::HasValidState' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, State) == 0x000008, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::State' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, Temp_byte_Variable) == 0x000020, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, CallFunc_GetEndTime_ReturnValue) == 0x000024, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, CallFunc_SafeDivide_ReturnValue) == 0x000028, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000030, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, CallFunc_FTrunc_ReturnValue) == 0x000034, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, Temp_byte_Variable_1) == 0x000058, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000059, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, Temp_bool_Variable) == 0x00005A, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, CallFunc_SelectInt_ReturnValue) == 0x00005C, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, CallFunc_Map_Find_Value) == 0x000060, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, CallFunc_Map_Find_ReturnValue) == 0x000078, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, K2Node_Select_Default) == 0x000079, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, CallFunc_SafeDivide_A_ImplicitCast) == 0x000080, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::CallFunc_SafeDivide_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVisuals, CallFunc_SafeDivide_B_ImplicitCast) == 0x000088, "Member 'WBP_VoiceChatUIState_C_UpdateVisuals::CallFunc_SafeDivide_B_ImplicitCast' has a wrong offset!");

// Function WBP_VoiceChatUIState.WBP_VoiceChatUIState_C.UpdateVoiceChatEnabled
// 0x0030 (0x0030 - 0x0000)
struct WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled final
{
public:
	class FString                                 PlayFabId;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bIsMuted;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoiceChatUIState                             Temp_byte_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoiceChatUIState                             Temp_byte_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoiceChatUIState                             K2Node_Select_Default;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB9[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEpicProductUserId_ReturnValue;         // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled) == 0x000008, "Wrong alignment on WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled");
static_assert(sizeof(WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled) == 0x000030, "Wrong size on WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled, PlayFabId) == 0x000000, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled::PlayFabId' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled, bIsMuted) == 0x000010, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled::bIsMuted' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled, Temp_bool_Variable) == 0x000011, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled, Temp_byte_Variable) == 0x000012, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled, Temp_byte_Variable_1) == 0x000013, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled, K2Node_Select_Default) == 0x000015, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled, CallFunc_GetEpicProductUserId_ReturnValue) == 0x000018, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled::CallFunc_GetEpicProductUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000028, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatEnabled::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function WBP_VoiceChatUIState.WBP_VoiceChatUIState_C.UpdateVoiceChatMuted
// 0x0030 (0x0030 - 0x0000)
struct WBP_VoiceChatUIState_C_UpdateVoiceChatMuted final
{
public:
	class FString                                 PlayFabId;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bIsMuted;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DBA[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEpicProductUserId_ReturnValue;         // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoiceChatUIState                             Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoiceChatUIState                             K2Node_Select_Default;                             // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatUIState_C_UpdateVoiceChatMuted) == 0x000008, "Wrong alignment on WBP_VoiceChatUIState_C_UpdateVoiceChatMuted");
static_assert(sizeof(WBP_VoiceChatUIState_C_UpdateVoiceChatMuted) == 0x000030, "Wrong size on WBP_VoiceChatUIState_C_UpdateVoiceChatMuted");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatMuted, PlayFabId) == 0x000000, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatMuted::PlayFabId' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatMuted, bIsMuted) == 0x000010, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatMuted::bIsMuted' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatMuted, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatMuted::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatMuted, CallFunc_GetEpicProductUserId_ReturnValue) == 0x000018, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatMuted::CallFunc_GetEpicProductUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatMuted, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000028, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatMuted::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatMuted, Temp_byte_Variable) == 0x000029, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatMuted::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatMuted, Temp_bool_Variable) == 0x00002A, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatMuted::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatMuted, K2Node_Select_Default) == 0x00002B, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatMuted::K2Node_Select_Default' has a wrong offset!");

// Function WBP_VoiceChatUIState.WBP_VoiceChatUIState_C.UpdateVoiceChatTalking
// 0x0030 (0x0030 - 0x0000)
struct WBP_VoiceChatUIState_C_UpdateVoiceChatTalking final
{
public:
	class FString                                 EpicProductUserId;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bTalkingState;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoiceChatUIState                             Temp_byte_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoiceChatUIState                             Temp_byte_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoiceChatUIState                             K2Node_Select_Default;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DBB[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEpicProductUserId_ReturnValue;         // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatUIState_C_UpdateVoiceChatTalking) == 0x000008, "Wrong alignment on WBP_VoiceChatUIState_C_UpdateVoiceChatTalking");
static_assert(sizeof(WBP_VoiceChatUIState_C_UpdateVoiceChatTalking) == 0x000030, "Wrong size on WBP_VoiceChatUIState_C_UpdateVoiceChatTalking");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatTalking, EpicProductUserId) == 0x000000, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatTalking::EpicProductUserId' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatTalking, bTalkingState) == 0x000010, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatTalking::bTalkingState' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatUIState_C_UpdateVoiceChatTalking, Temp_bool_Variable) == 0x000011, "Member 'WBP_VoiceChatUIState_C_UpdateVoiceChatTalking::Temp_bool_Variable' has a wrong offset!");
