#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Vehicle_Seat

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Vehicle_Seat.WBP_Vehicle_Seat_C
// 0x0510 (0x07F0 - 0x02E0)
class UWBP_Vehicle_Seat_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Seat_Image;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            Brush_Enemy;                                       // 0x02F0(0x00D0)(Edit, BlueprintVisible)
	struct FSlateBrush                            Brush_Unoccupied;                                  // 0x03C0(0x00D0)(Edit, BlueprintVisible)
	struct FSlateBrush                            Brush_Friendly;                                    // 0x0490(0x00D0)(Edit, BlueprintVisible)
	bool                                          Occupied;                                          // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalPlayer;                                       // 0x0561(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42DA[0xE];                                     // 0x0562(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Brush_Self;                                        // 0x0570(0x00D0)(Edit, BlueprintVisible)
	ETeamAttitude                                 Team_Atitude;                                      // 0x0640(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42DB[0xF];                                     // 0x0641(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Brush_Friendly_NPC;                                // 0x0650(0x00D0)(Edit, BlueprintVisible)
	struct FSlateBrush                            Brush_Enemy_NPC;                                   // 0x0720(0x00D0)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WBP_Vehicle_Seat(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetSeatOccupied(bool Param_Occupied, bool Param_LocalPlayer, ETeamAttitude TeamAtitude, bool IsNPC);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Vehicle_Seat_C">();
	}
	static class UWBP_Vehicle_Seat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Vehicle_Seat_C>();
	}
};
static_assert(alignof(UWBP_Vehicle_Seat_C) == 0x000010, "Wrong alignment on UWBP_Vehicle_Seat_C");
static_assert(sizeof(UWBP_Vehicle_Seat_C) == 0x0007F0, "Wrong size on UWBP_Vehicle_Seat_C");
static_assert(offsetof(UWBP_Vehicle_Seat_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Vehicle_Seat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_Seat_C, Seat_Image) == 0x0002E8, "Member 'UWBP_Vehicle_Seat_C::Seat_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_Seat_C, Brush_Enemy) == 0x0002F0, "Member 'UWBP_Vehicle_Seat_C::Brush_Enemy' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_Seat_C, Brush_Unoccupied) == 0x0003C0, "Member 'UWBP_Vehicle_Seat_C::Brush_Unoccupied' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_Seat_C, Brush_Friendly) == 0x000490, "Member 'UWBP_Vehicle_Seat_C::Brush_Friendly' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_Seat_C, Occupied) == 0x000560, "Member 'UWBP_Vehicle_Seat_C::Occupied' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_Seat_C, LocalPlayer) == 0x000561, "Member 'UWBP_Vehicle_Seat_C::LocalPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_Seat_C, Brush_Self) == 0x000570, "Member 'UWBP_Vehicle_Seat_C::Brush_Self' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_Seat_C, Team_Atitude) == 0x000640, "Member 'UWBP_Vehicle_Seat_C::Team_Atitude' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_Seat_C, Brush_Friendly_NPC) == 0x000650, "Member 'UWBP_Vehicle_Seat_C::Brush_Friendly_NPC' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_Seat_C, Brush_Enemy_NPC) == 0x000720, "Member 'UWBP_Vehicle_Seat_C::Brush_Enemy_NPC' has a wrong offset!");

}

