#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HEX_Menu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HEX_Menu.WBP_HEX_Menu_C
// 0x00F8 (0x0660 - 0x0568)
class UWBP_HEX_Menu_C final : public UGzHexExtractorMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBoundActionBar*                  ActionBar;                                         // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Image;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NavigationButton_C*                CancelButton;                                      // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Cash_HorizontalBox;                                // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Content_WidgetSwitcher;                            // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Currency_Image;                                    // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Event_HorizontalBox;                               // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           ExtractionPercentage_Text;                         // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ExtractionProgress_ProgressBar;                    // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           ExtractionTime_Text;                               // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hex_Image;                                         // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           HexAmount_Text;                                    // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           HexDiscountTime;                                   // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             HexList_ScrollBox;                                 // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           HEXName_Text;                                      // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NotEnoughMoney_Overlay;                            // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           PlayerCurrency_Text;                               // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HEX_PriceList_C*                   WBP_HEX_ExtractionPrices_1;                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NavigationButton_C*                WBP_NavigationButton;                              // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScreenBackground_C*                WBP_ScreenBackground;                              // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzSessionGameModeSettings*             GameModeSettings;                                  // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_HEX_Extractor_C*                    HexExtractorBP;                                    // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ExtractingTimeTotal;                               // 0x0620(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CE1[0x4];                                     // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzItemData*                            ExtractingHex;                                     // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_HEX_Button_C*>              HexButtons;                                        // 0x0630(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          XrGameMode;                                        // 0x0640(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CE2[0x7];                                     // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           EventTimeTimer;                                    // 0x0648(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          EventActive;                                       // 0x0650(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CE3[0x7];                                     // 0x0651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentEventExpireTime;                            // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateProgress();
	void UpdateEventTime();
	void UpdateCancelButton();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void StartExtraction(class UCommonButtonBase* Button);
	void SetTime(double Time);
	void SetExtractingMode(class UGzItemData* HexData);
	void SetContentHex(class UGzItemData* HexData);
	void SetCashQuantity();
	void Init(class AGzItemExtractor* InHexExtractor);
	void ExecuteUbergraph_WBP_HEX_Menu(int32 EntryPoint);
	void EventCheck();
	void Destruct();
	void CreateHexButtons();
	void CollapseProgretionElements();
	void ButtonUnhover(class UCommonButtonBase* Button);
	void ButtonHover(class UCommonButtonBase* Button);
	void BndEvt__WBP_HEX_Menu_Figma_WBP_NavigationButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_HEX_Menu_Figma_CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Allocate_Button_by_Rarity(class UWBP_HEX_Button_C* NewButton);
	void RemoveWidget();
	void OnInitialized();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnEventNotificationStageDelegat(class FName NotificationID, EGzNotificationStageType StageType, const struct FGzEventNotificationData& NotificationData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HEX_Menu_C">();
	}
	static class UWBP_HEX_Menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HEX_Menu_C>();
	}
};
static_assert(alignof(UWBP_HEX_Menu_C) == 0x000008, "Wrong alignment on UWBP_HEX_Menu_C");
static_assert(sizeof(UWBP_HEX_Menu_C) == 0x000660, "Wrong size on UWBP_HEX_Menu_C");
static_assert(offsetof(UWBP_HEX_Menu_C, UberGraphFrame) == 0x000568, "Member 'UWBP_HEX_Menu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, ActionBar) == 0x000570, "Member 'UWBP_HEX_Menu_C::ActionBar' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, Background_Image) == 0x000578, "Member 'UWBP_HEX_Menu_C::Background_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, CancelButton) == 0x000580, "Member 'UWBP_HEX_Menu_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, Cash_HorizontalBox) == 0x000588, "Member 'UWBP_HEX_Menu_C::Cash_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, Content_WidgetSwitcher) == 0x000590, "Member 'UWBP_HEX_Menu_C::Content_WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, Currency_Image) == 0x000598, "Member 'UWBP_HEX_Menu_C::Currency_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, Event_HorizontalBox) == 0x0005A0, "Member 'UWBP_HEX_Menu_C::Event_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, ExtractionPercentage_Text) == 0x0005A8, "Member 'UWBP_HEX_Menu_C::ExtractionPercentage_Text' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, ExtractionProgress_ProgressBar) == 0x0005B0, "Member 'UWBP_HEX_Menu_C::ExtractionProgress_ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, ExtractionTime_Text) == 0x0005B8, "Member 'UWBP_HEX_Menu_C::ExtractionTime_Text' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, Hex_Image) == 0x0005C0, "Member 'UWBP_HEX_Menu_C::Hex_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, HexAmount_Text) == 0x0005C8, "Member 'UWBP_HEX_Menu_C::HexAmount_Text' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, HexDiscountTime) == 0x0005D0, "Member 'UWBP_HEX_Menu_C::HexDiscountTime' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, HexList_ScrollBox) == 0x0005D8, "Member 'UWBP_HEX_Menu_C::HexList_ScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, HEXName_Text) == 0x0005E0, "Member 'UWBP_HEX_Menu_C::HEXName_Text' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, NotEnoughMoney_Overlay) == 0x0005E8, "Member 'UWBP_HEX_Menu_C::NotEnoughMoney_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, PlayerCurrency_Text) == 0x0005F0, "Member 'UWBP_HEX_Menu_C::PlayerCurrency_Text' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, WBP_HEX_ExtractionPrices_1) == 0x0005F8, "Member 'UWBP_HEX_Menu_C::WBP_HEX_ExtractionPrices_1' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, WBP_NavigationButton) == 0x000600, "Member 'UWBP_HEX_Menu_C::WBP_NavigationButton' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, WBP_ScreenBackground) == 0x000608, "Member 'UWBP_HEX_Menu_C::WBP_ScreenBackground' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, GameModeSettings) == 0x000610, "Member 'UWBP_HEX_Menu_C::GameModeSettings' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, HexExtractorBP) == 0x000618, "Member 'UWBP_HEX_Menu_C::HexExtractorBP' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, ExtractingTimeTotal) == 0x000620, "Member 'UWBP_HEX_Menu_C::ExtractingTimeTotal' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, ExtractingHex) == 0x000628, "Member 'UWBP_HEX_Menu_C::ExtractingHex' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, HexButtons) == 0x000630, "Member 'UWBP_HEX_Menu_C::HexButtons' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, XrGameMode) == 0x000640, "Member 'UWBP_HEX_Menu_C::XrGameMode' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, EventTimeTimer) == 0x000648, "Member 'UWBP_HEX_Menu_C::EventTimeTimer' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, EventActive) == 0x000650, "Member 'UWBP_HEX_Menu_C::EventActive' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Menu_C, CurrentEventExpireTime) == 0x000658, "Member 'UWBP_HEX_Menu_C::CurrentEventExpireTime' has a wrong offset!");

}

