#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerProfileItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerProfileItem.WBP_PlayerProfileItem_C
// 0x0090 (0x0370 - 0x02E0)
class UWBP_PlayerProfileItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 PlayerAvatar_Image;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerIdentifier_Image;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           PlayerName_GzText;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           PlayerTag_GzText;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProBadge_Image;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           StatsContainer_HorizontalBox;                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerStat_C*                      WBP_PlayerStat_Assists;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerStat_C*                      WBP_PlayerStat_Deads;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerStat_C*                      WBP_PlayerStat_Kills;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shared_LabelHeader_C*              WBP_Shared_LabelHeader;                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SquadScreen_MicHandleButton_C*     WBP_SquadScreen_MicHandleButton;                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SquadScreen_MuteButton_C*          WBP_SquadScreen_MuteButton;                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SquadScreen_Connection_C*          WBP_SquatScreen_ConnectionProblem;                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PlayerId;                                          // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPreMatchGame;                                    // 0x0354(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_26CA[0x3];                                     // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         TargetPlayerState;                                 // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateTimerHandle;                                 // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateStatsFromMatchResult();
	void Set_Player_Info(class AGzPlayerState* InPlayerState);
	class UWidget* Navigate_From_Mute_Sound(EUINavigation Param_Navigation);
	class UWidget* Navigate_From_Mute_Mic(EUINavigation Param_Navigation);
	void UpdatePlayerStats();
	void UnbindEvents();
	void SetUpVoiceChatButtons();
	void SetPlayerIdentifier();
	void SetIdHeaderText();
	void ExecuteUbergraph_WBP_PlayerProfileItem(int32 EntryPoint);
	void Destruct();
	void Construct();
	void BindEvents();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerProfileItem_C">();
	}
	static class UWBP_PlayerProfileItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerProfileItem_C>();
	}
};
static_assert(alignof(UWBP_PlayerProfileItem_C) == 0x000008, "Wrong alignment on UWBP_PlayerProfileItem_C");
static_assert(sizeof(UWBP_PlayerProfileItem_C) == 0x000370, "Wrong size on UWBP_PlayerProfileItem_C");
static_assert(offsetof(UWBP_PlayerProfileItem_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_PlayerProfileItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, PlayerAvatar_Image) == 0x0002E8, "Member 'UWBP_PlayerProfileItem_C::PlayerAvatar_Image' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, PlayerIdentifier_Image) == 0x0002F0, "Member 'UWBP_PlayerProfileItem_C::PlayerIdentifier_Image' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, PlayerName_GzText) == 0x0002F8, "Member 'UWBP_PlayerProfileItem_C::PlayerName_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, PlayerTag_GzText) == 0x000300, "Member 'UWBP_PlayerProfileItem_C::PlayerTag_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, ProBadge_Image) == 0x000308, "Member 'UWBP_PlayerProfileItem_C::ProBadge_Image' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, StatsContainer_HorizontalBox) == 0x000310, "Member 'UWBP_PlayerProfileItem_C::StatsContainer_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, WBP_PlayerStat_Assists) == 0x000318, "Member 'UWBP_PlayerProfileItem_C::WBP_PlayerStat_Assists' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, WBP_PlayerStat_Deads) == 0x000320, "Member 'UWBP_PlayerProfileItem_C::WBP_PlayerStat_Deads' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, WBP_PlayerStat_Kills) == 0x000328, "Member 'UWBP_PlayerProfileItem_C::WBP_PlayerStat_Kills' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, WBP_Shared_LabelHeader) == 0x000330, "Member 'UWBP_PlayerProfileItem_C::WBP_Shared_LabelHeader' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, WBP_SquadScreen_MicHandleButton) == 0x000338, "Member 'UWBP_PlayerProfileItem_C::WBP_SquadScreen_MicHandleButton' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, WBP_SquadScreen_MuteButton) == 0x000340, "Member 'UWBP_PlayerProfileItem_C::WBP_SquadScreen_MuteButton' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, WBP_SquatScreen_ConnectionProblem) == 0x000348, "Member 'UWBP_PlayerProfileItem_C::WBP_SquatScreen_ConnectionProblem' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, PlayerId) == 0x000350, "Member 'UWBP_PlayerProfileItem_C::PlayerId' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, IsPreMatchGame) == 0x000354, "Member 'UWBP_PlayerProfileItem_C::IsPreMatchGame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, TargetPlayerState) == 0x000358, "Member 'UWBP_PlayerProfileItem_C::TargetPlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, UpdateTimerHandle) == 0x000360, "Member 'UWBP_PlayerProfileItem_C::UpdateTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerProfileItem_C, NewVar) == 0x000368, "Member 'UWBP_PlayerProfileItem_C::NewVar' has a wrong offset!");

}

