#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSelection_Item

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoadoutSelection_Item.WBP_LoadoutSelection_Item_C.ShowItem
// 0x0078 (0x0078 - 0x0000)
struct WBP_LoadoutSelection_Item_C_ShowItem final
{
public:
	struct FGzInvItem                             Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UGzItemData*                            ItemData;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidItem_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59DB[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzItemData*                            CallFunc_GetItemData_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemQuantity_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59DC[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0010)()
	float                                         K2Node_Select_Default;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzItemRarity                                 CallFunc_GetRarity_ReturnValue;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59DD[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetRarityColor_ReturnValue;               // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelection_Item_C_ShowItem) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_Item_C_ShowItem");
static_assert(sizeof(WBP_LoadoutSelection_Item_C_ShowItem) == 0x000078, "Wrong size on WBP_LoadoutSelection_Item_C_ShowItem");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, Item) == 0x000000, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::Item' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, ItemData) == 0x000010, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::ItemData' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, Temp_real_Variable) == 0x000018, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, CallFunc_IsValidItem_ReturnValue) == 0x00001C, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::CallFunc_IsValidItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, CallFunc_Conv_BoolToInt_ReturnValue) == 0x000020, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, Temp_real_Variable_1) == 0x000024, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, CallFunc_GetItemData_ReturnValue) == 0x000028, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, CallFunc_GetItemQuantity_ReturnValue) == 0x000030, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::CallFunc_GetItemQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, Temp_bool_Variable) == 0x000035, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, CallFunc_Conv_IntToText_ReturnValue) == 0x000038, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, K2Node_Select_Default) == 0x000048, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, CallFunc_GetRarity_ReturnValue) == 0x00004C, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, CallFunc_GetRarityColor_ReturnValue) == 0x000050, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::CallFunc_GetRarityColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000060, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, K2Node_DynamicCast_AsTexture_2D) == 0x000068, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Item_C_ShowItem, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WBP_LoadoutSelection_Item_C_ShowItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

