#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Redeployment_MemberButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_Redeployment_PlayerState_structs.hpp"
#include "G01_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Redeployment_MemberButton.WBP_Redeployment_MemberButton_C.UpdateRespawnTime
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Redeployment_MemberButton_C_UpdateRespawnTime final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0010)()
	class FText                                   CallFunc_GetRemainingRespawnTime_Text;             // 0x0010(0x0010)()
	double                                        CallFunc_GetRemainingRespawnTime_Float;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E83[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0078(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0010)()
};
static_assert(alignof(WBP_Redeployment_MemberButton_C_UpdateRespawnTime) == 0x000008, "Wrong alignment on WBP_Redeployment_MemberButton_C_UpdateRespawnTime");
static_assert(sizeof(WBP_Redeployment_MemberButton_C_UpdateRespawnTime) == 0x0000E0, "Wrong size on WBP_Redeployment_MemberButton_C_UpdateRespawnTime");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdateRespawnTime, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'WBP_Redeployment_MemberButton_C_UpdateRespawnTime::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdateRespawnTime, CallFunc_GetRemainingRespawnTime_Text) == 0x000010, "Member 'WBP_Redeployment_MemberButton_C_UpdateRespawnTime::CallFunc_GetRemainingRespawnTime_Text' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdateRespawnTime, CallFunc_GetRemainingRespawnTime_Float) == 0x000020, "Member 'WBP_Redeployment_MemberButton_C_UpdateRespawnTime::CallFunc_GetRemainingRespawnTime_Float' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdateRespawnTime, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_Redeployment_MemberButton_C_UpdateRespawnTime::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdateRespawnTime, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000070, "Member 'WBP_Redeployment_MemberButton_C_UpdateRespawnTime::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdateRespawnTime, K2Node_MakeStruct_FormatArgumentData_1) == 0x000078, "Member 'WBP_Redeployment_MemberButton_C_UpdateRespawnTime::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdateRespawnTime, K2Node_MakeArray_Array) == 0x0000C0, "Member 'WBP_Redeployment_MemberButton_C_UpdateRespawnTime::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdateRespawnTime, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'WBP_Redeployment_MemberButton_C_UpdateRespawnTime::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_Redeployment_MemberButton.WBP_Redeployment_MemberButton_C.UpdateRedeploymentCost
// 0x0018 (0x0018 - 0x0000)
struct WBP_Redeployment_MemberButton_C_UpdateRedeploymentCost final
{
public:
	int32                                         CallFunc_GetRedeploymentCost_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E84[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
static_assert(alignof(WBP_Redeployment_MemberButton_C_UpdateRedeploymentCost) == 0x000008, "Wrong alignment on WBP_Redeployment_MemberButton_C_UpdateRedeploymentCost");
static_assert(sizeof(WBP_Redeployment_MemberButton_C_UpdateRedeploymentCost) == 0x000018, "Wrong size on WBP_Redeployment_MemberButton_C_UpdateRedeploymentCost");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdateRedeploymentCost, CallFunc_GetRedeploymentCost_ReturnValue) == 0x000000, "Member 'WBP_Redeployment_MemberButton_C_UpdateRedeploymentCost::CallFunc_GetRedeploymentCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdateRedeploymentCost, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_Redeployment_MemberButton_C_UpdateRedeploymentCost::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_Redeployment_MemberButton.WBP_Redeployment_MemberButton_C.UpdatePlayerCurrency
// 0x0030 (0x0030 - 0x0000)
struct WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency final
{
public:
	int32                                         Param_PlayerCurrecy;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency) == 0x000008, "Wrong alignment on WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency");
static_assert(sizeof(WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency) == 0x000030, "Wrong size on WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency, Param_PlayerCurrecy) == 0x000000, "Member 'WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency::Param_PlayerCurrecy' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency, Temp_bool_Variable) == 0x000004, "Member 'WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency, Temp_byte_Variable) == 0x000005, "Member 'WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency, CallFunc_Less_IntInt_ReturnValue) == 0x000007, "Member 'WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency, CallFunc_GetPlayerName_ReturnValue) == 0x000008, "Member 'WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency, K2Node_Select_Default) == 0x000028, "Member 'WBP_Redeployment_MemberButton_C_UpdatePlayerCurrency::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Redeployment_MemberButton.WBP_Redeployment_MemberButton_C.RedeployPlayer__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Redeployment_MemberButton_C_RedeployPlayer__DelegateSignature final
{
public:
	class AGzPlayerState*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Redeployment_MemberButton_C*       RedeploymentButton;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_MemberButton_C_RedeployPlayer__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Redeployment_MemberButton_C_RedeployPlayer__DelegateSignature");
static_assert(sizeof(WBP_Redeployment_MemberButton_C_RedeployPlayer__DelegateSignature) == 0x000010, "Wrong size on WBP_Redeployment_MemberButton_C_RedeployPlayer__DelegateSignature");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_RedeployPlayer__DelegateSignature, PlayerState) == 0x000000, "Member 'WBP_Redeployment_MemberButton_C_RedeployPlayer__DelegateSignature::PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_RedeployPlayer__DelegateSignature, RedeploymentButton) == 0x000008, "Member 'WBP_Redeployment_MemberButton_C_RedeployPlayer__DelegateSignature::RedeploymentButton' has a wrong offset!");

// Function WBP_Redeployment_MemberButton.WBP_Redeployment_MemberButton_C.OnTeammateAlive
// 0x0008 (0x0008 - 0x0000)
struct WBP_Redeployment_MemberButton_C_OnTeammateAlive final
{
public:
	class AGzPlayerState*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_MemberButton_C_OnTeammateAlive) == 0x000008, "Wrong alignment on WBP_Redeployment_MemberButton_C_OnTeammateAlive");
static_assert(sizeof(WBP_Redeployment_MemberButton_C_OnTeammateAlive) == 0x000008, "Wrong size on WBP_Redeployment_MemberButton_C_OnTeammateAlive");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_OnTeammateAlive, PlayerState) == 0x000000, "Member 'WBP_Redeployment_MemberButton_C_OnTeammateAlive::PlayerState' has a wrong offset!");

// Function WBP_Redeployment_MemberButton.WBP_Redeployment_MemberButton_C.GetRemainingRespawnTime
// 0x0058 (0x0058 - 0x0000)
struct WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(Parm, OutParm)
	double                                        Float;                                             // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRespawnTime_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E85[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTimeInMinutesSecondFormatText_Result;  // 0x0038(0x0010)()
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeInMinutesSecondFormatText_InSeconds_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime) == 0x000008, "Wrong alignment on WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime");
static_assert(sizeof(WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime) == 0x000058, "Wrong size on WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime, Text) == 0x000000, "Member 'WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime::Text' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime, Float) == 0x000010, "Member 'WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime::Float' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime, CallFunc_GetGameState_ReturnValue) == 0x000018, "Member 'WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000020, "Member 'WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime, CallFunc_GetRespawnTime_ReturnValue) == 0x000028, "Member 'WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime::CallFunc_GetRespawnTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime, CallFunc_GetTimeInMinutesSecondFormatText_Result) == 0x000038, "Member 'WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime::CallFunc_GetTimeInMinutesSecondFormatText_Result' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime, CallFunc_GetTimeInMinutesSecondFormatText_InSeconds_ImplicitCast) == 0x000050, "Member 'WBP_Redeployment_MemberButton_C_GetRemainingRespawnTime::CallFunc_GetTimeInMinutesSecondFormatText_InSeconds_ImplicitCast' has a wrong offset!");

// Function WBP_Redeployment_MemberButton.WBP_Redeployment_MemberButton_C.GetPlayerLifeState
// 0x0028 (0x0028 - 0x0000)
struct WBP_Redeployment_MemberButton_C_GetPlayerLifeState final
{
public:
	ENUM_Redeployment_PlayerState                 PlayerLifeState;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzConnectionState                            Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Redeployment_PlayerState                 Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Redeployment_PlayerState                 Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Redeployment_PlayerState                 Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E86[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Redeployment_PlayerState                 Temp_byte_Variable_4;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Redeployment_PlayerState                 Temp_byte_Variable_5;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Redeployment_PlayerState                 Temp_byte_Variable_6;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Redeployment_PlayerState                 Temp_byte_Variable_7;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzConnectionState                            CallFunc_GetConnectionState_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInComebackArena_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInComebackArenaQueue_ReturnValue;       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzAliveState                                 CallFunc_GetPlayerAliveState_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E87[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Redeployment_PlayerState                 K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Redeployment_PlayerState                 K2Node_Select_Default_1;                           // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState) == 0x000004, "Wrong alignment on WBP_Redeployment_MemberButton_C_GetPlayerLifeState");
static_assert(sizeof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState) == 0x000028, "Wrong size on WBP_Redeployment_MemberButton_C_GetPlayerLifeState");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, PlayerLifeState) == 0x000000, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::PlayerLifeState' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, Temp_byte_Variable) == 0x000001, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, Temp_byte_Variable_3) == 0x000004, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, Temp_int_Variable) == 0x000008, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, Temp_byte_Variable_4) == 0x00000C, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, Temp_byte_Variable_5) == 0x00000D, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, Temp_byte_Variable_6) == 0x00000E, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, Temp_byte_Variable_7) == 0x00000F, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, CallFunc_GetConnectionState_ReturnValue) == 0x000010, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::CallFunc_GetConnectionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, CallFunc_IsInComebackArena_ReturnValue) == 0x000011, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::CallFunc_IsInComebackArena_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, CallFunc_IsInComebackArenaQueue_ReturnValue) == 0x000012, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::CallFunc_IsInComebackArenaQueue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, CallFunc_GetPlayerAliveState_ReturnValue) == 0x000013, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::CallFunc_GetPlayerAliveState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, CallFunc_SelectInt_ReturnValue) == 0x000018, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, CallFunc_SelectInt_ReturnValue_1) == 0x00001C, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, CallFunc_SelectInt_ReturnValue_2) == 0x000020, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, K2Node_Select_Default) == 0x000024, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_GetPlayerLifeState, K2Node_Select_Default_1) == 0x000025, "Member 'WBP_Redeployment_MemberButton_C_GetPlayerLifeState::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_Redeployment_MemberButton.WBP_Redeployment_MemberButton_C.ExecuteUbergraph_WBP_Redeployment_MemberButton
// 0x0028 (0x0028 - 0x0000)
struct WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E88[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         K2Node_CustomEvent_PlayerState;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGzAliveState                                 CallFunc_GetPlayerAliveState_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton) == 0x000008, "Wrong alignment on WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton");
static_assert(sizeof(WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton) == 0x000028, "Wrong size on WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton, EntryPoint) == 0x000000, "Member 'WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton, K2Node_CustomEvent_PlayerState) == 0x000018, "Member 'WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton, CallFunc_GetPlayerAliveState_ReturnValue) == 0x000020, "Member 'WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton::CallFunc_GetPlayerAliveState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'WBP_Redeployment_MemberButton_C_ExecuteUbergraph_WBP_Redeployment_MemberButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Redeployment_MemberButton.WBP_Redeployment_MemberButton_C.ButtonSetUp
// 0x02F8 (0x02F8 - 0x0000)
struct WBP_Redeployment_MemberButton_C_ButtonSetUp final
{
public:
	class FString                                 PlayerClanTag;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           WarningColor;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E89[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E8A[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0010)()
	class FString                                 CallFunc_GetPlayerClanTag_ReturnValue;             // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0118(0x0010)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Redeployment_PlayerState                 CallFunc_GetPlayerLifeState_PlayerLifeState;       // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGzAliveState                                 CallFunc_GetPlayerAliveState_ReturnValue;          // 0x012F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E8B[0x2];                                     // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0134(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0144(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E8C[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	ENUM_Redeployment_PlayerState                 CallFunc_GetPlayerLifeState_PlayerLifeState_1;     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E8D[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0168(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E8E[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0180(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01D8(0x0010)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x01F0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0200(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0248(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0290(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x02A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x02B0(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x02C0(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Redeployment_PlayerState                 CallFunc_GetPlayerLifeState_PlayerLifeState_2;     // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E8F[0x5];                                     // 0x02D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x02E8(0x0010)()
};
static_assert(alignof(WBP_Redeployment_MemberButton_C_ButtonSetUp) == 0x000008, "Wrong alignment on WBP_Redeployment_MemberButton_C_ButtonSetUp");
static_assert(sizeof(WBP_Redeployment_MemberButton_C_ButtonSetUp) == 0x0002F8, "Wrong size on WBP_Redeployment_MemberButton_C_ButtonSetUp");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, PlayerClanTag) == 0x000000, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::PlayerClanTag' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, WarningColor) == 0x000010, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::WarningColor' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_IsEmpty_ReturnValue) == 0x000030, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_Not_PreBool_ReturnValue) == 0x000080, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_Format_ReturnValue) == 0x000098, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_GetPlayerClanTag_ReturnValue) == 0x0000A8, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_GetPlayerClanTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000B8, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, K2Node_MakeArray_Array_1) == 0x000108, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_Format_ReturnValue_1) == 0x000118, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, Temp_byte_Variable) == 0x000128, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_GetPlayerLifeState_PlayerLifeState) == 0x000129, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_GetPlayerLifeState_PlayerLifeState' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00012A, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00012B, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_BooleanOR_ReturnValue) == 0x00012C, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, Temp_byte_Variable_1) == 0x00012D, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, Temp_bool_Variable) == 0x00012E, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_GetPlayerAliveState_ReturnValue) == 0x00012F, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_GetPlayerAliveState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, K2Node_Select_Default) == 0x000130, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, K2Node_SwitchEnum_CmpSuccess) == 0x000131, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, K2Node_CreateDelegate_OutputDelegate) == 0x000134, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, K2Node_CreateDelegate_OutputDelegate_1) == 0x000144, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000158, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_GetPlayerLifeState_PlayerLifeState_1) == 0x000160, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_GetPlayerLifeState_PlayerLifeState_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_Map_Find_Value) == 0x000168, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_Map_Find_ReturnValue) == 0x000178, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, K2Node_MakeStruct_FormatArgumentData_2) == 0x000180, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, K2Node_MakeArray_Array_2) == 0x0001C8, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_Format_ReturnValue_2) == 0x0001D8, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0001E8, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_MakeLiteralText_ReturnValue) == 0x0001F0, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, K2Node_MakeStruct_FormatArgumentData_3) == 0x000200, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, K2Node_MakeStruct_FormatArgumentData_4) == 0x000248, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, K2Node_MakeArray_Array_3) == 0x000290, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, K2Node_MakeArray_Array_4) == 0x0002A0, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_Format_ReturnValue_3) == 0x0002B0, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_Format_ReturnValue_4) == 0x0002C0, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_Less_IntInt_ReturnValue) == 0x0002D0, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_GetPlayerLifeState_PlayerLifeState_2) == 0x0002D1, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_GetPlayerLifeState_PlayerLifeState_2' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0002D2, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_GetPlayerName_ReturnValue) == 0x0002D8, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonSetUp, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0002E8, "Member 'WBP_Redeployment_MemberButton_C_ButtonSetUp::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function WBP_Redeployment_MemberButton.WBP_Redeployment_MemberButton_C.ButtonHover
// 0x0005 (0x0005 - 0x0000)
struct WBP_Redeployment_MemberButton_C_ButtonHover final
{
public:
	bool                                          IsButtonHover;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Redeployment_MemberButton_C_ButtonHover) == 0x000001, "Wrong alignment on WBP_Redeployment_MemberButton_C_ButtonHover");
static_assert(sizeof(WBP_Redeployment_MemberButton_C_ButtonHover) == 0x000005, "Wrong size on WBP_Redeployment_MemberButton_C_ButtonHover");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonHover, IsButtonHover) == 0x000000, "Member 'WBP_Redeployment_MemberButton_C_ButtonHover::IsButtonHover' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonHover, Temp_bool_Variable) == 0x000001, "Member 'WBP_Redeployment_MemberButton_C_ButtonHover::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Redeployment_MemberButton_C_ButtonHover, Temp_byte_Variable) == 0x000002, "Member 'WBP_Redeployment_MemberButton_C_ButtonHover::Temp_byte_Variable' has a wrong offset!");
