#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BaseOpportunityMission

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MissionGraphRuntime_structs.hpp"


namespace SDK::Params
{

// Function WBP_BaseOpportunityMission.WBP_BaseOpportunityMission_C.FindDeepestObjective
// 0x0068 (0x0068 - 0x0000)
struct WBP_BaseOpportunityMission_C_FindDeepestObjective final
{
public:
	class UMissionObjective*                      In_Objective;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveState                        CallFunc_GetState_ReturnValue;                     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BEB[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetHudText_ReturnValue;                   // 0x0010(0x0010)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BEC[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BED[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective_Composition*          K2Node_DynamicCast_AsMission_Objective_Composition; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BEE[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMissionObjective*>              CallFunc_GetChildObjectives_ReturnValue;           // 0x0040(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BEF[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseOpportunityMission_C_FindDeepestObjective) == 0x000008, "Wrong alignment on WBP_BaseOpportunityMission_C_FindDeepestObjective");
static_assert(sizeof(WBP_BaseOpportunityMission_C_FindDeepestObjective) == 0x000068, "Wrong size on WBP_BaseOpportunityMission_C_FindDeepestObjective");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, In_Objective) == 0x000000, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::In_Objective' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, CallFunc_GetState_ReturnValue) == 0x000009, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, CallFunc_GetHudText_ReturnValue) == 0x000010, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::CallFunc_GetHudText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, CallFunc_TextIsEmpty_ReturnValue) == 0x000024, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, CallFunc_Not_PreBool_ReturnValue) == 0x000025, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, K2Node_DynamicCast_AsMission_Objective_Composition) == 0x000030, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::K2Node_DynamicCast_AsMission_Objective_Composition' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, CallFunc_GetChildObjectives_ReturnValue) == 0x000040, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::CallFunc_GetChildObjectives_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_FindDeepestObjective, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'WBP_BaseOpportunityMission_C_FindDeepestObjective::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_BaseOpportunityMission.WBP_BaseOpportunityMission_C.GetObjectiveTimeText
// 0x0128 (0x0128 - 0x0000)
struct WBP_BaseOpportunityMission_C_GetObjectiveTimeText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(Parm, OutParm)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Days;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Hours;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Minutes;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Seconds;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_FractionNano;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BF0[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0060(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0010)()
	float                                         CallFunc_FromSeconds_Seconds_ImplicitCast;         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText) == 0x000008, "Wrong alignment on WBP_BaseOpportunityMission_C_GetObjectiveTimeText");
static_assert(sizeof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText) == 0x000128, "Wrong size on WBP_BaseOpportunityMission_C_GetObjectiveTimeText");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, Text) == 0x000000, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::Text' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000018, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, CallFunc_FMax_ReturnValue) == 0x000028, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, CallFunc_FromSeconds_ReturnValue) == 0x000030, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::CallFunc_FromSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, CallFunc_BreakTimespan2_Days) == 0x000038, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::CallFunc_BreakTimespan2_Days' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, CallFunc_BreakTimespan2_Hours) == 0x00003C, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::CallFunc_BreakTimespan2_Hours' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, CallFunc_BreakTimespan2_Minutes) == 0x000040, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::CallFunc_BreakTimespan2_Minutes' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, CallFunc_BreakTimespan2_Seconds) == 0x000044, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::CallFunc_BreakTimespan2_Seconds' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, CallFunc_BreakTimespan2_FractionNano) == 0x000048, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::CallFunc_BreakTimespan2_FractionNano' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000060, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, K2Node_MakeArray_Array) == 0x000100, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, CallFunc_Format_ReturnValue) == 0x000110, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseOpportunityMission_C_GetObjectiveTimeText, CallFunc_FromSeconds_Seconds_ImplicitCast) == 0x000120, "Member 'WBP_BaseOpportunityMission_C_GetObjectiveTimeText::CallFunc_FromSeconds_Seconds_ImplicitCast' has a wrong offset!");

// Function WBP_BaseOpportunityMission.WBP_BaseOpportunityMission_C.Set Mission Data
// 0x0008 (0x0008 - 0x0000)
struct WBP_BaseOpportunityMission_C_Set_Mission_Data final
{
public:
	class AGzMission*                             Mission;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseOpportunityMission_C_Set_Mission_Data) == 0x000008, "Wrong alignment on WBP_BaseOpportunityMission_C_Set_Mission_Data");
static_assert(sizeof(WBP_BaseOpportunityMission_C_Set_Mission_Data) == 0x000008, "Wrong size on WBP_BaseOpportunityMission_C_Set_Mission_Data");
static_assert(offsetof(WBP_BaseOpportunityMission_C_Set_Mission_Data, Mission) == 0x000000, "Member 'WBP_BaseOpportunityMission_C_Set_Mission_Data::Mission' has a wrong offset!");

}

