#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Crosshair_LimbCharges

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Crosshair_LimbCharges.WBP_Crosshair_LimbCharges_C
// 0x0010 (0x02F0 - 0x02E0)
class UWBP_Crosshair_LimbCharges_C final : public UUserWidget
{
public:
	class UHorizontalBox*                         ChargesContainer_HorizontalBox;                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         MaxChargesAmount;                                  // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LockedChargesCounter;                              // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddLockedCharge();
	void ClearChargesContainer();
	void InitCharges(int32 Param_MaxChargesAmount, double ChargeWidgetPadding);
	void RemoveLockedCharge();
	void UpdateChargesState(class UGzGA_BaseLimbAbility* LimbAbilityRef);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Crosshair_LimbCharges_C">();
	}
	static class UWBP_Crosshair_LimbCharges_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Crosshair_LimbCharges_C>();
	}
};
static_assert(alignof(UWBP_Crosshair_LimbCharges_C) == 0x000008, "Wrong alignment on UWBP_Crosshair_LimbCharges_C");
static_assert(sizeof(UWBP_Crosshair_LimbCharges_C) == 0x0002F0, "Wrong size on UWBP_Crosshair_LimbCharges_C");
static_assert(offsetof(UWBP_Crosshair_LimbCharges_C, ChargesContainer_HorizontalBox) == 0x0002E0, "Member 'UWBP_Crosshair_LimbCharges_C::ChargesContainer_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_LimbCharges_C, MaxChargesAmount) == 0x0002E8, "Member 'UWBP_Crosshair_LimbCharges_C::MaxChargesAmount' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_LimbCharges_C, LockedChargesCounter) == 0x0002EC, "Member 'UWBP_Crosshair_LimbCharges_C::LockedChargesCounter' has a wrong offset!");

}

