#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReportPlayer

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function WBP_ReportPlayer.WBP_ReportPlayer_C.BndEvt__WBP_ReportPlayer_Back_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ReportPlayer_C_BndEvt__WBP_ReportPlayer_Back_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportPlayer_C_BndEvt__WBP_ReportPlayer_Back_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ReportPlayer_C_BndEvt__WBP_ReportPlayer_Back_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ReportPlayer_C_BndEvt__WBP_ReportPlayer_Back_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ReportPlayer_C_BndEvt__WBP_ReportPlayer_Back_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ReportPlayer_C_BndEvt__WBP_ReportPlayer_Back_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ReportPlayer_C_BndEvt__WBP_ReportPlayer_Back_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ReportPlayer.WBP_ReportPlayer_C.CreatePlayerEntry
// 0x0038 (0x0038 - 0x0000)
struct WBP_ReportPlayer_C_CreatePlayerEntry final
{
public:
	int32                                         PlayerStateIndex;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetPlayerInformation_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerInformation_bIsNotOwner;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_682C[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetPlayerInformation_PlayerState;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_682D[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ReportPlayerEntry_C*               CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportPlayer_C_CreatePlayerEntry) == 0x000008, "Wrong alignment on WBP_ReportPlayer_C_CreatePlayerEntry");
static_assert(sizeof(WBP_ReportPlayer_C_CreatePlayerEntry) == 0x000038, "Wrong size on WBP_ReportPlayer_C_CreatePlayerEntry");
static_assert(offsetof(WBP_ReportPlayer_C_CreatePlayerEntry, PlayerStateIndex) == 0x000000, "Member 'WBP_ReportPlayer_C_CreatePlayerEntry::PlayerStateIndex' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_CreatePlayerEntry, CallFunc_GetPlayerInformation_ReturnValue) == 0x000004, "Member 'WBP_ReportPlayer_C_CreatePlayerEntry::CallFunc_GetPlayerInformation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_CreatePlayerEntry, CallFunc_GetPlayerInformation_bIsNotOwner) == 0x000005, "Member 'WBP_ReportPlayer_C_CreatePlayerEntry::CallFunc_GetPlayerInformation_bIsNotOwner' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_CreatePlayerEntry, CallFunc_GetPlayerInformation_PlayerState) == 0x000008, "Member 'WBP_ReportPlayer_C_CreatePlayerEntry::CallFunc_GetPlayerInformation_PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_CreatePlayerEntry, Temp_int_Variable) == 0x000010, "Member 'WBP_ReportPlayer_C_CreatePlayerEntry::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_CreatePlayerEntry, CallFunc_Percent_IntInt_ReturnValue) == 0x000014, "Member 'WBP_ReportPlayer_C_CreatePlayerEntry::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_CreatePlayerEntry, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_ReportPlayer_C_CreatePlayerEntry::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_CreatePlayerEntry, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_ReportPlayer_C_CreatePlayerEntry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_CreatePlayerEntry, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WBP_ReportPlayer_C_CreatePlayerEntry::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_CreatePlayerEntry, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_ReportPlayer_C_CreatePlayerEntry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_CreatePlayerEntry, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000030, "Member 'WBP_ReportPlayer_C_CreatePlayerEntry::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");

// Function WBP_ReportPlayer.WBP_ReportPlayer_C.DoCustomNavigation
// 0x0018 (0x0018 - 0x0000)
struct WBP_ReportPlayer_C_DoCustomNavigation final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_682E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportPlayer_C_DoCustomNavigation) == 0x000008, "Wrong alignment on WBP_ReportPlayer_C_DoCustomNavigation");
static_assert(sizeof(WBP_ReportPlayer_C_DoCustomNavigation) == 0x000018, "Wrong size on WBP_ReportPlayer_C_DoCustomNavigation");
static_assert(offsetof(WBP_ReportPlayer_C_DoCustomNavigation, Param_Navigation) == 0x000000, "Member 'WBP_ReportPlayer_C_DoCustomNavigation::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_DoCustomNavigation, ReturnValue) == 0x000008, "Member 'WBP_ReportPlayer_C_DoCustomNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_DoCustomNavigation, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'WBP_ReportPlayer_C_DoCustomNavigation::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_ReportPlayer.WBP_ReportPlayer_C.ExecuteUbergraph_WBP_ReportPlayer
// 0x0190 (0x0190 - 0x0000)
struct WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_682F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6830[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6831[0x1];                                     // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         K2Node_CustomEvent_PlayerState;                    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	double                                        Temp_real_Variable_3;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6832[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ReportPlayerEntry_C*               K2Node_DynamicCast_AsWBP_Report_Player_Entry;      // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6833[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumPlayerStates_ReturnValue;           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6834[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6835[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x00F0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0118(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6836[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6837[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APawn* OldPawn, class APawn* NewPawn)> K2Node_CreateDelegate_OutputDelegate;              // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_OldPawn;                        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_NewPawn;                        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APawn* OldPawn, class APawn* NewPawn)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6838[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer) == 0x000008, "Wrong alignment on WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer");
static_assert(sizeof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer) == 0x000190, "Wrong size on WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, EntryPoint) == 0x000000, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_bool_Variable) == 0x000004, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000008, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000028, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00002C, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000030, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_object_Variable) == 0x000038, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_real_Variable) == 0x000048, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_real_Variable_1) == 0x000050, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_real_Variable_0) == 0x000058, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_bool_Variable_1) == 0x000068, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_bool_True_if_break_was_hit_Variable) == 0x000069, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_Not_PreBool_ReturnValue) == 0x00006A, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_real_Variable_2) == 0x000070, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_int_Variable) == 0x000078, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_CustomEvent_PlayerState) == 0x000080, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_GetAllChildren_ReturnValue) == 0x000088, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_real_Variable_3) == 0x000098, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_DynamicCast_AsWBP_Report_Player_Entry) == 0x0000B0, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_DynamicCast_AsWBP_Report_Player_Entry' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_IsHovered_ReturnValue) == 0x0000B9, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_object_Variable_1) == 0x0000C0, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_GetNumPlayerStates_ReturnValue) == 0x0000C8, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_GetNumPlayerStates_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_ComponentBoundEvent_Button) == 0x0000D0, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000DC, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000E0, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_GetChildAt_ReturnValue) == 0x0000E8, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x0000F0, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000110, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000114, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000118, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_real_Variable_3_0) == 0x000128, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_real_Variable_2_0) == 0x000130, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x000138, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000140, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000148, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_CustomEvent_OldPawn) == 0x000158, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_CustomEvent_OldPawn' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_CustomEvent_NewPawn) == 0x000160, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_CustomEvent_NewPawn' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000168, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000170, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, Temp_int_Loop_Counter_Variable) == 0x000180, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_Less_IntInt_ReturnValue) == 0x000184, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_Add_IntInt_ReturnValue_1) == 0x000188, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer, CallFunc_BooleanAND_ReturnValue) == 0x00018C, "Member 'WBP_ReportPlayer_C_ExecuteUbergraph_WBP_ReportPlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_ReportPlayer.WBP_ReportPlayer_C.GetPlayerInformation
// 0x0030 (0x0030 - 0x0000)
struct WBP_ReportPlayer_C_GetPlayerInformation final
{
public:
	int32                                         PlayerStateIndex;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNotOwner;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6839[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         PlayerState;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         PlayerState_0;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_683A[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         CallFunc_GetPlayerState_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetTeamAttitude_ReturnValue;              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 K2Node_Select_Default;                             // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportPlayer_C_GetPlayerInformation) == 0x000008, "Wrong alignment on WBP_ReportPlayer_C_GetPlayerInformation");
static_assert(sizeof(WBP_ReportPlayer_C_GetPlayerInformation) == 0x000030, "Wrong size on WBP_ReportPlayer_C_GetPlayerInformation");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, PlayerStateIndex) == 0x000000, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::PlayerStateIndex' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, ReturnValue) == 0x000004, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, bIsNotOwner) == 0x000005, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::bIsNotOwner' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, PlayerState) == 0x000008, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, PlayerState_0) == 0x000010, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::PlayerState_0' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, Temp_byte_Variable) == 0x000018, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, CallFunc_GetPlayerState_ReturnValue) == 0x000020, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, Temp_byte_Variable_1) == 0x000028, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, Temp_bool_Variable) == 0x000029, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00002A, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00002B, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, CallFunc_GetTeamAttitude_ReturnValue) == 0x00002D, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::CallFunc_GetTeamAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002E, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerInformation, K2Node_Select_Default) == 0x00002F, "Member 'WBP_ReportPlayer_C_GetPlayerInformation::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ReportPlayer.WBP_ReportPlayer_C.GetPlayerNames
// 0x0068 (0x0068 - 0x0000)
struct WBP_ReportPlayer_C_GetPlayerNames final
{
public:
	class AGzPlayerState*                         Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ClanTag;                                           // 0x0008(0x0010)(Parm, OutParm)
	class FText                                   PlayerName;                                        // 0x0018(0x0010)(Parm, OutParm)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerClanTag_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0058(0x0010)()
};
static_assert(alignof(WBP_ReportPlayer_C_GetPlayerNames) == 0x000008, "Wrong alignment on WBP_ReportPlayer_C_GetPlayerNames");
static_assert(sizeof(WBP_ReportPlayer_C_GetPlayerNames) == 0x000068, "Wrong size on WBP_ReportPlayer_C_GetPlayerNames");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerNames, Target) == 0x000000, "Member 'WBP_ReportPlayer_C_GetPlayerNames::Target' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerNames, ClanTag) == 0x000008, "Member 'WBP_ReportPlayer_C_GetPlayerNames::ClanTag' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerNames, PlayerName) == 0x000018, "Member 'WBP_ReportPlayer_C_GetPlayerNames::PlayerName' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerNames, CallFunc_GetPlayerName_ReturnValue) == 0x000028, "Member 'WBP_ReportPlayer_C_GetPlayerNames::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerNames, CallFunc_GetPlayerClanTag_ReturnValue) == 0x000038, "Member 'WBP_ReportPlayer_C_GetPlayerNames::CallFunc_GetPlayerClanTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerNames, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_ReportPlayer_C_GetPlayerNames::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_GetPlayerNames, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000058, "Member 'WBP_ReportPlayer_C_GetPlayerNames::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function WBP_ReportPlayer.WBP_ReportPlayer_C.InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_ReportPlayer_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportPlayer_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_ReportPlayer_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_ReportPlayer_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_ReportPlayer_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_ReportPlayer_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_ReportPlayer_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_ReportPlayer_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_ReportPlayer_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_ReportPlayer_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_ReportPlayer.WBP_ReportPlayer_C.InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_ReportPlayer_C_InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportPlayer_C_InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_ReportPlayer_C_InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_ReportPlayer_C_InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_ReportPlayer_C_InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_ReportPlayer_C_InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_ReportPlayer_C_InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_ReportPlayer_C_InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_ReportPlayer_C_InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_ReportPlayer_C_InpActEvt_IA_UI_Confirm_Enter_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_ReportPlayer.WBP_ReportPlayer_C.OnButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_ReportPlayer_C_OnButtonClicked final
{
public:
	class AGzPlayerState*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportPlayer_C_OnButtonClicked) == 0x000008, "Wrong alignment on WBP_ReportPlayer_C_OnButtonClicked");
static_assert(sizeof(WBP_ReportPlayer_C_OnButtonClicked) == 0x000008, "Wrong size on WBP_ReportPlayer_C_OnButtonClicked");
static_assert(offsetof(WBP_ReportPlayer_C_OnButtonClicked, PlayerState) == 0x000000, "Member 'WBP_ReportPlayer_C_OnButtonClicked::PlayerState' has a wrong offset!");

// Function WBP_ReportPlayer.WBP_ReportPlayer_C.OnPlayerRespawned
// 0x0010 (0x0010 - 0x0000)
struct WBP_ReportPlayer_C_OnPlayerRespawned final
{
public:
	class APawn*                                  OldPawn;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportPlayer_C_OnPlayerRespawned) == 0x000008, "Wrong alignment on WBP_ReportPlayer_C_OnPlayerRespawned");
static_assert(sizeof(WBP_ReportPlayer_C_OnPlayerRespawned) == 0x000010, "Wrong size on WBP_ReportPlayer_C_OnPlayerRespawned");
static_assert(offsetof(WBP_ReportPlayer_C_OnPlayerRespawned, OldPawn) == 0x000000, "Member 'WBP_ReportPlayer_C_OnPlayerRespawned::OldPawn' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_OnPlayerRespawned, NewPawn) == 0x000008, "Member 'WBP_ReportPlayer_C_OnPlayerRespawned::NewPawn' has a wrong offset!");

// Function WBP_ReportPlayer.WBP_ReportPlayer_C.SetOwningPlayerState
// 0x0018 (0x0018 - 0x0000)
struct WBP_ReportPlayer_C_SetOwningPlayerState final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         K2Node_DynamicCast_AsGz_Player_State;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportPlayer_C_SetOwningPlayerState) == 0x000008, "Wrong alignment on WBP_ReportPlayer_C_SetOwningPlayerState");
static_assert(sizeof(WBP_ReportPlayer_C_SetOwningPlayerState) == 0x000018, "Wrong size on WBP_ReportPlayer_C_SetOwningPlayerState");
static_assert(offsetof(WBP_ReportPlayer_C_SetOwningPlayerState, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'WBP_ReportPlayer_C_SetOwningPlayerState::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_SetOwningPlayerState, K2Node_DynamicCast_AsGz_Player_State) == 0x000008, "Member 'WBP_ReportPlayer_C_SetOwningPlayerState::K2Node_DynamicCast_AsGz_Player_State' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_SetOwningPlayerState, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_ReportPlayer_C_SetOwningPlayerState::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ReportPlayer.WBP_ReportPlayer_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_ReportPlayer_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportPlayer_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_ReportPlayer_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_ReportPlayer_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_ReportPlayer_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_ReportPlayer_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_ReportPlayer_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportPlayer_C_BP_GetDesiredFocusTarget, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_ReportPlayer_C_BP_GetDesiredFocusTarget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

}

