#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoiceChatStateEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VoiceChatStateEntry.WBP_VoiceChatStateEntry_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_VoiceChatStateEntry_C final : public UUserWidget
{
public:
	class UImage*                                 Image_24;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_46;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           NameTextBlock;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ProbadgeSizeBox;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClanTag_C*                         WBP_ClanTag;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Set_Is_Pro(bool bPro);
	void Set_Name(const class FString& Param_Name);
	void Set_Tag(const class FString& Tag, bool bLocalPlayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VoiceChatStateEntry_C">();
	}
	static class UWBP_VoiceChatStateEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VoiceChatStateEntry_C>();
	}
};
static_assert(alignof(UWBP_VoiceChatStateEntry_C) == 0x000008, "Wrong alignment on UWBP_VoiceChatStateEntry_C");
static_assert(sizeof(UWBP_VoiceChatStateEntry_C) == 0x000308, "Wrong size on UWBP_VoiceChatStateEntry_C");
static_assert(offsetof(UWBP_VoiceChatStateEntry_C, Image_24) == 0x0002E0, "Member 'UWBP_VoiceChatStateEntry_C::Image_24' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatStateEntry_C, Image_46) == 0x0002E8, "Member 'UWBP_VoiceChatStateEntry_C::Image_46' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatStateEntry_C, NameTextBlock) == 0x0002F0, "Member 'UWBP_VoiceChatStateEntry_C::NameTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatStateEntry_C, ProbadgeSizeBox) == 0x0002F8, "Member 'UWBP_VoiceChatStateEntry_C::ProbadgeSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatStateEntry_C, WBP_ClanTag) == 0x000300, "Member 'UWBP_VoiceChatStateEntry_C::WBP_ClanTag' has a wrong offset!");

}

