#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InGame_CrosshairContainer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InGame_CrosshairContainer.WBP_InGame_CrosshairContainer_C
// 0x0040 (0x0480 - 0x0440)
class UWBP_InGame_CrosshairContainer_C final : public UGzCrosshairContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BlockedAimIndicator;                               // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BlockedAimCross;                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GrappleIndicator_Container_C*      WBP_GrappleIndicator_Container;                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        BlockedAimDistanceSquare;                          // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            DistanceScaleCurve;                                // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BlockedAimCrosshairColor;                          // 0x0470(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_InGame_CrosshairContainer(int32 EntryPoint);
	void OnViewTargetChanged(class APawn* ViewTarget);
	void ReceiveBindEvents(class APawn* NewViewTarget);
	void ReceiveUnbindEvents(class APawn* OldViewTarget);
	void ResetCrosshairColor(const struct FGzInvPocketId& PocketId, class AGzWeaponActor* WeaponActor);

	void OnAimUpdatedBP(const struct FVector& blockedLocation, bool bIsBlocked) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InGame_CrosshairContainer_C">();
	}
	static class UWBP_InGame_CrosshairContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InGame_CrosshairContainer_C>();
	}
};
static_assert(alignof(UWBP_InGame_CrosshairContainer_C) == 0x000008, "Wrong alignment on UWBP_InGame_CrosshairContainer_C");
static_assert(sizeof(UWBP_InGame_CrosshairContainer_C) == 0x000480, "Wrong size on UWBP_InGame_CrosshairContainer_C");
static_assert(offsetof(UWBP_InGame_CrosshairContainer_C, UberGraphFrame) == 0x000440, "Member 'UWBP_InGame_CrosshairContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InGame_CrosshairContainer_C, BlockedAimIndicator) == 0x000448, "Member 'UWBP_InGame_CrosshairContainer_C::BlockedAimIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_InGame_CrosshairContainer_C, Image_BlockedAimCross) == 0x000450, "Member 'UWBP_InGame_CrosshairContainer_C::Image_BlockedAimCross' has a wrong offset!");
static_assert(offsetof(UWBP_InGame_CrosshairContainer_C, WBP_GrappleIndicator_Container) == 0x000458, "Member 'UWBP_InGame_CrosshairContainer_C::WBP_GrappleIndicator_Container' has a wrong offset!");
static_assert(offsetof(UWBP_InGame_CrosshairContainer_C, BlockedAimDistanceSquare) == 0x000460, "Member 'UWBP_InGame_CrosshairContainer_C::BlockedAimDistanceSquare' has a wrong offset!");
static_assert(offsetof(UWBP_InGame_CrosshairContainer_C, DistanceScaleCurve) == 0x000468, "Member 'UWBP_InGame_CrosshairContainer_C::DistanceScaleCurve' has a wrong offset!");
static_assert(offsetof(UWBP_InGame_CrosshairContainer_C, BlockedAimCrosshairColor) == 0x000470, "Member 'UWBP_InGame_CrosshairContainer_C::BlockedAimCrosshairColor' has a wrong offset!");

}

