#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JetpackSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_JetpackSlot.WBP_JetpackSlot_C
// 0x0050 (0x03B0 - 0x0360)
class UWBP_JetpackSlot_C final : public UGzEquipmentPocketWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Hover;                                        // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Jetpack_Image;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QualityBar_Image_1;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Stack_ProgressBar;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnHovered_Jetpack;                                 // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsJetpackBroken;                                   // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B32[0x7];                                     // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnJetpackStateChanged;                             // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_WeaponSlot_PocketButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_WBP_JetpackSlot(int32 EntryPoint);
	void HandleEmptyItem();
	void HandleValidItem(const struct FGzInvItem& Item);
	void IsJetpackEnabled();
	void OnAttributeChanged_A3668B97403E351343CA609917C1CE33(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);
	void OnHovered_Jetpack__DelegateSignature(bool ToShow);
	void OnJetpackStateChanged__DelegateSignature(bool StateBroken);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnPocketChanged_BP(const struct FGzInvItem& NewItem);
	void UpdateJetpackState(bool Param_IsJetpackBroken, float InOpacity);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_JetpackSlot_C">();
	}
	static class UWBP_JetpackSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_JetpackSlot_C>();
	}
};
static_assert(alignof(UWBP_JetpackSlot_C) == 0x000008, "Wrong alignment on UWBP_JetpackSlot_C");
static_assert(sizeof(UWBP_JetpackSlot_C) == 0x0003B0, "Wrong size on UWBP_JetpackSlot_C");
static_assert(offsetof(UWBP_JetpackSlot_C, UberGraphFrame) == 0x000360, "Member 'UWBP_JetpackSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_JetpackSlot_C, Anim_Hover) == 0x000368, "Member 'UWBP_JetpackSlot_C::Anim_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_JetpackSlot_C, Jetpack_Image) == 0x000370, "Member 'UWBP_JetpackSlot_C::Jetpack_Image' has a wrong offset!");
static_assert(offsetof(UWBP_JetpackSlot_C, QualityBar_Image_1) == 0x000378, "Member 'UWBP_JetpackSlot_C::QualityBar_Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_JetpackSlot_C, Stack_ProgressBar) == 0x000380, "Member 'UWBP_JetpackSlot_C::Stack_ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_JetpackSlot_C, OnHovered_Jetpack) == 0x000388, "Member 'UWBP_JetpackSlot_C::OnHovered_Jetpack' has a wrong offset!");
static_assert(offsetof(UWBP_JetpackSlot_C, IsJetpackBroken) == 0x000398, "Member 'UWBP_JetpackSlot_C::IsJetpackBroken' has a wrong offset!");
static_assert(offsetof(UWBP_JetpackSlot_C, OnJetpackStateChanged) == 0x0003A0, "Member 'UWBP_JetpackSlot_C::OnJetpackStateChanged' has a wrong offset!");

}

