#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadingScreen_NoHints

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoadingScreen_NoHints.WBP_LoadingScreen_NoHints_C
// 0x0020 (0x0350 - 0x0330)
class UWBP_LoadingScreen_NoHints_C final : public UGzLoadingScreenView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ConceptArt_Image;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UTexture2D>>      BackgroundImages;                                  // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_LoadingScreen_NoHints(int32 EntryPoint);

	TArray<class UWidget*> GetBackgroundWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoadingScreen_NoHints_C">();
	}
	static class UWBP_LoadingScreen_NoHints_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoadingScreen_NoHints_C>();
	}
};
static_assert(alignof(UWBP_LoadingScreen_NoHints_C) == 0x000008, "Wrong alignment on UWBP_LoadingScreen_NoHints_C");
static_assert(sizeof(UWBP_LoadingScreen_NoHints_C) == 0x000350, "Wrong size on UWBP_LoadingScreen_NoHints_C");
static_assert(offsetof(UWBP_LoadingScreen_NoHints_C, UberGraphFrame) == 0x000330, "Member 'UWBP_LoadingScreen_NoHints_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoadingScreen_NoHints_C, ConceptArt_Image) == 0x000338, "Member 'UWBP_LoadingScreen_NoHints_C::ConceptArt_Image' has a wrong offset!");
static_assert(offsetof(UWBP_LoadingScreen_NoHints_C, BackgroundImages) == 0x000340, "Member 'UWBP_LoadingScreen_NoHints_C::BackgroundImages' has a wrong offset!");

}

