#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainNotification_SecondaryIconAndTimer

#include "Basic.hpp"

#include "G01_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainNotification_SecondaryIconAndTimer.WBP_MainNotification_SecondaryIconAndTimer_C.UpdateNotificationData
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_MainNotification_SecondaryIconAndTimer_C_UpdateNotificationData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D10[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNotificationDisplayData*             CallFunc_GetDisplayData_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGzGameNotificationSpec                CallFunc_GetNotificationSpec_ReturnValue;          // 0x0010(0x00A0)(ConstParm)
	double                                        CallFunc_SetTime_Time_ImplicitCast;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainNotification_SecondaryIconAndTimer_C_UpdateNotificationData) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryIconAndTimer_C_UpdateNotificationData");
static_assert(sizeof(WBP_MainNotification_SecondaryIconAndTimer_C_UpdateNotificationData) == 0x0000B8, "Wrong size on WBP_MainNotification_SecondaryIconAndTimer_C_UpdateNotificationData");
static_assert(offsetof(WBP_MainNotification_SecondaryIconAndTimer_C_UpdateNotificationData, ReturnValue) == 0x000000, "Member 'WBP_MainNotification_SecondaryIconAndTimer_C_UpdateNotificationData::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryIconAndTimer_C_UpdateNotificationData, CallFunc_GetDisplayData_ReturnValue) == 0x000008, "Member 'WBP_MainNotification_SecondaryIconAndTimer_C_UpdateNotificationData::CallFunc_GetDisplayData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryIconAndTimer_C_UpdateNotificationData, CallFunc_GetNotificationSpec_ReturnValue) == 0x000010, "Member 'WBP_MainNotification_SecondaryIconAndTimer_C_UpdateNotificationData::CallFunc_GetNotificationSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryIconAndTimer_C_UpdateNotificationData, CallFunc_SetTime_Time_ImplicitCast) == 0x0000B0, "Member 'WBP_MainNotification_SecondaryIconAndTimer_C_UpdateNotificationData::CallFunc_SetTime_Time_ImplicitCast' has a wrong offset!");

}

