#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipInteraction_Backpack

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_TooltipInteraction_Backpack.WBP_TooltipInteraction_Backpack_C.CreateAtributeWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget final
{
public:
	class UGzBackpackItemData*                    BackpackItemData;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGzItemAttribute                       ItemAttribute;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_6776[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 AttributeWidgetClass;                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_BackpackTooltipAttributeBase_C*    CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget");
static_assert(sizeof(WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget) == 0x000030, "Wrong size on WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget, BackpackItemData) == 0x000000, "Member 'WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget::BackpackItemData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget, ItemAttribute) == 0x000008, "Member 'WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget::ItemAttribute' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget, AttributeWidgetClass) == 0x000018, "Member 'WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget::AttributeWidgetClass' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget, CallFunc_AddChild_ReturnValue) == 0x000028, "Member 'WBP_TooltipInteraction_Backpack_C_CreateAtributeWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_TooltipInteraction_Backpack.WBP_TooltipInteraction_Backpack_C.FindAttributes
// 0x0048 (0x0048 - 0x0000)
struct WBP_TooltipInteraction_Backpack_C_FindAttributes final
{
public:
	struct FGzItemAttribute                       Result;                                            // 0x0000(0x000C)(Parm, OutParm, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGzItemAttribute                       K2Node_MakeStruct_GzItemAttribute;                 // 0x0010(0x000C)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6777[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzItemAttribute                       CallFunc_Array_Get_Item;                           // 0x0024(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemAttributeValueMax_OutSuccessful;   // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6778[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzItemAttribute                       CallFunc_GetItemAttributeValueMax_ReturnValue;     // 0x0038(0x000C)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Backpack_C_FindAttributes) == 0x000004, "Wrong alignment on WBP_TooltipInteraction_Backpack_C_FindAttributes");
static_assert(sizeof(WBP_TooltipInteraction_Backpack_C_FindAttributes) == 0x000048, "Wrong size on WBP_TooltipInteraction_Backpack_C_FindAttributes");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_FindAttributes, Result) == 0x000000, "Member 'WBP_TooltipInteraction_Backpack_C_FindAttributes::Result' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_FindAttributes, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_TooltipInteraction_Backpack_C_FindAttributes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_FindAttributes, K2Node_MakeStruct_GzItemAttribute) == 0x000010, "Member 'WBP_TooltipInteraction_Backpack_C_FindAttributes::K2Node_MakeStruct_GzItemAttribute' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_FindAttributes, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_TooltipInteraction_Backpack_C_FindAttributes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_FindAttributes, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_TooltipInteraction_Backpack_C_FindAttributes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_FindAttributes, CallFunc_Array_Get_Item) == 0x000024, "Member 'WBP_TooltipInteraction_Backpack_C_FindAttributes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_FindAttributes, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_TooltipInteraction_Backpack_C_FindAttributes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_FindAttributes, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WBP_TooltipInteraction_Backpack_C_FindAttributes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_FindAttributes, CallFunc_GetItemAttributeValueMax_OutSuccessful) == 0x000035, "Member 'WBP_TooltipInteraction_Backpack_C_FindAttributes::CallFunc_GetItemAttributeValueMax_OutSuccessful' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_FindAttributes, CallFunc_GetItemAttributeValueMax_ReturnValue) == 0x000038, "Member 'WBP_TooltipInteraction_Backpack_C_FindAttributes::CallFunc_GetItemAttributeValueMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_FindAttributes, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WBP_TooltipInteraction_Backpack_C_FindAttributes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_TooltipInteraction_Backpack.WBP_TooltipInteraction_Backpack_C.InitItemSetup
// 0x0040 (0x0040 - 0x0000)
struct WBP_TooltipInteraction_Backpack_C_InitItemSetup final
{
public:
	class UGzBackpackItemData*                    BackpackItemData;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGzItemAttribute                       ItrmAttribute;                                     // 0x0008(0x000C)(Edit, BlueprintVisible, NoDestructor)
	EGzItemRarity                                 CallFunc_GetRarity_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6779[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetRarityColor_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_677A[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzItemAttribute                       CallFunc_FindAttributes_Result;                    // 0x002C(0x000C)(NoDestructor)
	int32                                         CallFunc_GetBackpackPocketDefsCount_ReturnValue;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Backpack_C_InitItemSetup) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Backpack_C_InitItemSetup");
static_assert(sizeof(WBP_TooltipInteraction_Backpack_C_InitItemSetup) == 0x000040, "Wrong size on WBP_TooltipInteraction_Backpack_C_InitItemSetup");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_InitItemSetup, BackpackItemData) == 0x000000, "Member 'WBP_TooltipInteraction_Backpack_C_InitItemSetup::BackpackItemData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_InitItemSetup, ItrmAttribute) == 0x000008, "Member 'WBP_TooltipInteraction_Backpack_C_InitItemSetup::ItrmAttribute' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_InitItemSetup, CallFunc_GetRarity_ReturnValue) == 0x000014, "Member 'WBP_TooltipInteraction_Backpack_C_InitItemSetup::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_InitItemSetup, CallFunc_GetRarityColor_ReturnValue) == 0x000018, "Member 'WBP_TooltipInteraction_Backpack_C_InitItemSetup::CallFunc_GetRarityColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_InitItemSetup, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000028, "Member 'WBP_TooltipInteraction_Backpack_C_InitItemSetup::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_InitItemSetup, CallFunc_FindAttributes_Result) == 0x00002C, "Member 'WBP_TooltipInteraction_Backpack_C_InitItemSetup::CallFunc_FindAttributes_Result' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_InitItemSetup, CallFunc_GetBackpackPocketDefsCount_ReturnValue) == 0x000038, "Member 'WBP_TooltipInteraction_Backpack_C_InitItemSetup::CallFunc_GetBackpackPocketDefsCount_ReturnValue' has a wrong offset!");

// Function WBP_TooltipInteraction_Backpack.WBP_TooltipInteraction_Backpack_C.SetItemDescription
// 0x0028 (0x0028 - 0x0000)
struct WBP_TooltipInteraction_Backpack_C_SetItemDescription final
{
public:
	class UGzBackpackItemData*                    Param_ItemData;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetShortDescription_ReturnValue;          // 0x0008(0x0010)(ConstParm)
	class FText                                   CallFunc_CutText_Result;                           // 0x0018(0x0010)()
};
static_assert(alignof(WBP_TooltipInteraction_Backpack_C_SetItemDescription) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Backpack_C_SetItemDescription");
static_assert(sizeof(WBP_TooltipInteraction_Backpack_C_SetItemDescription) == 0x000028, "Wrong size on WBP_TooltipInteraction_Backpack_C_SetItemDescription");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_SetItemDescription, Param_ItemData) == 0x000000, "Member 'WBP_TooltipInteraction_Backpack_C_SetItemDescription::Param_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_SetItemDescription, CallFunc_GetShortDescription_ReturnValue) == 0x000008, "Member 'WBP_TooltipInteraction_Backpack_C_SetItemDescription::CallFunc_GetShortDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_SetItemDescription, CallFunc_CutText_Result) == 0x000018, "Member 'WBP_TooltipInteraction_Backpack_C_SetItemDescription::CallFunc_CutText_Result' has a wrong offset!");

// Function WBP_TooltipInteraction_Backpack.WBP_TooltipInteraction_Backpack_C.SetPickable
// 0x0008 (0x0008 - 0x0000)
struct WBP_TooltipInteraction_Backpack_C_SetPickable final
{
public:
	class AGzPickableBase*                        InPickable;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Backpack_C_SetPickable) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Backpack_C_SetPickable");
static_assert(sizeof(WBP_TooltipInteraction_Backpack_C_SetPickable) == 0x000008, "Wrong size on WBP_TooltipInteraction_Backpack_C_SetPickable");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_SetPickable, InPickable) == 0x000000, "Member 'WBP_TooltipInteraction_Backpack_C_SetPickable::InPickable' has a wrong offset!");

// Function WBP_TooltipInteraction_Backpack.WBP_TooltipInteraction_Backpack_C.UpdateTooltip
// 0x0018 (0x0018 - 0x0000)
struct WBP_TooltipInteraction_Backpack_C_UpdateTooltip final
{
public:
	class UGzItemData*                            CallFunc_GetItemData_ItemData;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzBackpackItemData*                    K2Node_DynamicCast_AsGz_Backpack_Item_Data;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipInteraction_Backpack_C_UpdateTooltip) == 0x000008, "Wrong alignment on WBP_TooltipInteraction_Backpack_C_UpdateTooltip");
static_assert(sizeof(WBP_TooltipInteraction_Backpack_C_UpdateTooltip) == 0x000018, "Wrong size on WBP_TooltipInteraction_Backpack_C_UpdateTooltip");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_UpdateTooltip, CallFunc_GetItemData_ItemData) == 0x000000, "Member 'WBP_TooltipInteraction_Backpack_C_UpdateTooltip::CallFunc_GetItemData_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_UpdateTooltip, K2Node_DynamicCast_AsGz_Backpack_Item_Data) == 0x000008, "Member 'WBP_TooltipInteraction_Backpack_C_UpdateTooltip::K2Node_DynamicCast_AsGz_Backpack_Item_Data' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_UpdateTooltip, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_TooltipInteraction_Backpack_C_UpdateTooltip::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TooltipInteraction_Backpack_C_UpdateTooltip, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_TooltipInteraction_Backpack_C_UpdateTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

