#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BackpackAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "EBackpackSlotState_structs.hpp"
#include "G01_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BackpackAbility.WBP_BackpackAbility_C
// 0x00B8 (0x0398 - 0x02E0)
class UWBP_BackpackAbility_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LimbRechargerAnimation;                            // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SoldierFillAnimation;                              // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeAnimation;                                     // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AppearAnimation;                                   // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AbilityIcon;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border_Image;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Quality_Image;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTag                           BackpackAbilityTags;                               // 0x0328(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MaxValue;                                          // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentValue;                                      // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6715[0x4];                                     // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer;                                             // 0x0340(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Item_Type;                                         // 0x0348(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGzItemData*                            Backpack;                                          // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           MyCharacter;                                       // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           AsyncTaskGridArmor;                                // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    AsyncTaskAutoReload;                               // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGzInvItem                             Backpack_Item;                                     // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UGzAsyncTaskGameplayTagAddedRemoved*    LimbRechargerAsyncTask;                            // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    ListenForLimbRechargingAsyncTask;                  // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableSolderReload;                                // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableEWard;                                       // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBackpackSlotState                            BackpackSlotState;                                 // 0x0392(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetProgresPercent(float InPercent);
	void SetBackpackSlotState(EBackpackSlotState State);
	bool CheckIfParentHasBackpackTag();
	void InitializeGridshield(bool* bIsGridShield, float* Percent);
	void HasBackpack(bool* bHasBackpack, struct FGzInvItem* BackpackItem);
	bool IsBasicBackpack();
	void UpdateBasicBackpack();
	void ResetAll();
	void SoldierReload(int32 GunAmmo);
	void UnbindWeaponReload(class AGzWeaponActor* Weapon);
	class UGzCombatComponent* GetCombatComponent();
	void InventoryChanged(EGzInvChangeEvent State, const struct FGzInvItem& Item);
	void AbilitySetup();
	void UpdateAbilityBackpack(double NewEnergy);
	void OnAttributeChanged_E53347D844482C80833FC7BB2B8FFBC0(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);
	void OnTagRemoved_7463BDA74169165BC623689E75CEC2CF(const struct FGameplayTag& Tag);
	void OnTagAdded_7463BDA74169165BC623689E75CEC2CF(const struct FGameplayTag& Tag);
	void OnTagRemoved_64C7CB5A46D638E9DED166A4CD78615C(const struct FGameplayTag& Tag);
	void OnTagAdded_64C7CB5A46D638E9DED166A4CD78615C(const struct FGameplayTag& Tag);
	void OnTagRemoved_87C61F2549B436027584F29817510D0B(const struct FGameplayTag& Tag);
	void OnTagAdded_87C61F2549B436027584F29817510D0B(const struct FGameplayTag& Tag);
	void OnTagRemoved_3A113ABB4499C80CD9655894254F1F68(const struct FGameplayTag& Tag);
	void OnTagAdded_3A113ABB4499C80CD9655894254F1F68(const struct FGameplayTag& Tag);
	void ListenForAttributes();
	void WeaponChanged(const struct FGzInvPocketId& PocketId, class AGzWeaponActor* WeaponActor);
	void Destruct();
	void InitializeWidget(class APawn* OldPawn, class APawn* NewPawn);
	void Construct();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void ExecuteUbergraph_WBP_BackpackAbility(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BackpackAbility_C">();
	}
	static class UWBP_BackpackAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BackpackAbility_C>();
	}
};
static_assert(alignof(UWBP_BackpackAbility_C) == 0x000008, "Wrong alignment on UWBP_BackpackAbility_C");
static_assert(sizeof(UWBP_BackpackAbility_C) == 0x000398, "Wrong size on UWBP_BackpackAbility_C");
static_assert(offsetof(UWBP_BackpackAbility_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_BackpackAbility_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, LimbRechargerAnimation) == 0x0002E8, "Member 'UWBP_BackpackAbility_C::LimbRechargerAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, SoldierFillAnimation) == 0x0002F0, "Member 'UWBP_BackpackAbility_C::SoldierFillAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, FadeAnimation) == 0x0002F8, "Member 'UWBP_BackpackAbility_C::FadeAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, AppearAnimation) == 0x000300, "Member 'UWBP_BackpackAbility_C::AppearAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, AbilityIcon) == 0x000308, "Member 'UWBP_BackpackAbility_C::AbilityIcon' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, Border_Image) == 0x000310, "Member 'UWBP_BackpackAbility_C::Border_Image' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, ProgressBar) == 0x000318, "Member 'UWBP_BackpackAbility_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, Quality_Image) == 0x000320, "Member 'UWBP_BackpackAbility_C::Quality_Image' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, BackpackAbilityTags) == 0x000328, "Member 'UWBP_BackpackAbility_C::BackpackAbilityTags' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, MaxValue) == 0x000330, "Member 'UWBP_BackpackAbility_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, CurrentValue) == 0x000338, "Member 'UWBP_BackpackAbility_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, Timer) == 0x000340, "Member 'UWBP_BackpackAbility_C::Timer' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, Item_Type) == 0x000348, "Member 'UWBP_BackpackAbility_C::Item_Type' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, Backpack) == 0x000350, "Member 'UWBP_BackpackAbility_C::Backpack' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, MyCharacter) == 0x000358, "Member 'UWBP_BackpackAbility_C::MyCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, AsyncTaskGridArmor) == 0x000360, "Member 'UWBP_BackpackAbility_C::AsyncTaskGridArmor' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, AsyncTaskAutoReload) == 0x000368, "Member 'UWBP_BackpackAbility_C::AsyncTaskAutoReload' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, Backpack_Item) == 0x000370, "Member 'UWBP_BackpackAbility_C::Backpack_Item' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, LimbRechargerAsyncTask) == 0x000380, "Member 'UWBP_BackpackAbility_C::LimbRechargerAsyncTask' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, ListenForLimbRechargingAsyncTask) == 0x000388, "Member 'UWBP_BackpackAbility_C::ListenForLimbRechargingAsyncTask' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, EnableSolderReload) == 0x000390, "Member 'UWBP_BackpackAbility_C::EnableSolderReload' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, EnableEWard) == 0x000391, "Member 'UWBP_BackpackAbility_C::EnableEWard' has a wrong offset!");
static_assert(offsetof(UWBP_BackpackAbility_C, BackpackSlotState) == 0x000392, "Member 'UWBP_BackpackAbility_C::BackpackSlotState' has a wrong offset!");

}

