#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Celebration_Screen

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Celebration_Screen.WBP_Celebration_Screen_C.UpdateMatchEndResults
// 0x0090 (0x0090 - 0x0000)
struct WBP_Celebration_Screen_C_UpdateMatchEndResults final
{
public:
	struct FGzMatchEndResult                      Result;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGzMatchEndPlayerResult                CallFunc_Array_Get_Item;                           // 0x0020(0x0048)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_WinnerProfileItem_C*               CallFunc_Create_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5998[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Celebration_Screen_C_UpdateMatchEndResults) == 0x000008, "Wrong alignment on WBP_Celebration_Screen_C_UpdateMatchEndResults");
static_assert(sizeof(WBP_Celebration_Screen_C_UpdateMatchEndResults) == 0x000090, "Wrong size on WBP_Celebration_Screen_C_UpdateMatchEndResults");
static_assert(offsetof(WBP_Celebration_Screen_C_UpdateMatchEndResults, Result) == 0x000000, "Member 'WBP_Celebration_Screen_C_UpdateMatchEndResults::Result' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_UpdateMatchEndResults, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_Celebration_Screen_C_UpdateMatchEndResults::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_UpdateMatchEndResults, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_Celebration_Screen_C_UpdateMatchEndResults::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_UpdateMatchEndResults, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Celebration_Screen_C_UpdateMatchEndResults::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_UpdateMatchEndResults, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'WBP_Celebration_Screen_C_UpdateMatchEndResults::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_UpdateMatchEndResults, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'WBP_Celebration_Screen_C_UpdateMatchEndResults::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_UpdateMatchEndResults, CallFunc_GetOwningPlayer_ReturnValue) == 0x000070, "Member 'WBP_Celebration_Screen_C_UpdateMatchEndResults::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_UpdateMatchEndResults, CallFunc_Create_ReturnValue) == 0x000078, "Member 'WBP_Celebration_Screen_C_UpdateMatchEndResults::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_UpdateMatchEndResults, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'WBP_Celebration_Screen_C_UpdateMatchEndResults::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_UpdateMatchEndResults, CallFunc_Add_IntInt_ReturnValue_1) == 0x000084, "Member 'WBP_Celebration_Screen_C_UpdateMatchEndResults::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_UpdateMatchEndResults, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000088, "Member 'WBP_Celebration_Screen_C_UpdateMatchEndResults::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function WBP_Celebration_Screen.WBP_Celebration_Screen_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Celebration_Screen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Celebration_Screen_C_Tick) == 0x000004, "Wrong alignment on WBP_Celebration_Screen_C_Tick");
static_assert(sizeof(WBP_Celebration_Screen_C_Tick) == 0x00003C, "Wrong size on WBP_Celebration_Screen_C_Tick");
static_assert(offsetof(WBP_Celebration_Screen_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Celebration_Screen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Celebration_Screen_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Celebration_Screen.WBP_Celebration_Screen_C.ExecuteUbergraph_WBP_Celebration_Screen
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5999[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzGameState*                           K2Node_DynamicCast_AsGz_Game_State;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599A[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzMatchEndResult                      CallFunc_GetMatchEndResult_ReturnValue;            // 0x0020(0x0018)(ConstParm)
	TDelegate<void(const struct FGzMatchEndResult& Result)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzNavigationWidget*                    CallFunc_AddWidgetCached_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_EscapeMenu_ExitPrompt_C*           K2Node_DynamicCast_AsWBP_Escape_Menu_Exit_Prompt;  // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599B[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerController*                    K2Node_DynamicCast_AsGz_Player_Controller;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599C[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0084(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchEndResult_ReturnValue;            // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen) == 0x000008, "Wrong alignment on WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen");
static_assert(sizeof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen) == 0x0000D0, "Wrong size on WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, EntryPoint) == 0x000000, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, K2Node_DynamicCast_AsGz_Game_State) == 0x000010, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::K2Node_DynamicCast_AsGz_Game_State' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, CallFunc_GetMatchEndResult_ReturnValue) == 0x000020, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::CallFunc_GetMatchEndResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, K2Node_ComponentBoundEvent_Button) == 0x000048, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, CallFunc_GetNavigationRoot_ReturnValue) == 0x000050, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::CallFunc_GetNavigationRoot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, CallFunc_AddWidgetCached_ReturnValue) == 0x000058, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::CallFunc_AddWidgetCached_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, K2Node_DynamicCast_AsWBP_Escape_Menu_Exit_Prompt) == 0x000060, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::K2Node_DynamicCast_AsWBP_Escape_Menu_Exit_Prompt' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, CallFunc_GetOwningPlayer_ReturnValue) == 0x000070, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, K2Node_DynamicCast_AsGz_Player_Controller) == 0x000078, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::K2Node_DynamicCast_AsGz_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, K2Node_Event_MyGeometry) == 0x000084, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, K2Node_Event_InDeltaTime) == 0x0000BC, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000C0, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000C8, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C9, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen, CallFunc_HasMatchEndResult_ReturnValue) == 0x0000CA, "Member 'WBP_Celebration_Screen_C_ExecuteUbergraph_WBP_Celebration_Screen::CallFunc_HasMatchEndResult_ReturnValue' has a wrong offset!");

// Function WBP_Celebration_Screen.WBP_Celebration_Screen_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Celebration_Screen_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	struct FGzMatchEndResult                      Result;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Celebration_Screen_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on WBP_Celebration_Screen_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(WBP_Celebration_Screen_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000018, "Wrong size on WBP_Celebration_Screen_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(WBP_Celebration_Screen_C_CREATEDELEGATE_PROXYFUNCTION_0, Result) == 0x000000, "Member 'WBP_Celebration_Screen_C_CREATEDELEGATE_PROXYFUNCTION_0::Result' has a wrong offset!");

// Function WBP_Celebration_Screen.WBP_Celebration_Screen_C.BndEvt__WBP_PostMatch_Screen_LeaveMatch_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Celebration_Screen_C_BndEvt__WBP_PostMatch_Screen_LeaveMatch_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Celebration_Screen_C_BndEvt__WBP_PostMatch_Screen_LeaveMatch_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Celebration_Screen_C_BndEvt__WBP_PostMatch_Screen_LeaveMatch_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Celebration_Screen_C_BndEvt__WBP_PostMatch_Screen_LeaveMatch_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Celebration_Screen_C_BndEvt__WBP_PostMatch_Screen_LeaveMatch_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Celebration_Screen_C_BndEvt__WBP_PostMatch_Screen_LeaveMatch_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Celebration_Screen_C_BndEvt__WBP_PostMatch_Screen_LeaveMatch_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Celebration_Screen.WBP_Celebration_Screen_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Celebration_Screen_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Celebration_Screen_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Celebration_Screen_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Celebration_Screen_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_Celebration_Screen_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Celebration_Screen_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Celebration_Screen_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

