#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DynamicInventory

#include "Basic.hpp"

#include "G01_structs.hpp"


namespace SDK::Params
{

// Function WBP_DynamicInventory.WBP_DynamicInventory_C.ED_Item_New_Data__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_DynamicInventory_C_ED_Item_New_Data__DelegateSignature final
{
public:
	struct FGzInvItem                             NewItem;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_DynamicInventory_C_ED_Item_New_Data__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DynamicInventory_C_ED_Item_New_Data__DelegateSignature");
static_assert(sizeof(WBP_DynamicInventory_C_ED_Item_New_Data__DelegateSignature) == 0x000010, "Wrong size on WBP_DynamicInventory_C_ED_Item_New_Data__DelegateSignature");
static_assert(offsetof(WBP_DynamicInventory_C_ED_Item_New_Data__DelegateSignature, NewItem) == 0x000000, "Member 'WBP_DynamicInventory_C_ED_Item_New_Data__DelegateSignature::NewItem' has a wrong offset!");

// Function WBP_DynamicInventory.WBP_DynamicInventory_C.ExecuteUbergraph_WBP_DynamicInventory
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DynamicSlotLocked_C*               CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C8[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzPocketWidget*                        K2Node_Event_PocketWidget;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C9[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47CA[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47CB[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue_1;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGzInvItem& NewItem)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_DynamicSlotLocked_C*               CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47CC[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_1;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47CD[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzPocketWidget*                        CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGzInvItem                             K2Node_CustomEvent_NewItem;                        // 0x00A8(0x0010)(ConstParm)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory) == 0x000008, "Wrong alignment on WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory");
static_assert(sizeof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory) == 0x0000D8, "Wrong size on WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, EntryPoint) == 0x000000, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, K2Node_Event_PocketWidget) == 0x000020, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::K2Node_Event_PocketWidget' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, K2Node_Event_Index) == 0x000028, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_Divide_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_Percent_IntInt_ReturnValue) == 0x000030, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000038, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, Temp_int_Variable) == 0x000040, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_Divide_IntInt_ReturnValue_1) == 0x000048, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_Percent_IntInt_ReturnValue_1) == 0x00004C, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_AddChildToUniformGrid_ReturnValue_1) == 0x000058, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_AddChildToUniformGrid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_Map_Length_ReturnValue) == 0x000060, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, K2Node_CustomEvent_Button_1) == 0x000088, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_Array_RemoveItem_ReturnValue) == 0x000090, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x000098, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, K2Node_CustomEvent_Button) == 0x0000A0, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, K2Node_CustomEvent_NewItem) == 0x0000A8, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::K2Node_CustomEvent_NewItem' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B8, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C8, "Member 'WBP_DynamicInventory_C_ExecuteUbergraph_WBP_DynamicInventory::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_DynamicInventory.WBP_DynamicInventory_C.ItemButtonHover__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_DynamicInventory_C_ItemButtonHover__DelegateSignature final
{
public:
	bool                                          IsHover;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47CE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzInvItem                             Item;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_DynamicInventory_C_ItemButtonHover__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DynamicInventory_C_ItemButtonHover__DelegateSignature");
static_assert(sizeof(WBP_DynamicInventory_C_ItemButtonHover__DelegateSignature) == 0x000018, "Wrong size on WBP_DynamicInventory_C_ItemButtonHover__DelegateSignature");
static_assert(offsetof(WBP_DynamicInventory_C_ItemButtonHover__DelegateSignature, IsHover) == 0x000000, "Member 'WBP_DynamicInventory_C_ItemButtonHover__DelegateSignature::IsHover' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_ItemButtonHover__DelegateSignature, Item) == 0x000008, "Member 'WBP_DynamicInventory_C_ItemButtonHover__DelegateSignature::Item' has a wrong offset!");

// Function WBP_DynamicInventory.WBP_DynamicInventory_C.OnButtonBaseHovered_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_DynamicInventory_C_OnButtonBaseHovered_Event final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DynamicInventory_C_OnButtonBaseHovered_Event) == 0x000008, "Wrong alignment on WBP_DynamicInventory_C_OnButtonBaseHovered_Event");
static_assert(sizeof(WBP_DynamicInventory_C_OnButtonBaseHovered_Event) == 0x000008, "Wrong size on WBP_DynamicInventory_C_OnButtonBaseHovered_Event");
static_assert(offsetof(WBP_DynamicInventory_C_OnButtonBaseHovered_Event, Button) == 0x000000, "Member 'WBP_DynamicInventory_C_OnButtonBaseHovered_Event::Button' has a wrong offset!");

// Function WBP_DynamicInventory.WBP_DynamicInventory_C.OnButtonBaseUnhovered_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_DynamicInventory_C_OnButtonBaseUnhovered_Event final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DynamicInventory_C_OnButtonBaseUnhovered_Event) == 0x000008, "Wrong alignment on WBP_DynamicInventory_C_OnButtonBaseUnhovered_Event");
static_assert(sizeof(WBP_DynamicInventory_C_OnButtonBaseUnhovered_Event) == 0x000008, "Wrong size on WBP_DynamicInventory_C_OnButtonBaseUnhovered_Event");
static_assert(offsetof(WBP_DynamicInventory_C_OnButtonBaseUnhovered_Event, Button) == 0x000000, "Member 'WBP_DynamicInventory_C_OnButtonBaseUnhovered_Event::Button' has a wrong offset!");

// Function WBP_DynamicInventory.WBP_DynamicInventory_C.OnPocketWidgetAdded
// 0x0010 (0x0010 - 0x0000)
struct WBP_DynamicInventory_C_OnPocketWidgetAdded final
{
public:
	class UGzPocketWidget*                        PocketWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DynamicInventory_C_OnPocketWidgetAdded) == 0x000008, "Wrong alignment on WBP_DynamicInventory_C_OnPocketWidgetAdded");
static_assert(sizeof(WBP_DynamicInventory_C_OnPocketWidgetAdded) == 0x000010, "Wrong size on WBP_DynamicInventory_C_OnPocketWidgetAdded");
static_assert(offsetof(WBP_DynamicInventory_C_OnPocketWidgetAdded, PocketWidget) == 0x000000, "Member 'WBP_DynamicInventory_C_OnPocketWidgetAdded::PocketWidget' has a wrong offset!");
static_assert(offsetof(WBP_DynamicInventory_C_OnPocketWidgetAdded, Param_Index) == 0x000008, "Member 'WBP_DynamicInventory_C_OnPocketWidgetAdded::Param_Index' has a wrong offset!");

// Function WBP_DynamicInventory.WBP_DynamicInventory_C.OnPocketWidgetDataChanged_Event
// 0x0010 (0x0010 - 0x0000)
struct WBP_DynamicInventory_C_OnPocketWidgetDataChanged_Event final
{
public:
	struct FGzInvItem                             NewItem;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_DynamicInventory_C_OnPocketWidgetDataChanged_Event) == 0x000008, "Wrong alignment on WBP_DynamicInventory_C_OnPocketWidgetDataChanged_Event");
static_assert(sizeof(WBP_DynamicInventory_C_OnPocketWidgetDataChanged_Event) == 0x000010, "Wrong size on WBP_DynamicInventory_C_OnPocketWidgetDataChanged_Event");
static_assert(offsetof(WBP_DynamicInventory_C_OnPocketWidgetDataChanged_Event, NewItem) == 0x000000, "Member 'WBP_DynamicInventory_C_OnPocketWidgetDataChanged_Event::NewItem' has a wrong offset!");

}

