#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SquadPanelEntry

#include "Basic.hpp"

#include "E_SquadInfoStates_structs.hpp"
#include "G01_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function WBP_SquadPanelEntry.WBP_SquadPanelEntry_C.Check for Deployment State
// 0x0018 (0x0018 - 0x0000)
struct WBP_SquadPanelEntry_C_Check_for_Deployment_State final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzDeploymentPawn*                      K2Node_DynamicCast_AsGz_Deployment_Pawn;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SquadPanelEntry_C_Check_for_Deployment_State) == 0x000008, "Wrong alignment on WBP_SquadPanelEntry_C_Check_for_Deployment_State");
static_assert(sizeof(WBP_SquadPanelEntry_C_Check_for_Deployment_State) == 0x000018, "Wrong size on WBP_SquadPanelEntry_C_Check_for_Deployment_State");
static_assert(offsetof(WBP_SquadPanelEntry_C_Check_for_Deployment_State, Pawn) == 0x000000, "Member 'WBP_SquadPanelEntry_C_Check_for_Deployment_State::Pawn' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_Check_for_Deployment_State, K2Node_DynamicCast_AsGz_Deployment_Pawn) == 0x000008, "Member 'WBP_SquadPanelEntry_C_Check_for_Deployment_State::K2Node_DynamicCast_AsGz_Deployment_Pawn' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_Check_for_Deployment_State, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_SquadPanelEntry_C_Check_for_Deployment_State::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_Check_for_Deployment_State, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_SquadPanelEntry_C_Check_for_Deployment_State::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_SquadPanelEntry.WBP_SquadPanelEntry_C.ExecuteUbergraph_WBP_SquadPanelEntry
// 0x0450 (0x0450 - 0x0000)
struct WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzGameState* GameState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC6[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0018(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0070(0x0038)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC7[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue;  // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC8[0x2];                                     // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag_7;                          // 0x00C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_6;                          // 0x00EC(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x00F4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC9[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue_1; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DCA[0x2];                                     // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag_5;                          // 0x0114(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x012C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_4;                          // 0x013C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0144(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DCB[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DCC[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x016C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x017C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_3;                          // 0x018C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0194(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_2;                          // 0x01A4(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x01AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x01BC(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x01C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x01D4(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x01DC(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x01E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x01F4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SquadInfoStates                             Temp_byte_Variable;                                // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SquadInfoStates                             Temp_byte_Variable_1;                              // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DCD[0x1];                                     // 0x01FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     Temp_struct_Variable_5;                            // 0x0200(0x0038)(HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x0240(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x0250(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x0260(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x0270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute_1;                    // 0x0280(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_1;                     // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue_1;                     // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_17;           // 0x02C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate_18;           // 0x02D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_19;           // 0x02E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGzPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_20;           // 0x02F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0300(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DCE[0x4];                                     // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue_1;                    // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DCF[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_2; // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD0[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           K2Node_CustomEvent_Player;                         // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_NewPawn;                        // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_OldPawn;                        // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_3; // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD1[0x7];                                     // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerState*                         K2Node_CustomEvent_PlayerState;                    // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD2[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue_2; // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           CallFunc_ListenForAttributeChange_ReturnValue;     // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD3[0x6];                                     // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBleeding_ReturnValue;                   // 0x03D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SquadInfoStates                             K2Node_Select_Default;                             // 0x03D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD4[0x4];                                     // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD5[0x7];                                     // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue_3; // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           CallFunc_ListenForAttributeChange_ReturnValue_1;   // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD6[0x6];                                     // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzExtractionRoyaleGameState*           K2Node_DynamicCast_AsGz_Extraction_Royale_Game_State; // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD7[0x3];                                     // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGzEventNotificationData& ActedEvent)> K2Node_CreateDelegate_OutputDelegate_21;           // 0x0414(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD8[0x4];                                     // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSoloGamemode_bIsSolos;                  // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD9[0x7];                                     // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzExtractionRoyaleGameState*           K2Node_DynamicCast_AsGz_Extraction_Royale_Game_State_1; // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry) == 0x000008, "Wrong alignment on WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry");
static_assert(sizeof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry) == 0x000450, "Wrong size on WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, EntryPoint) == 0x000000, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_Attribute) == 0x000018, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_NewValue) == 0x000050, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_OldValue) == 0x000054, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, Temp_real_Variable) == 0x000068, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, Temp_real_Variable_1) == 0x00006C, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, Temp_struct_Variable) == 0x000070, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_GetGzAbilitySystemComponent_ReturnValue) == 0x0000B0, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_GetGzAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue) == 0x0000B8, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_2) == 0x0000C1, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_Tag_7) == 0x0000C4, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_Tag_7' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000CC, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000DC, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_Tag_6) == 0x0000EC, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_Tag_6' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, Temp_struct_Variable_1) == 0x0000F4, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_3) == 0x0000FC, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_GetGzAbilitySystemComponent_ReturnValue_1) == 0x000100, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_GetGzAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1) == 0x000108, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_4) == 0x000110, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_5) == 0x000111, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_Tag_5) == 0x000114, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_Tag_5' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_4) == 0x00011C, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_5) == 0x00012C, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_Tag_4) == 0x00013C, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_Tag_4' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, Temp_struct_Variable_2) == 0x000144, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_6) == 0x00014C, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_GetPawn_ReturnValue) == 0x000150, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_6) == 0x000158, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_7) == 0x000168, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_7) == 0x00016C, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_8) == 0x00017C, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_Tag_3) == 0x00018C, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_Tag_3' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_9) == 0x000194, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_Tag_2) == 0x0001A4, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_Tag_2' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_10) == 0x0001AC, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, Temp_struct_Variable_3) == 0x0001BC, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_11) == 0x0001C4, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_Tag_1) == 0x0001D4, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_Tag) == 0x0001DC, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_12) == 0x0001E4, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, Temp_struct_Variable_4) == 0x0001F4, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, Temp_bool_Variable) == 0x0001FC, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, Temp_byte_Variable) == 0x0001FD, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, Temp_byte_Variable_1) == 0x0001FE, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, Temp_struct_Variable_5) == 0x000200, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, Temp_real_Variable_2) == 0x000238, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, Temp_real_Variable_3) == 0x00023C, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_13) == 0x000240, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_14) == 0x000250, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_15) == 0x000260, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_16) == 0x000270, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_Attribute_1) == 0x000280, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_Attribute_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_NewValue_1) == 0x0002B8, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_OldValue_1) == 0x0002BC, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_OldValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_17) == 0x0002C0, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_18) == 0x0002D0, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_19) == 0x0002E0, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_20) == 0x0002F0, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_Event_MyGeometry) == 0x000300, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_Event_InDeltaTime) == 0x000338, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_GetPawn_ReturnValue_1) == 0x000340, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000348, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_8) == 0x000350, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_2) == 0x000358, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_9) == 0x000360, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_Player) == 0x000368, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_NewPawn) == 0x000370, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_NewPawn' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_OldPawn) == 0x000378, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_OldPawn' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000380, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_3) == 0x000388, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_10) == 0x000390, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CustomEvent_PlayerState) == 0x000398, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_11) == 0x0003A0, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_GetGzAbilitySystemComponent_ReturnValue_2) == 0x0003A8, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_GetGzAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_ListenForAttributeChange_ReturnValue) == 0x0003B0, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_ListenForAttributeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_12) == 0x0003B8, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_13) == 0x0003B9, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0003C0, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0003C8, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0003D0, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_14) == 0x0003D1, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsBleeding_ReturnValue) == 0x0003D2, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsBleeding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_Select_Default) == 0x0003D3, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_PlayAnimation_ReturnValue) == 0x0003D8, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_15) == 0x0003E0, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_GetGzAbilitySystemComponent_ReturnValue_3) == 0x0003E8, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_GetGzAbilitySystemComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_ListenForAttributeChange_ReturnValue_1) == 0x0003F0, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_ListenForAttributeChange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_16) == 0x0003F8, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsValid_ReturnValue_17) == 0x0003F9, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsValid_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_GetGameState_ReturnValue) == 0x000400, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_DynamicCast_AsGz_Extraction_Royale_Game_State) == 0x000408, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_DynamicCast_AsGz_Extraction_Royale_Game_State' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_DynamicCast_bSuccess) == 0x000410, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_CreateDelegate_OutputDelegate_21) == 0x000414, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_CreateDelegate_OutputDelegate_21' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_GetOwningPlayer_ReturnValue) == 0x000428, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_GetGameState_ReturnValue_1) == 0x000430, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, CallFunc_IsSoloGamemode_bIsSolos) == 0x000438, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::CallFunc_IsSoloGamemode_bIsSolos' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_DynamicCast_AsGz_Extraction_Royale_Game_State_1) == 0x000440, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_DynamicCast_AsGz_Extraction_Royale_Game_State_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry, K2Node_DynamicCast_bSuccess_1) == 0x000448, "Member 'WBP_SquadPanelEntry_C_ExecuteUbergraph_WBP_SquadPanelEntry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_SquadPanelEntry.WBP_SquadPanelEntry_C.InitializePlayerInformation
// 0x0128 (0x0128 - 0x0000)
struct WBP_SquadPanelEntry_C_InitializePlayerInformation final
{
public:
	class AGzPlayerState*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 PlayerClanTag;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DDA[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DDB[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DDC[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerSubscriptionIsValid_ReturnValue; // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DDD[0x5];                                     // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerClanTag_ReturnValue;             // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DDE[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexInTeam_OutputPin;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexInTeam_OutputPin_1;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DDF[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetTeammateShapeFromIndex_NewParam;       // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetTeammateColorFromIndex_OutPlayerColor; // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00F0(0x0014)()
	uint8                                         Pad_6DE0[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0118(0x0010)()
};
static_assert(alignof(WBP_SquadPanelEntry_C_InitializePlayerInformation) == 0x000008, "Wrong alignment on WBP_SquadPanelEntry_C_InitializePlayerInformation");
static_assert(sizeof(WBP_SquadPanelEntry_C_InitializePlayerInformation) == 0x000128, "Wrong size on WBP_SquadPanelEntry_C_InitializePlayerInformation");
static_assert(offsetof(WBP_SquadPanelEntry_C_InitializePlayerInformation, PlayerState) == 0x000000, "Member 'WBP_SquadPanelEntry_C_InitializePlayerInformation::PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_InitializePlayerInformation, PlayerClanTag) == 0x000008, "Member 'WBP_SquadPanelEntry_C_InitializePlayerInformation::PlayerClanTag' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_InitializePlayerInformation, Temp_bool_Variable) == 0x000018, "Member 'WBP_SquadPanelEntry_C_InitializePlayerInformation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_InitializePlayerInformation, Temp_byte_Variable) == 0x000019, "Member 'WBP_SquadPanelEntry_C_InitializePlayerInformation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_InitializePlayerInformation, Temp_byte_Variable_1) == 0x00001A, "Member 'WBP_SquadPanelEntry_C_InitializePlayerInformation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_InitializePlayerInformation, Temp_bool_Variable_1) == 0x00001B, "Member 'WBP_SquadPanelEntry_C_InitializePlayerInformation::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_InitializePlayerInformation, Temp_byte_Variable_2) == 0x00001C, "Member 'WBP_SquadPanelEntry_C_InitializePlayerInformation::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_InitializePlayerInformation, Temp_byte_Variable_3) == 0x00001D, "Member 'WBP_SquadPanelEntry_C_InitializePlayerInformation::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_InitializePlayerInformation, Temp_bool_Variable_2) == 0x00001E, "Member 'WBP_SquadPanelEntry_C_InitializePlayerInformation::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_InitializePlayerInformation, Temp_byte_Variable_4) == 0x00001F, "Member 'WBP_SquadPanelEntry_C_InitializePlayerInformation::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_InitializePlayerInformation, Temp_byte_Variable_5) == 0x000020, "Member 'WBP_SquadPanelEntry_C_InitializePlayerInformation::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_InitializePlayerInformation, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WBP_SquadPanelEntry_C_InitializePlayerInformation::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SquadPanelEntry_C_InitializePlayerInformation, K2Node_Select_Default) == 0x000038, "Member 'WBP_SquadPanelEntry_C_InitializePlayerInformation::K2Node_Select_Default' has a wrong offset!");
