#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipInteraction_ItemHex

#include "Basic.hpp"

#include "WBP_BaseTooltip_classes.hpp"
#include "G01_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TooltipInteraction_ItemHex.WBP_TooltipInteraction_ItemHex_C
// 0x0028 (0x0310 - 0x02E8)
class UWBP_TooltipInteraction_ItemHex_C final : public UWBP_BaseTooltip_C
{
public:
	class UGzTextBlock*                           Description_GzText;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           ExtractionTimeValue_GzText;                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Quality_Image;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemImage_C*                       WBP_ItemImage;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TooltipDetailsPanel_C*             WBP_TooltipDetailsPanel;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void InitItemSetup(class UGzItemData* Param_ItemData, int32 Quantity);
	void UpdateDescription();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TooltipInteraction_ItemHex_C">();
	}
	static class UWBP_TooltipInteraction_ItemHex_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TooltipInteraction_ItemHex_C>();
	}
};
static_assert(alignof(UWBP_TooltipInteraction_ItemHex_C) == 0x000008, "Wrong alignment on UWBP_TooltipInteraction_ItemHex_C");
static_assert(sizeof(UWBP_TooltipInteraction_ItemHex_C) == 0x000310, "Wrong size on UWBP_TooltipInteraction_ItemHex_C");
static_assert(offsetof(UWBP_TooltipInteraction_ItemHex_C, Description_GzText) == 0x0002E8, "Member 'UWBP_TooltipInteraction_ItemHex_C::Description_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_ItemHex_C, ExtractionTimeValue_GzText) == 0x0002F0, "Member 'UWBP_TooltipInteraction_ItemHex_C::ExtractionTimeValue_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_ItemHex_C, Quality_Image) == 0x0002F8, "Member 'UWBP_TooltipInteraction_ItemHex_C::Quality_Image' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_ItemHex_C, WBP_ItemImage) == 0x000300, "Member 'UWBP_TooltipInteraction_ItemHex_C::WBP_ItemImage' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipInteraction_ItemHex_C, WBP_TooltipDetailsPanel) == 0x000308, "Member 'UWBP_TooltipInteraction_ItemHex_C::WBP_TooltipDetailsPanel' has a wrong offset!");

}

