#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MortarLegs_TargetCounter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MortarLegs_TargetCounter.WBP_MortarLegs_TargetCounter_C
// 0x0058 (0x0338 - 0x02E0)
class UWBP_MortarLegs_TargetCounter_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FirstTargetBG;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FirstTargetFG;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SecondTargetBG;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SecondTargetFG;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ThirdTargetBG;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ThirdTargetFG;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         TargetCount;                                       // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EFB[0x4];                                     // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         FGList;                                            // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void DecrementTargetCount();
	void ExecuteUbergraph_WBP_MortarLegs_TargetCounter(int32 EntryPoint);
	void IncrementTargetCount();
	void ResetTargetCount();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MortarLegs_TargetCounter_C">();
	}
	static class UWBP_MortarLegs_TargetCounter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MortarLegs_TargetCounter_C>();
	}
};
static_assert(alignof(UWBP_MortarLegs_TargetCounter_C) == 0x000008, "Wrong alignment on UWBP_MortarLegs_TargetCounter_C");
static_assert(sizeof(UWBP_MortarLegs_TargetCounter_C) == 0x000338, "Wrong size on UWBP_MortarLegs_TargetCounter_C");
static_assert(offsetof(UWBP_MortarLegs_TargetCounter_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_MortarLegs_TargetCounter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_TargetCounter_C, Background) == 0x0002E8, "Member 'UWBP_MortarLegs_TargetCounter_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_TargetCounter_C, FirstTargetBG) == 0x0002F0, "Member 'UWBP_MortarLegs_TargetCounter_C::FirstTargetBG' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_TargetCounter_C, FirstTargetFG) == 0x0002F8, "Member 'UWBP_MortarLegs_TargetCounter_C::FirstTargetFG' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_TargetCounter_C, SecondTargetBG) == 0x000300, "Member 'UWBP_MortarLegs_TargetCounter_C::SecondTargetBG' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_TargetCounter_C, SecondTargetFG) == 0x000308, "Member 'UWBP_MortarLegs_TargetCounter_C::SecondTargetFG' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_TargetCounter_C, ThirdTargetBG) == 0x000310, "Member 'UWBP_MortarLegs_TargetCounter_C::ThirdTargetBG' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_TargetCounter_C, ThirdTargetFG) == 0x000318, "Member 'UWBP_MortarLegs_TargetCounter_C::ThirdTargetFG' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_TargetCounter_C, TargetCount) == 0x000320, "Member 'UWBP_MortarLegs_TargetCounter_C::TargetCount' has a wrong offset!");
static_assert(offsetof(UWBP_MortarLegs_TargetCounter_C, FGList) == 0x000328, "Member 'UWBP_MortarLegs_TargetCounter_C::FGList' has a wrong offset!");

}

