#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RedeploymentBackpack

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_RedeploymentBackpack.WBP_RedeploymentBackpack_C.ExecuteUbergraph_WBP_RedeploymentBackpack
// 0x0030 (0x0030 - 0x0000)
struct WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5702[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5703[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack) == 0x000008, "Wrong alignment on WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack");
static_assert(sizeof(WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack) == 0x000030, "Wrong size on WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack");
static_assert(offsetof(WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack, EntryPoint) == 0x000000, "Member 'WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack, K2Node_Event_Animation) == 0x000008, "Member 'WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000011, "Member 'WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000012, "Member 'WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x000013, "Member 'WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'WBP_RedeploymentBackpack_C_ExecuteUbergraph_WBP_RedeploymentBackpack::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function WBP_RedeploymentBackpack.WBP_RedeploymentBackpack_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_RedeploymentBackpack_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RedeploymentBackpack_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_RedeploymentBackpack_C_OnAnimationFinished");
static_assert(sizeof(WBP_RedeploymentBackpack_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_RedeploymentBackpack_C_OnAnimationFinished");
static_assert(offsetof(WBP_RedeploymentBackpack_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_RedeploymentBackpack_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_RedeploymentBackpack.WBP_RedeploymentBackpack_C.Show
// 0x0010 (0x0010 - 0x0000)
struct WBP_RedeploymentBackpack_C_Show final
{
public:
	bool                                          Successful;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingAnimation_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5704[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RedeploymentBackpack_C_Show) == 0x000008, "Wrong alignment on WBP_RedeploymentBackpack_C_Show");
static_assert(sizeof(WBP_RedeploymentBackpack_C_Show) == 0x000010, "Wrong size on WBP_RedeploymentBackpack_C_Show");
static_assert(offsetof(WBP_RedeploymentBackpack_C_Show, Successful) == 0x000000, "Member 'WBP_RedeploymentBackpack_C_Show::Successful' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_C_Show, CallFunc_IsPlayingAnimation_ReturnValue) == 0x000001, "Member 'WBP_RedeploymentBackpack_C_Show::CallFunc_IsPlayingAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_C_Show, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_RedeploymentBackpack_C_Show::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

