#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsEntry_ControllerProfiles

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SettingsEntry_ControllerProfiles.WBP_SettingsEntry_ControllerProfiles_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_SettingsEntry_ControllerProfiles_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SettingsEntry_ControllerProfiles_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_SettingsEntry_ControllerProfiles_C_OnMouseLeave");
static_assert(sizeof(WBP_SettingsEntry_ControllerProfiles_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_SettingsEntry_ControllerProfiles_C_OnMouseLeave");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_SettingsEntry_ControllerProfiles_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_SettingsEntry_ControllerProfiles.WBP_SettingsEntry_ControllerProfiles_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_SettingsEntry_ControllerProfiles_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SettingsEntry_ControllerProfiles_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_SettingsEntry_ControllerProfiles_C_OnMouseEnter");
static_assert(sizeof(WBP_SettingsEntry_ControllerProfiles_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_SettingsEntry_ControllerProfiles_C_OnMouseEnter");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_SettingsEntry_ControllerProfiles_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_SettingsEntry_ControllerProfiles_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_SettingsEntry_ControllerProfiles.WBP_SettingsEntry_ControllerProfiles_C.GetPrimaryGamepadFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsEntry_ControllerProfiles_C_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsEntry_ControllerProfiles_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong alignment on WBP_SettingsEntry_ControllerProfiles_C_GetPrimaryGamepadFocusWidget");
static_assert(sizeof(WBP_SettingsEntry_ControllerProfiles_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong size on WBP_SettingsEntry_ControllerProfiles_C_GetPrimaryGamepadFocusWidget");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_GetPrimaryGamepadFocusWidget, ReturnValue) == 0x000000, "Member 'WBP_SettingsEntry_ControllerProfiles_C_GetPrimaryGamepadFocusWidget::ReturnValue' has a wrong offset!");

// Function WBP_SettingsEntry_ControllerProfiles.WBP_SettingsEntry_ControllerProfiles_C.ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles
// 0x0150 (0x0150 - 0x0000)
struct WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C06[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0060(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D8(0x0078)(ConstParm)
};
static_assert(alignof(WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles) == 0x000008, "Wrong alignment on WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles");
static_assert(sizeof(WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles) == 0x000150, "Wrong size on WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles, EntryPoint) == 0x000000, "Member 'WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles, K2Node_ComponentBoundEvent_Button_3) == 0x000008, "Member 'WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles, K2Node_ComponentBoundEvent_Button_2) == 0x000010, "Member 'WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles, K2Node_Event_MyGeometry) == 0x000028, "Member 'WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles, K2Node_Event_MouseEvent_1) == 0x000060, "Member 'WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles, K2Node_Event_MouseEvent) == 0x0000D8, "Member 'WBP_SettingsEntry_ControllerProfiles_C_ExecuteUbergraph_WBP_SettingsEntry_ControllerProfiles::K2Node_Event_MouseEvent' has a wrong offset!");

// Function WBP_SettingsEntry_ControllerProfiles.WBP_SettingsEntry_ControllerProfiles_C.BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SettingsEntry_ControllerProfiles.WBP_SettingsEntry_ControllerProfiles_C.BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Increase_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SettingsEntry_ControllerProfiles.WBP_SettingsEntry_ControllerProfiles_C.BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SettingsEntry_ControllerProfiles.WBP_SettingsEntry_ControllerProfiles_C.BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SettingsEntry_ControllerProfiles_C_BndEvt__WBP_SettingsEntry_Discrete_Button_Decrease_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

}

