#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSelection_PlayerCurrency

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoadoutSelection_PlayerCurrency.WBP_LoadoutSelection_PlayerCurrency_C.ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency
// 0x0058 (0x0058 - 0x0000)
struct WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63E9[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzLoadoutSelectionInitializeData      K2Node_Event_LoadoutInitializeData;                // 0x0018(0x0020)(ConstParm)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63EA[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzInvComponent*                        CallFunc_GetInventoryComponent_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency");
static_assert(sizeof(WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency) == 0x000058, "Wrong size on WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency, EntryPoint) == 0x000000, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency, K2Node_Event_LoadoutInitializeData) == 0x000018, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency::K2Node_Event_LoadoutInitializeData' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency, CallFunc_K2_GetPawn_ReturnValue) == 0x000038, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency, K2Node_DynamicCast_AsGz_Character) == 0x000040, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency, CallFunc_GetInventoryComponent_ReturnValue) == 0x000050, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_ExecuteUbergraph_WBP_LoadoutSelection_PlayerCurrency::CallFunc_GetInventoryComponent_ReturnValue' has a wrong offset!");

// Function WBP_LoadoutSelection_PlayerCurrency.WBP_LoadoutSelection_PlayerCurrency_C.OnLoadoutSlotReady_BP
// 0x0020 (0x0020 - 0x0000)
struct WBP_LoadoutSelection_PlayerCurrency_C_OnLoadoutSlotReady_BP final
{
public:
	struct FGzLoadoutSelectionInitializeData      LoadoutInitializeData;                             // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_LoadoutSelection_PlayerCurrency_C_OnLoadoutSlotReady_BP) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_PlayerCurrency_C_OnLoadoutSlotReady_BP");
static_assert(sizeof(WBP_LoadoutSelection_PlayerCurrency_C_OnLoadoutSlotReady_BP) == 0x000020, "Wrong size on WBP_LoadoutSelection_PlayerCurrency_C_OnLoadoutSlotReady_BP");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_OnLoadoutSlotReady_BP, LoadoutInitializeData) == 0x000000, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_OnLoadoutSlotReady_BP::LoadoutInitializeData' has a wrong offset!");

// Function WBP_LoadoutSelection_PlayerCurrency.WBP_LoadoutSelection_PlayerCurrency_C.SetCurrencyIcons
// 0x0010 (0x0010 - 0x0000)
struct WBP_LoadoutSelection_PlayerCurrency_C_SetCurrencyIcons final
{
public:
	class UTexture2D*                             CallFunc_GetCurrencyIcon_AsTexture_2D;             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelection_PlayerCurrency_C_SetCurrencyIcons) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_PlayerCurrency_C_SetCurrencyIcons");
static_assert(sizeof(WBP_LoadoutSelection_PlayerCurrency_C_SetCurrencyIcons) == 0x000010, "Wrong size on WBP_LoadoutSelection_PlayerCurrency_C_SetCurrencyIcons");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_SetCurrencyIcons, CallFunc_GetCurrencyIcon_AsTexture_2D) == 0x000000, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_SetCurrencyIcons::CallFunc_GetCurrencyIcon_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_SetCurrencyIcons, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_SetCurrencyIcons::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_LoadoutSelection_PlayerCurrency.WBP_LoadoutSelection_PlayerCurrency_C.UpdatePlayerCurrency
// 0x0030 (0x0030 - 0x0000)
struct WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency final
{
public:
	class AGzCharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0008(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	class UGzInvComponent*                        CallFunc_GetInventoryComponent_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCountByType_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63EB[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0010)()
};
static_assert(alignof(WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency");
static_assert(sizeof(WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency) == 0x000030, "Wrong size on WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency, Character) == 0x000000, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency::Character' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency, Temp_struct_Variable) == 0x000008, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency, CallFunc_GetInventoryComponent_ReturnValue) == 0x000010, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency::CallFunc_GetInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency, CallFunc_GetItemCountByType_ReturnValue) == 0x000018, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency::CallFunc_GetItemCountByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WBP_LoadoutSelection_PlayerCurrency_C_UpdatePlayerCurrency::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

