#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Progress_SelfReviveKit

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "G01_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Progress_SelfReviveKit.WBP_Progress_SelfReviveKit_C
// 0x01A0 (0x04E0 - 0x0340)
class UWBP_Progress_SelfReviveKit_C final : public UGzHUDComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzTextBlock*                           ActionDescription_GzText;                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BeingRevived_Image;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HealthIcon_Image;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzActionWidget*                        InputActionWidget;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Main_VerticalBox;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressCicrcleFill_Image;                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bHasSelfReviveKit;                                 // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6795[0x3];                                     // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxHoldTime;                                       // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUsingSelfRevive;                                  // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6796[0x7];                                     // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentHoldTime;                                   // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          KillingSelf;                                       // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TeammateReviving;                                  // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6797[0x6];                                     // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGA_SelfRevive_C*                       SelfReviveAbility;                                 // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     GzPlayerCharacter;                                 // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RedColor;                                          // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GreenColor;                                        // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGzInteractionData                     Out_Interaction_Data;                              // 0x03C8(0x00F8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UGzAsyncTaskAttributeChanged*           AsyncTaskHealth;                                   // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag;                                               // 0x04C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         LastProgress;                                      // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6798[0x4];                                     // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGA_SelfRevive_C*                       As_GA_Self_Revive;                                 // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BeingRevived(bool IsReviving);
	void CanSelfRevive(bool* CanActivateAbility);
	void CheckState();
	void Construct();
	void ExecuteUbergraph_WBP_Progress_SelfReviveKit(int32 EntryPoint);
	void On_Knock_Down_State_Changed(bool bWasAdded);
	void OnAttributeChanged_3F97F61C4E8AA661EF1F45BA62032E1F(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);
	void OnKillSelfTagChanged(bool TagAdded);
	void OnPlayerDeath(bool bWasAdded);
	void OnUsingReviveKit(bool bWasAdded);
	void ReceiveBindEvents(class APawn* NewViewTarget);
	void ReceiveUnbindEvents(class APawn* OldViewTarget);
	void SetCurrentHoldTime(double DeltaTime);
	void SetProgressBarProgress(float Value, bool FlipOrientation);
	void Show();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateHealth();
	void UpdateHoldTime(float Progress);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Progress_SelfReviveKit_C">();
	}
	static class UWBP_Progress_SelfReviveKit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Progress_SelfReviveKit_C>();
	}
};
static_assert(alignof(UWBP_Progress_SelfReviveKit_C) == 0x000008, "Wrong alignment on UWBP_Progress_SelfReviveKit_C");
static_assert(sizeof(UWBP_Progress_SelfReviveKit_C) == 0x0004E0, "Wrong size on UWBP_Progress_SelfReviveKit_C");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, UberGraphFrame) == 0x000340, "Member 'UWBP_Progress_SelfReviveKit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, ActionDescription_GzText) == 0x000348, "Member 'UWBP_Progress_SelfReviveKit_C::ActionDescription_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, BeingRevived_Image) == 0x000350, "Member 'UWBP_Progress_SelfReviveKit_C::BeingRevived_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, HealthIcon_Image) == 0x000358, "Member 'UWBP_Progress_SelfReviveKit_C::HealthIcon_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, InputActionWidget) == 0x000360, "Member 'UWBP_Progress_SelfReviveKit_C::InputActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, Main_VerticalBox) == 0x000368, "Member 'UWBP_Progress_SelfReviveKit_C::Main_VerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, ProgressCicrcleFill_Image) == 0x000370, "Member 'UWBP_Progress_SelfReviveKit_C::ProgressCicrcleFill_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, bHasSelfReviveKit) == 0x000378, "Member 'UWBP_Progress_SelfReviveKit_C::bHasSelfReviveKit' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, MaxHoldTime) == 0x00037C, "Member 'UWBP_Progress_SelfReviveKit_C::MaxHoldTime' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, bUsingSelfRevive) == 0x000380, "Member 'UWBP_Progress_SelfReviveKit_C::bUsingSelfRevive' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, CurrentHoldTime) == 0x000388, "Member 'UWBP_Progress_SelfReviveKit_C::CurrentHoldTime' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, KillingSelf) == 0x000390, "Member 'UWBP_Progress_SelfReviveKit_C::KillingSelf' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, TeammateReviving) == 0x000391, "Member 'UWBP_Progress_SelfReviveKit_C::TeammateReviving' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, SelfReviveAbility) == 0x000398, "Member 'UWBP_Progress_SelfReviveKit_C::SelfReviveAbility' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, GzPlayerCharacter) == 0x0003A0, "Member 'UWBP_Progress_SelfReviveKit_C::GzPlayerCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, RedColor) == 0x0003A8, "Member 'UWBP_Progress_SelfReviveKit_C::RedColor' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, GreenColor) == 0x0003B8, "Member 'UWBP_Progress_SelfReviveKit_C::GreenColor' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, Out_Interaction_Data) == 0x0003C8, "Member 'UWBP_Progress_SelfReviveKit_C::Out_Interaction_Data' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, AsyncTaskHealth) == 0x0004C0, "Member 'UWBP_Progress_SelfReviveKit_C::AsyncTaskHealth' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, Tag) == 0x0004C8, "Member 'UWBP_Progress_SelfReviveKit_C::Tag' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, LastProgress) == 0x0004D0, "Member 'UWBP_Progress_SelfReviveKit_C::LastProgress' has a wrong offset!");
static_assert(offsetof(UWBP_Progress_SelfReviveKit_C, As_GA_Self_Revive) == 0x0004D8, "Member 'UWBP_Progress_SelfReviveKit_C::As_GA_Self_Revive' has a wrong offset!");

}

