#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DisplayDamage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DisplayDamage.WBP_DisplayDamage_C
// 0x0050 (0x0330 - 0x02E0)
class UWBP_DisplayDamage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Animation_1;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Animation_0;                                       // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Animation;                                         // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ArmorDamageText;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BodyDamageText;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GridArmorDamageText;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             JetpackDamageText;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LimbDamageText;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             VehicleDamageText;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ShowDamage(double Body, double Armor, double Limb, double Vehicle, double Jetpack, double GridArmorDamage);
	void SetDamage(class UTextBlock* DamageWidget, double DamageValue);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_DisplayDamage(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DisplayDamage_C">();
	}
	static class UWBP_DisplayDamage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DisplayDamage_C>();
	}
};
static_assert(alignof(UWBP_DisplayDamage_C) == 0x000008, "Wrong alignment on UWBP_DisplayDamage_C");
static_assert(sizeof(UWBP_DisplayDamage_C) == 0x000330, "Wrong size on UWBP_DisplayDamage_C");
static_assert(offsetof(UWBP_DisplayDamage_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_DisplayDamage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayDamage_C, Animation_1) == 0x0002E8, "Member 'UWBP_DisplayDamage_C::Animation_1' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayDamage_C, Animation_0) == 0x0002F0, "Member 'UWBP_DisplayDamage_C::Animation_0' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayDamage_C, Animation) == 0x0002F8, "Member 'UWBP_DisplayDamage_C::Animation' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayDamage_C, ArmorDamageText) == 0x000300, "Member 'UWBP_DisplayDamage_C::ArmorDamageText' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayDamage_C, BodyDamageText) == 0x000308, "Member 'UWBP_DisplayDamage_C::BodyDamageText' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayDamage_C, GridArmorDamageText) == 0x000310, "Member 'UWBP_DisplayDamage_C::GridArmorDamageText' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayDamage_C, JetpackDamageText) == 0x000318, "Member 'UWBP_DisplayDamage_C::JetpackDamageText' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayDamage_C, LimbDamageText) == 0x000320, "Member 'UWBP_DisplayDamage_C::LimbDamageText' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayDamage_C, VehicleDamageText) == 0x000328, "Member 'UWBP_DisplayDamage_C::VehicleDamageText' has a wrong offset!");

}

