#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ViewportMarker_Mission_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ViewportMarker_Mission_Base.WBP_ViewportMarker_Mission_Base_C.Change Visibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_ViewportMarker_Mission_Base_C_Change_Visibility final
{
public:
	bool                                          Param_bVisible;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ViewportMarker_Mission_Base_C_Change_Visibility) == 0x000001, "Wrong alignment on WBP_ViewportMarker_Mission_Base_C_Change_Visibility");
static_assert(sizeof(WBP_ViewportMarker_Mission_Base_C_Change_Visibility) == 0x000001, "Wrong size on WBP_ViewportMarker_Mission_Base_C_Change_Visibility");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_Change_Visibility, Param_bVisible) == 0x000000, "Member 'WBP_ViewportMarker_Mission_Base_C_Change_Visibility::Param_bVisible' has a wrong offset!");

// Function WBP_ViewportMarker_Mission_Base.WBP_ViewportMarker_Mission_Base_C.ExecuteUbergraph_WBP_ViewportMarker_Mission_Base
// 0x0118 (0x0118 - 0x0000)
struct WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BBF[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC0[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0010)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC1[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzMissionMarker*                       K2Node_DynamicCast_AsGz_Mission_Marker;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bVisible;                       // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC2[0x2];                                     // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bVisible)>                K2Node_CreateDelegate_OutputDelegate_2;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC3[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC4[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC5[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base) == 0x000008, "Wrong alignment on WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base");
static_assert(sizeof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base) == 0x000118, "Wrong size on WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, EntryPoint) == 0x000000, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, K2Node_CustomEvent_InText) == 0x000028, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, CallFunc_Format_ReturnValue) == 0x000098, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, CallFunc_GetOwner_ReturnValue) == 0x0000A8, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, CallFunc_IsValid_ReturnValue_1) == 0x0000B0, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, K2Node_DynamicCast_AsGz_Mission_Marker) == 0x0000B8, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::K2Node_DynamicCast_AsGz_Mission_Marker' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, K2Node_CustomEvent_bVisible) == 0x0000C1, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::K2Node_CustomEvent_bVisible' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C4, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, CallFunc_IsVisible_ReturnValue) == 0x0000D4, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000D8, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000E0, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, CallFunc_IsValid_ReturnValue_2) == 0x0000E8, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x0000F0, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x0000F8, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, CallFunc_IsValid_ReturnValue_3) == 0x000100, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base, K2Node_CreateDelegate_OutputDelegate_3) == 0x000104, "Member 'WBP_ViewportMarker_Mission_Base_C_ExecuteUbergraph_WBP_ViewportMarker_Mission_Base::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function WBP_ViewportMarker_Mission_Base.WBP_ViewportMarker_Mission_Base_C.SetMarkerText
// 0x0010 (0x0010 - 0x0000)
struct WBP_ViewportMarker_Mission_Base_C_SetMarkerText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ViewportMarker_Mission_Base_C_SetMarkerText) == 0x000008, "Wrong alignment on WBP_ViewportMarker_Mission_Base_C_SetMarkerText");
static_assert(sizeof(WBP_ViewportMarker_Mission_Base_C_SetMarkerText) == 0x000010, "Wrong size on WBP_ViewportMarker_Mission_Base_C_SetMarkerText");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_SetMarkerText, InText) == 0x000000, "Member 'WBP_ViewportMarker_Mission_Base_C_SetMarkerText::InText' has a wrong offset!");

// Function WBP_ViewportMarker_Mission_Base.WBP_ViewportMarker_Mission_Base_C.UpdateMarkerVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_ViewportMarker_Mission_Base_C_UpdateMarkerVisibility final
{
public:
	bool                                          Param_bVisible;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ViewportMarker_Mission_Base_C_UpdateMarkerVisibility) == 0x000001, "Wrong alignment on WBP_ViewportMarker_Mission_Base_C_UpdateMarkerVisibility");
static_assert(sizeof(WBP_ViewportMarker_Mission_Base_C_UpdateMarkerVisibility) == 0x000001, "Wrong size on WBP_ViewportMarker_Mission_Base_C_UpdateMarkerVisibility");
static_assert(offsetof(WBP_ViewportMarker_Mission_Base_C_UpdateMarkerVisibility, Param_bVisible) == 0x000000, "Member 'WBP_ViewportMarker_Mission_Base_C_UpdateMarkerVisibility::Param_bVisible' has a wrong offset!");

}

