#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapLegend

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MapLegend.WBP_MapLegend_C
// 0x0098 (0x0378 - 0x02E0)
class UWBP_MapLegend_C final : public UUserWidget
{
public:
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_1;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_2;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_3;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_4;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_5;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_6;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_7;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_8;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_9;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_10;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_11;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_12;                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_16;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_17;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_18;                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_19;                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_20;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapLegendEntry_C*                  WBP_MapLegendEntry_21;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MapLegend_C">();
	}
	static class UWBP_MapLegend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MapLegend_C>();
	}
};
static_assert(alignof(UWBP_MapLegend_C) == 0x000008, "Wrong alignment on UWBP_MapLegend_C");
static_assert(sizeof(UWBP_MapLegend_C) == 0x000378, "Wrong size on UWBP_MapLegend_C");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry) == 0x0002E0, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_1) == 0x0002E8, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_1' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_2) == 0x0002F0, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_2' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_3) == 0x0002F8, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_3' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_4) == 0x000300, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_4' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_5) == 0x000308, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_5' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_6) == 0x000310, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_6' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_7) == 0x000318, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_7' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_8) == 0x000320, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_8' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_9) == 0x000328, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_9' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_10) == 0x000330, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_10' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_11) == 0x000338, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_11' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_12) == 0x000340, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_12' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_16) == 0x000348, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_16' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_17) == 0x000350, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_17' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_18) == 0x000358, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_18' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_19) == 0x000360, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_19' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_20) == 0x000368, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_20' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, WBP_MapLegendEntry_21) == 0x000370, "Member 'UWBP_MapLegend_C::WBP_MapLegendEntry_21' has a wrong offset!");

}

