#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSelection_Grid

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoadoutSelection_Grid.WBP_LoadoutSelection_Grid_C.SetDataToSlot
// 0x0070 (0x0070 - 0x0000)
struct WBP_LoadoutSelection_Grid_C_SetDataToSlot final
{
public:
	struct FGzLoadoutDataConfig                   LoadoutConfig;                                     // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_LoadoutSelection_Grid_C_SetDataToSlot) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_Grid_C_SetDataToSlot");
static_assert(sizeof(WBP_LoadoutSelection_Grid_C_SetDataToSlot) == 0x000070, "Wrong size on WBP_LoadoutSelection_Grid_C_SetDataToSlot");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_SetDataToSlot, LoadoutConfig) == 0x000000, "Member 'WBP_LoadoutSelection_Grid_C_SetDataToSlot::LoadoutConfig' has a wrong offset!");

// Function WBP_LoadoutSelection_Grid.WBP_LoadoutSelection_Grid_C.RecreateLoadoutSlotsWithLoadout
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout final
{
public:
	TMap<EGzLoadoutSlots, struct FGzInvItem>      LoadoutPreset;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66A1[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66A2[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66A3[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_LoadoutSelection_Item_C*           K2Node_DynamicCast_AsWBP_Loadout_Selection_Item;   // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66A4[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzInvItem                             CallFunc_Map_Find_Value;                           // 0x0098(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout");
static_assert(sizeof(WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout) == 0x0000B0, "Wrong size on WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout, LoadoutPreset) == 0x000000, "Member 'WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout::LoadoutPreset' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout, Temp_int_Array_Index_Variable) == 0x000050, "Member 'WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout, CallFunc_GetAllChildren_ReturnValue) == 0x000060, "Member 'WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout, K2Node_DynamicCast_AsWBP_Loadout_Selection_Item) == 0x000088, "Member 'WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout::K2Node_DynamicCast_AsWBP_Loadout_Selection_Item' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout, CallFunc_Map_Find_Value) == 0x000098, "Member 'WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout, CallFunc_Map_Find_ReturnValue) == 0x0000A8, "Member 'WBP_LoadoutSelection_Grid_C_RecreateLoadoutSlotsWithLoadout::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_LoadoutSelection_Grid.WBP_LoadoutSelection_Grid_C.Recreate Loadout Slots with Guid
// 0x0060 (0x0060 - 0x0000)
struct WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid final
{
public:
	struct FGuid                                  LoadoutGuid;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66A5[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_LoadoutSelection_Item_C*           CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EGzLoadoutSlots                               CallFunc_Array_Get_Item;                           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66A6[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGzInvItem                             CallFunc_GetItemFromLocalLoadoutSlot_ReturnValue;  // 0x0048(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid");
static_assert(sizeof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid) == 0x000060, "Wrong size on WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid, LoadoutGuid) == 0x000000, "Member 'WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid::LoadoutGuid' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid, CallFunc_IsValid_Guid_ReturnValue) == 0x000010, "Member 'WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid, CallFunc_Divide_IntInt_ReturnValue) == 0x000018, "Member 'WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid, CallFunc_Percent_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000040, "Member 'WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid, CallFunc_GetItemFromLocalLoadoutSlot_ReturnValue) == 0x000048, "Member 'WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid::CallFunc_GetItemFromLocalLoadoutSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_LoadoutSelection_Grid_C_Recreate_Loadout_Slots_with_Guid::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_LoadoutSelection_Grid.WBP_LoadoutSelection_Grid_C.ExecuteUbergraph_WBP_LoadoutSelection_Grid
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_LoadoutSelection_Grid_C_ExecuteUbergraph_WBP_LoadoutSelection_Grid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66A7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzLoadoutDataConfig                   K2Node_Event_LoadoutConfig;                        // 0x0008(0x0070)(ConstParm, ContainsInstancedReference)
	TMap<EGzLoadoutSlots, struct FGzInvItem>      CallFunc_GetLoadoutItemsForSlotsFromConfig_ReturnValue; // 0x0078(0x0050)()
};
static_assert(alignof(WBP_LoadoutSelection_Grid_C_ExecuteUbergraph_WBP_LoadoutSelection_Grid) == 0x000008, "Wrong alignment on WBP_LoadoutSelection_Grid_C_ExecuteUbergraph_WBP_LoadoutSelection_Grid");
static_assert(sizeof(WBP_LoadoutSelection_Grid_C_ExecuteUbergraph_WBP_LoadoutSelection_Grid) == 0x0000C8, "Wrong size on WBP_LoadoutSelection_Grid_C_ExecuteUbergraph_WBP_LoadoutSelection_Grid");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_ExecuteUbergraph_WBP_LoadoutSelection_Grid, EntryPoint) == 0x000000, "Member 'WBP_LoadoutSelection_Grid_C_ExecuteUbergraph_WBP_LoadoutSelection_Grid::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_ExecuteUbergraph_WBP_LoadoutSelection_Grid, K2Node_Event_LoadoutConfig) == 0x000008, "Member 'WBP_LoadoutSelection_Grid_C_ExecuteUbergraph_WBP_LoadoutSelection_Grid::K2Node_Event_LoadoutConfig' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelection_Grid_C_ExecuteUbergraph_WBP_LoadoutSelection_Grid, CallFunc_GetLoadoutItemsForSlotsFromConfig_ReturnValue) == 0x000078, "Member 'WBP_LoadoutSelection_Grid_C_ExecuteUbergraph_WBP_LoadoutSelection_Grid::CallFunc_GetLoadoutItemsForSlotsFromConfig_ReturnValue' has a wrong offset!");

}

