#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SelfReviveSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SelfReviveSlot.WBP_SelfReviveSlot_C
// 0x0040 (0x03A0 - 0x0360)
class UWBP_SelfReviveSlot_C final : public UGzEquipmentPocketWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Hover;                                        // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           ChargingBar;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_62;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QualityBar_Image_1;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           GridArmorChangeAsyncTask;                          // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_BackpackSlot_PocketButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Destruct();
	void ExecuteUbergraph_WBP_SelfReviveSlot(int32 EntryPoint);
	void HandleEmptyItem();
	void HandleValidItem(const struct FGzInvItem& Item);
	void OnAttributeChanged_6E9295794202063A3F33C0985E297277(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);
	void OnPocketChanged_BP(const struct FGzInvItem& NewItem);
	void StopListenForAttribute();
	void UpdateCharge(const struct FGzInvItem& Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SelfReviveSlot_C">();
	}
	static class UWBP_SelfReviveSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SelfReviveSlot_C>();
	}
};
static_assert(alignof(UWBP_SelfReviveSlot_C) == 0x000008, "Wrong alignment on UWBP_SelfReviveSlot_C");
static_assert(sizeof(UWBP_SelfReviveSlot_C) == 0x0003A0, "Wrong size on UWBP_SelfReviveSlot_C");
static_assert(offsetof(UWBP_SelfReviveSlot_C, UberGraphFrame) == 0x000360, "Member 'UWBP_SelfReviveSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SelfReviveSlot_C, Anim_Hover) == 0x000368, "Member 'UWBP_SelfReviveSlot_C::Anim_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_SelfReviveSlot_C, ChargingBar) == 0x000370, "Member 'UWBP_SelfReviveSlot_C::ChargingBar' has a wrong offset!");
static_assert(offsetof(UWBP_SelfReviveSlot_C, Image_62) == 0x000378, "Member 'UWBP_SelfReviveSlot_C::Image_62' has a wrong offset!");
static_assert(offsetof(UWBP_SelfReviveSlot_C, QualityBar_Image_1) == 0x000380, "Member 'UWBP_SelfReviveSlot_C::QualityBar_Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_SelfReviveSlot_C, WBP_ItemIcon) == 0x000388, "Member 'UWBP_SelfReviveSlot_C::WBP_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_SelfReviveSlot_C, WidgetSwitcher_0) == 0x000390, "Member 'UWBP_SelfReviveSlot_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_SelfReviveSlot_C, GridArmorChangeAsyncTask) == 0x000398, "Member 'UWBP_SelfReviveSlot_C::GridArmorChangeAsyncTask' has a wrong offset!");

}

