#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Progress_SelfReviveKit

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function WBP_Progress_SelfReviveKit.WBP_Progress_SelfReviveKit_C.BeingRevived
// 0x0140 (0x0140 - 0x0000)
struct WBP_Progress_SelfReviveKit_C_BeingRevived final
{
public:
	bool                                          IsReviving;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6799[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGzInteractionData                     CallFunc_FindInteractionDataByTag_OutInteractionData; // 0x0020(0x00F8)(ContainsInstancedReference)
	bool                                          CallFunc_FindInteractionDataByTag_ReturnValue;     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679A[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_LastProgress_ImplicitCast;      // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679B[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Progress_SelfReviveKit_C_BeingRevived) == 0x000008, "Wrong alignment on WBP_Progress_SelfReviveKit_C_BeingRevived");
static_assert(sizeof(WBP_Progress_SelfReviveKit_C_BeingRevived) == 0x000140, "Wrong size on WBP_Progress_SelfReviveKit_C_BeingRevived");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_BeingRevived, IsReviving) == 0x000000, "Member 'WBP_Progress_SelfReviveKit_C_BeingRevived::IsReviving' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_BeingRevived, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_Progress_SelfReviveKit_C_BeingRevived::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_BeingRevived, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_Progress_SelfReviveKit_C_BeingRevived::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_BeingRevived, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000018, "Member 'WBP_Progress_SelfReviveKit_C_BeingRevived::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_BeingRevived, CallFunc_FindInteractionDataByTag_OutInteractionData) == 0x000020, "Member 'WBP_Progress_SelfReviveKit_C_BeingRevived::CallFunc_FindInteractionDataByTag_OutInteractionData' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_BeingRevived, CallFunc_FindInteractionDataByTag_ReturnValue) == 0x000118, "Member 'WBP_Progress_SelfReviveKit_C_BeingRevived::CallFunc_FindInteractionDataByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_BeingRevived, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000120, "Member 'WBP_Progress_SelfReviveKit_C_BeingRevived::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_BeingRevived, K2Node_VariableSet_LastProgress_ImplicitCast) == 0x000128, "Member 'WBP_Progress_SelfReviveKit_C_BeingRevived::K2Node_VariableSet_LastProgress_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_BeingRevived, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000130, "Member 'WBP_Progress_SelfReviveKit_C_BeingRevived::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_BeingRevived, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000138, "Member 'WBP_Progress_SelfReviveKit_C_BeingRevived::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_Progress_SelfReviveKit.WBP_Progress_SelfReviveKit_C.CanSelfRevive
// 0x0080 (0x0080 - 0x0000)
struct WBP_Progress_SelfReviveKit_C_CanSelfRevive final
{
public:
	bool                                          CanActivateAbility;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679C[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0008(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable_1;                            // 0x0010(0x0020)(ConstParm)
	bool                                          CallFunc_BP_CanActivateAbility_ReturnValue;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679D[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGzGameplayAbility*>             CallFunc_GetAbilitiesForInventorySlots_OutAbilities; // 0x0038(0x0010)(ReferenceParm)
	class UGzGameplayAbility*                     CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679E[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGA_SelfRevive_C*                       K2Node_DynamicCast_AsGA_Self_Revive;               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679F[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A0[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzInvComponent*                        CallFunc_GetInventoryComponent_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItemOfType_ReturnValue;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Progress_SelfReviveKit_C_CanSelfRevive) == 0x000008, "Wrong alignment on WBP_Progress_SelfReviveKit_C_CanSelfRevive");
static_assert(sizeof(WBP_Progress_SelfReviveKit_C_CanSelfRevive) == 0x000080, "Wrong size on WBP_Progress_SelfReviveKit_C_CanSelfRevive");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, CanActivateAbility) == 0x000000, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::CanActivateAbility' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, Temp_struct_Variable) == 0x000008, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, Temp_struct_Variable_1) == 0x000010, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, CallFunc_BP_CanActivateAbility_ReturnValue) == 0x000030, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::CallFunc_BP_CanActivateAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, CallFunc_GetAbilitiesForInventorySlots_OutAbilities) == 0x000038, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::CallFunc_GetAbilitiesForInventorySlots_OutAbilities' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, K2Node_DynamicCast_AsGA_Self_Revive) == 0x000058, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::K2Node_DynamicCast_AsGA_Self_Revive' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, CallFunc_GetInventoryComponent_ReturnValue) == 0x000070, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::CallFunc_GetInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, CallFunc_HasItemOfType_ReturnValue) == 0x000079, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::CallFunc_HasItemOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CanSelfRevive, CallFunc_IsValid_ReturnValue_1) == 0x00007A, "Member 'WBP_Progress_SelfReviveKit_C_CanSelfRevive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_Progress_SelfReviveKit.WBP_Progress_SelfReviveKit_C.CheckState
// 0x0088 (0x0088 - 0x0000)
struct WBP_Progress_SelfReviveKit_C_CheckState final
{
public:
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A1[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A2[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A3[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2;  // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A4[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_3;  // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_3;     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Progress_SelfReviveKit_C_CheckState) == 0x000008, "Wrong alignment on WBP_Progress_SelfReviveKit_C_CheckState");
static_assert(sizeof(WBP_Progress_SelfReviveKit_C_CheckState) == 0x000088, "Wrong size on WBP_Progress_SelfReviveKit_C_CheckState");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CheckState, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000000, "Member 'WBP_Progress_SelfReviveKit_C_CheckState::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CheckState, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_Progress_SelfReviveKit_C_CheckState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CheckState, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000010, "Member 'WBP_Progress_SelfReviveKit_C_CheckState::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CheckState, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000018, "Member 'WBP_Progress_SelfReviveKit_C_CheckState::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CheckState, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000028, "Member 'WBP_Progress_SelfReviveKit_C_CheckState::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CheckState, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000030, "Member 'WBP_Progress_SelfReviveKit_C_CheckState::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CheckState, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000040, "Member 'WBP_Progress_SelfReviveKit_C_CheckState::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CheckState, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000048, "Member 'WBP_Progress_SelfReviveKit_C_CheckState::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CheckState, CallFunc_GetAbilitySystemComponent_ReturnValue_3) == 0x000050, "Member 'WBP_Progress_SelfReviveKit_C_CheckState::CallFunc_GetAbilitySystemComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CheckState, CallFunc_HasMatchingGameplayTag_self_CastInput_2) == 0x000058, "Member 'WBP_Progress_SelfReviveKit_C_CheckState::CallFunc_HasMatchingGameplayTag_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CheckState, CallFunc_HasMatchingGameplayTag_ReturnValue_2) == 0x000068, "Member 'WBP_Progress_SelfReviveKit_C_CheckState::CallFunc_HasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CheckState, CallFunc_HasMatchingGameplayTag_self_CastInput_3) == 0x000070, "Member 'WBP_Progress_SelfReviveKit_C_CheckState::CallFunc_HasMatchingGameplayTag_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_CheckState, CallFunc_HasMatchingGameplayTag_ReturnValue_3) == 0x000080, "Member 'WBP_Progress_SelfReviveKit_C_CheckState::CallFunc_HasMatchingGameplayTag_ReturnValue_3' has a wrong offset!");

// Function WBP_Progress_SelfReviveKit.WBP_Progress_SelfReviveKit_C.ExecuteUbergraph_WBP_Progress_SelfReviveKit
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A5[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0010(0x0038)(HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_OldViewTarget;                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A6[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0054(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A7[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_NewViewTarget;                        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A8[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bWasAdded)>               K2Node_CreateDelegate_OutputDelegate;              // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A9[0x2];                                     // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           CallFunc_ListenForAttributeChange_ReturnValue;     // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67AA[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x00E8(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67AB[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bWasAdded)>               K2Node_CreateDelegate_OutputDelegate_1;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_2;     // 0x0144(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bWasAdded)>               K2Node_CreateDelegate_OutputDelegate_2;            // 0x014C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Progress)>               K2Node_CreateDelegate_OutputDelegate_4;            // 0x016C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_3;     // 0x017C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bWasAdded)>               K2Node_CreateDelegate_OutputDelegate_5;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentHoldProgress_ReturnValue;       // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_4;     // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bWasAdded)>               K2Node_CreateDelegate_OutputDelegate_6;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWasAdded;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67AC[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetCurrentHoldTime_DeltaTime_ImplicitCast; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_RangeMax_ImplicitCast;   // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_B_ImplicitCast;   // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetProgressBarProgress_Value_ImplicitCast; // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67AD[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit) == 0x000008, "Wrong alignment on WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit");
static_assert(sizeof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit) == 0x0001F0, "Wrong size on WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, EntryPoint) == 0x000000, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, Temp_real_Variable) == 0x000004, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, Temp_real_Variable_1) == 0x000008, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, Temp_struct_Variable) == 0x000010, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_Event_OldViewTarget) == 0x000048, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_Event_OldViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_Event_MyGeometry) == 0x000054, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_Event_InDeltaTime) == 0x00008C, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000090, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_NormalizeToRange_ReturnValue) == 0x000098, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_Event_NewViewTarget) == 0x0000A0, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_Event_NewViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x0000A8, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_DynamicCast_AsGz_Player_Character) == 0x0000B0, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_CreateDelegate_OutputDelegate) == 0x0000BC, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_IsValid_ReturnValue_1) == 0x0000CC, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_IsValid_ReturnValue_2) == 0x0000CD, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000D0, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_ListenForAttributeChange_ReturnValue) == 0x0000D8, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_ListenForAttributeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_BooleanOR_ReturnValue) == 0x0000E0, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_IsValid_ReturnValue_3) == 0x0000E1, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_CustomEvent_Attribute) == 0x0000E8, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_CustomEvent_NewValue) == 0x000120, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_CustomEvent_OldValue) == 0x000124, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x000128, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_BooleanOR_ReturnValue_1) == 0x000130, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_CreateDelegate_OutputDelegate_1) == 0x000134, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_MakeLiteralGameplayTag_ReturnValue_2) == 0x000144, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_MakeLiteralGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_CreateDelegate_OutputDelegate_2) == 0x00014C, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_CreateDelegate_OutputDelegate_3) == 0x00015C, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_CreateDelegate_OutputDelegate_4) == 0x00016C, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_MakeLiteralGameplayTag_ReturnValue_3) == 0x00017C, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_MakeLiteralGameplayTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_CreateDelegate_OutputDelegate_5) == 0x000184, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_GetCurrentHoldProgress_ReturnValue) == 0x000194, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_GetCurrentHoldProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_MakeLiteralGameplayTag_ReturnValue_4) == 0x000198, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_MakeLiteralGameplayTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001A0, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001A8, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, K2Node_CustomEvent_bWasAdded) == 0x0001B8, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::K2Node_CustomEvent_bWasAdded' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_SetCurrentHoldTime_DeltaTime_ImplicitCast) == 0x0001C0, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_SetCurrentHoldTime_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_NormalizeToRange_RangeMax_ImplicitCast) == 0x0001C8, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_NormalizeToRange_RangeMax_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_EqualEqual_DoubleDouble_B_ImplicitCast) == 0x0001D0, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_EqualEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_SetProgressBarProgress_Value_ImplicitCast) == 0x0001D8, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_SetProgressBarProgress_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x0001E0, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0001E8, "Member 'WBP_Progress_SelfReviveKit_C_ExecuteUbergraph_WBP_Progress_SelfReviveKit::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_Progress_SelfReviveKit.WBP_Progress_SelfReviveKit_C.On Knock Down State Changed
// 0x0001 (0x0001 - 0x0000)
struct WBP_Progress_SelfReviveKit_C_On_Knock_Down_State_Changed final
{
public:
	bool                                          bWasAdded;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Progress_SelfReviveKit_C_On_Knock_Down_State_Changed) == 0x000001, "Wrong alignment on WBP_Progress_SelfReviveKit_C_On_Knock_Down_State_Changed");
static_assert(sizeof(WBP_Progress_SelfReviveKit_C_On_Knock_Down_State_Changed) == 0x000001, "Wrong size on WBP_Progress_SelfReviveKit_C_On_Knock_Down_State_Changed");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_On_Knock_Down_State_Changed, bWasAdded) == 0x000000, "Member 'WBP_Progress_SelfReviveKit_C_On_Knock_Down_State_Changed::bWasAdded' has a wrong offset!");

// Function WBP_Progress_SelfReviveKit.WBP_Progress_SelfReviveKit_C.OnAttributeChanged_3F97F61C4E8AA661EF1F45BA62032E1F
// 0x0040 (0x0040 - 0x0000)
struct WBP_Progress_SelfReviveKit_C_OnAttributeChanged_3F97F61C4E8AA661EF1F45BA62032E1F final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Progress_SelfReviveKit_C_OnAttributeChanged_3F97F61C4E8AA661EF1F45BA62032E1F) == 0x000008, "Wrong alignment on WBP_Progress_SelfReviveKit_C_OnAttributeChanged_3F97F61C4E8AA661EF1F45BA62032E1F");
static_assert(sizeof(WBP_Progress_SelfReviveKit_C_OnAttributeChanged_3F97F61C4E8AA661EF1F45BA62032E1F) == 0x000040, "Wrong size on WBP_Progress_SelfReviveKit_C_OnAttributeChanged_3F97F61C4E8AA661EF1F45BA62032E1F");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnAttributeChanged_3F97F61C4E8AA661EF1F45BA62032E1F, Attribute) == 0x000000, "Member 'WBP_Progress_SelfReviveKit_C_OnAttributeChanged_3F97F61C4E8AA661EF1F45BA62032E1F::Attribute' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnAttributeChanged_3F97F61C4E8AA661EF1F45BA62032E1F, NewValue) == 0x000038, "Member 'WBP_Progress_SelfReviveKit_C_OnAttributeChanged_3F97F61C4E8AA661EF1F45BA62032E1F::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnAttributeChanged_3F97F61C4E8AA661EF1F45BA62032E1F, OldValue) == 0x00003C, "Member 'WBP_Progress_SelfReviveKit_C_OnAttributeChanged_3F97F61C4E8AA661EF1F45BA62032E1F::OldValue' has a wrong offset!");

// Function WBP_Progress_SelfReviveKit.WBP_Progress_SelfReviveKit_C.OnKillSelfTagChanged
// 0x0060 (0x0060 - 0x0000)
struct WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged final
{
public:
	bool                                          TagAdded;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67AE[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67AF[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetViewTarget_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67B0[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzAbilitySystemComponent*              CallFunc_GetGzAbilitySystemComponent_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UGameplayAbility*>               CallFunc_FindAbilitiesFromAbilityTag_OutAbilities; // 0x0030(0x0010)(ReferenceParm)
	class UGameplayAbility*                       CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67B1[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGA_KillSelf_C*                         K2Node_DynamicCast_AsGA_Kill_Self;                 // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67B2[0x1];                                     // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_VariableSet_MaxHoldTime_ImplicitCast;       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged) == 0x000008, "Wrong alignment on WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged");
static_assert(sizeof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged) == 0x000060, "Wrong size on WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, TagAdded) == 0x000000, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::TagAdded' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, Temp_bool_True_if_break_was_hit_Variable) == 0x000001, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, CallFunc_GetViewTarget_ReturnValue) == 0x000010, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, K2Node_DynamicCast_AsGz_Character) == 0x000018, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::K2Node_DynamicCast_AsGz_Character' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, CallFunc_GetGzAbilitySystemComponent_ReturnValue) == 0x000028, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::CallFunc_GetGzAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, CallFunc_FindAbilitiesFromAbilityTag_OutAbilities) == 0x000030, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::CallFunc_FindAbilitiesFromAbilityTag_OutAbilities' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, K2Node_DynamicCast_AsGA_Kill_Self) == 0x000050, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::K2Node_DynamicCast_AsGA_Kill_Self' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, CallFunc_Less_IntInt_ReturnValue) == 0x000059, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged, K2Node_VariableSet_MaxHoldTime_ImplicitCast) == 0x00005C, "Member 'WBP_Progress_SelfReviveKit_C_OnKillSelfTagChanged::K2Node_VariableSet_MaxHoldTime_ImplicitCast' has a wrong offset!");

// Function WBP_Progress_SelfReviveKit.WBP_Progress_SelfReviveKit_C.OnPlayerDeath
// 0x0001 (0x0001 - 0x0000)
struct WBP_Progress_SelfReviveKit_C_OnPlayerDeath final
{
public:
	bool                                          bWasAdded;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Progress_SelfReviveKit_C_OnPlayerDeath) == 0x000001, "Wrong alignment on WBP_Progress_SelfReviveKit_C_OnPlayerDeath");
static_assert(sizeof(WBP_Progress_SelfReviveKit_C_OnPlayerDeath) == 0x000001, "Wrong size on WBP_Progress_SelfReviveKit_C_OnPlayerDeath");
static_assert(offsetof(WBP_Progress_SelfReviveKit_C_OnPlayerDeath, bWasAdded) == 0x000000, "Member 'WBP_Progress_SelfReviveKit_C_OnPlayerDeath::bWasAdded' has a wrong offset!");

// Function WBP_Progress_SelfReviveKit.WBP_Progress_SelfReviveKit_C.OnUsingReviveKit
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Progress_SelfReviveKit_C_OnUsingReviveKit final
{
public:
	bool                                          bWasAdded;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67B3[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67B4[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0010(0x0020)(ConstParm)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67B5[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetViewTarget_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzCharacter*                           K2Node_DynamicCast_AsGz_Character;                 // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67B6[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UGzGameplayAbility*>             CallFunc_GetAbilitiesForInventorySlots_OutAbilities; // 0x0060(0x0010)(ReferenceParm)
	class UGzGameplayAbility*                     CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67B7[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGA_SelfRevive_C*                       K2Node_DynamicCast_AsGA_Self_Revive;               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
