#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PickUpLogEntry

#include "Basic.hpp"

#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PickUpLogEntry.WBP_PickUpLogEntry_C
// 0x0018 (0x0330 - 0x0318)
class UWBP_PickUpLogEntry_C final : public UGzPickUpLogEntryWidget
{
public:
	class UGzTextBlock*                           Item_GzText;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemImage;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MainPanel;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetItemInfo(const struct FGzInvItem& InvItem) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PickUpLogEntry_C">();
	}
	static class UWBP_PickUpLogEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PickUpLogEntry_C>();
	}
};
static_assert(alignof(UWBP_PickUpLogEntry_C) == 0x000008, "Wrong alignment on UWBP_PickUpLogEntry_C");
static_assert(sizeof(UWBP_PickUpLogEntry_C) == 0x000330, "Wrong size on UWBP_PickUpLogEntry_C");
static_assert(offsetof(UWBP_PickUpLogEntry_C, Item_GzText) == 0x000318, "Member 'UWBP_PickUpLogEntry_C::Item_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_PickUpLogEntry_C, ItemImage) == 0x000320, "Member 'UWBP_PickUpLogEntry_C::ItemImage' has a wrong offset!");
static_assert(offsetof(UWBP_PickUpLogEntry_C, MainPanel) == 0x000328, "Member 'UWBP_PickUpLogEntry_C::MainPanel' has a wrong offset!");

}

