#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OutsidePlayableAreaBG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OutsidePlayableAreaBG.WBP_OutsidePlayableAreaBG_C
// 0x0028 (0x0368 - 0x0340)
class UWBP_OutsidePlayableAreaBG_C final : public UGzHUDComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeInAnimationV2;                                 // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           FadeTimer;                                         // 0x0358(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag;                                               // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckTimer();
	void ExecuteUbergraph_WBP_OutsidePlayableAreaBG(int32 EntryPoint);
	void On_Tag_Changed(bool bWasAdded);
	void ReceiveBindEvents(class APawn* NewViewTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OutsidePlayableAreaBG_C">();
	}
	static class UWBP_OutsidePlayableAreaBG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OutsidePlayableAreaBG_C>();
	}
};
static_assert(alignof(UWBP_OutsidePlayableAreaBG_C) == 0x000008, "Wrong alignment on UWBP_OutsidePlayableAreaBG_C");
static_assert(sizeof(UWBP_OutsidePlayableAreaBG_C) == 0x000368, "Wrong size on UWBP_OutsidePlayableAreaBG_C");
static_assert(offsetof(UWBP_OutsidePlayableAreaBG_C, UberGraphFrame) == 0x000340, "Member 'UWBP_OutsidePlayableAreaBG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OutsidePlayableAreaBG_C, FadeInAnimationV2) == 0x000348, "Member 'UWBP_OutsidePlayableAreaBG_C::FadeInAnimationV2' has a wrong offset!");
static_assert(offsetof(UWBP_OutsidePlayableAreaBG_C, Background) == 0x000350, "Member 'UWBP_OutsidePlayableAreaBG_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_OutsidePlayableAreaBG_C, FadeTimer) == 0x000358, "Member 'UWBP_OutsidePlayableAreaBG_C::FadeTimer' has a wrong offset!");
static_assert(offsetof(UWBP_OutsidePlayableAreaBG_C, Tag) == 0x000360, "Member 'UWBP_OutsidePlayableAreaBG_C::Tag' has a wrong offset!");

}

