#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapMarker_HexTerminal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "WBP_MapMarker_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MapMarker_HexTerminal.WBP_MapMarker_HexTerminal_C
// 0x0060 (0x0568 - 0x0508)
class UWBP_MapMarker_HexTerminal_C final : public UWBP_MapMarker_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_MapMarker_HexTerminal_C;        // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_HEX_Extractor_C*                    HexExtractor;                                      // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInExtractingTeam;                                // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B5D[0x3];                                     // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           BadColor;                                          // 0x051C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GoodColor;                                         // 0x052C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PausedColor;                                       // 0x053C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B5E[0x4];                                     // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ProgressTimer;                                     // 0x0550(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExtracting;                                      // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B5F[0x7];                                     // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DistanceToShowProgress;                            // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void EndExtraction();
	void ExecuteUbergraph_WBP_MapMarker_HexTerminal(int32 EntryPoint);
	void ExtractionDataChanged(const struct FGzExtractionData& Current);
	void Is_Local_Player_In_Extracting_Team(bool* IsInTeam, bool* Valid);
	bool IsLocalPlayerClose();
	void StartExtraction();
	void UpdateProgress();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MapMarker_HexTerminal_C">();
	}
	static class UWBP_MapMarker_HexTerminal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MapMarker_HexTerminal_C>();
	}
};
static_assert(alignof(UWBP_MapMarker_HexTerminal_C) == 0x000008, "Wrong alignment on UWBP_MapMarker_HexTerminal_C");
static_assert(sizeof(UWBP_MapMarker_HexTerminal_C) == 0x000568, "Wrong size on UWBP_MapMarker_HexTerminal_C");
static_assert(offsetof(UWBP_MapMarker_HexTerminal_C, UberGraphFrame_WBP_MapMarker_HexTerminal_C) == 0x000508, "Member 'UWBP_MapMarker_HexTerminal_C::UberGraphFrame_WBP_MapMarker_HexTerminal_C' has a wrong offset!");
static_assert(offsetof(UWBP_MapMarker_HexTerminal_C, HexExtractor) == 0x000510, "Member 'UWBP_MapMarker_HexTerminal_C::HexExtractor' has a wrong offset!");
static_assert(offsetof(UWBP_MapMarker_HexTerminal_C, IsInExtractingTeam) == 0x000518, "Member 'UWBP_MapMarker_HexTerminal_C::IsInExtractingTeam' has a wrong offset!");
static_assert(offsetof(UWBP_MapMarker_HexTerminal_C, BadColor) == 0x00051C, "Member 'UWBP_MapMarker_HexTerminal_C::BadColor' has a wrong offset!");
static_assert(offsetof(UWBP_MapMarker_HexTerminal_C, GoodColor) == 0x00052C, "Member 'UWBP_MapMarker_HexTerminal_C::GoodColor' has a wrong offset!");
static_assert(offsetof(UWBP_MapMarker_HexTerminal_C, PausedColor) == 0x00053C, "Member 'UWBP_MapMarker_HexTerminal_C::PausedColor' has a wrong offset!");
static_assert(offsetof(UWBP_MapMarker_HexTerminal_C, ProgressTimer) == 0x000550, "Member 'UWBP_MapMarker_HexTerminal_C::ProgressTimer' has a wrong offset!");
static_assert(offsetof(UWBP_MapMarker_HexTerminal_C, IsExtracting) == 0x000558, "Member 'UWBP_MapMarker_HexTerminal_C::IsExtracting' has a wrong offset!");
static_assert(offsetof(UWBP_MapMarker_HexTerminal_C, DistanceToShowProgress) == 0x000560, "Member 'UWBP_MapMarker_HexTerminal_C::DistanceToShowProgress' has a wrong offset!");

}

