#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReportScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReportScreen.WBP_ReportScreen_C
// 0x00D0 (0x05F8 - 0x0528)
class UWBP_ReportScreen_C final : public UGzNavigationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_NavigationButton_Action_C*         Back_NavButton;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Button_HB;                                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NavigationButton_Action_C*         ChangePlayer_NavButton;                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NavigationButton_Action_C*         ConfirmReport_NavButton;                           // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           PlayerName;                                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ReportOptionsOverlay;                              // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonHierarchicalScrollBox*           ReportOptionVB;                                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReportOption_C*                    WBP_ReportOption;                                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReportOption_C*                    WBP_ReportOption_1;                                // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReportOption_C*                    WBP_ReportOption_2;                                // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReportOption_C*                    WBP_ReportOption_3;                                // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReportOption_C*                    WBP_ReportOption_4;                                // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReportOption_C*                    WBP_ReportOption_5;                                // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReportOption_C*                    WBP_ReportOption_6;                                // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AGzPlayerState*                         TargetedPlayerState;                               // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AGzPlayerState*                         KillerPlayerState;                                 // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UWBP_ReportOption_C*>            ReportArray;                                       // 0x05B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<EGzReportReason>                       Report_Reason;                                     // 0x05C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_ReportPlayer_C*                    SelectPlayerScreen;                                // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ConfirmReport_C*                   WBPConfirmReport;                                  // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanConfirm;                                       // 0x05E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6810[0x7];                                     // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Spectate_C*                        WBPSpectate;                                       // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ReportScreen_Back_NavButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_ReportScreen_ChangePlayer_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_ReportScreen_ConfirmReport_NavButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void CanProceedToConfirm(bool bChecked);
	void CleanUpChildren();
	void Construct();
	void CreateReportReasons();
	void Destruct();
	class UWidget* DoCustomNavigation(EUINavigation Param_Navigation);
	void ExecuteUbergraph_WBP_ReportScreen(int32 EntryPoint);
	void GetReportReasons(TArray<EGzReportReason>* Param_Report_Reason);
	void InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_ConfirmReport_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnBackAction();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnPlayerPawnChanged(class APawn* OldPawn, class APawn* NewPawn);
	void OnReportSent();
	void OnToReportPlayerChange(class AGzPlayerState* PlayerState);
	void SetConfirmButtonState();
	void SetCurrentViewTargetPlayerState();
	void SetPlayerName();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReportScreen_C">();
	}
	static class UWBP_ReportScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReportScreen_C>();
	}
};
static_assert(alignof(UWBP_ReportScreen_C) == 0x000008, "Wrong alignment on UWBP_ReportScreen_C");
static_assert(sizeof(UWBP_ReportScreen_C) == 0x0005F8, "Wrong size on UWBP_ReportScreen_C");
static_assert(offsetof(UWBP_ReportScreen_C, UberGraphFrame) == 0x000528, "Member 'UWBP_ReportScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, Back_NavButton) == 0x000530, "Member 'UWBP_ReportScreen_C::Back_NavButton' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, Button_HB) == 0x000538, "Member 'UWBP_ReportScreen_C::Button_HB' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, ChangePlayer_NavButton) == 0x000540, "Member 'UWBP_ReportScreen_C::ChangePlayer_NavButton' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, ConfirmReport_NavButton) == 0x000548, "Member 'UWBP_ReportScreen_C::ConfirmReport_NavButton' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, Overlay_1) == 0x000550, "Member 'UWBP_ReportScreen_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, PlayerName) == 0x000558, "Member 'UWBP_ReportScreen_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, ReportOptionsOverlay) == 0x000560, "Member 'UWBP_ReportScreen_C::ReportOptionsOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, ReportOptionVB) == 0x000568, "Member 'UWBP_ReportScreen_C::ReportOptionVB' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, WBP_ReportOption) == 0x000570, "Member 'UWBP_ReportScreen_C::WBP_ReportOption' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, WBP_ReportOption_1) == 0x000578, "Member 'UWBP_ReportScreen_C::WBP_ReportOption_1' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, WBP_ReportOption_2) == 0x000580, "Member 'UWBP_ReportScreen_C::WBP_ReportOption_2' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, WBP_ReportOption_3) == 0x000588, "Member 'UWBP_ReportScreen_C::WBP_ReportOption_3' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, WBP_ReportOption_4) == 0x000590, "Member 'UWBP_ReportScreen_C::WBP_ReportOption_4' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, WBP_ReportOption_5) == 0x000598, "Member 'UWBP_ReportScreen_C::WBP_ReportOption_5' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, WBP_ReportOption_6) == 0x0005A0, "Member 'UWBP_ReportScreen_C::WBP_ReportOption_6' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, TargetedPlayerState) == 0x0005A8, "Member 'UWBP_ReportScreen_C::TargetedPlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, KillerPlayerState) == 0x0005B0, "Member 'UWBP_ReportScreen_C::KillerPlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, ReportArray) == 0x0005B8, "Member 'UWBP_ReportScreen_C::ReportArray' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, Report_Reason) == 0x0005C8, "Member 'UWBP_ReportScreen_C::Report_Reason' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, SelectPlayerScreen) == 0x0005D8, "Member 'UWBP_ReportScreen_C::SelectPlayerScreen' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, WBPConfirmReport) == 0x0005E0, "Member 'UWBP_ReportScreen_C::WBPConfirmReport' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, bCanConfirm) == 0x0005E8, "Member 'UWBP_ReportScreen_C::bCanConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_ReportScreen_C, WBPSpectate) == 0x0005F0, "Member 'UWBP_ReportScreen_C::WBPSpectate' has a wrong offset!");

}

