#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JetpackAction_Wrapper

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_JetpackAction_Wrapper.WBP_JetpackAction_Wrapper_C.ExecuteUbergraph_WBP_JetpackAction_Wrapper
// 0x0010 (0x0010 - 0x0000)
struct WBP_JetpackAction_Wrapper_C_ExecuteUbergraph_WBP_JetpackAction_Wrapper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B74[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_NewViewTarget;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JetpackAction_Wrapper_C_ExecuteUbergraph_WBP_JetpackAction_Wrapper) == 0x000008, "Wrong alignment on WBP_JetpackAction_Wrapper_C_ExecuteUbergraph_WBP_JetpackAction_Wrapper");
static_assert(sizeof(WBP_JetpackAction_Wrapper_C_ExecuteUbergraph_WBP_JetpackAction_Wrapper) == 0x000010, "Wrong size on WBP_JetpackAction_Wrapper_C_ExecuteUbergraph_WBP_JetpackAction_Wrapper");
static_assert(offsetof(WBP_JetpackAction_Wrapper_C_ExecuteUbergraph_WBP_JetpackAction_Wrapper, EntryPoint) == 0x000000, "Member 'WBP_JetpackAction_Wrapper_C_ExecuteUbergraph_WBP_JetpackAction_Wrapper::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_JetpackAction_Wrapper_C_ExecuteUbergraph_WBP_JetpackAction_Wrapper, K2Node_Event_NewViewTarget) == 0x000008, "Member 'WBP_JetpackAction_Wrapper_C_ExecuteUbergraph_WBP_JetpackAction_Wrapper::K2Node_Event_NewViewTarget' has a wrong offset!");

// Function WBP_JetpackAction_Wrapper.WBP_JetpackAction_Wrapper_C.ReceiveBindEvents
// 0x0008 (0x0008 - 0x0000)
struct WBP_JetpackAction_Wrapper_C_ReceiveBindEvents final
{
public:
	class APawn*                                  NewViewTarget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JetpackAction_Wrapper_C_ReceiveBindEvents) == 0x000008, "Wrong alignment on WBP_JetpackAction_Wrapper_C_ReceiveBindEvents");
static_assert(sizeof(WBP_JetpackAction_Wrapper_C_ReceiveBindEvents) == 0x000008, "Wrong size on WBP_JetpackAction_Wrapper_C_ReceiveBindEvents");
static_assert(offsetof(WBP_JetpackAction_Wrapper_C_ReceiveBindEvents, NewViewTarget) == 0x000000, "Member 'WBP_JetpackAction_Wrapper_C_ReceiveBindEvents::NewViewTarget' has a wrong offset!");

}

