#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MortarLegsMap

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MortarLegsMap.WBP_MortarLegsMap_C.ExecuteUbergraph_WBP_MortarLegsMap
// 0x0018 (0x0018 - 0x0000)
struct WBP_MortarLegsMap_C_ExecuteUbergraph_WBP_MortarLegsMap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D2D[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MortarLegsMap_C_ExecuteUbergraph_WBP_MortarLegsMap) == 0x000004, "Wrong alignment on WBP_MortarLegsMap_C_ExecuteUbergraph_WBP_MortarLegsMap");
static_assert(sizeof(WBP_MortarLegsMap_C_ExecuteUbergraph_WBP_MortarLegsMap) == 0x000018, "Wrong size on WBP_MortarLegsMap_C_ExecuteUbergraph_WBP_MortarLegsMap");
static_assert(offsetof(WBP_MortarLegsMap_C_ExecuteUbergraph_WBP_MortarLegsMap, EntryPoint) == 0x000000, "Member 'WBP_MortarLegsMap_C_ExecuteUbergraph_WBP_MortarLegsMap::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegsMap_C_ExecuteUbergraph_WBP_MortarLegsMap, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_MortarLegsMap_C_ExecuteUbergraph_WBP_MortarLegsMap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegsMap_C_ExecuteUbergraph_WBP_MortarLegsMap, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_MortarLegsMap_C_ExecuteUbergraph_WBP_MortarLegsMap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

