#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BrokenJetpackNotificationSimplefied

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_StatusEffrctSlotBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BrokenJetpackNotificationSimplefied.WBP_BrokenJetpackNotificationSimplefied_C
// 0x0090 (0x0458 - 0x03C8)
class UWBP_BrokenJetpackNotificationSimplefied_C final : public UWBP_StatusEffrctSlotBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_BrokenJetpackNotificationSimplefied_C; // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           UpdateTimerHandler;                                // 0x03D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        UpdateSpeed;                                       // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShowTimeMax;                                       // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F[0x4];                                       // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           UpdateProgressTimer;                               // 0x03E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ShowTimeCarrent;                                   // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60[0x4];                                       // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           UpdateTimerHandler_Progress;                       // 0x03F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        UpdateProgressPercent;                             // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           JetpackHealthAsyncTask;                            // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowNotification;                                 // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzAsyncTaskGameplayTagAddedRemoved*    AsyncTaskDeadCharacter;                            // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     JetpackOwner;                                      // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              JetpackIcon;                                       // 0x0428(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class UGzAsyncTaskGameplayTagAddedRemoved*    GorillaJetpackDisableTask;                         // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BindJetpackListner(class APawn* ViewTarget);
	void ClearAsyncTask();
	void ClearTimer();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_BrokenJetpackNotificationSimplefied(int32 EntryPoint);
	void Init();
	void OnAttributeChanged_9F5FD0D54159A8B22DBE5793022A8B4C(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);
	void OnFinishShow();
	void OnTagAdded_9426B32746CF22499F7CCFB04A5F73B2(const struct FGameplayTag& Tag);
	void OnTagAdded_A0A228ED418CFD03D11B309C385D07EF(const struct FGameplayTag& Tag);
	void OnTagRemoved_9426B32746CF22499F7CCFB04A5F73B2(const struct FGameplayTag& Tag);
	void OnTagRemoved_A0A228ED418CFD03D11B309C385D07EF(const struct FGameplayTag& Tag);
	void PreConstruct(bool IsDesignTime);
	void ReceiveBindEvents(class APawn* NewViewTarget);
	void ReloadMaxTime();
	void ShowJetpackNotification(bool Show, bool Force);
	void TryShowNotification(double CurrentHealth);
	void UpdateProgress();
	void UpdateTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BrokenJetpackNotificationSimplefied_C">();
	}
	static class UWBP_BrokenJetpackNotificationSimplefied_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BrokenJetpackNotificationSimplefied_C>();
	}
};
static_assert(alignof(UWBP_BrokenJetpackNotificationSimplefied_C) == 0x000008, "Wrong alignment on UWBP_BrokenJetpackNotificationSimplefied_C");
static_assert(sizeof(UWBP_BrokenJetpackNotificationSimplefied_C) == 0x000458, "Wrong size on UWBP_BrokenJetpackNotificationSimplefied_C");
static_assert(offsetof(UWBP_BrokenJetpackNotificationSimplefied_C, UberGraphFrame_WBP_BrokenJetpackNotificationSimplefied_C) == 0x0003C8, "Member 'UWBP_BrokenJetpackNotificationSimplefied_C::UberGraphFrame_WBP_BrokenJetpackNotificationSimplefied_C' has a wrong offset!");
static_assert(offsetof(UWBP_BrokenJetpackNotificationSimplefied_C, UpdateTimerHandler) == 0x0003D0, "Member 'UWBP_BrokenJetpackNotificationSimplefied_C::UpdateTimerHandler' has a wrong offset!");
static_assert(offsetof(UWBP_BrokenJetpackNotificationSimplefied_C, UpdateSpeed) == 0x0003D8, "Member 'UWBP_BrokenJetpackNotificationSimplefied_C::UpdateSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_BrokenJetpackNotificationSimplefied_C, ShowTimeMax) == 0x0003E0, "Member 'UWBP_BrokenJetpackNotificationSimplefied_C::ShowTimeMax' has a wrong offset!");
static_assert(offsetof(UWBP_BrokenJetpackNotificationSimplefied_C, UpdateProgressTimer) == 0x0003E8, "Member 'UWBP_BrokenJetpackNotificationSimplefied_C::UpdateProgressTimer' has a wrong offset!");
static_assert(offsetof(UWBP_BrokenJetpackNotificationSimplefied_C, ShowTimeCarrent) == 0x0003F0, "Member 'UWBP_BrokenJetpackNotificationSimplefied_C::ShowTimeCarrent' has a wrong offset!");
static_assert(offsetof(UWBP_BrokenJetpackNotificationSimplefied_C, UpdateTimerHandler_Progress) == 0x0003F8, "Member 'UWBP_BrokenJetpackNotificationSimplefied_C::UpdateTimerHandler_Progress' has a wrong offset!");
static_assert(offsetof(UWBP_BrokenJetpackNotificationSimplefied_C, UpdateProgressPercent) == 0x000400, "Member 'UWBP_BrokenJetpackNotificationSimplefied_C::UpdateProgressPercent' has a wrong offset!");
static_assert(offsetof(UWBP_BrokenJetpackNotificationSimplefied_C, JetpackHealthAsyncTask) == 0x000408, "Member 'UWBP_BrokenJetpackNotificationSimplefied_C::JetpackHealthAsyncTask' has a wrong offset!");
static_assert(offsetof(UWBP_BrokenJetpackNotificationSimplefied_C, bShowNotification) == 0x000410, "Member 'UWBP_BrokenJetpackNotificationSimplefied_C::bShowNotification' has a wrong offset!");
static_assert(offsetof(UWBP_BrokenJetpackNotificationSimplefied_C, AsyncTaskDeadCharacter) == 0x000418, "Member 'UWBP_BrokenJetpackNotificationSimplefied_C::AsyncTaskDeadCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_BrokenJetpackNotificationSimplefied_C, JetpackOwner) == 0x000420, "Member 'UWBP_BrokenJetpackNotificationSimplefied_C::JetpackOwner' has a wrong offset!");
static_assert(offsetof(UWBP_BrokenJetpackNotificationSimplefied_C, JetpackIcon) == 0x000428, "Member 'UWBP_BrokenJetpackNotificationSimplefied_C::JetpackIcon' has a wrong offset!");
static_assert(offsetof(UWBP_BrokenJetpackNotificationSimplefied_C, GorillaJetpackDisableTask) == 0x000450, "Member 'UWBP_BrokenJetpackNotificationSimplefied_C::GorillaJetpackDisableTask' has a wrong offset!");

}

