#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HEX_PriceList_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HEX_PriceList_Entry.WBP_HEX_PriceList_Entry_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_HEX_PriceList_Entry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzTextBlock*                           HEXCost_Text;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           HEXQuality_Text;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Quality_Border;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EGzItemRarity                                 Quality;                                           // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3D3C[0x3];                                     // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Cost;                                              // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_HEX_PriceList_Entry(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HEX_PriceList_Entry_C">();
	}
	static class UWBP_HEX_PriceList_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HEX_PriceList_Entry_C>();
	}
};
static_assert(alignof(UWBP_HEX_PriceList_Entry_C) == 0x000008, "Wrong alignment on UWBP_HEX_PriceList_Entry_C");
static_assert(sizeof(UWBP_HEX_PriceList_Entry_C) == 0x000308, "Wrong size on UWBP_HEX_PriceList_Entry_C");
static_assert(offsetof(UWBP_HEX_PriceList_Entry_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_HEX_PriceList_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_PriceList_Entry_C, HEXCost_Text) == 0x0002E8, "Member 'UWBP_HEX_PriceList_Entry_C::HEXCost_Text' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_PriceList_Entry_C, HEXQuality_Text) == 0x0002F0, "Member 'UWBP_HEX_PriceList_Entry_C::HEXQuality_Text' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_PriceList_Entry_C, Quality_Border) == 0x0002F8, "Member 'UWBP_HEX_PriceList_Entry_C::Quality_Border' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_PriceList_Entry_C, Quality) == 0x000300, "Member 'UWBP_HEX_PriceList_Entry_C::Quality' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_PriceList_Entry_C, Cost) == 0x000304, "Member 'UWBP_HEX_PriceList_Entry_C::Cost' has a wrong offset!");

}

