#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusEffect

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "WBP_StatusEffrctSlotBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatusEffect.WBP_StatusEffect_C
// 0x0118 (0x04E0 - 0x03C8)
class UWBP_StatusEffect_C final : public UWBP_StatusEffrctSlotBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_StatusEffect_C;                 // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  Tags;                                              // 0x03D0(0x0020)(Edit, BlueprintVisible)
	struct FActiveGameplayEffectHandle            Active_Handle;                                     // 0x03F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateTimer;                                       // 0x03F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      Owning_Tag_Query;                                  // 0x0400(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UTexture2D>> IconsMap;                                          // 0x0448(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class APawn*                                  New_View_Target;                                   // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                ViewTargetASC;                                     // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              EmptyIcon;                                         // 0x04A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   Gameplay_Tags;                                     // 0x04D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_StatusEffect(int32 EntryPoint);
	void OnViewTargetChanged(class APawn* ViewTarget);
	void PreConstruct(bool IsDesignTime);
	void ReceiveBindEvents(class APawn* NewViewTarget);
	void ResetAll();
	void SetItemTexture();
	void TagChanged(bool bWasAdded);
	void UpdatePercent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatusEffect_C">();
	}
	static class UWBP_StatusEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatusEffect_C>();
	}
};
static_assert(alignof(UWBP_StatusEffect_C) == 0x000008, "Wrong alignment on UWBP_StatusEffect_C");
static_assert(sizeof(UWBP_StatusEffect_C) == 0x0004E0, "Wrong size on UWBP_StatusEffect_C");
static_assert(offsetof(UWBP_StatusEffect_C, UberGraphFrame_WBP_StatusEffect_C) == 0x0003C8, "Member 'UWBP_StatusEffect_C::UberGraphFrame_WBP_StatusEffect_C' has a wrong offset!");
static_assert(offsetof(UWBP_StatusEffect_C, Tags) == 0x0003D0, "Member 'UWBP_StatusEffect_C::Tags' has a wrong offset!");
static_assert(offsetof(UWBP_StatusEffect_C, Active_Handle) == 0x0003F0, "Member 'UWBP_StatusEffect_C::Active_Handle' has a wrong offset!");
static_assert(offsetof(UWBP_StatusEffect_C, UpdateTimer) == 0x0003F8, "Member 'UWBP_StatusEffect_C::UpdateTimer' has a wrong offset!");
static_assert(offsetof(UWBP_StatusEffect_C, Owning_Tag_Query) == 0x000400, "Member 'UWBP_StatusEffect_C::Owning_Tag_Query' has a wrong offset!");
static_assert(offsetof(UWBP_StatusEffect_C, IconsMap) == 0x000448, "Member 'UWBP_StatusEffect_C::IconsMap' has a wrong offset!");
static_assert(offsetof(UWBP_StatusEffect_C, New_View_Target) == 0x000498, "Member 'UWBP_StatusEffect_C::New_View_Target' has a wrong offset!");
static_assert(offsetof(UWBP_StatusEffect_C, ViewTargetASC) == 0x0004A0, "Member 'UWBP_StatusEffect_C::ViewTargetASC' has a wrong offset!");
static_assert(offsetof(UWBP_StatusEffect_C, EmptyIcon) == 0x0004A8, "Member 'UWBP_StatusEffect_C::EmptyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_StatusEffect_C, Gameplay_Tags) == 0x0004D0, "Member 'UWBP_StatusEffect_C::Gameplay_Tags' has a wrong offset!");

}

