#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HEX_Extractor_3DWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_HexUIExtractionStates_structs.hpp"
#include "Engine_structs.hpp"
#include "WBP_HEX_DiegeticWidget_Parent_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "G01_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HEX_Extractor_3DWidget.WBP_HEX_Extractor_3DWidget_C
// 0x0108 (0x03F8 - 0x02F0)
class UWBP_HEX_Extractor_3DWidget_C final : public UWBP_HEX_DiegeticWidget_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PauseHackAnim;                                     // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PausedProgressAnim;                                // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IdleAnimation;                                     // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 GridNoise_Image;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               HackedOverlay;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HackStateColor_Center_Image;                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HackStateColor_Top_Image;                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HEXIcon_Image;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           HintInfo_Text;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Main_WidgetSwitcher;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Pause_Overlay;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Pause_ProgressBar;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PauseBackground_Overlay;                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Percent_Text;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Text_Overlay;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           HackingColor;                                      // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ExtractingColor;                                   // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PausedColor;                                       // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TextCompletedHackColor;                            // 0x03A0(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TextCompletedExtractionColor;                      // 0x03B4(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TextDefaultColor;                                  // 0x03C8(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           CompletedExtractionColor;                          // 0x03DC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60CB[0x4];                                     // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               HexMaterial;                                       // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ShowGridNoise(bool Show);
	void SetStateStyle(E_HexUIExtractionStates NewState);
	void SetPercent(double Percent);
	void SetPauseState();
	void SetHackingState();
	void SetStartExtractionState(class UGzItemData* ItemData);
	void ResetInfo();
	void OnInitialized();
	void ExecuteUbergraph_WBP_HEX_Extractor_3DWidget(int32 EntryPoint);
	void HackCompleteInfo();
	void CompleteExtraction();
	void ExtractionCompleteInfo();
	void ExtractingState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HEX_Extractor_3DWidget_C">();
	}
	static class UWBP_HEX_Extractor_3DWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HEX_Extractor_3DWidget_C>();
	}
};
static_assert(alignof(UWBP_HEX_Extractor_3DWidget_C) == 0x000008, "Wrong alignment on UWBP_HEX_Extractor_3DWidget_C");
static_assert(sizeof(UWBP_HEX_Extractor_3DWidget_C) == 0x0003F8, "Wrong size on UWBP_HEX_Extractor_3DWidget_C");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_HEX_Extractor_3DWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, PauseHackAnim) == 0x0002F8, "Member 'UWBP_HEX_Extractor_3DWidget_C::PauseHackAnim' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, PausedProgressAnim) == 0x000300, "Member 'UWBP_HEX_Extractor_3DWidget_C::PausedProgressAnim' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, IdleAnimation) == 0x000308, "Member 'UWBP_HEX_Extractor_3DWidget_C::IdleAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, GridNoise_Image) == 0x000310, "Member 'UWBP_HEX_Extractor_3DWidget_C::GridNoise_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, HackedOverlay) == 0x000318, "Member 'UWBP_HEX_Extractor_3DWidget_C::HackedOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, HackStateColor_Center_Image) == 0x000320, "Member 'UWBP_HEX_Extractor_3DWidget_C::HackStateColor_Center_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, HackStateColor_Top_Image) == 0x000328, "Member 'UWBP_HEX_Extractor_3DWidget_C::HackStateColor_Top_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, HEXIcon_Image) == 0x000330, "Member 'UWBP_HEX_Extractor_3DWidget_C::HEXIcon_Image' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, HintInfo_Text) == 0x000338, "Member 'UWBP_HEX_Extractor_3DWidget_C::HintInfo_Text' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, Main_WidgetSwitcher) == 0x000340, "Member 'UWBP_HEX_Extractor_3DWidget_C::Main_WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, Pause_Overlay) == 0x000348, "Member 'UWBP_HEX_Extractor_3DWidget_C::Pause_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, Pause_ProgressBar) == 0x000350, "Member 'UWBP_HEX_Extractor_3DWidget_C::Pause_ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, PauseBackground_Overlay) == 0x000358, "Member 'UWBP_HEX_Extractor_3DWidget_C::PauseBackground_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, Percent_Text) == 0x000360, "Member 'UWBP_HEX_Extractor_3DWidget_C::Percent_Text' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, Text_Overlay) == 0x000368, "Member 'UWBP_HEX_Extractor_3DWidget_C::Text_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, HackingColor) == 0x000370, "Member 'UWBP_HEX_Extractor_3DWidget_C::HackingColor' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, ExtractingColor) == 0x000380, "Member 'UWBP_HEX_Extractor_3DWidget_C::ExtractingColor' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, PausedColor) == 0x000390, "Member 'UWBP_HEX_Extractor_3DWidget_C::PausedColor' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, TextCompletedHackColor) == 0x0003A0, "Member 'UWBP_HEX_Extractor_3DWidget_C::TextCompletedHackColor' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, TextCompletedExtractionColor) == 0x0003B4, "Member 'UWBP_HEX_Extractor_3DWidget_C::TextCompletedExtractionColor' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, TextDefaultColor) == 0x0003C8, "Member 'UWBP_HEX_Extractor_3DWidget_C::TextDefaultColor' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, CompletedExtractionColor) == 0x0003DC, "Member 'UWBP_HEX_Extractor_3DWidget_C::CompletedExtractionColor' has a wrong offset!");
static_assert(offsetof(UWBP_HEX_Extractor_3DWidget_C, HexMaterial) == 0x0003F0, "Member 'UWBP_HEX_Extractor_3DWidget_C::HexMaterial' has a wrong offset!");

}

