#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ViewportMarkersContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ViewportMarkersContainer.WBP_ViewportMarkersContainer_C
// 0x0018 (0x0548 - 0x0530)
class UWBP_ViewportMarkersContainer_C final : public UGzViewportMarkerContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzMarkerComponent*                     Marker_Component;                                  // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzViewportMarkerWidget*                Marker_Widget;                                     // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ViewportMarkersContainer(int32 EntryPoint);
	void OnMarkerAdded(class UGzMarkerWidget* MarkerWidget, class UGzMarkerComponent* MarkerComponent);
	void SetupMissionMarkers();
	void SetupMissionVehicleHealthbar();
	void SetupNPCNames();
	void SetupPingData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ViewportMarkersContainer_C">();
	}
	static class UWBP_ViewportMarkersContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ViewportMarkersContainer_C>();
	}
};
static_assert(alignof(UWBP_ViewportMarkersContainer_C) == 0x000008, "Wrong alignment on UWBP_ViewportMarkersContainer_C");
static_assert(sizeof(UWBP_ViewportMarkersContainer_C) == 0x000548, "Wrong size on UWBP_ViewportMarkersContainer_C");
static_assert(offsetof(UWBP_ViewportMarkersContainer_C, UberGraphFrame) == 0x000530, "Member 'UWBP_ViewportMarkersContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ViewportMarkersContainer_C, Marker_Component) == 0x000538, "Member 'UWBP_ViewportMarkersContainer_C::Marker_Component' has a wrong offset!");
static_assert(offsetof(UWBP_ViewportMarkersContainer_C, Marker_Widget) == 0x000540, "Member 'UWBP_ViewportMarkersContainer_C::Marker_Widget' has a wrong offset!");

}

