#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OpportunityLog

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_OpportunityLog.WBP_OpportunityLog_C.CreateMissionWidget
// 0x0048 (0x0048 - 0x0000)
struct WBP_OpportunityLog_C_CreateMissionWidget final
{
public:
	const class AGzMission*                       Mission;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_BaseOpportunityMission_C*          Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzMissionData*                         CallFunc_GetMissionData_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_OpportunityMission_C*              CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsWBP_Base_Opportunity_Mission; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5762[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_BaseOpportunityMission_C*          CallFunc_Create_ReturnValue_1;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OpportunityLog_C_CreateMissionWidget) == 0x000008, "Wrong alignment on WBP_OpportunityLog_C_CreateMissionWidget");
static_assert(sizeof(WBP_OpportunityLog_C_CreateMissionWidget) == 0x000048, "Wrong size on WBP_OpportunityLog_C_CreateMissionWidget");
static_assert(offsetof(WBP_OpportunityLog_C_CreateMissionWidget, Mission) == 0x000000, "Member 'WBP_OpportunityLog_C_CreateMissionWidget::Mission' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_CreateMissionWidget, Widget) == 0x000008, "Member 'WBP_OpportunityLog_C_CreateMissionWidget::Widget' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_CreateMissionWidget, CallFunc_GetMissionData_ReturnValue) == 0x000010, "Member 'WBP_OpportunityLog_C_CreateMissionWidget::CallFunc_GetMissionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_CreateMissionWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_OpportunityLog_C_CreateMissionWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_CreateMissionWidget, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_OpportunityLog_C_CreateMissionWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_CreateMissionWidget, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000028, "Member 'WBP_OpportunityLog_C_CreateMissionWidget::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_CreateMissionWidget, K2Node_ClassDynamicCast_AsWBP_Base_Opportunity_Mission) == 0x000030, "Member 'WBP_OpportunityLog_C_CreateMissionWidget::K2Node_ClassDynamicCast_AsWBP_Base_Opportunity_Mission' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_CreateMissionWidget, K2Node_ClassDynamicCast_bSuccess) == 0x000038, "Member 'WBP_OpportunityLog_C_CreateMissionWidget::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_CreateMissionWidget, CallFunc_Create_ReturnValue_1) == 0x000040, "Member 'WBP_OpportunityLog_C_CreateMissionWidget::CallFunc_Create_ReturnValue_1' has a wrong offset!");

// Function WBP_OpportunityLog.WBP_OpportunityLog_C.ExecuteUbergraph_WBP_OpportunityLog
// 0x0080 (0x0080 - 0x0000)
struct WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5763[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzMissionSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5764[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGzMission*>                     CallFunc_GetActiveMissions_ReturnValue;            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	class UWBP_OpportunityMission_C*              CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzMission*                             CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGzMissionState                        CallFunc_GetMissionState_ReturnValue;              // 0x003C(0x000C)(NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5765[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGzMission* Mission)>    K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5766[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzMissionSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5767[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog) == 0x000008, "Wrong alignment on WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog");
static_assert(sizeof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog) == 0x000080, "Wrong size on WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, EntryPoint) == 0x000000, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, CallFunc_GetActiveMissions_ReturnValue) == 0x000018, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::CallFunc_GetActiveMissions_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, CallFunc_GetMissionState_ReturnValue) == 0x00003C, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::CallFunc_GetMissionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, K2Node_Event_IsDesignTime) == 0x00005C, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000060, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, CallFunc_AddChild_ReturnValue) == 0x000068, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'WBP_OpportunityLog_C_ExecuteUbergraph_WBP_OpportunityLog::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_OpportunityLog.WBP_OpportunityLog_C.OnMissionStarted
// 0x0050 (0x0050 - 0x0000)
struct WBP_OpportunityLog_C_OnMissionStarted final
{
public:
	class AGzMission*                             Mission;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGzMissionState                        CallFunc_GetMissionState_ReturnValue;              // 0x0008(0x000C)(NoDestructor)
	uint8                                         Pad_5768[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_BaseOpportunityMission_C*          CallFunc_CreateMissionWidget_Widget;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5769[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OpportunityLog_C_OnMissionStarted) == 0x000008, "Wrong alignment on WBP_OpportunityLog_C_OnMissionStarted");
static_assert(sizeof(WBP_OpportunityLog_C_OnMissionStarted) == 0x000050, "Wrong size on WBP_OpportunityLog_C_OnMissionStarted");
static_assert(offsetof(WBP_OpportunityLog_C_OnMissionStarted, Mission) == 0x000000, "Member 'WBP_OpportunityLog_C_OnMissionStarted::Mission' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_OnMissionStarted, CallFunc_GetMissionState_ReturnValue) == 0x000008, "Member 'WBP_OpportunityLog_C_OnMissionStarted::CallFunc_GetMissionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_OnMissionStarted, CallFunc_CreateMissionWidget_Widget) == 0x000018, "Member 'WBP_OpportunityLog_C_OnMissionStarted::CallFunc_CreateMissionWidget_Widget' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_OnMissionStarted, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_OpportunityLog_C_OnMissionStarted::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_OnMissionStarted, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'WBP_OpportunityLog_C_OnMissionStarted::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_OnMissionStarted, CallFunc_IsValid_ReturnValue_1) == 0x000022, "Member 'WBP_OpportunityLog_C_OnMissionStarted::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_OnMissionStarted, CallFunc_AddChild_ReturnValue) == 0x000028, "Member 'WBP_OpportunityLog_C_OnMissionStarted::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_OnMissionStarted, K2Node_MakeStruct_Margin) == 0x000030, "Member 'WBP_OpportunityLog_C_OnMissionStarted::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_OnMissionStarted, K2Node_DynamicCast_AsVertical_Box_Slot) == 0x000040, "Member 'WBP_OpportunityLog_C_OnMissionStarted::K2Node_DynamicCast_AsVertical_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_OpportunityLog_C_OnMissionStarted, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_OpportunityLog_C_OnMissionStarted::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_OpportunityLog.WBP_OpportunityLog_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_OpportunityLog_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OpportunityLog_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_OpportunityLog_C_PreConstruct");
static_assert(sizeof(WBP_OpportunityLog_C_PreConstruct) == 0x000001, "Wrong size on WBP_OpportunityLog_C_PreConstruct");
static_assert(offsetof(WBP_OpportunityLog_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_OpportunityLog_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

