#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainNotification_SecondaryIcon

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "G01_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainNotification_SecondaryIcon.WBP_MainNotification_SecondaryIcon_C
// 0x0020 (0x03A8 - 0x0388)
class UWBP_MainNotification_SecondaryIcon_C final : public UGzGameNotificationBody
{
public:
	class UWidgetAnimation*                       ErrorAnimation;                                    // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 MainIcon_Image;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeContainer;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpecialIcon_Image;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetIconSize(float InSizeOverride);
	void TryUpdateSpecialIcon(bool* Result);
	bool UpdateNotificationData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainNotification_SecondaryIcon_C">();
	}
	static class UWBP_MainNotification_SecondaryIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainNotification_SecondaryIcon_C>();
	}
};
static_assert(alignof(UWBP_MainNotification_SecondaryIcon_C) == 0x000008, "Wrong alignment on UWBP_MainNotification_SecondaryIcon_C");
static_assert(sizeof(UWBP_MainNotification_SecondaryIcon_C) == 0x0003A8, "Wrong size on UWBP_MainNotification_SecondaryIcon_C");
static_assert(offsetof(UWBP_MainNotification_SecondaryIcon_C, ErrorAnimation) == 0x000388, "Member 'UWBP_MainNotification_SecondaryIcon_C::ErrorAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryIcon_C, MainIcon_Image) == 0x000390, "Member 'UWBP_MainNotification_SecondaryIcon_C::MainIcon_Image' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryIcon_C, SizeContainer) == 0x000398, "Member 'UWBP_MainNotification_SecondaryIcon_C::SizeContainer' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryIcon_C, SpecialIcon_Image) == 0x0003A0, "Member 'UWBP_MainNotification_SecondaryIcon_C::SpecialIcon_Image' has a wrong offset!");

}

