#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainNotification_SecondaryTimerOnlySecond

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainNotification_SecondaryTimerOnlySecond.WBP_MainNotification_SecondaryTimerOnlySecond_C
// 0x0070 (0x03F8 - 0x0388)
class UWBP_MainNotification_SecondaryTimerOnlySecond_C final : public UGzGameNotificationBody
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SecondSecondaryMovement;                           // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SecondFirstMovement;                               // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGzTextBlock*                           SecondFirstNumber_GzText;                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           SecondFirstNumberNext_GzText;                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SecondFirstOverlay;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           SecondSecondaryNumber_GzText;                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           SecondSecondaryNumberNext_GzText;                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SecondSecondaryOverlay;                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Time;                                              // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateTimer;                                       // 0x03D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableAutoAnimation;                              // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BA8[0x7];                                     // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ZeroTime;                                          // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_MainNotification_SecondaryTimerOnlySecond(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PlayNumberAnimation();
	void ResentNextToCurrentTime();
	void ResetAnimationOffsets();
	void ResetTime(class UTextBlock* NextTimeText, class UTextBlock* CurrTimeText);
	void SetText(const class FString& Text, class UGzTextBlock* FirstNumber, class UGzTextBlock* SecondaryNumber);
	void SetTime(double Param_Time, bool Param_PlayAnimation);
	void StopUpdateTime();
	void TryUpdateTimeNumber(const class FString& Param_Time, int32 StartIndex, class UGzTextBlock* GzText);
	bool UpdateNotificationData();
	void UpdateNumbers(bool bIgnoreUpdateStart);
	void UpdateTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainNotification_SecondaryTimerOnlySecond_C">();
	}
	static class UWBP_MainNotification_SecondaryTimerOnlySecond_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainNotification_SecondaryTimerOnlySecond_C>();
	}
};
static_assert(alignof(UWBP_MainNotification_SecondaryTimerOnlySecond_C) == 0x000008, "Wrong alignment on UWBP_MainNotification_SecondaryTimerOnlySecond_C");
static_assert(sizeof(UWBP_MainNotification_SecondaryTimerOnlySecond_C) == 0x0003F8, "Wrong size on UWBP_MainNotification_SecondaryTimerOnlySecond_C");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerOnlySecond_C, UberGraphFrame) == 0x000388, "Member 'UWBP_MainNotification_SecondaryTimerOnlySecond_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerOnlySecond_C, SecondSecondaryMovement) == 0x000390, "Member 'UWBP_MainNotification_SecondaryTimerOnlySecond_C::SecondSecondaryMovement' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerOnlySecond_C, SecondFirstMovement) == 0x000398, "Member 'UWBP_MainNotification_SecondaryTimerOnlySecond_C::SecondFirstMovement' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerOnlySecond_C, SecondFirstNumber_GzText) == 0x0003A0, "Member 'UWBP_MainNotification_SecondaryTimerOnlySecond_C::SecondFirstNumber_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerOnlySecond_C, SecondFirstNumberNext_GzText) == 0x0003A8, "Member 'UWBP_MainNotification_SecondaryTimerOnlySecond_C::SecondFirstNumberNext_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerOnlySecond_C, SecondFirstOverlay) == 0x0003B0, "Member 'UWBP_MainNotification_SecondaryTimerOnlySecond_C::SecondFirstOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerOnlySecond_C, SecondSecondaryNumber_GzText) == 0x0003B8, "Member 'UWBP_MainNotification_SecondaryTimerOnlySecond_C::SecondSecondaryNumber_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerOnlySecond_C, SecondSecondaryNumberNext_GzText) == 0x0003C0, "Member 'UWBP_MainNotification_SecondaryTimerOnlySecond_C::SecondSecondaryNumberNext_GzText' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerOnlySecond_C, SecondSecondaryOverlay) == 0x0003C8, "Member 'UWBP_MainNotification_SecondaryTimerOnlySecond_C::SecondSecondaryOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerOnlySecond_C, Time) == 0x0003D0, "Member 'UWBP_MainNotification_SecondaryTimerOnlySecond_C::Time' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerOnlySecond_C, UpdateTimer) == 0x0003D8, "Member 'UWBP_MainNotification_SecondaryTimerOnlySecond_C::UpdateTimer' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerOnlySecond_C, bEnableAutoAnimation) == 0x0003E0, "Member 'UWBP_MainNotification_SecondaryTimerOnlySecond_C::bEnableAutoAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_MainNotification_SecondaryTimerOnlySecond_C, ZeroTime) == 0x0003E8, "Member 'UWBP_MainNotification_SecondaryTimerOnlySecond_C::ZeroTime' has a wrong offset!");

}

