#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Crosshair_InputAction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_InputHint_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Crosshair_InputAction.WBP_Crosshair_InputAction_C
// 0x0040 (0x0320 - 0x02E0)
class UWBP_Crosshair_InputAction_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzActionWidget*                        GzActionWidget;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Result_Text;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           RText_ActionModifier;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputAction*                           InputAction;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   ResultText;                                        // 0x0308(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	E_InputHint                                   InputHint;                                         // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void CyberlimbUpdateState(const class FText& Param_ResultText, E_InputHint Param_InputHint, class UInputAction* Param_InputAction);
	void ExecuteUbergraph_WBP_Crosshair_InputAction(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void RebuildInputInfo();
	void SetNewInputAction(class UInputAction* NewInputAction);
	void SetNewResultText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Crosshair_InputAction_C">();
	}
	static class UWBP_Crosshair_InputAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Crosshair_InputAction_C>();
	}
};
static_assert(alignof(UWBP_Crosshair_InputAction_C) == 0x000008, "Wrong alignment on UWBP_Crosshair_InputAction_C");
static_assert(sizeof(UWBP_Crosshair_InputAction_C) == 0x000320, "Wrong size on UWBP_Crosshair_InputAction_C");
static_assert(offsetof(UWBP_Crosshair_InputAction_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Crosshair_InputAction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_InputAction_C, GzActionWidget) == 0x0002E8, "Member 'UWBP_Crosshair_InputAction_C::GzActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_InputAction_C, Result_Text) == 0x0002F0, "Member 'UWBP_Crosshair_InputAction_C::Result_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_InputAction_C, RText_ActionModifier) == 0x0002F8, "Member 'UWBP_Crosshair_InputAction_C::RText_ActionModifier' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_InputAction_C, InputAction) == 0x000300, "Member 'UWBP_Crosshair_InputAction_C::InputAction' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_InputAction_C, ResultText) == 0x000308, "Member 'UWBP_Crosshair_InputAction_C::ResultText' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_InputAction_C, InputHint) == 0x000318, "Member 'UWBP_Crosshair_InputAction_C::InputHint' has a wrong offset!");

}

