#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Vehicle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Vehicle.WBP_Vehicle_C
// 0x0048 (0x0388 - 0x0340)
class UWBP_Vehicle_C final : public UGzHUDComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzActionWidget*                        InputActionWidget;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Vehicle_WidgetSwitcher;                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VehicleDestroyed_Image;                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Vehicle_Layout_Offroad_C*          VehicleSeatLayout_Offroad;                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Vehicle_Layout_TAC_C*              VehicleSeatLayout_TAC;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class WBP_Vehicle_Health_0::UWBP_Vehicle_Health_C* WBP_VehiclePanel_Health_DOS;                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzAsyncTaskAttributeChanged*           HealthListenTask;                                  // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGzVehicle*                             CachedVehicle;                                     // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Clear_Callbacks(class APawn* PlayerCharacter);
	void ExecuteUbergraph_WBP_Vehicle(int32 EntryPoint);
	void GetVehicleLayout(class AGzVehicle* Vehicle, class UWBP_Vehicle_Layout_C** AsWBP_Base_Vehicle_Seat_Position);
	void OnSeatEvent(class AGzCharacter* Character, EGzVehicleSeatType NewSeat, EGzVehicleSeatType OldSeat);
	void OnVehicleDestroyed();
	void ReceiveBindEvents(class APawn* NewViewTarget);
	void ReceiveUnbindEvents(class APawn* OldViewTarget);
	void Vehicle_Seat_Changed(class AGzCharacter* Character, EGzVehicleSeatType NewSeat, EGzVehicleSeatType OldSeat);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Vehicle_C">();
	}
	static class UWBP_Vehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Vehicle_C>();
	}
};
static_assert(alignof(UWBP_Vehicle_C) == 0x000008, "Wrong alignment on UWBP_Vehicle_C");
static_assert(sizeof(UWBP_Vehicle_C) == 0x000388, "Wrong size on UWBP_Vehicle_C");
static_assert(offsetof(UWBP_Vehicle_C, UberGraphFrame) == 0x000340, "Member 'UWBP_Vehicle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_C, InputActionWidget) == 0x000348, "Member 'UWBP_Vehicle_C::InputActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_C, Vehicle_WidgetSwitcher) == 0x000350, "Member 'UWBP_Vehicle_C::Vehicle_WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_C, VehicleDestroyed_Image) == 0x000358, "Member 'UWBP_Vehicle_C::VehicleDestroyed_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_C, VehicleSeatLayout_Offroad) == 0x000360, "Member 'UWBP_Vehicle_C::VehicleSeatLayout_Offroad' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_C, VehicleSeatLayout_TAC) == 0x000368, "Member 'UWBP_Vehicle_C::VehicleSeatLayout_TAC' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_C, WBP_VehiclePanel_Health_DOS) == 0x000370, "Member 'UWBP_Vehicle_C::WBP_VehiclePanel_Health_DOS' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_C, HealthListenTask) == 0x000378, "Member 'UWBP_Vehicle_C::HealthListenTask' has a wrong offset!");
static_assert(offsetof(UWBP_Vehicle_C, CachedVehicle) == 0x000380, "Member 'UWBP_Vehicle_C::CachedVehicle' has a wrong offset!");

}

