#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NavigationButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NavigationButton.WBP_NavigationButton_C
// 0x0020 (0x1650 - 0x1630)
class UWBP_NavigationButton_C final : public UGzCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   ButtonText;                                        // 0x1638(0x0010)(Edit, BlueprintVisible)
	class UClass*                                 TextStyle;                                         // 0x1648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void SetText(const class FText& InText);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_NavigationButton(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NavigationButton_C">();
	}
	static class UWBP_NavigationButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NavigationButton_C>();
	}
};
static_assert(alignof(UWBP_NavigationButton_C) == 0x000010, "Wrong alignment on UWBP_NavigationButton_C");
static_assert(sizeof(UWBP_NavigationButton_C) == 0x001650, "Wrong size on UWBP_NavigationButton_C");
static_assert(offsetof(UWBP_NavigationButton_C, UberGraphFrame) == 0x001630, "Member 'UWBP_NavigationButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NavigationButton_C, ButtonText) == 0x001638, "Member 'UWBP_NavigationButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_NavigationButton_C, TextStyle) == 0x001648, "Member 'UWBP_NavigationButton_C::TextStyle' has a wrong offset!");

}

