#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemName

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ItemName.WBP_ItemName_C.ExecuteUbergraph_WBP_ItemName
// 0x0038 (0x0038 - 0x0000)
struct WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B27[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	class UGzItemData*                            K2Node_Event_Item_Data;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B28[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0028(0x0010)()
};
static_assert(alignof(WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName) == 0x000008, "Wrong alignment on WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName");
static_assert(sizeof(WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName) == 0x000038, "Wrong size on WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName");
static_assert(offsetof(WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName, EntryPoint) == 0x000000, "Member 'WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName, Temp_bool_Variable) == 0x000004, "Member 'WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName, Temp_text_Variable) == 0x000008, "Member 'WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName, K2Node_Event_Item_Data) == 0x000018, "Member 'WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName::K2Node_Event_Item_Data' has a wrong offset!");
static_assert(offsetof(WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName, K2Node_Select_Default) == 0x000028, "Member 'WBP_ItemName_C_ExecuteUbergraph_WBP_ItemName::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ItemName.WBP_ItemName_C.OnItemUpdated
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemName_C_OnItemUpdated final
{
public:
	class UGzItemData*                            Param_Item_Data;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemName_C_OnItemUpdated) == 0x000008, "Wrong alignment on WBP_ItemName_C_OnItemUpdated");
static_assert(sizeof(WBP_ItemName_C_OnItemUpdated) == 0x000008, "Wrong size on WBP_ItemName_C_OnItemUpdated");
static_assert(offsetof(WBP_ItemName_C_OnItemUpdated, Param_Item_Data) == 0x000000, "Member 'WBP_ItemName_C_OnItemUpdated::Param_Item_Data' has a wrong offset!");

}

