#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Map

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Map.WBP_Map_C.ExecuteUbergraph_WBP_Map
// 0x0018 (0x0018 - 0x0000)
struct WBP_Map_C_ExecuteUbergraph_WBP_Map final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_512E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_ExecuteUbergraph_WBP_Map) == 0x000004, "Wrong alignment on WBP_Map_C_ExecuteUbergraph_WBP_Map");
static_assert(sizeof(WBP_Map_C_ExecuteUbergraph_WBP_Map) == 0x000018, "Wrong size on WBP_Map_C_ExecuteUbergraph_WBP_Map");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, EntryPoint) == 0x000000, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

