#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WinnerProfileItem

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "G01_structs.hpp"


namespace SDK::Params
{

// Function WBP_WinnerProfileItem.WBP_WinnerProfileItem_C.UpdateBadges
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_WinnerProfileItem_C_UpdateBadges final
{
public:
	class FString                                 PlayerClanTag;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D09[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D0A[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WinnerProfileItem_C_UpdateBadges) == 0x000008, "Wrong alignment on WBP_WinnerProfileItem_C_UpdateBadges");
static_assert(sizeof(WBP_WinnerProfileItem_C_UpdateBadges) == 0x0000A0, "Wrong size on WBP_WinnerProfileItem_C_UpdateBadges");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, PlayerClanTag) == 0x000000, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::PlayerClanTag' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, Temp_bool_Variable) == 0x000010, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, Temp_byte_Variable) == 0x000011, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, Temp_bool_Variable_1) == 0x000013, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, Temp_byte_Variable_2) == 0x000014, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, Temp_byte_Variable_3) == 0x000015, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, CallFunc_IsEmpty_ReturnValue) == 0x000070, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, CallFunc_Format_ReturnValue) == 0x000088, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, K2Node_Select_Default) == 0x000098, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, CallFunc_Not_PreBool_ReturnValue) == 0x000099, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_UpdateBadges, K2Node_Select_Default_1) == 0x00009A, "Member 'WBP_WinnerProfileItem_C_UpdateBadges::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_WinnerProfileItem.WBP_WinnerProfileItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_WinnerProfileItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WinnerProfileItem_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_WinnerProfileItem_C_PreConstruct");
static_assert(sizeof(WBP_WinnerProfileItem_C_PreConstruct) == 0x000001, "Wrong size on WBP_WinnerProfileItem_C_PreConstruct");
static_assert(offsetof(WBP_WinnerProfileItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_WinnerProfileItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_WinnerProfileItem.WBP_WinnerProfileItem_C.GetStats
// 0x0098 (0x0098 - 0x0000)
struct WBP_WinnerProfileItem_C_GetStats final
{
public:
	struct FGzMatchEndPlayerResult                GameStats;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<struct FGzGameStat>                    Return_Value;                                      // 0x0048(0x0010)(Parm, OutParm)
	TArray<struct FGzGameStat>                    FilteredStats;                                     // 0x0058(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGzGameStat                            CallFunc_Array_Get_Item;                           // 0x0070(0x0010)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D0B[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WinnerProfileItem_C_GetStats) == 0x000008, "Wrong alignment on WBP_WinnerProfileItem_C_GetStats");
static_assert(sizeof(WBP_WinnerProfileItem_C_GetStats) == 0x000098, "Wrong size on WBP_WinnerProfileItem_C_GetStats");
static_assert(offsetof(WBP_WinnerProfileItem_C_GetStats, GameStats) == 0x000000, "Member 'WBP_WinnerProfileItem_C_GetStats::GameStats' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_GetStats, Return_Value) == 0x000048, "Member 'WBP_WinnerProfileItem_C_GetStats::Return_Value' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_GetStats, FilteredStats) == 0x000058, "Member 'WBP_WinnerProfileItem_C_GetStats::FilteredStats' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_GetStats, Temp_int_Array_Index_Variable) == 0x000068, "Member 'WBP_WinnerProfileItem_C_GetStats::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_GetStats, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'WBP_WinnerProfileItem_C_GetStats::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_GetStats, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_WinnerProfileItem_C_GetStats::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_GetStats, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'WBP_WinnerProfileItem_C_GetStats::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_GetStats, CallFunc_Array_Add_ReturnValue) == 0x000084, "Member 'WBP_WinnerProfileItem_C_GetStats::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_GetStats, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WBP_WinnerProfileItem_C_GetStats::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_GetStats, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_WinnerProfileItem_C_GetStats::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_GetStats, CallFunc_Array_Contains_ReturnValue) == 0x000090, "Member 'WBP_WinnerProfileItem_C_GetStats::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function WBP_WinnerProfileItem.WBP_WinnerProfileItem_C.ExecuteUbergraph_WBP_WinnerProfileItem
// 0x0148 (0x0148 - 0x0000)
struct WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D0C[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGzGameStat>                    CallFunc_GetStats_Return_value;                    // 0x0018(0x0010)(ReferenceParm)
	struct FGzGameStat                            CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D0D[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0040(0x0010)()
	class UBP_GameStatTemplate_C*                 K2Node_DynamicCast_AsBP_Game_Stat_Template;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D0E[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_WinnerScreenStatEntry_C*           CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0078(0x0010)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0130(0x0010)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem) == 0x000008, "Wrong alignment on WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem");
static_assert(sizeof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem) == 0x000148, "Wrong size on WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, EntryPoint) == 0x000000, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, CallFunc_GetStats_Return_value) == 0x000018, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::CallFunc_GetStats_Return_value' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000040, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, K2Node_DynamicCast_AsBP_Game_Stat_Template) == 0x000050, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::K2Node_DynamicCast_AsBP_Game_Stat_Template' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, CallFunc_Create_ReturnValue) == 0x000068, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000070, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, CallFunc_MakeLiteralText_ReturnValue) == 0x000078, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000088, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D8, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, K2Node_MakeArray_Array) == 0x000120, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, CallFunc_Format_ReturnValue) == 0x000130, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000140, "Member 'WBP_WinnerProfileItem_C_ExecuteUbergraph_WBP_WinnerProfileItem::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

}

