#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Lobby_Username_Component

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Lobby_Username_Component.WBP_Lobby_Username_Component_C.ExecuteUbergraph_WBP_Lobby_Username_Component
// 0x01E8 (0x01E8 - 0x0000)
struct WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60F1[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60F2[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzSceneManager*                        CallFunc_GetSceneManager_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_LobbyUsername_C*                   K2Node_DynamicCast_AsWBP_Lobby_Username;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60F3[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_SceneTag_1;                     // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGzSceneChangedEventData               K2Node_CustomEvent_EventData_1;                    // 0x004C(0x0010)(ConstParm, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_SceneTag;                       // 0x005C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGzSceneChangedEventData               K2Node_CustomEvent_EventData;                      // 0x0064(0x0010)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_2;     // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60F4[0x1];                                     // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& SceneTag, struct FGzSceneChangedEventData& EventData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& SceneTag, struct FGzSceneChangedEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_1;                  // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60F5[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60F6[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00E8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component) == 0x000008, "Wrong alignment on WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component");
static_assert(sizeof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component) == 0x0001E8, "Wrong size on WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, EntryPoint) == 0x000000, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, CallFunc_GetWidget_ReturnValue) == 0x000028, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, CallFunc_GetSceneManager_ReturnValue) == 0x000030, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::CallFunc_GetSceneManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, K2Node_DynamicCast_AsWBP_Lobby_Username) == 0x000038, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::K2Node_DynamicCast_AsWBP_Lobby_Username' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, K2Node_CustomEvent_SceneTag_1) == 0x000044, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::K2Node_CustomEvent_SceneTag_1' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, K2Node_CustomEvent_EventData_1) == 0x00004C, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::K2Node_CustomEvent_EventData_1' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, K2Node_CustomEvent_SceneTag) == 0x00005C, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::K2Node_CustomEvent_SceneTag' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, K2Node_CustomEvent_EventData) == 0x000064, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::K2Node_CustomEvent_EventData' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000074, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x000075, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, CallFunc_EqualEqual_GameplayTag_ReturnValue_2) == 0x000076, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::CallFunc_EqualEqual_GameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, CallFunc_GetWidget_ReturnValue_1) == 0x000098, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::CallFunc_GetWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0000A8, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, CallFunc_IsValid_ReturnValue_1) == 0x0000B0, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, CallFunc_GetCameraLocation_ReturnValue) == 0x0000B8, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000D0, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000E8, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component, CallFunc_IsValid_ReturnValue_2) == 0x0001E0, "Member 'WBP_Lobby_Username_Component_C_ExecuteUbergraph_WBP_Lobby_Username_Component::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_Lobby_Username_Component.WBP_Lobby_Username_Component_C.OnSceneEnter
// 0x0018 (0x0018 - 0x0000)
struct WBP_Lobby_Username_Component_C_OnSceneEnter final
{
public:
	struct FGameplayTag                           SceneTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGzSceneChangedEventData               EventData;                                         // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_Lobby_Username_Component_C_OnSceneEnter) == 0x000004, "Wrong alignment on WBP_Lobby_Username_Component_C_OnSceneEnter");
static_assert(sizeof(WBP_Lobby_Username_Component_C_OnSceneEnter) == 0x000018, "Wrong size on WBP_Lobby_Username_Component_C_OnSceneEnter");
static_assert(offsetof(WBP_Lobby_Username_Component_C_OnSceneEnter, SceneTag) == 0x000000, "Member 'WBP_Lobby_Username_Component_C_OnSceneEnter::SceneTag' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_OnSceneEnter, EventData) == 0x000008, "Member 'WBP_Lobby_Username_Component_C_OnSceneEnter::EventData' has a wrong offset!");

// Function WBP_Lobby_Username_Component.WBP_Lobby_Username_Component_C.OnSceneLeave
// 0x0018 (0x0018 - 0x0000)
struct WBP_Lobby_Username_Component_C_OnSceneLeave final
{
public:
	struct FGameplayTag                           SceneTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGzSceneChangedEventData               EventData;                                         // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_Lobby_Username_Component_C_OnSceneLeave) == 0x000004, "Wrong alignment on WBP_Lobby_Username_Component_C_OnSceneLeave");
static_assert(sizeof(WBP_Lobby_Username_Component_C_OnSceneLeave) == 0x000018, "Wrong size on WBP_Lobby_Username_Component_C_OnSceneLeave");
static_assert(offsetof(WBP_Lobby_Username_Component_C_OnSceneLeave, SceneTag) == 0x000000, "Member 'WBP_Lobby_Username_Component_C_OnSceneLeave::SceneTag' has a wrong offset!");
static_assert(offsetof(WBP_Lobby_Username_Component_C_OnSceneLeave, EventData) == 0x000008, "Member 'WBP_Lobby_Username_Component_C_OnSceneLeave::EventData' has a wrong offset!");

// Function WBP_Lobby_Username_Component.WBP_Lobby_Username_Component_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct WBP_Lobby_Username_Component_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Lobby_Username_Component_C_ReceiveTick) == 0x000004, "Wrong alignment on WBP_Lobby_Username_Component_C_ReceiveTick");
static_assert(sizeof(WBP_Lobby_Username_Component_C_ReceiveTick) == 0x000004, "Wrong size on WBP_Lobby_Username_Component_C_ReceiveTick");
static_assert(offsetof(WBP_Lobby_Username_Component_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'WBP_Lobby_Username_Component_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

