#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryBaseElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "G01_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventoryBaseElement.WBP_InventoryBaseElement_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_InventoryBaseElement_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AGzPlayerCharacter*                     PlayerCharacter;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGzInvComponent*                        InventoryComponent;                                // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzItemData*                            Item_Data;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_InventoryBaseElement(int32 EntryPoint);
	void OnInitSuccess();
	void OnInventoryChanged(EGzInvChangeEvent State, const struct FGzInvItem& Item);
	void OnItemUpdated(class UGzItemData* Param_Item_Data);
	void TryInitInventoryElement(bool* bInitSuccessful);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InventoryBaseElement_C">();
	}
	static class UWBP_InventoryBaseElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventoryBaseElement_C>();
	}
};
static_assert(alignof(UWBP_InventoryBaseElement_C) == 0x000008, "Wrong alignment on UWBP_InventoryBaseElement_C");
static_assert(sizeof(UWBP_InventoryBaseElement_C) == 0x000300, "Wrong size on UWBP_InventoryBaseElement_C");
static_assert(offsetof(UWBP_InventoryBaseElement_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_InventoryBaseElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryBaseElement_C, PlayerCharacter) == 0x0002E8, "Member 'UWBP_InventoryBaseElement_C::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryBaseElement_C, InventoryComponent) == 0x0002F0, "Member 'UWBP_InventoryBaseElement_C::InventoryComponent' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryBaseElement_C, Item_Data) == 0x0002F8, "Member 'UWBP_InventoryBaseElement_C::Item_Data' has a wrong offset!");

}

