#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OutsidePlayableAreaBG

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_OutsidePlayableAreaBG.WBP_OutsidePlayableAreaBG_C.CheckTimer
// 0x0001 (0x0001 - 0x0000)
struct WBP_OutsidePlayableAreaBG_C_CheckTimer final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaBG_C_CheckTimer) == 0x000001, "Wrong alignment on WBP_OutsidePlayableAreaBG_C_CheckTimer");
static_assert(sizeof(WBP_OutsidePlayableAreaBG_C_CheckTimer) == 0x000001, "Wrong size on WBP_OutsidePlayableAreaBG_C_CheckTimer");
static_assert(offsetof(WBP_OutsidePlayableAreaBG_C_CheckTimer, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'WBP_OutsidePlayableAreaBG_C_CheckTimer::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function WBP_OutsidePlayableAreaBG.WBP_OutsidePlayableAreaBG_C.ExecuteUbergraph_WBP_OutsidePlayableAreaBG
// 0x0030 (0x0030 - 0x0000)
struct WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D59[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_NewViewTarget;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     K2Node_DynamicCast_AsGz_Player_Character;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D5A[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bWasAdded)>               K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG) == 0x000008, "Wrong alignment on WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG");
static_assert(sizeof(WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG) == 0x000030, "Wrong size on WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG");
static_assert(offsetof(WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG, EntryPoint) == 0x000000, "Member 'WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG, K2Node_Event_NewViewTarget) == 0x000008, "Member 'WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG::K2Node_Event_NewViewTarget' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG, K2Node_DynamicCast_AsGz_Player_Character) == 0x000010, "Member 'WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG::K2Node_DynamicCast_AsGz_Player_Character' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_OutsidePlayableAreaBG_C_ExecuteUbergraph_WBP_OutsidePlayableAreaBG::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_OutsidePlayableAreaBG.WBP_OutsidePlayableAreaBG_C.On Tag Changed
// 0x0020 (0x0020 - 0x0000)
struct WBP_OutsidePlayableAreaBG_C_On_Tag_Changed final
{
public:
	bool                                          bWasAdded;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D5B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaBG_C_On_Tag_Changed) == 0x000008, "Wrong alignment on WBP_OutsidePlayableAreaBG_C_On_Tag_Changed");
static_assert(sizeof(WBP_OutsidePlayableAreaBG_C_On_Tag_Changed) == 0x000020, "Wrong size on WBP_OutsidePlayableAreaBG_C_On_Tag_Changed");
static_assert(offsetof(WBP_OutsidePlayableAreaBG_C_On_Tag_Changed, bWasAdded) == 0x000000, "Member 'WBP_OutsidePlayableAreaBG_C_On_Tag_Changed::bWasAdded' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaBG_C_On_Tag_Changed, CallFunc_GetEndTime_ReturnValue) == 0x000004, "Member 'WBP_OutsidePlayableAreaBG_C_On_Tag_Changed::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaBG_C_On_Tag_Changed, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_OutsidePlayableAreaBG_C_On_Tag_Changed::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaBG_C_On_Tag_Changed, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'WBP_OutsidePlayableAreaBG_C_On_Tag_Changed::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OutsidePlayableAreaBG_C_On_Tag_Changed, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WBP_OutsidePlayableAreaBG_C_On_Tag_Changed::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_OutsidePlayableAreaBG.WBP_OutsidePlayableAreaBG_C.ReceiveBindEvents
// 0x0008 (0x0008 - 0x0000)
struct WBP_OutsidePlayableAreaBG_C_ReceiveBindEvents final
{
public:
	class APawn*                                  NewViewTarget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OutsidePlayableAreaBG_C_ReceiveBindEvents) == 0x000008, "Wrong alignment on WBP_OutsidePlayableAreaBG_C_ReceiveBindEvents");
static_assert(sizeof(WBP_OutsidePlayableAreaBG_C_ReceiveBindEvents) == 0x000008, "Wrong size on WBP_OutsidePlayableAreaBG_C_ReceiveBindEvents");
static_assert(offsetof(WBP_OutsidePlayableAreaBG_C_ReceiveBindEvents, NewViewTarget) == 0x000000, "Member 'WBP_OutsidePlayableAreaBG_C_ReceiveBindEvents::NewViewTarget' has a wrong offset!");

}

