#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RespawnTimer_Screen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RespawnTimer_Screen.WBP_RespawnTimer_Screen_C
// 0x0018 (0x0540 - 0x0528)
class UWBP_RespawnTimer_Screen_C final : public UGzNavigationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URichTextBlock*                         RespawnTimer_RichText;                             // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        RespawnTime;                                       // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UpdateText(double Time);
	void Update();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_WBP_RespawnTimer_Screen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RespawnTimer_Screen_C">();
	}
	static class UWBP_RespawnTimer_Screen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RespawnTimer_Screen_C>();
	}
};
static_assert(alignof(UWBP_RespawnTimer_Screen_C) == 0x000008, "Wrong alignment on UWBP_RespawnTimer_Screen_C");
static_assert(sizeof(UWBP_RespawnTimer_Screen_C) == 0x000540, "Wrong size on UWBP_RespawnTimer_Screen_C");
static_assert(offsetof(UWBP_RespawnTimer_Screen_C, UberGraphFrame) == 0x000528, "Member 'UWBP_RespawnTimer_Screen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RespawnTimer_Screen_C, RespawnTimer_RichText) == 0x000530, "Member 'UWBP_RespawnTimer_Screen_C::RespawnTimer_RichText' has a wrong offset!");
static_assert(offsetof(UWBP_RespawnTimer_Screen_C, RespawnTime) == 0x000538, "Member 'UWBP_RespawnTimer_Screen_C::RespawnTime' has a wrong offset!");

}

