#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapMarker_Location_MortarTablet

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MapMarker_Location_MortarTablet.WBP_MapMarker_Location_MortarTablet_C.ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet
// 0x0038 (0x0038 - 0x0000)
struct WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67F5[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet) == 0x000008, "Wrong alignment on WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet");
static_assert(sizeof(WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet) == 0x000038, "Wrong size on WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet");
static_assert(offsetof(WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet, EntryPoint) == 0x000000, "Member 'WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000020, "Member 'WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000028, "Member 'WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_MapMarker_Location_MortarTablet_C_ExecuteUbergraph_WBP_MapMarker_Location_MortarTablet::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

