#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_XRCurrentZoneWidget

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_XRCurrentZoneWidget.WBP_XRCurrentZoneWidget_C.ExecuteUbergraph_WBP_XRCurrentZoneWidget
// 0x0060 (0x0060 - 0x0000)
struct WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C2E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetActiveStageTags_ReturnValue;           // 0x0008(0x0020)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C2F[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGzMultiStageGameState*                 K2Node_DynamicCast_AsGz_Multi_Stage_Game_State;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget) == 0x000008, "Wrong alignment on WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget");
static_assert(sizeof(WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget) == 0x000060, "Wrong size on WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget");
static_assert(offsetof(WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget, EntryPoint) == 0x000000, "Member 'WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget, CallFunc_GetActiveStageTags_ReturnValue) == 0x000008, "Member 'WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget::CallFunc_GetActiveStageTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget, CallFunc_HasTag_ReturnValue) == 0x000028, "Member 'WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget, CallFunc_GetGameState_ReturnValue) == 0x000038, "Member 'WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget, K2Node_DynamicCast_AsGz_Multi_Stage_Game_State) == 0x000050, "Member 'WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget::K2Node_DynamicCast_AsGz_Multi_Stage_Game_State' has a wrong offset!");
static_assert(offsetof(WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_XRCurrentZoneWidget_C_ExecuteUbergraph_WBP_XRCurrentZoneWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

