#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReportScreen

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "G01_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ReportScreen.WBP_ReportScreen_C.BndEvt__WBP_ReportScreen_Back_NavButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_Back_NavButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_Back_NavButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_Back_NavButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_Back_NavButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_Back_NavButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_Back_NavButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_Back_NavButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ReportScreen.WBP_ReportScreen_C.BndEvt__WBP_ReportScreen_ChangePlayer_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_ChangePlayer_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_ChangePlayer_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_ChangePlayer_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_ChangePlayer_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_ChangePlayer_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_ChangePlayer_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_ChangePlayer_NavButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ReportScreen.WBP_ReportScreen_C.BndEvt__WBP_ReportScreen_ConfirmReport_NavButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_ConfirmReport_NavButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_ConfirmReport_NavButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_ConfirmReport_NavButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_ConfirmReport_NavButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_ConfirmReport_NavButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_ConfirmReport_NavButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ReportScreen_C_BndEvt__WBP_ReportScreen_ConfirmReport_NavButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ReportScreen.WBP_ReportScreen_C.CanProceedToConfirm
// 0x0001 (0x0001 - 0x0000)
struct WBP_ReportScreen_C_CanProceedToConfirm final
{
public:
	bool                                          bChecked;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportScreen_C_CanProceedToConfirm) == 0x000001, "Wrong alignment on WBP_ReportScreen_C_CanProceedToConfirm");
static_assert(sizeof(WBP_ReportScreen_C_CanProceedToConfirm) == 0x000001, "Wrong size on WBP_ReportScreen_C_CanProceedToConfirm");
static_assert(offsetof(WBP_ReportScreen_C_CanProceedToConfirm, bChecked) == 0x000000, "Member 'WBP_ReportScreen_C_CanProceedToConfirm::bChecked' has a wrong offset!");

// Function WBP_ReportScreen.WBP_ReportScreen_C.CleanUpChildren
// 0x0002 (0x0002 - 0x0000)
struct WBP_ReportScreen_C_CleanUpChildren final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportScreen_C_CleanUpChildren) == 0x000001, "Wrong alignment on WBP_ReportScreen_C_CleanUpChildren");
static_assert(sizeof(WBP_ReportScreen_C_CleanUpChildren) == 0x000002, "Wrong size on WBP_ReportScreen_C_CleanUpChildren");
static_assert(offsetof(WBP_ReportScreen_C_CleanUpChildren, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_ReportScreen_C_CleanUpChildren::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_CleanUpChildren, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'WBP_ReportScreen_C_CleanUpChildren::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_ReportScreen.WBP_ReportScreen_C.CreateReportReasons
// 0x0040 (0x0040 - 0x0000)
struct WBP_ReportScreen_C_CreateReportReasons final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6811[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ReportOption_C*                    CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6812[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportScreen_C_CreateReportReasons) == 0x000008, "Wrong alignment on WBP_ReportScreen_C_CreateReportReasons");
static_assert(sizeof(WBP_ReportScreen_C_CreateReportReasons) == 0x000040, "Wrong size on WBP_ReportScreen_C_CreateReportReasons");
static_assert(offsetof(WBP_ReportScreen_C_CreateReportReasons, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_ReportScreen_C_CreateReportReasons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_CreateReportReasons, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_ReportScreen_C_CreateReportReasons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_CreateReportReasons, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_ReportScreen_C_CreateReportReasons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_CreateReportReasons, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_ReportScreen_C_CreateReportReasons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_CreateReportReasons, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_ReportScreen_C_CreateReportReasons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_CreateReportReasons, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_ReportScreen_C_CreateReportReasons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_CreateReportReasons, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'WBP_ReportScreen_C_CreateReportReasons::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_CreateReportReasons, CallFunc_Array_Add_ReturnValue_1) == 0x000024, "Member 'WBP_ReportScreen_C_CreateReportReasons::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_CreateReportReasons, CallFunc_Array_Add_ReturnValue_2) == 0x000028, "Member 'WBP_ReportScreen_C_CreateReportReasons::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_CreateReportReasons, CallFunc_Array_Add_ReturnValue_3) == 0x00002C, "Member 'WBP_ReportScreen_C_CreateReportReasons::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_CreateReportReasons, CallFunc_Array_Add_ReturnValue_4) == 0x000030, "Member 'WBP_ReportScreen_C_CreateReportReasons::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_CreateReportReasons, CallFunc_Array_Add_ReturnValue_5) == 0x000034, "Member 'WBP_ReportScreen_C_CreateReportReasons::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_CreateReportReasons, CallFunc_Array_Add_ReturnValue_6) == 0x000038, "Member 'WBP_ReportScreen_C_CreateReportReasons::CallFunc_Array_Add_ReturnValue_6' has a wrong offset!");

// Function WBP_ReportScreen.WBP_ReportScreen_C.DoCustomNavigation
// 0x0020 (0x0020 - 0x0000)
struct WBP_ReportScreen_C_DoCustomNavigation final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6813[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportScreen_C_DoCustomNavigation) == 0x000008, "Wrong alignment on WBP_ReportScreen_C_DoCustomNavigation");
static_assert(sizeof(WBP_ReportScreen_C_DoCustomNavigation) == 0x000020, "Wrong size on WBP_ReportScreen_C_DoCustomNavigation");
static_assert(offsetof(WBP_ReportScreen_C_DoCustomNavigation, Param_Navigation) == 0x000000, "Member 'WBP_ReportScreen_C_DoCustomNavigation::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_DoCustomNavigation, ReturnValue) == 0x000008, "Member 'WBP_ReportScreen_C_DoCustomNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_DoCustomNavigation, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'WBP_ReportScreen_C_DoCustomNavigation::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_DoCustomNavigation, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'WBP_ReportScreen_C_DoCustomNavigation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_DoCustomNavigation, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'WBP_ReportScreen_C_DoCustomNavigation::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_ReportScreen.WBP_ReportScreen_C.ExecuteUbergraph_WBP_ReportScreen
// 0x0230 (0x0230 - 0x0000)
struct WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6814[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0010(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6815[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6816[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1_0;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0078(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x00A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6817[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6818[0x2];                                     // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6819[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         K2Node_CustomEvent_PlayerState;                    // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EGzReportReason>                       CallFunc_GetReportReasons_Report_Reason;           // 0x0108(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681A[0x5];                                     // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ReportPlayer_C*                    CallFunc_Create_ReturnValue;                       // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ConfirmReport_C*                   CallFunc_Create_ReturnValue_1;                     // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bChecked;                       // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681B[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4;                              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ReportOption_C*                    CallFunc_Array_Get_Item;                           // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681C[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5;                              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681D[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681E[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681F[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0188(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x01B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5_0;                            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6820[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APawn* OldPawn, class APawn* NewPawn)> K2Node_CreateDelegate_OutputDelegate;              // 0x01D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6821[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_CustomEvent_OldPawn;                        // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_NewPawn;                        // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  K2Node_DynamicCast_AsBP_Player_Character;          // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6822[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APawn* OldPawn, class APawn* NewPawn)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0210(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue;            // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue_1;          // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen) == 0x000008, "Wrong alignment on WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen");
static_assert(sizeof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen) == 0x000230, "Wrong size on WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, EntryPoint) == 0x000000, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000010, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000030, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000034, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000038, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_object_Variable) == 0x000048, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_real_Variable) == 0x000050, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_real_Variable_0) == 0x000058, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_real_Variable_1) == 0x000060, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_bool_Variable) == 0x000068, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_real_Variable_1_0) == 0x000070, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000078, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000098, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00009C, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_EnhancedInputActionEvent_SourceAction) == 0x0000A0, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_object_Variable_1) == 0x0000A8, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0000B0, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_real_Variable_2) == 0x0000B8, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_real_Variable_3) == 0x0000C0, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_real_Variable_2_0) == 0x0000C8, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_real_Variable_3_0) == 0x0000D0, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_bool_Variable_1) == 0x0000D8, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_bool_True_if_break_was_hit_Variable) == 0x0000D9, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_int_Array_Index_Variable) == 0x0000DC, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_Not_PreBool_ReturnValue) == 0x0000E0, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_ComponentBoundEvent_Button_2) == 0x0000E8, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_ComponentBoundEvent_Button_1) == 0x0000F0, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_ComponentBoundEvent_Button) == 0x0000F8, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_CustomEvent_PlayerState) == 0x000100, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_GetReportReasons_Report_Reason) == 0x000108, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_GetReportReasons_Report_Reason' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000118, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_bool_Variable_2) == 0x000119, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_IsValid_ReturnValue) == 0x00011A, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_GetOwningPlayer_ReturnValue) == 0x000120, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_Create_ReturnValue) == 0x000128, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000130, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_Create_ReturnValue_1) == 0x000138, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_IsValid_ReturnValue_1) == 0x000140, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_BooleanOR_ReturnValue) == 0x000141, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_IsValid_ReturnValue_2) == 0x000142, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_CustomEvent_bChecked) == 0x000143, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_CustomEvent_bChecked' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_real_Variable_4) == 0x000148, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_Array_Get_Item) == 0x000150, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_Array_Length_ReturnValue) == 0x000158, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_real_Variable_5) == 0x000160, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_int_Loop_Counter_Variable) == 0x000168, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_object_Variable_2) == 0x000170, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000178, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_Add_IntInt_ReturnValue) == 0x00017C, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_BooleanAND_ReturnValue) == 0x000180, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x000188, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x0001A8, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x0001AC, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x0001B0, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0001B8, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_real_Variable_5_0) == 0x0001C0, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_real_Variable_5_0' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, Temp_real_Variable_4_0) == 0x0001C8, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::Temp_real_Variable_4_0' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_Conv_InputActionValueToBool_ReturnValue_2) == 0x0001D0, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_Conv_InputActionValueToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_CreateDelegate_OutputDelegate) == 0x0001D4, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_CustomEvent_OldPawn) == 0x0001E8, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_CustomEvent_OldPawn' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_CustomEvent_NewPawn) == 0x0001F0, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_CustomEvent_NewPawn' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_DynamicCast_AsBP_Player_Character) == 0x0001F8, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_DynamicCast_AsBP_Player_Character' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_DynamicCast_bSuccess) == 0x000200, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_GetOwningPlayer_ReturnValue_3) == 0x000208, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_GetOwningPlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x000210, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_GetNavigationRoot_ReturnValue) == 0x000220, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_GetNavigationRoot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen, CallFunc_GetNavigationRoot_ReturnValue_1) == 0x000228, "Member 'WBP_ReportScreen_C_ExecuteUbergraph_WBP_ReportScreen::CallFunc_GetNavigationRoot_ReturnValue_1' has a wrong offset!");

// Function WBP_ReportScreen.WBP_ReportScreen_C.GetReportReasons
// 0x0030 (0x0030 - 0x0000)
struct WBP_ReportScreen_C_GetReportReasons final
{
public:
	TArray<EGzReportReason>                       Param_Report_Reason;                               // 0x0000(0x0010)(Parm, OutParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ReportOption_C*                    CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6823[0x1];                                     // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportScreen_C_GetReportReasons) == 0x000008, "Wrong alignment on WBP_ReportScreen_C_GetReportReasons");
static_assert(sizeof(WBP_ReportScreen_C_GetReportReasons) == 0x000030, "Wrong size on WBP_ReportScreen_C_GetReportReasons");
static_assert(offsetof(WBP_ReportScreen_C_GetReportReasons, Param_Report_Reason) == 0x000000, "Member 'WBP_ReportScreen_C_GetReportReasons::Param_Report_Reason' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_GetReportReasons, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_ReportScreen_C_GetReportReasons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_GetReportReasons, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_ReportScreen_C_GetReportReasons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_GetReportReasons, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_ReportScreen_C_GetReportReasons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_GetReportReasons, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_ReportScreen_C_GetReportReasons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_GetReportReasons, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_ReportScreen_C_GetReportReasons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_GetReportReasons, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_ReportScreen_C_GetReportReasons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_GetReportReasons, CallFunc_Array_RemoveItem_ReturnValue) == 0x000029, "Member 'WBP_ReportScreen_C_GetReportReasons::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_GetReportReasons, CallFunc_Array_Contains_ReturnValue) == 0x00002A, "Member 'WBP_ReportScreen_C_GetReportReasons::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_GetReportReasons, CallFunc_Array_AddUnique_ReturnValue) == 0x00002C, "Member 'WBP_ReportScreen_C_GetReportReasons::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function WBP_ReportScreen.WBP_ReportScreen_C.InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_ReportScreen_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportScreen_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_ReportScreen_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_ReportScreen_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_ReportScreen_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_ReportScreen_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_ReportScreen_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_ReportScreen_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_ReportScreen_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_ReportScreen_C_InpActEvt_IA_UI_Back_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_ReportScreen.WBP_ReportScreen_C.InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_ReportScreen_C_InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportScreen_C_InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_ReportScreen_C_InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_ReportScreen_C_InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_ReportScreen_C_InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_ReportScreen_C_InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_ReportScreen_C_InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_ReportScreen_C_InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_ReportScreen_C_InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_ReportScreen_C_InpActEvt_IA_UI_ChangeReportingPlayer_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_ReportScreen.WBP_ReportScreen_C.InpActEvt_IA_UI_ConfirmReport_K2Node_EnhancedInputActionEvent_2
// 0x0030 (0x0030 - 0x0000)
struct WBP_ReportScreen_C_InpActEvt_IA_UI_ConfirmReport_K2Node_EnhancedInputActionEvent_2 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReportScreen_C_InpActEvt_IA_UI_ConfirmReport_K2Node_EnhancedInputActionEvent_2) == 0x000008, "Wrong alignment on WBP_ReportScreen_C_InpActEvt_IA_UI_ConfirmReport_K2Node_EnhancedInputActionEvent_2");
static_assert(sizeof(WBP_ReportScreen_C_InpActEvt_IA_UI_ConfirmReport_K2Node_EnhancedInputActionEvent_2) == 0x000030, "Wrong size on WBP_ReportScreen_C_InpActEvt_IA_UI_ConfirmReport_K2Node_EnhancedInputActionEvent_2");
static_assert(offsetof(WBP_ReportScreen_C_InpActEvt_IA_UI_ConfirmReport_K2Node_EnhancedInputActionEvent_2, ActionValue) == 0x000000, "Member 'WBP_ReportScreen_C_InpActEvt_IA_UI_ConfirmReport_K2Node_EnhancedInputActionEvent_2::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_InpActEvt_IA_UI_ConfirmReport_K2Node_EnhancedInputActionEvent_2, ElapsedTime) == 0x000020, "Member 'WBP_ReportScreen_C_InpActEvt_IA_UI_ConfirmReport_K2Node_EnhancedInputActionEvent_2::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ReportScreen_C_InpActEvt_IA_UI_ConfirmReport_K2Node_EnhancedInputActionEvent_2, TriggeredTime) == 0x000024, "Member 'WBP_ReportScreen_C_InpActEvt_IA_UI_ConfirmReport_K2Node_EnhancedInputActionEvent_2::TriggeredTime' has a wrong offset!");
