#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EventLogNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_EventLogTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EventLogNotification.WBP_EventLogNotification_C
// 0x00F8 (0x03D8 - 0x02E0)
class WBP_EventLogNotification::UWBP_EventLogNotification_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Action_Text;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Instigator_Text;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KillSource_Image;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Modifier1_Image;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Modifier2_Image;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Victim_Text;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScreenBackground_C*                WBP_ScreenBackground;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               WrongSizeFixer_SizeBox;                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        RemoveTimer;                                       // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            PlayerColor;                                       // 0x0338(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TeammateColor;                                     // 0x034C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DefaultColor;                                      // 0x0360(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_6D5C[0x4];                                     // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 MessageClass;                                      // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Instigator;                                        // 0x0380(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class AGzPlayerState*                         InstigatorPlayerState;                             // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Victim;                                            // 0x0398(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class AGzPlayerState*                         VictimPlayerState;                                 // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   ActionDescription;                                 // 0x03B0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UTexture2D*                             KillSourceTexture;                                 // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             Modifier1Texture;                                  // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             Modifier2Texture;                                  // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BuildEntry();
	void Construct();
	void ExecuteUbergraph_WBP_EventLogNotification(int32 EntryPoint);
	void Finished_6B9F16F0486C5FDA81A46B8628AF30AB();
	void RemoveEntry();
	void SetActionDescription();
	void SetIconTexture(class UTexture2D* Texture, class UImage* ImageElement, class USizeBox* SizeBox);
	void SetInstigatorText();
	void SetTextColour(class UTextBlock* TextElement, class AGzPlayerState* PlayerState);
	void SetVictimText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WidgetBlueprintGeneratedClass WBP_EventLogNotification.WBP_EventLogNotification_C", true, "WBP_EventLogNotification_C">();
	}
	static class WBP_EventLogNotification::UWBP_EventLogNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<WBP_EventLogNotification::UWBP_EventLogNotification_C>();
	}
};
static_assert(alignof(WBP_EventLogNotification::UWBP_EventLogNotification_C) == 0x000008, "Wrong alignment on WBP_EventLogNotification::UWBP_EventLogNotification_C");
static_assert(sizeof(WBP_EventLogNotification::UWBP_EventLogNotification_C) == 0x0003D8, "Wrong size on WBP_EventLogNotification::UWBP_EventLogNotification_C");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, UberGraphFrame) == 0x0002E0, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, FadeOut) == 0x0002E8, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::FadeOut' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, Action_Text) == 0x0002F0, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::Action_Text' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, Instigator_Text) == 0x0002F8, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::Instigator_Text' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, KillSource_Image) == 0x000300, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::KillSource_Image' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, Modifier1_Image) == 0x000308, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::Modifier1_Image' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, Modifier2_Image) == 0x000310, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::Modifier2_Image' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, Victim_Text) == 0x000318, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::Victim_Text' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, WBP_ScreenBackground) == 0x000320, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::WBP_ScreenBackground' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, WrongSizeFixer_SizeBox) == 0x000328, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::WrongSizeFixer_SizeBox' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, RemoveTimer) == 0x000330, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::RemoveTimer' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, PlayerColor) == 0x000338, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::PlayerColor' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, TeammateColor) == 0x00034C, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::TeammateColor' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, DefaultColor) == 0x000360, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::DefaultColor' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, MessageClass) == 0x000378, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::MessageClass' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, Instigator) == 0x000380, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::Instigator' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, InstigatorPlayerState) == 0x000390, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::InstigatorPlayerState' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, Victim) == 0x000398, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::Victim' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, VictimPlayerState) == 0x0003A8, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::VictimPlayerState' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, ActionDescription) == 0x0003B0, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::ActionDescription' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, KillSourceTexture) == 0x0003C0, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::KillSourceTexture' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, Modifier1Texture) == 0x0003C8, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::Modifier1Texture' has a wrong offset!");
static_assert(offsetof(WBP_EventLogNotification::UWBP_EventLogNotification_C, Modifier2Texture) == 0x0003D0, "Member 'WBP_EventLogNotification::UWBP_EventLogNotification_C::Modifier2Texture' has a wrong offset!");

}

