#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSelection_LoadoutV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoadoutSelection_LoadoutV2.WBP_LoadoutSelection_LoadoutV2_C
// 0x00A0 (0x1740 - 0x16A0)
class UWBP_LoadoutSelection_LoadoutV2_C final : public UGzLoadoutSelectionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x16A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         CurrencyCosts_HorizontalBox;                       // 0x16A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           CurrencyCosts_Text;                                // 0x16B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CurrencyIcon_Image;                                // 0x16B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_124;                                         // 0x16C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGzTextBlock*                           Loadout_Name_Text;                                 // 0x16C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RandomLoadout_Image;                               // 0x16D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TextColorBox;                                      // 0x16D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSelection_Loadout_GridView_Rarity_C* WBP_LoadoutSelection_Loadout_GridView;             // 0x16E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shared_Animated_Background_C*      WBP_Shared_Animated_Background;                    // 0x16E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            TextColorBlack;                                    // 0x16F0(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TextColorWhite;                                    // 0x1704(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UGzInvComponent*                        PlayerInventory;                                   // 0x1718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 RandomLoadoutName;                                 // 0x1720(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 LoadoutName;                                       // 0x1730(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void UpdateCurrencyBoxVisibility();
	void UpdateCostsText();
	void SetHotColors();
	void SetCommonColors();
	void Refresh();
	void OnUpdateInventory();
	void OnSelectedStateChanged(class UCommonButtonBase* Button, bool Selected);
	void OnInitialized_BP();
	void Load_Loadout();
	bool GetIsPreMatch();
	void ExecuteUbergraph_WBP_LoadoutSelection_LoadoutV2(int32 EntryPoint);
	void BP_OnUnhovered();
	void BP_OnSelected();
	void BP_OnHovered();
	void BP_OnDeselected();
	void BP_OnClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoadoutSelection_LoadoutV2_C">();
	}
	static class UWBP_LoadoutSelection_LoadoutV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoadoutSelection_LoadoutV2_C>();
	}
};
static_assert(alignof(UWBP_LoadoutSelection_LoadoutV2_C) == 0x000010, "Wrong alignment on UWBP_LoadoutSelection_LoadoutV2_C");
static_assert(sizeof(UWBP_LoadoutSelection_LoadoutV2_C) == 0x001740, "Wrong size on UWBP_LoadoutSelection_LoadoutV2_C");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, UberGraphFrame) == 0x0016A0, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, CurrencyCosts_HorizontalBox) == 0x0016A8, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::CurrencyCosts_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, CurrencyCosts_Text) == 0x0016B0, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::CurrencyCosts_Text' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, CurrencyIcon_Image) == 0x0016B8, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::CurrencyIcon_Image' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, Image_124) == 0x0016C0, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::Image_124' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, Loadout_Name_Text) == 0x0016C8, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::Loadout_Name_Text' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, RandomLoadout_Image) == 0x0016D0, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::RandomLoadout_Image' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, TextColorBox) == 0x0016D8, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::TextColorBox' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, WBP_LoadoutSelection_Loadout_GridView) == 0x0016E0, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::WBP_LoadoutSelection_Loadout_GridView' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, WBP_Shared_Animated_Background) == 0x0016E8, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::WBP_Shared_Animated_Background' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, TextColorBlack) == 0x0016F0, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::TextColorBlack' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, TextColorWhite) == 0x001704, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::TextColorWhite' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, PlayerInventory) == 0x001718, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::PlayerInventory' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, RandomLoadoutName) == 0x001720, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::RandomLoadoutName' has a wrong offset!");
static_assert(offsetof(UWBP_LoadoutSelection_LoadoutV2_C, LoadoutName) == 0x001730, "Member 'UWBP_LoadoutSelection_LoadoutV2_C::LoadoutName' has a wrong offset!");

}

