#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Inventory_BaseButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G01_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Inventory_BaseButton.WBP_Inventory_BaseButton_C
// 0x0020 (0x1650 - 0x1630)
class UWBP_Inventory_BaseButton_C final : public UGzCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Shared_Animated_Background_C*      WBP_Shared_Animated_Background;                    // 0x1638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         StyleID;                                           // 0x1640(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WBP_Inventory_BaseButton(int32 EntryPoint);
	void ForceHover();
	void ForceUnhover();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Inventory_BaseButton_C">();
	}
	static class UWBP_Inventory_BaseButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Inventory_BaseButton_C>();
	}
};
static_assert(alignof(UWBP_Inventory_BaseButton_C) == 0x000010, "Wrong alignment on UWBP_Inventory_BaseButton_C");
static_assert(sizeof(UWBP_Inventory_BaseButton_C) == 0x001650, "Wrong size on UWBP_Inventory_BaseButton_C");
static_assert(offsetof(UWBP_Inventory_BaseButton_C, UberGraphFrame) == 0x001630, "Member 'UWBP_Inventory_BaseButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_BaseButton_C, WBP_Shared_Animated_Background) == 0x001638, "Member 'UWBP_Inventory_BaseButton_C::WBP_Shared_Animated_Background' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_BaseButton_C, StyleID) == 0x001640, "Member 'UWBP_Inventory_BaseButton_C::StyleID' has a wrong offset!");

}

