#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClanTag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ClanTag.WBP_ClanTag_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_ClanTag_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGzTextBlock*                           ClanTag_GzTextBlock;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTag                           FontTag;                                           // 0x02F0(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerState*                         CachedPS;                                          // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ClanTag(int32 EntryPoint);
	void OnInitialized();
	void OnTagUpdated(class AGzPlayerState* PlayerState);
	void PreConstruct(bool IsDesignTime);
	void SetTag(class AGzPlayerState* InPlayerState);
	void SetTagText(const class FString& ClanTag, bool bLocalTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ClanTag_C">();
	}
	static class UWBP_ClanTag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ClanTag_C>();
	}
};
static_assert(alignof(UWBP_ClanTag_C) == 0x000008, "Wrong alignment on UWBP_ClanTag_C");
static_assert(sizeof(UWBP_ClanTag_C) == 0x000300, "Wrong size on UWBP_ClanTag_C");
static_assert(offsetof(UWBP_ClanTag_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ClanTag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ClanTag_C, ClanTag_GzTextBlock) == 0x0002E8, "Member 'UWBP_ClanTag_C::ClanTag_GzTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_ClanTag_C, FontTag) == 0x0002F0, "Member 'UWBP_ClanTag_C::FontTag' has a wrong offset!");
static_assert(offsetof(UWBP_ClanTag_C, CachedPS) == 0x0002F8, "Member 'UWBP_ClanTag_C::CachedPS' has a wrong offset!");

}

