#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainNotification_SecondaryTimerCount

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainNotification_SecondaryTimerCount.WBP_MainNotification_SecondaryTimerCount_C.CheckForHundreds
// 0x0014 (0x0014 - 0x0000)
struct WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38A6[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds) == 0x000004, "Wrong alignment on WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds");
static_assert(sizeof(WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds) == 0x000014, "Wrong size on WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds, Temp_byte_Variable) == 0x000000, "Member 'WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds, Temp_bool_Variable) == 0x000002, "Member 'WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds, CallFunc_FTrunc_ReturnValue) == 0x000004, "Member 'WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds, CallFunc_Divide_IntInt_ReturnValue) == 0x000008, "Member 'WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds, CallFunc_Percent_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds, K2Node_Select_Default) == 0x000011, "Member 'WBP_MainNotification_SecondaryTimerCount_C_CheckForHundreds::K2Node_Select_Default' has a wrong offset!");

// Function WBP_MainNotification_SecondaryTimerCount.WBP_MainNotification_SecondaryTimerCount_C.ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38A7[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38A8[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38A9[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_2;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_3;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_3;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38AA[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount");
static_assert(sizeof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount) == 0x0000C8, "Wrong size on WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, EntryPoint) == 0x000000, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_FTrunc_ReturnValue) == 0x000040, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_Divide_IntInt_ReturnValue) == 0x000044, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_FTrunc_ReturnValue_1) == 0x000048, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_Percent_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_Divide_IntInt_ReturnValue_1) == 0x000050, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000054, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000058, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000060, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000061, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_FMax_ReturnValue) == 0x000070, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000078, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000080, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_FTrunc_ReturnValue_2) == 0x000088, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_FTrunc_ReturnValue_3) == 0x00008C, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_Divide_IntInt_ReturnValue_2) == 0x000090, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_Divide_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_Divide_IntInt_ReturnValue_3) == 0x000094, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_Divide_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_Percent_IntInt_ReturnValue_2) == 0x000098, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_Percent_IntInt_ReturnValue_3) == 0x00009C, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_Percent_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0000A0, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0000A8, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x0000B0, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_FMax_ReturnValue_1) == 0x0000B8, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'WBP_MainNotification_SecondaryTimerCount_C_ExecuteUbergraph_WBP_MainNotification_SecondaryTimerCount::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_MainNotification_SecondaryTimerCount.WBP_MainNotification_SecondaryTimerCount_C.SetText
// 0x0080 (0x0080 - 0x0000)
struct WBP_MainNotification_SecondaryTimerCount_C_SetText final
{
public:
	class UGzTextBlock*                           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Text;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38AB[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
};
static_assert(alignof(WBP_MainNotification_SecondaryTimerCount_C_SetText) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryTimerCount_C_SetText");
static_assert(sizeof(WBP_MainNotification_SecondaryTimerCount_C_SetText) == 0x000080, "Wrong size on WBP_MainNotification_SecondaryTimerCount_C_SetText");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetText, Widget) == 0x000000, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetText::Widget' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetText, Text) == 0x000008, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetText::Text' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetText, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetText, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetText, CallFunc_Format_ReturnValue) == 0x000070, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_MainNotification_SecondaryTimerCount.WBP_MainNotification_SecondaryTimerCount_C.SetTime
// 0x0040 (0x0040 - 0x0000)
struct WBP_MainNotification_SecondaryTimerCount_C_SetTime final
{
public:
	double                                        Param_Time;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_PlayAnimation;                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_EnabledFirstShowFilter;                      // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38AC[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ServerTime;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38AD[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainNotification_SecondaryTimerCount_C_SetTime) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryTimerCount_C_SetTime");
static_assert(sizeof(WBP_MainNotification_SecondaryTimerCount_C_SetTime) == 0x000040, "Wrong size on WBP_MainNotification_SecondaryTimerCount_C_SetTime");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetTime, Param_Time) == 0x000000, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetTime::Param_Time' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetTime, Param_PlayAnimation) == 0x000008, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetTime::Param_PlayAnimation' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetTime, Param_EnabledFirstShowFilter) == 0x000009, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetTime::Param_EnabledFirstShowFilter' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetTime, ServerTime) == 0x000010, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetTime::ServerTime' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetTime, CallFunc_GetGameState_ReturnValue) == 0x000018, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetTime::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetTime, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetTime::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetTime, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000028, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetTime::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_SetTime, CallFunc_FMax_ReturnValue) == 0x000038, "Member 'WBP_MainNotification_SecondaryTimerCount_C_SetTime::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function WBP_MainNotification_SecondaryTimerCount.WBP_MainNotification_SecondaryTimerCount_C.UpdateNotificationData
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_MainNotification_SecondaryTimerCount_C_UpdateNotificationData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38AE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGzGameNotificationSpec                CallFunc_GetNotificationSpec_ReturnValue;          // 0x0008(0x00A0)(ConstParm)
	double                                        CallFunc_SetTime_Time_ImplicitCast;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainNotification_SecondaryTimerCount_C_UpdateNotificationData) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryTimerCount_C_UpdateNotificationData");
static_assert(sizeof(WBP_MainNotification_SecondaryTimerCount_C_UpdateNotificationData) == 0x0000B0, "Wrong size on WBP_MainNotification_SecondaryTimerCount_C_UpdateNotificationData");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_UpdateNotificationData, ReturnValue) == 0x000000, "Member 'WBP_MainNotification_SecondaryTimerCount_C_UpdateNotificationData::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_UpdateNotificationData, CallFunc_GetNotificationSpec_ReturnValue) == 0x000008, "Member 'WBP_MainNotification_SecondaryTimerCount_C_UpdateNotificationData::CallFunc_GetNotificationSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_UpdateNotificationData, CallFunc_SetTime_Time_ImplicitCast) == 0x0000A8, "Member 'WBP_MainNotification_SecondaryTimerCount_C_UpdateNotificationData::CallFunc_SetTime_Time_ImplicitCast' has a wrong offset!");

// Function WBP_MainNotification_SecondaryTimerCount.WBP_MainNotification_SecondaryTimerCount_C.UpdateNumbers
// 0x0050 (0x0050 - 0x0000)
struct WBP_MainNotification_SecondaryTimerCount_C_UpdateNumbers final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38AF[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_2;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_3;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_3;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_4;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_5;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainNotification_SecondaryTimerCount_C_UpdateNumbers) == 0x000008, "Wrong alignment on WBP_MainNotification_SecondaryTimerCount_C_UpdateNumbers");
static_assert(sizeof(WBP_MainNotification_SecondaryTimerCount_C_UpdateNumbers) == 0x000050, "Wrong size on WBP_MainNotification_SecondaryTimerCount_C_UpdateNumbers");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_UpdateNumbers, NewValue) == 0x000000, "Member 'WBP_MainNotification_SecondaryTimerCount_C_UpdateNumbers::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_MainNotification_SecondaryTimerCount_C_UpdateNumbers, CallFunc_Divide_IntInt_ReturnValue) == 0x000004, "Member 'WBP_MainNotification_SecondaryTimerCount_C_UpdateNumbers::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
