#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoiceChatStateWidget

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_VoiceChatStateWidget.WBP_VoiceChatStateWidget_C.ExecuteUbergraph_WBP_VoiceChatStateWidget
// 0x0158 (0x0158 - 0x0000)
struct WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6763[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6764[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_VoiceChatStateEntry_C*             CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGzVoiceChatTalker                     K2Node_MakeStruct_GzVoiceChatTalker;               // 0x0048(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FGzVoiceChatTalker                     K2Node_Event_NewTalker;                            // 0x0080(0x0038)(ConstParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FGzVoiceChatTalker                     CallFunc_Array_Get_Item;                           // 0x00B8(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6765[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_VoiceChatStateEntry_C*             K2Node_DynamicCast_AsWBP_Voice_Chat_State_Entry;   // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6766[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot;            // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6767[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot_1;          // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6768[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetSwitcher*                        K2Node_DynamicCast_AsWidget_Switcher;              // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6769[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetSwitcher*                        K2Node_DynamicCast_AsWidget_Switcher_1;            // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget) == 0x000008, "Wrong alignment on WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget");
static_assert(sizeof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget) == 0x000158, "Wrong size on WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, EntryPoint) == 0x000000, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_MakeStruct_Margin) == 0x000004, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_MakeStruct_Margin_1) == 0x000020, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_Event_IsDesignTime) == 0x000030, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, Temp_int_Variable) == 0x000034, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, CallFunc_Create_ReturnValue) == 0x000040, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_MakeStruct_GzVoiceChatTalker) == 0x000048, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_MakeStruct_GzVoiceChatTalker' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_Event_NewTalker) == 0x000080, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_Event_NewTalker' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_DynamicCast_AsWBP_Voice_Chat_State_Entry) == 0x0000F8, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_DynamicCast_AsWBP_Voice_Chat_State_Entry' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, CallFunc_AddChild_ReturnValue) == 0x000108, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_DynamicCast_AsVertical_Box_Slot) == 0x000110, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_DynamicCast_AsVertical_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, CallFunc_AddChild_ReturnValue_1) == 0x000120, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_DynamicCast_AsVertical_Box_Slot_1) == 0x000128, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_DynamicCast_AsVertical_Box_Slot_1' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_DynamicCast_bSuccess_2) == 0x000130, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_DynamicCast_AsWidget_Switcher) == 0x000138, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_DynamicCast_AsWidget_Switcher' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_DynamicCast_bSuccess_3) == 0x000140, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_DynamicCast_AsWidget_Switcher_1) == 0x000148, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_DynamicCast_AsWidget_Switcher_1' has a wrong offset!");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget, K2Node_DynamicCast_bSuccess_4) == 0x000150, "Member 'WBP_VoiceChatStateWidget_C_ExecuteUbergraph_WBP_VoiceChatStateWidget::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function WBP_VoiceChatStateWidget.WBP_VoiceChatStateWidget_C.OnTalkerAdded
// 0x0038 (0x0038 - 0x0000)
struct WBP_VoiceChatStateWidget_C_OnTalkerAdded final
{
public:
	struct FGzVoiceChatTalker                     NewTalker;                                         // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatStateWidget_C_OnTalkerAdded) == 0x000008, "Wrong alignment on WBP_VoiceChatStateWidget_C_OnTalkerAdded");
static_assert(sizeof(WBP_VoiceChatStateWidget_C_OnTalkerAdded) == 0x000038, "Wrong size on WBP_VoiceChatStateWidget_C_OnTalkerAdded");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_OnTalkerAdded, NewTalker) == 0x000000, "Member 'WBP_VoiceChatStateWidget_C_OnTalkerAdded::NewTalker' has a wrong offset!");

// Function WBP_VoiceChatStateWidget.WBP_VoiceChatStateWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_VoiceChatStateWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceChatStateWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_VoiceChatStateWidget_C_PreConstruct");
static_assert(sizeof(WBP_VoiceChatStateWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_VoiceChatStateWidget_C_PreConstruct");
static_assert(offsetof(WBP_VoiceChatStateWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_VoiceChatStateWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

