#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RedeploymentBackpack_Container

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_RedeploymentBackpack_Container.WBP_RedeploymentBackpack_Container_C.CreateWidget
// 0x0038 (0x0038 - 0x0000)
struct WBP_RedeploymentBackpack_Container_C_CreateWidget final
{
public:
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0000(0x0008)(NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_RedeploymentBackpack_C*            CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Show_Successful;                          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RedeploymentBackpack_Container_C_CreateWidget) == 0x000008, "Wrong alignment on WBP_RedeploymentBackpack_Container_C_CreateWidget");
static_assert(sizeof(WBP_RedeploymentBackpack_Container_C_CreateWidget) == 0x000038, "Wrong size on WBP_RedeploymentBackpack_Container_C_CreateWidget");
static_assert(offsetof(WBP_RedeploymentBackpack_Container_C_CreateWidget, K2Node_MakeStruct_SlateChildSize) == 0x000000, "Member 'WBP_RedeploymentBackpack_Container_C_CreateWidget::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_Container_C_CreateWidget, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000008, "Member 'WBP_RedeploymentBackpack_Container_C_CreateWidget::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_Container_C_CreateWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_RedeploymentBackpack_Container_C_CreateWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_Container_C_CreateWidget, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'WBP_RedeploymentBackpack_Container_C_CreateWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_Container_C_CreateWidget, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_RedeploymentBackpack_Container_C_CreateWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_Container_C_CreateWidget, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_RedeploymentBackpack_Container_C_CreateWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RedeploymentBackpack_Container_C_CreateWidget, CallFunc_Show_Successful) == 0x000031, "Member 'WBP_RedeploymentBackpack_Container_C_CreateWidget::CallFunc_Show_Successful' has a wrong offset!");

// Function WBP_RedeploymentBackpack_Container.WBP_RedeploymentBackpack_Container_C.ExecuteUbergraph_WBP_RedeploymentBackpack_Container
// 0x0004 (0x0004 - 0x0000)
struct WBP_RedeploymentBackpack_Container_C_ExecuteUbergraph_WBP_RedeploymentBackpack_Container final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RedeploymentBackpack_Container_C_ExecuteUbergraph_WBP_RedeploymentBackpack_Container) == 0x000004, "Wrong alignment on WBP_RedeploymentBackpack_Container_C_ExecuteUbergraph_WBP_RedeploymentBackpack_Container");
static_assert(sizeof(WBP_RedeploymentBackpack_Container_C_ExecuteUbergraph_WBP_RedeploymentBackpack_Container) == 0x000004, "Wrong size on WBP_RedeploymentBackpack_Container_C_ExecuteUbergraph_WBP_RedeploymentBackpack_Container");
static_assert(offsetof(WBP_RedeploymentBackpack_Container_C_ExecuteUbergraph_WBP_RedeploymentBackpack_Container, EntryPoint) == 0x000000, "Member 'WBP_RedeploymentBackpack_Container_C_ExecuteUbergraph_WBP_RedeploymentBackpack_Container::EntryPoint' has a wrong offset!");

// Function WBP_RedeploymentBackpack_Container.WBP_RedeploymentBackpack_Container_C.HideWidget
// 0x0001 (0x0001 - 0x0000)
struct WBP_RedeploymentBackpack_Container_C_HideWidget final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RedeploymentBackpack_Container_C_HideWidget) == 0x000001, "Wrong alignment on WBP_RedeploymentBackpack_Container_C_HideWidget");
static_assert(sizeof(WBP_RedeploymentBackpack_Container_C_HideWidget) == 0x000001, "Wrong size on WBP_RedeploymentBackpack_Container_C_HideWidget");
static_assert(offsetof(WBP_RedeploymentBackpack_Container_C_HideWidget, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_RedeploymentBackpack_Container_C_HideWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

