#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutSelectionScreen_SharedContainer

#include "Basic.hpp"

#include "G01_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoadoutSelectionScreen_SharedContainer.WBP_LoadoutSelectionScreen_SharedContainer_C.OnSharedLoadoutSelectionEnded__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct WBP_LoadoutSelectionScreen_SharedContainer_C_OnSharedLoadoutSelectionEnded__DelegateSignature final
{
public:
	bool                                          IsSuccessfull;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E90[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGzPlayerController*                    Controller;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Guid;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGzPlayerCharacter*                     Character;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelectionScreen_SharedContainer_C_OnSharedLoadoutSelectionEnded__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoadoutSelectionScreen_SharedContainer_C_OnSharedLoadoutSelectionEnded__DelegateSignature");
static_assert(sizeof(WBP_LoadoutSelectionScreen_SharedContainer_C_OnSharedLoadoutSelectionEnded__DelegateSignature) == 0x000028, "Wrong size on WBP_LoadoutSelectionScreen_SharedContainer_C_OnSharedLoadoutSelectionEnded__DelegateSignature");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_OnSharedLoadoutSelectionEnded__DelegateSignature, IsSuccessfull) == 0x000000, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_OnSharedLoadoutSelectionEnded__DelegateSignature::IsSuccessfull' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_OnSharedLoadoutSelectionEnded__DelegateSignature, Controller) == 0x000008, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_OnSharedLoadoutSelectionEnded__DelegateSignature::Controller' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_OnSharedLoadoutSelectionEnded__DelegateSignature, Guid) == 0x000010, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_OnSharedLoadoutSelectionEnded__DelegateSignature::Guid' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_OnSharedLoadoutSelectionEnded__DelegateSignature, Character) == 0x000020, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_OnSharedLoadoutSelectionEnded__DelegateSignature::Character' has a wrong offset!");

// Function WBP_LoadoutSelectionScreen_SharedContainer.WBP_LoadoutSelectionScreen_SharedContainer_C.OnEndedSelection_Event
// 0x0080 (0x0080 - 0x0000)
struct WBP_LoadoutSelectionScreen_SharedContainer_C_OnEndedSelection_Event final
{
public:
	bool                                          bSuccessfull;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E91[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AGzPlayerController*              Controller;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGzLoadoutDataConfig                   CompledWithGuid;                                   // 0x0010(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_LoadoutSelectionScreen_SharedContainer_C_OnEndedSelection_Event) == 0x000008, "Wrong alignment on WBP_LoadoutSelectionScreen_SharedContainer_C_OnEndedSelection_Event");
static_assert(sizeof(WBP_LoadoutSelectionScreen_SharedContainer_C_OnEndedSelection_Event) == 0x000080, "Wrong size on WBP_LoadoutSelectionScreen_SharedContainer_C_OnEndedSelection_Event");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_OnEndedSelection_Event, bSuccessfull) == 0x000000, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_OnEndedSelection_Event::bSuccessfull' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_OnEndedSelection_Event, Controller) == 0x000008, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_OnEndedSelection_Event::Controller' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_OnEndedSelection_Event, CompledWithGuid) == 0x000010, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_OnEndedSelection_Event::CompledWithGuid' has a wrong offset!");

// Function WBP_LoadoutSelectionScreen_SharedContainer.WBP_LoadoutSelectionScreen_SharedContainer_C.ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccessfull;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E92[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class AGzPlayerController*              K2Node_CustomEvent_Controller;                     // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGzLoadoutDataConfig                   K2Node_CustomEvent_CompledWithGuid;                // 0x0010(0x0070)(ConstParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccessfull, class AGzPlayerController* Controller, struct FGzLoadoutDataConfig& CompledWithGuid)> K2Node_CreateDelegate_OutputDelegate;              // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccessfull, class AGzPlayerController* Controller, struct FGzLoadoutDataConfig& CompledWithGuid)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer) == 0x000008, "Wrong alignment on WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer");
static_assert(sizeof(WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer) == 0x0000B0, "Wrong size on WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer, EntryPoint) == 0x000000, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer, K2Node_CustomEvent_bSuccessfull) == 0x000004, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer::K2Node_CustomEvent_bSuccessfull' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer, K2Node_CustomEvent_Controller) == 0x000008, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer::K2Node_CustomEvent_Controller' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer, K2Node_CustomEvent_CompledWithGuid) == 0x000010, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer::K2Node_CustomEvent_CompledWithGuid' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer, CallFunc_Array_Add_ReturnValue_1) == 0x000084, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer, CallFunc_Array_Add_ReturnValue_2) == 0x000088, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'WBP_LoadoutSelectionScreen_SharedContainer_C_ExecuteUbergraph_WBP_LoadoutSelectionScreen_SharedContainer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

}

