#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MortarLegs_MapScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_MortarLegs_MapScreen.WBP_MortarLegs_MapScreen_C.CreateMapController
// 0x0020 (0x0020 - 0x0000)
struct WBP_MortarLegs_MapScreen_C_CreateMapController final
{
public:
	class UGzMortarLegs_MapScreenController*      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_MortarLegsMapController_C*          CallFunc_CreateControllerForMap_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MortarLegs_MapScreen_C_CreateMapController) == 0x000008, "Wrong alignment on WBP_MortarLegs_MapScreen_C_CreateMapController");
static_assert(sizeof(WBP_MortarLegs_MapScreen_C_CreateMapController) == 0x000020, "Wrong size on WBP_MortarLegs_MapScreen_C_CreateMapController");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_CreateMapController, ReturnValue) == 0x000000, "Member 'WBP_MortarLegs_MapScreen_C_CreateMapController::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_CreateMapController, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_MortarLegs_MapScreen_C_CreateMapController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_CreateMapController, CallFunc_CreateControllerForMap_ReturnValue) == 0x000018, "Member 'WBP_MortarLegs_MapScreen_C_CreateMapController::CallFunc_CreateControllerForMap_ReturnValue' has a wrong offset!");

// Function WBP_MortarLegs_MapScreen.WBP_MortarLegs_MapScreen_C.ExecuteUbergraph_WBP_MortarLegs_MapScreen
// 0x0190 (0x0190 - 0x0000)
struct WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F03[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F04[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F05[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F06[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0110(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F07[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue;            // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGzNavigationRoot*                      CallFunc_GetNavigationRoot_ReturnValue_1;          // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MortarLegs_MapCursor_C*            K2Node_DynamicCast_AsWBP_Mortar_Legs_Map_Cursor;   // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F08[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F09[0x5];                                     // 0x017B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateRetainerBox_DeltaTime_ImplicitCast; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen) == 0x000008, "Wrong alignment on WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen");
static_assert(sizeof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen) == 0x000190, "Wrong size on WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, EntryPoint) == 0x000000, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, Temp_byte_Variable) == 0x000004, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, Temp_bool_Variable) == 0x000028, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, Temp_byte_Variable_1) == 0x000038, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, Temp_byte_Variable_2) == 0x000039, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, Temp_byte_Variable_3) == 0x00003A, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_bBlockingHit) == 0x00003B, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_bInitialOverlap) == 0x00003C, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_Time) == 0x000040, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_Distance) == 0x000044, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_Location) == 0x000048, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_ImpactPoint) == 0x000060, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_Normal) == 0x000078, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_ImpactNormal) == 0x000090, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_PhysMat) == 0x0000A8, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_HitActor) == 0x0000B0, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_HitComponent) == 0x0000B8, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_HitBoneName) == 0x0000C0, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_BoneName) == 0x0000C8, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_HitItem) == 0x0000D0, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_ElementIndex) == 0x0000D4, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_FaceIndex) == 0x0000D8, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_TraceStart) == 0x0000E0, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_BreakHitResult_TraceEnd) == 0x0000F8, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, K2Node_Event_MyGeometry) == 0x000110, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, K2Node_Event_InDeltaTime) == 0x000148, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_GetNavigationRoot_ReturnValue) == 0x000150, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_GetNavigationRoot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_GetNavigationRoot_ReturnValue_1) == 0x000158, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_GetNavigationRoot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, K2Node_DynamicCast_AsWBP_Mortar_Legs_Map_Cursor) == 0x000160, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::K2Node_DynamicCast_AsWBP_Mortar_Legs_Map_Cursor' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_GetOwningPlayer_ReturnValue) == 0x000170, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, K2Node_Select_Default) == 0x000178, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, Temp_bool_Variable_1) == 0x000179, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, K2Node_Select_Default_1) == 0x00017A, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_GetEffectMaterial_ReturnValue) == 0x000180, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen, CallFunc_UpdateRetainerBox_DeltaTime_ImplicitCast) == 0x000188, "Member 'WBP_MortarLegs_MapScreen_C_ExecuteUbergraph_WBP_MortarLegs_MapScreen::CallFunc_UpdateRetainerBox_DeltaTime_ImplicitCast' has a wrong offset!");

// Function WBP_MortarLegs_MapScreen.WBP_MortarLegs_MapScreen_C.InitRadar
// 0x0020 (0x0020 - 0x0000)
struct WBP_MortarLegs_MapScreen_C_InitRadar final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F0A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MortarLegs_MapScreen_C_InitRadar) == 0x000008, "Wrong alignment on WBP_MortarLegs_MapScreen_C_InitRadar");
static_assert(sizeof(WBP_MortarLegs_MapScreen_C_InitRadar) == 0x000020, "Wrong size on WBP_MortarLegs_MapScreen_C_InitRadar");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_InitRadar, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_MortarLegs_MapScreen_C_InitRadar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_InitRadar, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_MortarLegs_MapScreen_C_InitRadar::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_InitRadar, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000010, "Member 'WBP_MortarLegs_MapScreen_C_InitRadar::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_InitRadar, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_MortarLegs_MapScreen_C_InitRadar::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_MortarLegs_MapScreen.WBP_MortarLegs_MapScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_MortarLegs_MapScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MortarLegs_MapScreen_C_Tick) == 0x000004, "Wrong alignment on WBP_MortarLegs_MapScreen_C_Tick");
static_assert(sizeof(WBP_MortarLegs_MapScreen_C_Tick) == 0x00003C, "Wrong size on WBP_MortarLegs_MapScreen_C_Tick");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_MortarLegs_MapScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_MortarLegs_MapScreen_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_MortarLegs_MapScreen.WBP_MortarLegs_MapScreen_C.UpdateAngleSlider
// 0x0018 (0x0018 - 0x0000)
struct WBP_MortarLegs_MapScreen_C_UpdateAngleSlider final
{
public:
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MortarLegs_MapScreen_C_UpdateAngleSlider) == 0x000008, "Wrong alignment on WBP_MortarLegs_MapScreen_C_UpdateAngleSlider");
static_assert(sizeof(WBP_MortarLegs_MapScreen_C_UpdateAngleSlider) == 0x000018, "Wrong size on WBP_MortarLegs_MapScreen_C_UpdateAngleSlider");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_UpdateAngleSlider, CallFunc_SafeDivide_ReturnValue) == 0x000000, "Member 'WBP_MortarLegs_MapScreen_C_UpdateAngleSlider::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_UpdateAngleSlider, CallFunc_SafeDivide_A_ImplicitCast) == 0x000008, "Member 'WBP_MortarLegs_MapScreen_C_UpdateAngleSlider::CallFunc_SafeDivide_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_UpdateAngleSlider, CallFunc_SetValue_InValue_ImplicitCast) == 0x000010, "Member 'WBP_MortarLegs_MapScreen_C_UpdateAngleSlider::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");

// Function WBP_MortarLegs_MapScreen.WBP_MortarLegs_MapScreen_C.UpdateDistanceSlider
// 0x0028 (0x0028 - 0x0000)
struct WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider final
{
public:
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider) == 0x000008, "Wrong alignment on WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider");
static_assert(sizeof(WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider) == 0x000028, "Wrong size on WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000000, "Member 'WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000008, "Member 'WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider, CallFunc_SafeDivide_ReturnValue) == 0x000010, "Member 'WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider, CallFunc_SetValue_InValue_ImplicitCast) == 0x000020, "Member 'WBP_MortarLegs_MapScreen_C_UpdateDistanceSlider::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");

// Function WBP_MortarLegs_MapScreen.WBP_MortarLegs_MapScreen_C.UpdateRetainerBox
// 0x0040 (0x0040 - 0x0000)
struct WBP_MortarLegs_MapScreen_C_UpdateRetainerBox final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaterialMagicNumber;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F0B[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MortarLegs_MapScreen_C_UpdateRetainerBox) == 0x000008, "Wrong alignment on WBP_MortarLegs_MapScreen_C_UpdateRetainerBox");
static_assert(sizeof(WBP_MortarLegs_MapScreen_C_UpdateRetainerBox) == 0x000040, "Wrong size on WBP_MortarLegs_MapScreen_C_UpdateRetainerBox");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_UpdateRetainerBox, DeltaTime) == 0x000000, "Member 'WBP_MortarLegs_MapScreen_C_UpdateRetainerBox::DeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_MortarLegs_MapScreen_C_UpdateRetainerBox, MaterialMagicNumber) == 0x000008, "Member 'WBP_MortarLegs_MapScreen_C_UpdateRetainerBox::MaterialMagicNumber' has a wrong offset!");
