#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XsollaStore

#include "Basic.hpp"

#include "XsollaStore_structs.hpp"
#include "XsollaUtils_structs.hpp"
#include "XsollaSettings_structs.hpp"


namespace SDK::Params
{

// Function XsollaStore.XsollaStoreBrowserWrapper.ExecuteBrowserClosed
// 0x0001 (0x0001 - 0x0000)
struct XsollaStoreBrowserWrapper_ExecuteBrowserClosed final
{
public:
	bool                                          bIsManually;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreBrowserWrapper_ExecuteBrowserClosed) == 0x000001, "Wrong alignment on XsollaStoreBrowserWrapper_ExecuteBrowserClosed");
static_assert(sizeof(XsollaStoreBrowserWrapper_ExecuteBrowserClosed) == 0x000001, "Wrong size on XsollaStoreBrowserWrapper_ExecuteBrowserClosed");
static_assert(offsetof(XsollaStoreBrowserWrapper_ExecuteBrowserClosed, bIsManually) == 0x000000, "Member 'XsollaStoreBrowserWrapper_ExecuteBrowserClosed::bIsManually' has a wrong offset!");

// Function XsollaStore.XsollaStoreBrowserWrapper.LoadUrl
// 0x0010 (0x0010 - 0x0000)
struct XsollaStoreBrowserWrapper_LoadUrl final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreBrowserWrapper_LoadUrl) == 0x000008, "Wrong alignment on XsollaStoreBrowserWrapper_LoadUrl");
static_assert(sizeof(XsollaStoreBrowserWrapper_LoadUrl) == 0x000010, "Wrong size on XsollaStoreBrowserWrapper_LoadUrl");
static_assert(offsetof(XsollaStoreBrowserWrapper_LoadUrl, URL) == 0x000000, "Member 'XsollaStoreBrowserWrapper_LoadUrl::URL' has a wrong offset!");

// Function XsollaStore.XsollaStoreLibrary.Equal_StoreCartStoreCart
// 0x00B8 (0x00B8 - 0x0000)
struct XsollaStoreLibrary_Equal_StoreCartStoreCart final
{
public:
	struct FStoreCart                             A;                                                 // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FStoreCart                             B;                                                 // 0x0058(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_286D[0x7];                                     // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(XsollaStoreLibrary_Equal_StoreCartStoreCart) == 0x000008, "Wrong alignment on XsollaStoreLibrary_Equal_StoreCartStoreCart");
static_assert(sizeof(XsollaStoreLibrary_Equal_StoreCartStoreCart) == 0x0000B8, "Wrong size on XsollaStoreLibrary_Equal_StoreCartStoreCart");
static_assert(offsetof(XsollaStoreLibrary_Equal_StoreCartStoreCart, A) == 0x000000, "Member 'XsollaStoreLibrary_Equal_StoreCartStoreCart::A' has a wrong offset!");
static_assert(offsetof(XsollaStoreLibrary_Equal_StoreCartStoreCart, B) == 0x000058, "Member 'XsollaStoreLibrary_Equal_StoreCartStoreCart::B' has a wrong offset!");
static_assert(offsetof(XsollaStoreLibrary_Equal_StoreCartStoreCart, ReturnValue) == 0x0000B0, "Member 'XsollaStoreLibrary_Equal_StoreCartStoreCart::ReturnValue' has a wrong offset!");

// Function XsollaStore.XsollaStoreLibrary.FormatPrice
// 0x0028 (0x0028 - 0x0000)
struct XsollaStoreLibrary_FormatPrice final
{
public:
	float                                         Amount;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_286E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Currency;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreLibrary_FormatPrice) == 0x000008, "Wrong alignment on XsollaStoreLibrary_FormatPrice");
static_assert(sizeof(XsollaStoreLibrary_FormatPrice) == 0x000028, "Wrong size on XsollaStoreLibrary_FormatPrice");
static_assert(offsetof(XsollaStoreLibrary_FormatPrice, Amount) == 0x000000, "Member 'XsollaStoreLibrary_FormatPrice::Amount' has a wrong offset!");
static_assert(offsetof(XsollaStoreLibrary_FormatPrice, Currency) == 0x000008, "Member 'XsollaStoreLibrary_FormatPrice::Currency' has a wrong offset!");
static_assert(offsetof(XsollaStoreLibrary_FormatPrice, ReturnValue) == 0x000018, "Member 'XsollaStoreLibrary_FormatPrice::ReturnValue' has a wrong offset!");

// Function XsollaStore.XsollaStoreLibrary.GetCurrencyLibrary
// 0x0008 (0x0008 - 0x0000)
struct XsollaStoreLibrary_GetCurrencyLibrary final
{
public:
	class UDataTable*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreLibrary_GetCurrencyLibrary) == 0x000008, "Wrong alignment on XsollaStoreLibrary_GetCurrencyLibrary");
static_assert(sizeof(XsollaStoreLibrary_GetCurrencyLibrary) == 0x000008, "Wrong size on XsollaStoreLibrary_GetCurrencyLibrary");
static_assert(offsetof(XsollaStoreLibrary_GetCurrencyLibrary, ReturnValue) == 0x000000, "Member 'XsollaStoreLibrary_GetCurrencyLibrary::ReturnValue' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.AddToCart
// 0x0058 (0x0058 - 0x0000)
struct XsollaStoreSubsystem_AddToCart final
{
public:
	class FString                                 AuthToken;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemSKU;                                           // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             SuccessCallback;                                   // 0x0034(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0044(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2873[0x4];                                     // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(XsollaStoreSubsystem_AddToCart) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_AddToCart");
static_assert(sizeof(XsollaStoreSubsystem_AddToCart) == 0x000058, "Wrong size on XsollaStoreSubsystem_AddToCart");
static_assert(offsetof(XsollaStoreSubsystem_AddToCart, AuthToken) == 0x000000, "Member 'XsollaStoreSubsystem_AddToCart::AuthToken' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_AddToCart, CartId) == 0x000010, "Member 'XsollaStoreSubsystem_AddToCart::CartId' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_AddToCart, ItemSKU) == 0x000020, "Member 'XsollaStoreSubsystem_AddToCart::ItemSKU' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_AddToCart, Quantity) == 0x000030, "Member 'XsollaStoreSubsystem_AddToCart::Quantity' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_AddToCart, SuccessCallback) == 0x000034, "Member 'XsollaStoreSubsystem_AddToCart::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_AddToCart, ErrorCallback) == 0x000044, "Member 'XsollaStoreSubsystem_AddToCart::ErrorCallback' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.BuyItemWithVirtualCurrency
// 0x0058 (0x0058 - 0x0000)
struct XsollaStoreSubsystem_BuyItemWithVirtualCurrency final
{
public:
	class FString                                 AuthToken;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemSKU;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrencySKU;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EXsollaPublishingPlatform                     Platform;                                          // 0x0030(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2874[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 OrderId)>                SuccessCallback;                                   // 0x0034(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0044(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2875[0x4];                                     // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(XsollaStoreSubsystem_BuyItemWithVirtualCurrency) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_BuyItemWithVirtualCurrency");
static_assert(sizeof(XsollaStoreSubsystem_BuyItemWithVirtualCurrency) == 0x000058, "Wrong size on XsollaStoreSubsystem_BuyItemWithVirtualCurrency");
static_assert(offsetof(XsollaStoreSubsystem_BuyItemWithVirtualCurrency, AuthToken) == 0x000000, "Member 'XsollaStoreSubsystem_BuyItemWithVirtualCurrency::AuthToken' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_BuyItemWithVirtualCurrency, ItemSKU) == 0x000010, "Member 'XsollaStoreSubsystem_BuyItemWithVirtualCurrency::ItemSKU' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_BuyItemWithVirtualCurrency, CurrencySKU) == 0x000020, "Member 'XsollaStoreSubsystem_BuyItemWithVirtualCurrency::CurrencySKU' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_BuyItemWithVirtualCurrency, Platform) == 0x000030, "Member 'XsollaStoreSubsystem_BuyItemWithVirtualCurrency::Platform' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_BuyItemWithVirtualCurrency, SuccessCallback) == 0x000034, "Member 'XsollaStoreSubsystem_BuyItemWithVirtualCurrency::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_BuyItemWithVirtualCurrency, ErrorCallback) == 0x000044, "Member 'XsollaStoreSubsystem_BuyItemWithVirtualCurrency::ErrorCallback' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.BuyVirtualOrFreeItemCallback
// 0x0004 (0x0004 - 0x0000)
struct XsollaStoreSubsystem_BuyVirtualOrFreeItemCallback final
{
public:
	int32                                         InOrderId;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreSubsystem_BuyVirtualOrFreeItemCallback) == 0x000004, "Wrong alignment on XsollaStoreSubsystem_BuyVirtualOrFreeItemCallback");
static_assert(sizeof(XsollaStoreSubsystem_BuyVirtualOrFreeItemCallback) == 0x000004, "Wrong size on XsollaStoreSubsystem_BuyVirtualOrFreeItemCallback");
static_assert(offsetof(XsollaStoreSubsystem_BuyVirtualOrFreeItemCallback, InOrderId) == 0x000000, "Member 'XsollaStoreSubsystem_BuyVirtualOrFreeItemCallback::InOrderId' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.CancelSubscription
// 0x0038 (0x0038 - 0x0000)
struct XsollaStoreSubsystem_CancelSubscription final
{
public:
	class FString                                 AuthToken;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubscriptionId;                                    // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             SuccessCallback;                                   // 0x0014(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0024(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2876[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(XsollaStoreSubsystem_CancelSubscription) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_CancelSubscription");
static_assert(sizeof(XsollaStoreSubsystem_CancelSubscription) == 0x000038, "Wrong size on XsollaStoreSubsystem_CancelSubscription");
static_assert(offsetof(XsollaStoreSubsystem_CancelSubscription, AuthToken) == 0x000000, "Member 'XsollaStoreSubsystem_CancelSubscription::AuthToken' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CancelSubscription, SubscriptionId) == 0x000010, "Member 'XsollaStoreSubsystem_CancelSubscription::SubscriptionId' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CancelSubscription, SuccessCallback) == 0x000014, "Member 'XsollaStoreSubsystem_CancelSubscription::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CancelSubscription, ErrorCallback) == 0x000024, "Member 'XsollaStoreSubsystem_CancelSubscription::ErrorCallback' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.CheckOrder
// 0x0038 (0x0038 - 0x0000)
struct XsollaStoreSubsystem_CheckOrder final
{
public:
	class FString                                 AuthToken;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OrderId;                                           // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 OrderId, EXsollaOrderStatus OrderStatus, const struct FXsollaOrderContent& OrderContent)> SuccessCallback;                                   // 0x0014(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0024(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2877[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(XsollaStoreSubsystem_CheckOrder) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_CheckOrder");
static_assert(sizeof(XsollaStoreSubsystem_CheckOrder) == 0x000038, "Wrong size on XsollaStoreSubsystem_CheckOrder");
static_assert(offsetof(XsollaStoreSubsystem_CheckOrder, AuthToken) == 0x000000, "Member 'XsollaStoreSubsystem_CheckOrder::AuthToken' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CheckOrder, OrderId) == 0x000010, "Member 'XsollaStoreSubsystem_CheckOrder::OrderId' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CheckOrder, SuccessCallback) == 0x000014, "Member 'XsollaStoreSubsystem_CheckOrder::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CheckOrder, ErrorCallback) == 0x000024, "Member 'XsollaStoreSubsystem_CheckOrder::ErrorCallback' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.CheckPendingOrder
// 0x0038 (0x0038 - 0x0000)
struct XsollaStoreSubsystem_CheckPendingOrder final
{
public:
	class FString                                 AccessToken;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OrderId;                                           // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             SuccessCallback;                                   // 0x0014(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0024(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUserInvolvedToPayment;                          // 0x0034(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2878[0x3];                                     // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(XsollaStoreSubsystem_CheckPendingOrder) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_CheckPendingOrder");
static_assert(sizeof(XsollaStoreSubsystem_CheckPendingOrder) == 0x000038, "Wrong size on XsollaStoreSubsystem_CheckPendingOrder");
static_assert(offsetof(XsollaStoreSubsystem_CheckPendingOrder, AccessToken) == 0x000000, "Member 'XsollaStoreSubsystem_CheckPendingOrder::AccessToken' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CheckPendingOrder, OrderId) == 0x000010, "Member 'XsollaStoreSubsystem_CheckPendingOrder::OrderId' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CheckPendingOrder, SuccessCallback) == 0x000014, "Member 'XsollaStoreSubsystem_CheckPendingOrder::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CheckPendingOrder, ErrorCallback) == 0x000024, "Member 'XsollaStoreSubsystem_CheckPendingOrder::ErrorCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CheckPendingOrder, bIsUserInvolvedToPayment) == 0x000034, "Member 'XsollaStoreSubsystem_CheckPendingOrder::bIsUserInvolvedToPayment' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.ClearCart
// 0x0040 (0x0040 - 0x0000)
struct XsollaStoreSubsystem_ClearCart final
{
public:
	class FString                                 AuthToken;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             SuccessCallback;                                   // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreSubsystem_ClearCart) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_ClearCart");
static_assert(sizeof(XsollaStoreSubsystem_ClearCart) == 0x000040, "Wrong size on XsollaStoreSubsystem_ClearCart");
static_assert(offsetof(XsollaStoreSubsystem_ClearCart, AuthToken) == 0x000000, "Member 'XsollaStoreSubsystem_ClearCart::AuthToken' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_ClearCart, CartId) == 0x000010, "Member 'XsollaStoreSubsystem_ClearCart::CartId' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_ClearCart, SuccessCallback) == 0x000020, "Member 'XsollaStoreSubsystem_ClearCart::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_ClearCart, ErrorCallback) == 0x000030, "Member 'XsollaStoreSubsystem_ClearCart::ErrorCallback' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.CreateOrderWithFreeCart
// 0x0040 (0x0040 - 0x0000)
struct XsollaStoreSubsystem_CreateOrderWithFreeCart final
{
public:
	class FString                                 AuthToken;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 OrderId)>                SuccessCallback;                                   // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreSubsystem_CreateOrderWithFreeCart) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_CreateOrderWithFreeCart");
static_assert(sizeof(XsollaStoreSubsystem_CreateOrderWithFreeCart) == 0x000040, "Wrong size on XsollaStoreSubsystem_CreateOrderWithFreeCart");
static_assert(offsetof(XsollaStoreSubsystem_CreateOrderWithFreeCart, AuthToken) == 0x000000, "Member 'XsollaStoreSubsystem_CreateOrderWithFreeCart::AuthToken' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CreateOrderWithFreeCart, CartId) == 0x000010, "Member 'XsollaStoreSubsystem_CreateOrderWithFreeCart::CartId' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CreateOrderWithFreeCart, SuccessCallback) == 0x000020, "Member 'XsollaStoreSubsystem_CreateOrderWithFreeCart::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CreateOrderWithFreeCart, ErrorCallback) == 0x000030, "Member 'XsollaStoreSubsystem_CreateOrderWithFreeCart::ErrorCallback' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.CreateOrderWithSpecifiedFreeItem
// 0x0048 (0x0048 - 0x0000)
struct XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem final
{
public:
	class FString                                 AuthToken;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemSKU;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 OrderId)>                SuccessCallback;                                   // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0040(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2879[0x4];                                     // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem");
static_assert(sizeof(XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem) == 0x000048, "Wrong size on XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem");
static_assert(offsetof(XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem, AuthToken) == 0x000000, "Member 'XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem::AuthToken' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem, ItemSKU) == 0x000010, "Member 'XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem::ItemSKU' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem, SuccessCallback) == 0x000020, "Member 'XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem, ErrorCallback) == 0x000030, "Member 'XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem::ErrorCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem, Quantity) == 0x000040, "Member 'XsollaStoreSubsystem_CreateOrderWithSpecifiedFreeItem::Quantity' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.FetchCartPaymentToken
// 0x00D0 (0x00D0 - 0x0000)
struct XsollaStoreSubsystem_FetchCartPaymentToken final
{
public:
	class FString                                 AuthToken;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Currency;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Country;                                           // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Locale;                                            // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FXsollaParameters                      CustomParameters;                                  // 0x0050(0x0050)(ConstParm, Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& AccessToken, int32 OrderId)> SuccessCallback;                                   // 0x00A0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x00B0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExternalId;                                        // 0x00C0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreSubsystem_FetchCartPaymentToken) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_FetchCartPaymentToken");
static_assert(sizeof(XsollaStoreSubsystem_FetchCartPaymentToken) == 0x0000D0, "Wrong size on XsollaStoreSubsystem_FetchCartPaymentToken");
static_assert(offsetof(XsollaStoreSubsystem_FetchCartPaymentToken, AuthToken) == 0x000000, "Member 'XsollaStoreSubsystem_FetchCartPaymentToken::AuthToken' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchCartPaymentToken, CartId) == 0x000010, "Member 'XsollaStoreSubsystem_FetchCartPaymentToken::CartId' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchCartPaymentToken, Currency) == 0x000020, "Member 'XsollaStoreSubsystem_FetchCartPaymentToken::Currency' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchCartPaymentToken, Country) == 0x000030, "Member 'XsollaStoreSubsystem_FetchCartPaymentToken::Country' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchCartPaymentToken, Locale) == 0x000040, "Member 'XsollaStoreSubsystem_FetchCartPaymentToken::Locale' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchCartPaymentToken, CustomParameters) == 0x000050, "Member 'XsollaStoreSubsystem_FetchCartPaymentToken::CustomParameters' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchCartPaymentToken, SuccessCallback) == 0x0000A0, "Member 'XsollaStoreSubsystem_FetchCartPaymentToken::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchCartPaymentToken, ErrorCallback) == 0x0000B0, "Member 'XsollaStoreSubsystem_FetchCartPaymentToken::ErrorCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchCartPaymentToken, ExternalId) == 0x0000C0, "Member 'XsollaStoreSubsystem_FetchCartPaymentToken::ExternalId' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.FetchPaymentToken
// 0x00D8 (0x00D8 - 0x0000)
struct XsollaStoreSubsystem_FetchPaymentToken final
{
public:
	class FString                                 AuthToken;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemSKU;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Currency;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Country;                                           // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Locale;                                            // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FXsollaParameters                      CustomParameters;                                  // 0x0050(0x0050)(ConstParm, Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& AccessToken, int32 OrderId)> SuccessCallback;                                   // 0x00A0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x00B0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x00C0(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_287A[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ExternalId;                                        // 0x00C8(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreSubsystem_FetchPaymentToken) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_FetchPaymentToken");
static_assert(sizeof(XsollaStoreSubsystem_FetchPaymentToken) == 0x0000D8, "Wrong size on XsollaStoreSubsystem_FetchPaymentToken");
static_assert(offsetof(XsollaStoreSubsystem_FetchPaymentToken, AuthToken) == 0x000000, "Member 'XsollaStoreSubsystem_FetchPaymentToken::AuthToken' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchPaymentToken, ItemSKU) == 0x000010, "Member 'XsollaStoreSubsystem_FetchPaymentToken::ItemSKU' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchPaymentToken, Currency) == 0x000020, "Member 'XsollaStoreSubsystem_FetchPaymentToken::Currency' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchPaymentToken, Country) == 0x000030, "Member 'XsollaStoreSubsystem_FetchPaymentToken::Country' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchPaymentToken, Locale) == 0x000040, "Member 'XsollaStoreSubsystem_FetchPaymentToken::Locale' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchPaymentToken, CustomParameters) == 0x000050, "Member 'XsollaStoreSubsystem_FetchPaymentToken::CustomParameters' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchPaymentToken, SuccessCallback) == 0x0000A0, "Member 'XsollaStoreSubsystem_FetchPaymentToken::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchPaymentToken, ErrorCallback) == 0x0000B0, "Member 'XsollaStoreSubsystem_FetchPaymentToken::ErrorCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchPaymentToken, Quantity) == 0x0000C0, "Member 'XsollaStoreSubsystem_FetchPaymentToken::Quantity' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchPaymentToken, ExternalId) == 0x0000C8, "Member 'XsollaStoreSubsystem_FetchPaymentToken::ExternalId' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.FetchTokenCallback
// 0x0018 (0x0018 - 0x0000)
struct XsollaStoreSubsystem_FetchTokenCallback final
{
public:
	class FString                                 AccessToken;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InOrderId;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_287B[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(XsollaStoreSubsystem_FetchTokenCallback) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_FetchTokenCallback");
static_assert(sizeof(XsollaStoreSubsystem_FetchTokenCallback) == 0x000018, "Wrong size on XsollaStoreSubsystem_FetchTokenCallback");
static_assert(offsetof(XsollaStoreSubsystem_FetchTokenCallback, AccessToken) == 0x000000, "Member 'XsollaStoreSubsystem_FetchTokenCallback::AccessToken' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FetchTokenCallback, InOrderId) == 0x000010, "Member 'XsollaStoreSubsystem_FetchTokenCallback::InOrderId' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.FillCartById
// 0x0050 (0x0050 - 0x0000)
struct XsollaStoreSubsystem_FillCartById final
{
public:
	class FString                                 AuthToken;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStoreCartItem>                 Items;                                             // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void()>                             SuccessCallback;                                   // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreSubsystem_FillCartById) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_FillCartById");
static_assert(sizeof(XsollaStoreSubsystem_FillCartById) == 0x000050, "Wrong size on XsollaStoreSubsystem_FillCartById");
static_assert(offsetof(XsollaStoreSubsystem_FillCartById, AuthToken) == 0x000000, "Member 'XsollaStoreSubsystem_FillCartById::AuthToken' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FillCartById, CartId) == 0x000010, "Member 'XsollaStoreSubsystem_FillCartById::CartId' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FillCartById, Items) == 0x000020, "Member 'XsollaStoreSubsystem_FillCartById::Items' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FillCartById, SuccessCallback) == 0x000030, "Member 'XsollaStoreSubsystem_FillCartById::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_FillCartById, ErrorCallback) == 0x000040, "Member 'XsollaStoreSubsystem_FillCartById::ErrorCallback' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.GetAllItemsList
// 0x0040 (0x0040 - 0x0000)
struct XsollaStoreSubsystem_GetAllItemsList final
{
public:
	class FString                                 Locale;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FStoreItemsList& ItemsList)> SuccessCallback;                                   // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AuthToken;                                         // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreSubsystem_GetAllItemsList) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_GetAllItemsList");
static_assert(sizeof(XsollaStoreSubsystem_GetAllItemsList) == 0x000040, "Wrong size on XsollaStoreSubsystem_GetAllItemsList");
static_assert(offsetof(XsollaStoreSubsystem_GetAllItemsList, Locale) == 0x000000, "Member 'XsollaStoreSubsystem_GetAllItemsList::Locale' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetAllItemsList, SuccessCallback) == 0x000010, "Member 'XsollaStoreSubsystem_GetAllItemsList::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetAllItemsList, ErrorCallback) == 0x000020, "Member 'XsollaStoreSubsystem_GetAllItemsList::ErrorCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetAllItemsList, AuthToken) == 0x000030, "Member 'XsollaStoreSubsystem_GetAllItemsList::AuthToken' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.GetBundles
// 0x0068 (0x0068 - 0x0000)
struct XsollaStoreSubsystem_GetBundles final
{
public:
	class FString                                 Locale;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Country;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         AdditionalFields;                                  // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FStoreListOfBundles& ListOfBundles)> SuccessCallback;                                   // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0050(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0054(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AuthToken;                                         // 0x0058(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreSubsystem_GetBundles) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_GetBundles");
static_assert(sizeof(XsollaStoreSubsystem_GetBundles) == 0x000068, "Wrong size on XsollaStoreSubsystem_GetBundles");
static_assert(offsetof(XsollaStoreSubsystem_GetBundles, Locale) == 0x000000, "Member 'XsollaStoreSubsystem_GetBundles::Locale' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetBundles, Country) == 0x000010, "Member 'XsollaStoreSubsystem_GetBundles::Country' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetBundles, AdditionalFields) == 0x000020, "Member 'XsollaStoreSubsystem_GetBundles::AdditionalFields' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetBundles, SuccessCallback) == 0x000030, "Member 'XsollaStoreSubsystem_GetBundles::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetBundles, ErrorCallback) == 0x000040, "Member 'XsollaStoreSubsystem_GetBundles::ErrorCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetBundles, Limit) == 0x000050, "Member 'XsollaStoreSubsystem_GetBundles::Limit' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetBundles, Offset) == 0x000054, "Member 'XsollaStoreSubsystem_GetBundles::Offset' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetBundles, AuthToken) == 0x000058, "Member 'XsollaStoreSubsystem_GetBundles::AuthToken' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.GetDRMList
// 0x0020 (0x0020 - 0x0000)
struct XsollaStoreSubsystem_GetDRMList final
{
public:
	TDelegate<void(const struct FStoreDRMList& DRMList)> SuccessCallback;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreSubsystem_GetDRMList) == 0x000004, "Wrong alignment on XsollaStoreSubsystem_GetDRMList");
static_assert(sizeof(XsollaStoreSubsystem_GetDRMList) == 0x000020, "Wrong size on XsollaStoreSubsystem_GetDRMList");
static_assert(offsetof(XsollaStoreSubsystem_GetDRMList, SuccessCallback) == 0x000000, "Member 'XsollaStoreSubsystem_GetDRMList::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetDRMList, ErrorCallback) == 0x000010, "Member 'XsollaStoreSubsystem_GetDRMList::ErrorCallback' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.GetGameItem
// 0x0060 (0x0060 - 0x0000)
struct XsollaStoreSubsystem_GetGameItem final
{
public:
	class FString                                 GameSKU;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Locale;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Country;                                           // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         AdditionalFields;                                  // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(struct FGameItem& Game)>       SuccessCallback;                                   // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0050(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreSubsystem_GetGameItem) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_GetGameItem");
static_assert(sizeof(XsollaStoreSubsystem_GetGameItem) == 0x000060, "Wrong size on XsollaStoreSubsystem_GetGameItem");
static_assert(offsetof(XsollaStoreSubsystem_GetGameItem, GameSKU) == 0x000000, "Member 'XsollaStoreSubsystem_GetGameItem::GameSKU' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameItem, Locale) == 0x000010, "Member 'XsollaStoreSubsystem_GetGameItem::Locale' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameItem, Country) == 0x000020, "Member 'XsollaStoreSubsystem_GetGameItem::Country' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameItem, AdditionalFields) == 0x000030, "Member 'XsollaStoreSubsystem_GetGameItem::AdditionalFields' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameItem, SuccessCallback) == 0x000040, "Member 'XsollaStoreSubsystem_GetGameItem::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameItem, ErrorCallback) == 0x000050, "Member 'XsollaStoreSubsystem_GetGameItem::ErrorCallback' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.GetGameKeyItem
// 0x0060 (0x0060 - 0x0000)
struct XsollaStoreSubsystem_GetGameKeyItem final
{
public:
	class FString                                 ItemSKU;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Locale;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Country;                                           // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         AdditionalFields;                                  // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(struct FGameKeyItem& GameKey)> SuccessCallback;                                   // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0050(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreSubsystem_GetGameKeyItem) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_GetGameKeyItem");
static_assert(sizeof(XsollaStoreSubsystem_GetGameKeyItem) == 0x000060, "Wrong size on XsollaStoreSubsystem_GetGameKeyItem");
static_assert(offsetof(XsollaStoreSubsystem_GetGameKeyItem, ItemSKU) == 0x000000, "Member 'XsollaStoreSubsystem_GetGameKeyItem::ItemSKU' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameKeyItem, Locale) == 0x000010, "Member 'XsollaStoreSubsystem_GetGameKeyItem::Locale' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameKeyItem, Country) == 0x000020, "Member 'XsollaStoreSubsystem_GetGameKeyItem::Country' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameKeyItem, AdditionalFields) == 0x000030, "Member 'XsollaStoreSubsystem_GetGameKeyItem::AdditionalFields' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameKeyItem, SuccessCallback) == 0x000040, "Member 'XsollaStoreSubsystem_GetGameKeyItem::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameKeyItem, ErrorCallback) == 0x000050, "Member 'XsollaStoreSubsystem_GetGameKeyItem::ErrorCallback' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.GetGameKeysListBySpecifiedGroup
// 0x0068 (0x0068 - 0x0000)
struct XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup final
{
public:
	class FString                                 ExternalId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Locale;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Country;                                           // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         AdditionalFields;                                  // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FStoreGameKeysList& GameKeysList)> SuccessCallback;                                   // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0050(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0060(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0064(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup");
static_assert(sizeof(XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup) == 0x000068, "Wrong size on XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup");
static_assert(offsetof(XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup, ExternalId) == 0x000000, "Member 'XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup::ExternalId' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup, Locale) == 0x000010, "Member 'XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup::Locale' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup, Country) == 0x000020, "Member 'XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup::Country' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup, AdditionalFields) == 0x000030, "Member 'XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup::AdditionalFields' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup, SuccessCallback) == 0x000040, "Member 'XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup, ErrorCallback) == 0x000050, "Member 'XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup::ErrorCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup, Limit) == 0x000060, "Member 'XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup::Limit' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup, Offset) == 0x000064, "Member 'XsollaStoreSubsystem_GetGameKeysListBySpecifiedGroup::Offset' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.GetGamesList
// 0x0058 (0x0058 - 0x0000)
struct XsollaStoreSubsystem_GetGamesList final
{
public:
	class FString                                 Locale;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Country;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         AdditionalFields;                                  // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(struct FStoreGamesData& GamesData)> SuccessCallback;                                   // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0050(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0054(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreSubsystem_GetGamesList) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_GetGamesList");
static_assert(sizeof(XsollaStoreSubsystem_GetGamesList) == 0x000058, "Wrong size on XsollaStoreSubsystem_GetGamesList");
static_assert(offsetof(XsollaStoreSubsystem_GetGamesList, Locale) == 0x000000, "Member 'XsollaStoreSubsystem_GetGamesList::Locale' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGamesList, Country) == 0x000010, "Member 'XsollaStoreSubsystem_GetGamesList::Country' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGamesList, AdditionalFields) == 0x000020, "Member 'XsollaStoreSubsystem_GetGamesList::AdditionalFields' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGamesList, SuccessCallback) == 0x000030, "Member 'XsollaStoreSubsystem_GetGamesList::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGamesList, ErrorCallback) == 0x000040, "Member 'XsollaStoreSubsystem_GetGamesList::ErrorCallback' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGamesList, Limit) == 0x000050, "Member 'XsollaStoreSubsystem_GetGamesList::Limit' has a wrong offset!");
static_assert(offsetof(XsollaStoreSubsystem_GetGamesList, Offset) == 0x000054, "Member 'XsollaStoreSubsystem_GetGamesList::Offset' has a wrong offset!");

// Function XsollaStore.XsollaStoreSubsystem.GetGamesListBySpecifiedGroup
// 0x0068 (0x0068 - 0x0000)
struct XsollaStoreSubsystem_GetGamesListBySpecifiedGroup final
{
public:
	class FString                                 ExternalId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Locale;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Country;                                           // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         AdditionalFields;                                  // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FStoreGamesList& GamesList)> SuccessCallback;                                   // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0050(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0060(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0064(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaStoreSubsystem_GetGamesListBySpecifiedGroup) == 0x000008, "Wrong alignment on XsollaStoreSubsystem_GetGamesListBySpecifiedGroup");
